{
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_more-good-news-brentwoods-schools/content_14.html": "Having written for the Brentwood Gazette last week about the amazing trip to China being planned for students at the Anglo European School and Becket Keys school who are studying Mandarin through the Mandarin Excellence programme, and the week before about the magnificent building work carried out at Brentwood County High School, there is yet more good news on the schools front this week.\nEight more projects are being funded through the Department for Education’s Condition Improvement Fund, including work to be carried out at St Martin’s School, the Brentwood Ursuline Convent High School, Larchwood Primary School, Hogarth Primary School and Bentley St Paul's Church of England Primary School.\nI know there are other schools in the constituency which have made bids, and the DfE will provide feedback to support them with future applications and, of course, I am always happy to add my support to these bids.\nAnd that’s not all. The Government is sticking with its plan to provide the best start in life for children and has made £19,665, 525 available to Essex County Council to ensure children with special educational needs and disabilities (SEND), or who need alternative education provision, receive an education that meets their needs in high-quality environments.\nI’ve been campaigning for more special school places to be made available to children with SEND living in Brentwood and Ongar and look forward to discussing with Essex County Council how this funding will be used, and how it will improve the education offer for children who have additional needs.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk/content_1.html": "Latest News Post Office Changes In recent years, as High Street Banks have closed their premises in Brentwood,… Budget Squeeze for Households, But Good News from Essex Police The changing of the clocks at the weekend to British Summer Time has been a… Costs of Living Increases Under Labour Government Families in Brentwood and Ongar are in line for £1,191 of cost increases from… Campaigns Dr Burghart's History Notes As a historian, I am always keen to seek out the history of where I live and… Opposing National Grid's Onshore Pylon Proposal Many residents, especially those in Ingatestone, Haverings Grove and West… Protecting Historic Ongar - My Call for High Street Weight Restriction Order I am calling for a Weight Restriction Order to be put in place on Ongar High… Road Safety in Stapleford Abbotts - Solution Found! Children and parents from Stapleford Abbotts Primary School contacted me to… Stop The Smell - Solved! The commercial composting site which appeared to have been the source of the… Cost of Living Support Useful Information from Organisations offering Cost of Living SupportNational… Brentwood and Ongar Broadband Speeds The post-Covid increase in the number of people working from home has seen an… Find me on Facebook Contact Email, Postal and Telephone InquiriesHouse of Commons, London, SW1A 0AA020 7219 1613[email protected]Alex on FacebookAlex on X (Twitter) Brentwood and Ongar Am I your MP? Enter your postcode Postcode\nBudget Squeeze for Households, But Good News from Essex Police The changing of the clocks at the weekend to British Summer Time has been a…\nCosts of Living Increases Under Labour Government Families in Brentwood and Ongar are in line for £1,191 of cost increases from…\nDr Burghart's History Notes As a historian, I am always keen to seek out the history of where I live and…\nOpposing National Grid's Onshore Pylon Proposal Many residents, especially those in Ingatestone, Haverings Grove and West…\nProtecting Historic Ongar - My Call for High Street Weight Restriction Order I am calling for a Weight Restriction Order to be put in place on Ongar High…\nRoad Safety in Stapleford Abbotts - Solution Found! Children and parents from Stapleford Abbotts Primary School contacted me to…\nStop The Smell - Solved! The commercial composting site which appeared to have been the source of the…\nCost of Living Support Useful Information from Organisations offering Cost of Living SupportNational…\nBrentwood and Ongar Broadband Speeds The post-Covid increase in the number of people working from home has seen an…",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_campaigns_stop-smell-solved/content_34.html": "The commercial composting site which appeared to have been the source of the deeply unpleasant smell drifting regularly across North Weald, Moreton and parts of Ongar was taken over by Envar Composting Limited in January 2024.\nI have met representatives from Envar and a series of meetings have taken place with Envar and local residents to ensure the local community is aware of the work which has been done to reduce the height of the windrows and ensuring the material for composting is shredded to a size which will allow air to circulate and encourage the composting process. The company has been monitoring the site carefully and everyone is now happy the smell has been significantly reduced.\nThe Envar representatives made it very clear to me that they are keen to have a good relationship with local residents and have asked anyone with any further problems, concerns or complaints to raise them using the email address [email protected].",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_brentwood/content_47.html": "Useful Links\nMy Work and Announcements\nBelow you can find out about latest announcements and more about my work in Brentwood:\nUseful Links\nMy Work and Announcements\nBelow you can find out about latest announcements and more about my work in Brentwood:",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_accessibility/content_24.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_general-election-2024-clear-plan-bold-action-secure-future/content_45.html": "Prime Minister Rishi Sunak speaking today on the steps of Downing Street, said:\n(Checked against delivery)\n“In the last five years our country has fought through the most challenging times since the Second World War.\nAs I stand here as your Prime Minister, I can’t help but reflect that my first proper introduction to you was just over four years ago.\nI stood behind one of the podiums, upstairs in the building behind me.\nI told you that we faced a generation defining moment, and that we as a society would not be judged by some government action, but by the small acts of kindness we showed one another.\nYou met that challenge and then some.\nAnd I have never been prouder to be British.\nAnd when I introduced the furlough scheme, I did so not because I saw a country simply in need of desperate help, albeit we were, but because I saw a country whose future hung in the balance.\nI could be bold and trust in the tens of millions of you at home, that you would rise to the moment, or I could accept the inevitable, millions of job losses, and pick up the pieces.\nIn truth, it was no choice at all.\nI have never, and will never, leave the people of this country to face the darkest of days alone. And you know that, because you’ve seen it.\nAs I did then, I will forever, do everything in my power to provide you with the strongest protection I possibly can.\nThat is my promise to you.\nBecause, for so many of us, it’s easy to forget the scale of what we’ve been through. We were hit by a pandemic that upended normal life.\nWho would have thought the government would ever tell us how many times a day we could leave our homes.\nThen, just as we were recovering from Covid, war returned to Europe, with Putin’s invasion of Ukraine sending your energy bills spiralling.\nI came to office, above all, to restore economic stability.\nEconomic stability is the bedrock of any future success.\nWhether that is rising wages and good jobs, investment in our public services, or the defence of our country.\nAnd because of our collective sacrifice and your hard work, we have reached two major milestones in delivering that stability.\nShowing that when we work together, anything is possible.\nOur economy is now growing faster than anyone predicted, outpacing Germany, France and the United States.\nAnd this morning, it was confirmed that inflation is back to normal.\nThis means that the pressure on prices will ease and mortgage rates will come down.\nThis is proof that the plan and priorities I set out are working.\nI recognise that it has not always been easy, some of you may just be starting to feel the benefits, for some it might still feel hard when you look at your bank balance.\nBut this hard-earned economic stability was only ever meant to be the beginning.\nThe question now is how and who do you trust to turn that foundation into a secure future for you, your family and our country.\nNow is the moment for Britain to choose its future.\nTo decide whether we want to build on the progress we have made or risk going back to square one with no plan and no certainty.\nEarlier today I spoke with His Majesty the King to request the dissolution of parliament.\nThe King has granted this request, and we will have a general election on the 4th July.\nThis election will take place at a time when the world is more dangerous than it has been since the end of the Cold War.\nPutin’s Russia is waging a brutal war in Ukraine; and will not stop there if he succeeds.\nThat war has also made all too clear the risks to our energy security. In the Middle East, the forces of Islamist extremism threaten regional and, ultimately, global stability.\nThese tensions are exploited by extremists who seek to undermine our values and divide our society here at home.\nChina is seeking to dominate the 21st century by stealing a lead in technology.\nAnd migration is being weaponised by hostile states to threaten the integrity of our borders.\nThese uncertain times call for a clear plan and bold action to chart a course to a secure future.\nYou must choose in this election who has that plan, who is prepared to take that bold action to secure a better future for our country and our children.\nI cannot, and will not, claim that we have got everything right, no government should.\nBut I am proud of what we have achieved together, the bold action we have taken and confident about what we can do in the future.\nWe have tackled inflation, controlled debt, cut workers’ taxes, and increased the state pension by £900 this year.\nWe have reduced taxes on investment and seized the opportunities of Brexit, to make this the best place in the world to grow a business.\nPut record amounts of funding into our NHS and ensured it is now training the doctors and nurses it needs in the decades to come.\nWe have reformed education and our children are now the best readers in the Western world.\nWe prioritised energy security and your family finances over environmental dogma in our approach to Net Zero.\nWe have fully funded an increase in defence spending to 2.5 per cent of GDP.\nWe made a decision to invest more in local transport that you actually use rather than endlessly plough more money into HS2.\nWe set out a comprehensive plan to reform our welfare system to make it fair to those who pay for it as well as those who need it.\nImmigration is finally coming down and we will stop the boats with our Rwanda partnership.\nAnd we will ensure that the next generation grows up smoke free.\nI hope that my work since I became Prime Minister shows that we have a plan and are prepared to take the bold action necessary for our country to flourish.\nI have stuck with that plan and always been honest with you about what is needed even when that’s been difficult.\nBecause I am guided by doing what is right for the country, not what is easy.\nI cannot say the same thing for the Labour party.\nBecause I don’t know what they offer. And in truth, I don’t think you know either.\nAnd that’s because they have no plan. There is no bold action.\nAnd as a result, the future can only be uncertain with them.\nOn the 5th of July, either Keir Starmer or I will be Prime Minister.\nHe has shown time and time again that he will take the easy way out and do anything to get power.\nIf he was happy to abandon all of the promises he made to become Labour leader once he got the job, how can you know he won’t do exactly the same thing if he were to become Prime Minister?\nIf you don’t have the conviction to stick to anything you say…\nIf you don’t have the courage to tell people what you want to do…\nAnd if you don’t have a plan…\nHow can you possibly be trusted to lead our country, especially at this most uncertain of times?\nOver the next few weeks, I will fight for every vote, I will earn your trust, and I will prove to you:\nThat only a Conservative government, led by me:\nWill not put our hard-earned economic stability at risk.\nCan restore pride and confidence in our country.\nAnd with a clear plan and bold action will deliver a secure future for you, your family and our United Kingdom.”\nE",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_campaigns_enforcing-law/content_19.html": "I am working closely with our excellent local Police, Fire and Crime Commissioner, Roger Hirst, to deliver more local police officers than ever before to tackle crime and keep our streets safe.\nThe changing of the clocks at the weekend to British Summer Time has been a welcome return to lighter evenings, and the recent sunshine has been something of a relief from the grim news of recent weeks.\nEssex Police are appealing for anyone with information that will support their investigation following the very sad discovery of a man’s body in Pilgrims Hatch.Officers were called to the scene in Lincolns Lane at about 5.45am on Wednesday 19 March where a man in his 30s was discovered.\nToday [Tuesday 18 March 2025] Kemi Badenoch, Leader of the Conservative Party, announced the Policy Renewal Programme. We are living off the inheritance of previous generations. For three centuries, every era in our country’s history left a better legacy for its children. The greatnes\nPolice Community Support Officers jobs in Essex have been saved after pressure was put on the Labour Government by Brentwood and Ongar’s Member of Parliament, Alex Burghart, and Essex Police Fire and Crime Commissioner, Roger Hirst.Last week Roger and Essex Police Chief Constable, BJ Harrington, mad\nEssex Police is facing the devastating prospect of having to lose its community support officers, and some police staff as a direct result of poor funding from the Labour Government.I met the Essex Police, Fire and Crime Commissioner, Roger Hirst, last week to discuss the funding proposals from the\nSmall businesses are the lifeblood of our economy here in my Brentwood and Ongar constituency – the very essence of entrepreneurialism, creating jobs and local wealth.\nOne of the ways in which the UK Parliament has moved itself into the 21st century, even within the seven years I have been a Member of Parliament, is by enabling MPs to register their votes in debates via a card reader. We still have to leave the Chamber when a division is called – meaning\nHave your say on what the Policing and Crime priorities and Fire and Rescue priorities should be for the next four years.\nFollowing his re-election in May, Roger Hirst, Police, Fire and Crime Commissioner for Essex, is now consulting on priorities to be included in\nEssex County Council has been in touch to let Essex residents know they can voice their priorities to help police and local authorities tackle crime and anti-social behaviour in different communities.\nThe annual Community Safety Survey by Safer Essex, on behalf of the county’s 14 Community Safety P\nThe Brentwood Business Improvement District (BID), known as Brentwood Connected, is in its early stages – it’s just a month old – but it promises to bring great benefits to the High Streets and businesses of Brentwood, Ingatestone and Shenfield.\nI met up last week with Brentwood Connected members,",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_essex-county-council-offers-free-advice-sessions-families-children-special-educational-needs/content_18.html": "I have had many constituents who have children with Special Educational Needs and Disabilities (SEND) contact me about support and advice for them and their children as they try to negotiate the education, welfare and care system for their families.\nFamilies with children who have additional needs are already under a great deal of pressure, having to deal with hospital appointments, assessments, medication, behavioural issues and a multitude of things, so making sure the right support and advice is in place is vital.\nEssex County Council, which has recently been given £1.7million to improve education inclusion, is the organisation with the responsibility of providing access to that support and advice, It's running some free workshops to help parents , and you can find out more here: https://www.essex.gov.uk/news/2024/free-send-information-sessions",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_campaigns_road-safety-stapleford-abbotts-solution-found/content_20.html": "Children and parents from Stapleford Abbotts Primary School contacted me to support their campaign to make school drop off and picks ups safer. Many of the children do not live within walking distance of this little village school and there is very limited space near the school for parents to park. Even the children who walk to school are hampered by the lack of a good footpath to the school.\nI have worked with the school and relevant authorities to find a suitable solution and am pleased Essex County Council is helping support the school with developing a School Travel Plan, with a view to encouraging and enabling more pupils to travel by the safest, greenest and healthiest modes available to them. The school is also making efforts to acquire some land nearby to create parking for the parents.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_myplan/content_33.html": "As a former teacher and the son of two state teachers, education is one of my central priorities. I support our schools and am campaigning for a new local special school for children with Special Educational Needs and Disabilities.\nI am working closely with our excellent local Police, Fire and Crime Commissioner, Roger Hirst, to deliver more local police officers than ever before to tackle crime and keep our streets safe.\nI am working with businesses to boost our High Streets with investment from the Government's Levelling Up Fund.In addition, I support the Brentwood Improvement District (BID) which is now in place to enable local shopkeepers, cafe owners, business people, residents and the local councils to work tog\nI will protect our greenbelt, oppose unauthorised development and continue to lead the fight against massive pylons and the Labour Government's Family Farm Tax.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_cdn-cgi_l_email-protection/content_8.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_campaigns_supporting-education-and-children-special-educational-needs-and-disabilities-send/content_13.html": "As a former teacher and the son of two state teachers, education is one of my central priorities. I support our schools and am campaigning for a new local special school for children with Special Educational Needs and Disabilities.\nAs a former teacher and the son of two state teachers, education is one of my central priorities. I support our schools and am campaigning for a new local special school for children with Special Educational Needs and Disabilities.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_cookies/content_31.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_category_Speeches/content_40.html": "Kemi Badenoch Speech: Getting real in a dangerous world 25th February 2025 Kemi Badenoch delivered the below speech at Policy Exchange on 25 February 2025. \"Every few decades, the world changes. The Iron Curtain descending. The fall of... Speeches\nThe Prime Minister's Update: Tackling the Coronavirus 30th April 2020 I want to thank everybody who has been doing such a good job in my absence and I want to thank the NHS for so much. Including getting me back here and I might... Speeches",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_what-can-mp-do/content_5.html": "Members of Parliament are elected to the House of Commons to represent the interests and concerns of all the people who live in their constituency, whether they voted for them at the General Election or not. They are only able to deal with issues raised by people who live in their constituency, called constituents.\nTo check if you are one of my constituents, please enter your postcode on the Parliament website .\nMPs consider and vote on legislation and use their position to ask government ministers questions about current issues.\nWe split our time between working in Parliament and working in the constituency. In Parliament, I spend my time representing the interests of all my constituents, attending debates, scrutinising and voting on legislation, and attending meetings. I hold telephone advice surgeries for my constituents, attend meetings and community events, as well as visiting local organisations and businesses across the constituency.\nWhen a constituent writes to me, I will write to the relevant department or official or the Minister involved. Many problems are solved in this way and I always aim to respond within 10 working days although sometimes more complex cases may take slightly longer.\nOral or Written Questions\nOnce a month each minister from each government department answer questions from MPs at the Despatch Box in the Chamber of the House. There is a limit to the number of questions that can be asked but I can also table a written question to the relevant government department, which are published in Hansard .\nAdjournment Debates\nMPs may be able to raise a constituent’s issue in a half-hour Adjournment Debate. To get an Adjournment Debate, MPs must be successful in a ballot of Members of Parliament or have the subject chosen by the Speaker. The debates are usually the last business of the day and a government minister responds at the end of the debate.\nPetition\nMembers of Parliament can present a petition to Parliament on behalf of their constituents. The format and wording of the petition need to be in a particular way. For more information or guidance, please contact:\nClerk of Public Petitions\nJournal Office\nHouse of Commons\nLondon SW1A 0AA\nhttp://www.parliament.uk/get-involved/have-your-say/petitioning/public-petitions\nWhat I cannot do, however, is have any jurisdiction over local Council decisions. I can write to on your behalf to the council and ask them to look into a problem or to reconsider an issue. In the first instance though, you should contact your local council or councillor directly.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_alex-welcomes-funding-boost-schools-brentwood-and-ongar/content_36.html": "More children across Essex, including Alex Burghart's Brentwood and Ongar constituency will be able to access a world-class education thanks to a major funding boost.\nThe Conservative Government has confirmed schools in Essex will receive 4.88% more funding per pupil next year as part of the recent multi-billion investment in primary and secondary education.\nAlex has welcomed this new funding: \"I've met with all the secondary school heads and most of the primary school headteachers in my constituency in the last year, and funding for schools is always part of the conversation we have. The information they have given me has enabled me to make strong representations to the Department for Education about funding needs. The commitment that every secondary school pupil will receive a minimum of £5,000 next year and every primary school pupil will receive a minimum of £4,000 by 2021-22 will reassure parents of the Government’s promise to deliver the best for their children.\"\nThis funding follows the Prime Minister’s announcement in August that the budget for schools and high needs would be increased by a total of over £14 billion over three years, rising to £52.2 billion by 2022-23. Schools and local authorities have now found out how the first part of that investment - £2.6 billion - will be allocated for the coming year.\nThe extra money, available from April, will ensure that per-pupil funding for all schools can rise at least in line with inflation and will deliver promised gains in full for areas which have been historically under-funded\nCommenting, Alex said:\n\"Every child in every school in my Brentwood and Ongar constituency deserves the best possible start in life – regardless of their background or where they live.\n\"The 4.88% per pupil funding boost next year will mean that every school will receive a budget increase, giving teachers, parents and pupils the certainty to plan, and supercharging standards in our schools.\n\"This new funding will also target those schools who need support the most need, making sure that every parent in Brentwood and Ongar can be sure their children are getting a world class education. I look forward to hearing how the money has helped children in our education system when I continue to visit our local schools as part of my constituency work.\"\nENDS\nNotes to Editors\nFor more information please contact Alex Burghart MP on 020 7219 1613",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_brentwood-county-high-school-building-future/content_43.html": "Brentwood Gazette Article from Alex Burghart MP:\nBrentwood County High School pupils are fortunate to have a magnificent 1920s building at the heart of their school; a classic classrooms and stone corridors set around two quadrangles. It’s not quite Hogwarts, but it is a historic setting which has seen thousands of pupils come and go in the 98 years since the main building was originally opened.\nLast week I was re-opening the school’s oldest building which has undergone a huge two year DfE funded refurbishment to bring classrooms, the main hall, and the roof up to modern specifications. Solar panels adorn the roof and, while ‘heritage’ cast iron radiators are still in place in the hall, they are for decorative purposes only.\nIn the not too distant past, one current Brentwood Borough councillor, and two former councillors have been Head Boys at the school, a point noted by Brentwood’s Mayor. There may be more councillors to come, as the school’s sixth form politics classes also regularly visit Westminster as part of their studies.\nIt was great to see how the investment by the Department for Education in BCHS has give the whole school a new lease of life – with a new science block replacing the former dilapidated 1960s building, an Art hub, and all weather pitch being used to their full extent.\nIt’s taken nine years of planning, design, wrangling and sheer hard work to get this work done, and to keep the best of the old alongside the best of the new. My congratulations to Parvis Rahman, the school’s headteacher, and to the ‘getting it done team’ of Dave Richardson and Janet Clark, for enabling the work to happen while also keeping the school open for its pupils and staff.\nIt is heartening to see how Government funding can breathe new life into a school, making it an asset to the pupils and the town for many years to come.\nNews Release from Brentwood County High School\nAt Brentwood County High School we were extremely honoured to welcome esteemed guests to our Opening Celebration on Friday 15th March 2024. Today marked a momentous occasion in the school’s journey as we unveiled our new renovated facilities. The premises were opened by MP Alex Burghart who was joined by Mayor Cllr Dr. Gareth Barrett, Chief Executive Officer of the Osborne Co-operative Academy Paul Griffiths, Executive Headteacher Secondary Phase of the Osborne Co-operative Academy Sharon Jenner together with trustees and school governors who met with students prior to the opening event.\nBrentwood and Ongar MP, Alex Burghart, said:\n“It is great to see how investment from the Department for Education can transform a local school for the benefit of its pupils, staff and, more broadly, Brentwood. Brentwood County High School’s buildings have always been magnificent, and the nine year of planning, design and sheer hard work have made them into buildings ready for the future, while retaining their heritage appeal. My congratulations to Janet Clark and Dave Richardson for overseeing such a daunting project over the best part of a decade, and to headteacher Ms Rahman, who has been able to keep the school running successfully amidst the major building works.\n“It is really the best of the old alongside the best of the new. I noticed the original building was opened in 1926, and I hope the refurbishment will offer the same level of education and memories for the young people of our town for another 98 years.”\nMs Rahman, Headteacher, from Brentwood County High School, said:\n“The transformation of our school facilities has been a truly remarkable feat. From state-of-the-art classrooms to cutting edge laboratories have created an environment that provides our students with teaching spaces of the highest quality. Our excellent facilities will enable our students to be inspired and empowered to reach their full potential.\nAs we gather to celebrate this milestone, let us reflect on the impact that these facilities will have on the lives of students both now and in the future and which will benefit both the school community and Brentwood as a whole. Together, we will continue to work providing every student with the opportunities they need to thrive and succeed in life.”",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_campaigns_brentwood-and-ongar-broadband-speeds/content_2.html": "The post-Covid increase in the number of people working from home has seen an increase in constituents contacting me about broadband speeds and a patchy roll out of superfast fibre to the property infrastructure in some parts of the constituency. I have brought this to the attention of Openreach and will be campaigning to ensure the latest technology is being made available swiftly and efficiently to those living in the towns and villages of Brentwood and Ongar.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_campaigns_protecting-historic-ongar-my-call-high-street-weight-restriction-order/content_21.html": "I am calling for a Weight Restriction Order to be put in place on Ongar High Street. We need to stop huge HGVs rumbling through the pinch point on the High Street, impacting on the safety of pedestrians and the historic buildings nearby. Having very large lorries cut through the town to avoid traffic elsewhere on the road network is unnecessary and potentially dangerous - I am pushing for change before an accident happens.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_voting-technology-and-praise-essex-police/content_32.html": "One of the ways in which the UK Parliament has moved itself into the 21st century, even within the seven years I have been a Member of Parliament, is by enabling MPs to register their votes in debates via a card reader.\nWe still have to leave the Chamber when a division is called – meaning all those present for the debate head into the two voting corridors to line up and vote ‘aye’ ( in favour of the motion which has just been debated), or ‘no’ (against the motion) but instead of our names being logged by a person standing at a tall desk at the end of the corridor, we now register our vote with a card.\nThis is all well and good and technologically sound until, as happened to me last week, the card reader does not register the vote. This meant the voting records on the House of Commons website, and picked up by various news channels, showed me as abstaining in the Winter Fuel Payment vote – a record which made many of you get in touch directly or via social media to vent your ire.\nAs soon as I realised what had happened I asked the public vote office to correct the record which now shows my true vote in favour of the motion to scrap Labour’s plan to remove the Winter Fuel Payment from millions of pensioners.\nAs I was writing this piece, news came through of the shocking events on Ingrave Road on Thursday evening, in which a man was assaulted and died. Essex Police officers were on the scene within minutes and an arrest was made within an hour of the attack - I am very grateful to officers for their swift and professional handling of this potentially dangerous situation. I understand from our local policing team there is no wider threat to the local community but appreciate how shocking this incident has been for all those living locally. A person has appeared in court and I will watch the outcome of the investigation carefully.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_brentwood-and-ongar/content_30.html": "As your Member of Parliament I can consider and can propose new laws as well as raising issues that matter to constituents in the House of Commons. This includes asking government ministers questions about current issues including those which affect local people.\nIf your correspondence relates to local housing, planning or refuse collection, Brentwood Borough Council or Epping Forest District Council may be best placed to assist you in the first instance. Your local councillors’ contact details are available at:\nBrentwood Borough Council - Your Councillors\nEpping Forest District Council - Your Councillors\nIf your query relates to highways, education or adult social care, Essex County Council should be able to help you.\nFor other issues, your best course of action is to follow the complaints process of the organisation involved.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_prime-ministers-statement-living-covid-19-21-february-2022/content_41.html": "Mr Speaker, with permission I will make a statement on our strategy for living with Covid.\nAnd before I begin, I know the whole House will join me in sending our best wishes to Her Majesty the Queen for a full and swift recovery.\nIt is a reminder that this virus has not gone away, but because of the efforts we have made as a country over the past two years we can now deal with it in a very different way, moving from government restrictions to personal responsibility.\nSo we protect ourselves without losing our liberties – and maintaining our contingency capabilities so we can respond rapidly to any new variant.\nMr Speaker, the UK was the first country in the world to administer an approved vaccine, and the first European nation to protect half our population with at least one dose.\nAnd having made that decision to refocus our NHS this Winter on the campaign to Get Boosted Now, we were the first major European nation to boost half our population too.\nAnd it is because of the extraordinary success of this vaccination programme, that we have been able to lift our restrictions earlier than other comparable countries, opening up last summer, while others remained closed, and keeping things open this winter, when others shut down again, making us one of the most open economies and societies in Europe, with the fastest growth anywhere in the G7 last year.\nAnd while the pandemic is not over, we have now passed the peak of the Omicron wave, with cases falling, hospitalisations in England now fewer than 10,000 and still falling, and the link between infection and severe disease substantially weakened.\nOver 71 per cent of all adults are now boosted in England, including 93 per cent of those 70 and over, and together with the treatments and scientific understanding of the virus we have built up, we now have sufficient levels of immunity to complete the transition from protecting people with government interventions to relying on vaccines and treatments as our first line of defence.\nAs we have throughout the past two years, we will continue to work closely with the Devolved Administrations as they decide how to take forward their own plans, and today’s strategy shows how we will structure our approach in England around four principles.\nFirst, we will remove all remaining domestic restrictions in law.\nFrom this Thursday, 24 February, we will end the legal requirement to self-isolate following a positive test, and so we will also end self-isolation support payments, although Covid provisions for Statutory Sick Pay can still be claimed for a further month.\nWe will end routine contact tracing, and no longer ask fully vaccinated close contacts and those under 18 to test daily for seven days.\nAnd we will remove the legal requirement for close contacts who are not fully vaccinated to self-isolate.\nUntil 1 April, we will still advise people who test positive to stay at home.\nBut after that, we will encourage people with Covid-19 symptoms to exercise personal responsibility, just as we encourage people who may have flu to be considerate to others.\nMr Speaker, it is only because levels of immunity are so high and deaths are now, if anything, below where you would normally expect for this time of year, that we can lift these restrictions.\nAnd it is only because we know Omicron is less severe, that testing for Omicron on the colossal scale we have been doing is much less important, and much less valuable in preventing serious illness.\nWe should be proud that the UK established the biggest testing programme per person of any large country in the world.\nBut this came at a vast cost.\nThe Testing, Tracing and Isolation budget in 2020-21 exceeded the entire budget of the Home Office.\nIt cost a further £15.7 billion in this financial year, and £2 billion in January alone at the height of the Omicron wave.\nWe must now scale this back.\nFrom today, we are removing the guidance for staff and students in most education and childcare settings to undertake twice weekly asymptomatic testing.\nAnd from 1st April, when Winter is over and the virus will spread less easily, we will end free symptomatic and asymptomatic testing for the general public.\nWe will continue to provide free symptomatic tests to the oldest age groups and those most vulnerable to Covid.\nAnd in line with the practice in many other countries, we are working with retailers to ensure that everyone who wants to can buy a test.\nFrom April 1st, we will also no longer recommend the use of voluntary Covid-status certification, although the NHS app will continue to allow people to indicate their vaccination status for international travel.\nAnd Mr Speaker, the government will also expire all temporary provisions of the Coronavirus Act.\nOf the original 40, 20 have already expired, 16 will expire on 24 March, and the last 4 relating to innovations in public service will expire six months later, after we have made those improvements permanent via other means.\nSecond, we will continue to protect the most vulnerable with targeted vaccines and treatments.\nThe UK government has procured enough doses of vaccine to anticipate a wide range of possible JCVI recommendations. And today we are taking further action to guard against a possible resurgence of the virus, accepting JCVI advice for a new Spring booster offered to those aged 75 and over, older care home residents, and those over 12 who are immunosuppressed.\nThe UK is also leading the way on antivirals and therapeutics, with our AntiVirals Task Force securing a supply of almost 5 million – more per head than any other country in Europe.\nThird, SAGE advise there is considerable uncertainty about the future path of the pandemic, and there may of course be significant resurgences.\nThey are certain there will be new variants and it’s very possible those will be worse than Omicron.\nSo we will maintain our resilience to manage and respond to these risks, including our world-leading ONS survey, which will allow us to continue tracking the virus in granular detail, with regional and age breakdowns helping us spot surges as and where they happen, and our laboratory networks will help us understand the evolution of the virus and identify any changes in characteristics.\nWe will prepare and maintain our capabilities to ramp up testing.\nWe will continue to support other countries in developing their own surveillance capabilities, because a new variant can emerge anywhere.\nAnd we will meet our commitment to donate 100 million vaccine doses by June, as our part of the agreement at the UK’s G7 summit to provide a billion doses to vaccinate the world over the next year.\nIn all circumstances, our aim will be to manage and respond to future risks through more routine public health interventions, with pharmaceutical interventions as the first line of defence.\nFourth, we will build on the innovation that has defined the best of our response to the pandemic.\nThe Vaccines Task Force will continue to ensure the UK has access to effective vaccines as they become available, already securing contracts with manufacturers trialling bi-valent vaccines, which would provide protection against Covid variants.\nThe Therapeutics Task Force will continue to support seven national priority clinical trial platforms focused on prevention, novel treatments and treatment for long-Covid.\nWe are refreshing our biosecurity strategy to protect the UK against natural zoonosis and accidental laboratory leaks, as well as the potential for biological threats emanating from state and non-state actors.\nAnd building on the Five Point Plan I set out at the United Nations and the agreements reached at the UK’s G7 last year, we are working with our international partners on future pandemic preparedness, including through a new pandemic treaty, an effective early warning system or Global Pandemic Radar, and a mission to make safe and effective diagnostics, therapeutics and vaccines available within the first 100 days of a future pandemic threat being identified.\nAnd we will be hosting a global pandemic preparedness summit next month.\nAnd Mr Speaker, Covid will not suddenly disappear.\nSo those who would wait for a total end to this war before lifting the remaining regulations, would be restricting the liberties of the British people for a long time to come.\nThis government does not believe that is right or necessary.\nRestrictions pose a heavy toll on our economy, our society, our mental wellbeing, and the life chances of our children.\nAnd we do not need to pay that cost any longer.\nWe have a population that is protected by the biggest vaccination programme in our history.\nWe have the antivirals, the treatments, and the scientific understanding of this virus, and we have the capabilities to respond rapidly to any resurgence or new variant.\nAnd Mr Speaker it is time to get our confidence back.\nWe don’t need laws to compel people to be considerate of others.\nWe can rely on that sense of responsibility towards one another, providing practical advice in the knowledge that people will follow it to avoid infecting loved ones and others.\nSo let us learn to live with this virus and continue protecting ourselves without restricting our freedoms.\nAnd in that spirit, I commend this Statement to the House.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_category_Speeches-in-Parliament/content_22.html": "Prime Minister’s Statement on Living with Covid-19: 21 February 2022 21st February 2022 Mr Speaker, with permission I will make a statement on our strategy for living with Covid. And before I begin, I know the whole House will join me in sending... Speeches in Parliament\nTribute to Sir Reginald Eyre 1925-2019 1st February 2019 It's been a busy week, and a sad one for my family. On Monday I was proud to be able to pay tribute, in the House of Commons, to Sir Reginald Eyre who, for 22... Speeches in Parliament",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_visiting-parliament-individuals-groups-and-schools/content_9.html": "Every year, MPs welcome hundreds of schoolchildren to Parliament and I am always tries to meet visitors from the constituency to talk about the politics and history of Westminster, the work of an MP and about local issues.\nTours can be booked for groups of up to 25 people. If you would like to book a tour of the Palace of Westminster, please contact my office. Unfortunately, I cannot meet travel costs.\nFor more details, such as the best times to arrange a tour of Parliament, please visit www.parliament.uk/visiting/visiting-and-tours/ukvisitors . Please be aware that tours do need to be booked months in advance.\nThere are also free educational visits which, in addition to a tour of the Palace, offer children and students the chance to learn more about Parliament through interactive workshops. There is also a travel subsidy available to state schools which could cover up to 75% of your travel costs.\nAll bookings are made by phone, one school term in advance, on a given date. To make a booking for an educational visit, please visit www.parliament.uk/education/visiting-parliament .",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news/content_15.html": "Post Office Changes Monday, 7 April, 2025 In recent years, as High Street Banks have closed their premises in Brentwood, Shenfield and Ingatestone, more use is being made of Post Office services to pay in money, as well as all the other assistance offered with passport applications, posting parcels and buying stamps. However, there are some changes afoot for Post Office services in the Brentwood Borough, and I had a meeting last week with... Articles\nBudget Squeeze for Households, But Good News from Essex Police 2nd April 2025 The changing of the clocks at the weekend to British Summer Time has been a welcome return to lighter evenings, and the recent sunshine has been something of a... Articles\nCosts of Living Increases Under Labour Government 1st April 2025 Families in Brentwood and Ongar are i n line for £1,191 of cost increases from today, 1st April. A swathe of price increases are set to come into force on the... Articles\nSmartphone Free Childhood 26th March 2025 A highly significant question for parents in the modern world is when to give your child a smartphone. This is because of increasingly clear data that exposes... Articles\nPlanning Permission Granted for the Lower Thames Crossing 25th March 2025 Planning Consent has been given to National Highways to go ahead with the Lower Thames Crossing, which aims to reduce congestion on the M25 at the Dartford... Local News\nEssex Police Call for Doorbell Camera Footage in Pilgrims Hatch After Body of Man Found 20th March 2025 Essex Police are appealing for anyone with information that will support their investigation following the very sad discovery of a man’s body in Pilgrims Hatch... Local News\nConstituency Visits: From Pylons to Cathedrals to Laybys 19th March 2025 It’s always good to be back in the constituency after a busy week in Parliament, and the team catch-up in the new Miracle Café on Brentwood High Street was... Articles\nKemi Badenoch Speech: Launching the Conservatives' Policy Renewal Programme 18th March 2025 Today [Tuesday 18 March 2025] Kemi Badenoch, Leader of the Conservative Party, announced the Policy Renewal Programme. We are living off the inheritance of... Opinions\nUrgent Pylons Consultation Update for Haverings Grove Residents 14th March 2025 In my ongoing campaign against the line of massive onshore pylons proposed to run from Norwich to Tilbury, through Ingatestone, Dunton Garden Village and... Local News\nShenfield Library Reopens in Brand New 21st Century Building 3rd March 2025 When Essex County Council launched its Library Services Consultation in 2019 there was great concern among constituents in Shenfield, Ingatestone and North... Articles",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_category_Westminster-News/content_11.html": "Kemi Badenoch Speech: Rebuilding Trust 16th January 2025 16th January 2025 We are all getting poorer. Politicians across all parties have not told the truth about this and instead keep prescribing quick fixes that are actually making... Westminster News\nRishi Sunak MP: Budget 2024 Response 30th October 2024 Madam Deputy Speaker, on the day he took office, the Prime Minister said he wanted to restore trust to British politics “with actions, not words”. Well today... Westminster News\nSupporting Pensioners Against Labour's Cruel Winter Fuel Payment Cut 10th September 2024 I will this afternoon vote against Labour’s plan to cut winter fuel payments for pensioners in Brentwood and Ongar after the Conservatives forced a Labour u... Westminster News\nGeneral Election 2024: CLEAR PLAN. BOLD ACTION. SECURE FUTURE 22nd May 2024 Prime Minister Rishi Sunak speaking today on the steps of Downing Street, said: (Checked against delivery) “In the last five years our country has fought... Westminster News\nMy Vote on Tobacco and Vapes Bill 16th April 2024 I want to set out for constituents my position on the Tobacco and Vapes Bill currently before Parliament. The bill would ban the sale of tobacco to anyone born... Westminster News\nCost of Living Payments Due for Vulnerable and Low-Income Households in Brentwood and Ongar 17th October 2023 I am very pleased the next cost of living payment, worth £300 for 7,100 vulnerable and low-income households in Brentwood and Ongar will be made between 31... Westminster News\nOur New Plan to Deliver Net Zero 25th September 2023 The Prime Minister's Ten Point Plan to deliver Net Zero will mobilise £12 billion of Government investment while laying the blueprint for a green industrial... Westminster News\nHistoric Bill to Ban Trophy Hunting Imports Approved By The House of Commons 20th March 2023 The House of Commons has passed the the Hunting Trophies (Import Prohibition) Bill, introduced by Crawley MP Henry Smith last year to legislate for a historic... Westminster News\nSupport for Households and Energy Security at the Heart of Budget 16th March 2023 Measures to support households with their bills and increase the country’s energy security and independence are at the heart of the Budget announced by the... Westminster News",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_ofgem-guide-help-available-energy-suppliers/content_46.html": "As the restrictions in response to COVID-19 have continued, Ofgem has been working closely with the energy industry to ensure consumers, particularly vulnerable consumers, continue to be protected. In October 2020 they strengthened protections for customers, making it a requirement that suppliers put customers in debt on a realistic and appropriate repayment plan. Suppliers have also voluntarily agreed to provide additional support to customers during the pandemic.\nThis is a worrying time for many people, particularly those who may be facing financial hardship. Ofgem has put together a brief guide which sets out the help available from suppliers, government schemes such as the Winter Fuel Payment, and where to find advice on managing debt and budgeting.\nIf someone is struggling to pay their gas or electricity bills or they get into debt, they should contact their energy supplier as soon as possible. Please do share this guide or the advice within directly with your constituents.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_privacy/content_38.html": "This document outlines how Alex Burghart MP processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Alex Burghart MP\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Alex Burghart MP.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Alex Burghart MP, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Alex Burghart MP via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_contact/content_27.html": "Thank you for taking the time to find me online. You can contact me using the form below. Please ensure select your address from the drop-down menu.\nI would like to be kept up-to-date by Alex Burghart MP on future issues that matter to me:",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_digital-essex-looks-support-faster-broadband-and-internet/content_44.html": "Essex County Council has launched a new £1.88 million programme to support digital connectivity and tackle digital exclusion. I know many of my constituents here in Brentwood and Ongar still struggle with slow broadband speeds and connectivity, especially in more rural areas, so I am keen any support to improve the service is accessed by those who need it.\nWorking with key partners, Digital Essex will deliver the County Council’s Digital Strategy for Essex over the next four years, in line with the Everyone’s Essex agenda.\nPlans include the development of a local grant scheme to provide additional funding to reach the final one per cent of rural addresses that still cannot access decent broadband.\nThis investment is in addition to £14 million spent by Essex County Council on upgrading digital infrastructure across the county with its superfast broadband programme, which has so far boosted connections to 160,000 homes and businesses.\nResearch shows that people who do not have the access, skills and confidence to use the internet are more likely to face inequalities than those who do. By making faster broadband and mobile internet connections available, Essex County Council is aiming to address inequalities, including employment prospects and poor mental and physical health.\nCllr Lesley Wagland OBE, Essex County Council Cabinet Member for Economic Renewal, Infrastructure and Planning, said: “This funding will help to ensure that no individual or business is excluded from digital opportunities due to lack of infrastructure, affordable access, equipment, or skills.\n“Enabling people to build the skills they need to be part of the business recovery is key to a stronger economy for the future. That’s why it’s so important for us to give our residents the confidence to take advantage of digital services and employment opportunities.”\nCllr Louise McKinlay, Essex County Council Deputy Leader and Cabinet Member for Community, Equality, Partnerships and Performance, said: “This new programme launch will support digital connectivity and inclusion initiatives, which are so important for our communities. We know that a lack of access to digital skills and services can limit opportunity – this funding will help to improve outcomes for our residents.”\nRead more about Digital Essex and Essex County Council's Strategy.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_helpful-links-advice-and-support-consumers-and-households/content_42.html": "Business, utility companies, housing associations and transport providers are providing fact sheets and advice on what they can do to help you during this difficult time.\nPlease see below for the information I have received so far - I will update it as more comes in.\nFor up-to-date information regarding what support is available from the Government please click here.\nAction for Children\nParent Talk is an online support service from Action for Children designed for parents that is free:\nAs part of their digital offer to parents, Parent Talk helps to provide extra support. There is guidance for parents on everything from managing behaviour through to sleep and emotional wellbeing, as well as the option to live chat with their parenting coaches online.\nThere is also support for parents including tools to help them take care of themselves, as well as practical advice on coping with money, relationships and their own emotional wellbeing.\nAge UK\nVolunteering\nAge UK has put together postcards and a short video on neighbourly volunteering which provides helpful information and support for older friends and neighbours: http://bit.ly/2WtAOGT\nDemand for our vital services has increased rapidly and online donations are the most effective way to reach the most in need at this time. Volunteers can help us keep our Information & Advice and friendship services running and help the local Age UKs provide practical help such as food parcels by donating at www.ageuk.org.uk/coronaappeal\nAge UK is here to support older people during this challenging time. We’ve outlined some tips to help stay safe and well over the coming weeks here\nIf you have concerns about anything else, including welfare, care or housing, you can contact Age UK’s free advice line, 8am-7pm, 635 days a year: 0800 055 6112\nChelmer Housing Partnership (CHP)\nCHP is a local housing association with a number of homes in the Brentwood and Ongar constituency. Enhanced health and hygiene measures have been put in place in its housing schemes and all community meetings and any external use of its facilities have been cancelled, including stopping the booking of guest suites in sheltered schemes. CHP is asking any customers who feel unwell and are self-isolating, to let them know as soon as possible. This is so they know how best to deliver any essential services to them. You can find out more here.\nEDF\nEDF know that the cost of living has had a significant impact on their customers’ lives and many will be worried about paying their bills. That is why EDF want to reassure customers that they are here to help. EDF are asking all customers who are worried about their finances or about paying a bill to take action and contact them.\nIgnoring debt only makes the problem worse. But EDF can only help if a customer gets in touch with them.\n- EDF have plenty of advice on what to do if you are worried about debt on their website here.\n- Alternatively, you can call their dedicated debt advice line: 0333 009 6992\nBy contacting EDF, their expert customer services team will work with every customer to provide tailored support to get them out of debt and back in control of their finances as quickly as possible.\nEDF have a number of ways they can help:\n- Tailored repayment plans: EDF know that every person is different and they will work with each customer to agree an affordable repayment plan which is right for them\n- A pay as you go meter – A smart PAYG meter puts their customers firmly in control of their energy usage and payments. Budgeting is made easy via their app, or by an in-home display that allows customers to see exactly how much energy they’re using in pounds and pence. Paying is simple too; customers can set auto-tops, low level alerts and pay online anytime, anywhere.\n- Energy saving advice – By better understanding their customer’s energy use, EDF also provide useful tips on how customers can save. This includes installing a smart meter or whether a customer would be eligible for new energy efficiency measures, like insulation, through the Energy Company Obligation.\n- If a customer needs extra support with their finances EDF can also put customers in touch with their partners at Citizen’s Advice Plymouth or Income Max to check for additional income sources.\nUK Power Networks (UKPN)\n\"We offer free additional tailored support and guidance to customers on our Priority Services Register if they experience a power cut, reliant on electronic medical equipment or with young children. For more information on our Priority Services Register, please visit www.ukpowernetworks.co.uk/priority to register, or call us on 0800 169 9970.\"\nUKPN's latest advice can be found here",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_parliament/content_3.html": "Tweet You can see Alex's latest speeches and appearances in Parliament below (provided by TheyWorkForYou):\nEmergency Preparedness | Cabinet Office | Commons debates I would like to turn to the sorry state of Labour-run Birmingham, where rats the size of dachshunds are terrifying local residents.\nEmergency Preparedness | Cabinet Office | Commons debates I am afraid I am not going to congratulate the Deputy Prime Minister, in much the same way that the people of Birmingham are not thanking he\nTopical Questions | Cabinet Office | Commons debates Will the Paymaster General give us an update on his negotiations with the European Union?\nTopical Questions | Cabinet Office | Commons debates The whole House will have heard the Minister fail to rule that out.\nTopical Questions | Cabinet Office | Commons debates The whole House will have heard the Minister fail to rule that out.\nTopical Questions | Cabinet Office | Commons debates Will the Paymaster General give us an update on his negotiations with the European Union?\nEmergency Preparedness | Cabinet Office | Commons debates I would like to turn to the sorry state of Labour-run Birmingham, where rats the size of dachshunds are terrifying local residents.\nEmergency Preparedness | Cabinet Office | Commons debates I am afraid I am not going to congratulate the Deputy Prime Minister, in much the same way that the people of Birmingham are not thanking he\nSteel Industry (Special Measures) Bill: Business of the House | Commons debates The House was sitting on Monday and on Tuesday, and on those days my hon.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_safer-essex-asks-your-views-community-safety/content_28.html": "Essex County Council has been in touch to let Essex residents know they can voice their priorities to help police and local authorities tackle crime and anti-social behaviour in different communities.\nThe annual Community Safety Survey by Safer Essex, on behalf of the county’s 14 Community Safety Partnerships, asks a range of questions to help focus multi-agency efforts in addressing crime and community safety across Essex.\nThe deadline for responses to this year’s survey has been extended to 31 July 2024. It is also the first Community Safety Survey to ask Essex residents about road safety.\n1,304 residents responded to the first survey in 2023. 83% identified burglary as a top concern, followed by 81% choosing theft of or from a vehicle and 77% saying fraud or scams.\nSafer Essex will be working closely with the new Multi-Agency Approach to Fraud (MAAF) group set up by Essex police as a result.\nThe survey also found 58% of respondents had witnessed anti-social behaviour in this last 12 months. This was followed closely by 56% witnessing drug usage or evidence or drug taking.\n61% of respondents said they could confidently identify signs of radicalisation in someone they know. However, just 47% said they were confident in knowing where to seek help.\nThe results were similar to 50% of respondents who said they could confidently spot signs of modern slavery, compared to 49% who felt unconfident about knowing where to report their concerns.\nSafer Essex will therefore be launching awareness campaigns about how to spot signs and help protect people from radicalisation and modern slavery.\nCouncillor Louise McKinlay, Deputy Leader and Cabinet Member for Levelling Up, Communities and Business Engagement at Essex County Council, said: “We received incredibly valuable insight into people’s views on crime and community safety across Essex as a result of last year’s survey.\n“We want to hear from as many residents as possible so effective solutions can be developed by local authorities in different parts of Essex.\n“The Community Safety Survey covers all types of crime including burglary, fraud, modern slavery, fly-tipping and anti-social behaviour. I urge Essex residents to complete this year’s survey to help police and local authorities focus their efforts on what matters most to you.”\nPhillipa Brent-Isherwood, Chair of Safer Essex, said: “Together we have built a strong, successful working partnership approach to community safety across the whole of greater Essex.\n“All Safer Essex partners, from Essex Police and Essex County Fire and Rescue Service to councils, health authorities and community groups, have contributed to creating a safe county for residents, families and businesses.\n“To maintain our successful approach and plan for the future, we need to hear the views of our biggest, most valuable partner: the people who live and work in Essex. As we have seen from last year’s survey, the results drive real action within and across the partnership, so people’s views can make a tangible difference to how we work together to keep Essex a great place in which to live, work and play for many years to come.”\nRoger Hirst, Police, Fire and Crime Commissioner for Essex, said: “Safe, secure communities are the bedrock on which we build prosperity and wellbeing for everyone.\n“Working together with our Safer Essex partners, we have invested in patrols and action around identified anti-social behaviour hotspots and improved town and city neighbourhoods through our Safer Streets interventions, with both these innovative actions supported by our strong Community Safety Partnerships.\n“All this partnership work has contributed to a decrease in crime of 6.5% year-on-year to the end of March, with anti-social behaviour incidents dropping by 26.8% in the same period. Our plan is working.\n“By completing this Safer Essex survey, residents can tell us their concerns around crime and community safety, helping inform how we plan and allocate resources for further effective interventions.”\nResidents can take part in this year’s Community Safety Survey until 31 July 2024 at https://consultations.essex.gov.uk/equalities-and-partnership/community_safety_survey_2024",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_map-locations/content_7.html": "Skip to main content\nMain navigation\nAbout Alex\nNews\nMy Plan\nLocal Issues\nIn Parliament\nIn Brentwood and Ongar\nContact\nMy Map",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_supporting-pensioners-against-labours-cruel-winter-fuel-payment-cut/content_37.html": "I will this afternoon vote against Labour’s plan to cut winter fuel payments for pensioners in Brentwood and Ongar after the Conservatives forced a Labour u-turn on holding a vote in Parliament.\nUnder Labour's original plan to axe the payments for more than 10 million older people across the country, MPs would not be able to debate the proposal in Parliament.\nBut now, following strong pressure from me and my fellow Conservative MPs, and an outcry from people across the country, the decision to end the payments will be discussed and vote on by every MP in the country.\nAnd it means the Government will be forced to defend their cruel plan before a vote and will reveal which MPs are prepared to punish thousands of pensioners in their constituencies.\nPensioners in Brentwood and Ongar will lose between £200 and £300 annually to help with their heating bills during the winter, if Labour MPs back the plan.\nI have made it clear I strongly believe the Labour Government is wrong to scrap the Winter Fuel Payment for pensioners. Now we have forced Labour into a vote, I will be standing up for pensioners here and support the Conservative motion against the cruel cuts.\nWhile Labour is giving their union paymasters a payrise, yet feel happy to cut vital payments to pensioners, it tells you all you need to know about the Government's priorities as we head towards Autumn and Winter. Rachel Reeves must reverse this decision so that those who worked hard and saved all of their life, live with dignity and security in retirement.\nBetween 2010 and 2023, the Conservatives had lifted over 200,000 pensioners out of absolute poverty. The Conservative Government’s unprecedented cost of living support following Putin’s illegal invasion of Ukraine also prevented 400,000 pensioners from falling into absolute poverty after housing costs in 2022-23.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_post-office-changes/content_23.html": "In recent years, as High Street Banks have closed their premises in Brentwood, Shenfield and Ingatestone, more use is being made of Post Office services to pay in money, as well as all the other assistance offered with passport applications, posting parcels and buying stamps.\nHowever, there are some changes afoot for Post Office services in the Brentwood Borough, and I had a meeting last week with the national Post Office Limited team to find out what is going on.\nIn Ingatestone, a temporary postmaster is in place after a number of issues meant the village’s Post Office services had been disrupted. In Shenfield, the Morrisons Daily store which replaced the former McColl’s shop, is due to close after Morrisons could not achieve a breakeven position in that site. This means the Shenfield Broadway Post Office located in the store will close on 13th April but efforts are being made to find a new location within Shenfield. This could be in the other Morrison’s store on Hutton Road, or somewhere else. If you think you could run a Post office this is the link to the website where Post Office Limited is now inviting expressions of interest to apply for Shenfield Broadway Post Office:\nhttps://runapostoffice.co.uk/branch/shenfield-broadway-post-office-brentwood-cm15-8nr\nInterest needs to be registered by 16th April.\nAnd in Brentwood, the town’s main Post Office, which moved to WH Smiths when the Baytree Centre was refurbished, is facing some change as WH Smith’s High Street business has been acquired by Modella Capital.\nModella is very enthusiastic about having Post Offices in their stores, as they bring footfall into those shops and generate significant revenues so is in talks with Post Office Limited about how Post office services can remain in Brentwood High Street.\nPost Office Limited has assured me it will continue to adhere to its Access Criteria set by HM Government and meet its requirement to maintain 11,500 branches across the UK. I will keep a close eye on what happens across the constituency, and please let me know if you have any concerns.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_costs-living-increases-under-labour-government/content_10.html": "Families in Brentwood and Ongar are in line for £1,191 of cost increases from today, 1st April. A swathe of price increases are set to come into force on the Chancellor, Rachel Reeves', watch today and when the tax year changes on 6 April.\nAnalysis shows an average family could be hit with annual bill increases of £1,191 following April hikes. The price breakdown includes:\n- Energy bills will rise by an average of £111. Labour promised to cut energy bills by £300 during the election but now the Energy Price Cap will rise to £1,849 – an increase of £111.\n- Council Tax to rise by £109. Labour promised to ‘freeze’ Council Tax, but the average Council Tax bill will rise by £109 on Labour’s watch.\n- Water bills to rise by £123; car tax to rise by £5; TV licence to rise by £5; phone bills to rise by £46; broadband to rise by £36 and nursery fees to rise by £756.\nLabour promised to support families with the cost of living but all of these increases create higher costs for families.\nThese price rises are yet another broken promise at the hands of a Labour Chancellor who is mismanaging the economy, with the British people paying for the privilege.\nI don't believe my constituents in Brentwood and Ongar should be forced to pay more for Labour’s choices. Only the Conservatives will remain on the side of hardworking families.\nMy colleague, Mel Stride, the Shadow Chancellor of the Exchequer has said: “Today [1 April] hard-working families across the country will see their cost of living rise yet again — and it's all thanks to this Labour government’s choices. A whole litany of household bills is set to soar, with some increases running into the hundreds of pounds. Whether it’s council tax, energy, water, broadband or car tax, almost every corner of family life is about to get more expensive. Yes, these bill hikes may come into force on April Fools’ Day, but there’s nothing funny about what Labour is doing to the country.”",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_campaigns_cost-living-support/content_48.html": "Useful Information from Organisations offering Cost of Living Support\nNational Debtline is a debt advice charity, providing free, impartial expert advice to more than 100,000 people each year. https://nationaldebtline.org/freedebtsupport\nUseful Information from Organisations offering Cost of Living Support\nNational Debtline is a debt advice charity, providing free, impartial expert advice to more than 100,000 people each year. https://nationaldebtline.org/freedebtsupport",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_kemi-badenoch-speech-rebuilding-trust-16th-january-2025/content_16.html": "We are all getting poorer.\nPoliticians across all parties have not told the truth about this and instead keep prescribing quick fixes that are actually making things worse.\nThis problem is broader than one party, one leader, or one period of government.\nGenerations of leaders and entire ranks of senior managers have been trying and failing for a long time.\nMany have not been honest with the public about the challenges we face.\nAnd others have not even been honest with themselves.\nWe are a great country, but we’ve lost our way.\nThe truth is that Britain is failing to compete in a world that is changing.\nAnd it is not working for its citizens, certainly not the way it used to.\nBack in the 1980s it took just months to save up for a house deposit.\nNow it is over a decade and for many the dream of owning a home is impossible.\nJobs which didn’t require a degree twenty years ago now need two, loading up to £50,000 of debt on someone just starting out.\nOne of my favourite quotes is from the economist Thomas Sowell.\nHe says: ‘When you want to help people, you tell them the truth. When you want to help yourself, you tell them what they want to hear.’\nThe Conservative Party is under new leadership.\nFrom now on we are going to be telling the British people the truth even when it is difficult to hear.\nThe truth about the mistakes we made.\nThe truth about the problems we face.\nAnd the truth about the actions we must take to get our country out of this mess.\nIt’s hard not to feel sorry for the Labour government.\nIt’s hard because they’ve walked into some of the same traps that we did.\nLike assuming that you can just keep raising taxes and there’ll be no consequences.\nBut I don’t feel sorry for them. Because as we saw last week when Keir Starmer labelled people calling for an inquiry ‘far-right’ he is what that is wrong with politics.\nIt’s legalism not leadership.\nAnd Labour are having even worse problems than we did because they presented policy without a plan.\nPolicies without a plan are not policies they’re just announcements.\nThat’s why Labour are struggling. It’s the old cliche that Failing to plan is Planning to Fail.\nBecause when you haven’t worked out what you’re going to do in opposition, you will accept whatever you’re given in government.\nThat’s why Rachel Reeves snatched winter fuel and taxing family farms.\nThose options were presented to us time and time again by officials and we rejected them, because they would hurt so many people for so little benefit.\nThe Chancellor took them because she has no ideas of her own.\nIt’s the same with education.\nThe schools bill that is going through Parliament now has one or two bits on safeguarding that may be good, the rest of it is worse than garbage. It is pure vandalism.\nAnd it’s quite clear these aren’t really Bridget Philipson’s ideas either.\nThey are a shopping list of all the complaints that the education unions had about schools right from the days of Tony Blair now wrapped up in a bill that is going to destroy the education of our children over the next five years.\nThe public will never trust politicians unless we can admit our mistakes.\nLabour are making a lot of mistakes.\nBut the difference between me and Keir Starmer is that he doesn’t believe that he’s ever made a mistake.\nI will acknowledge the Conservative Party made mistakes.\nAnd I understand why the British people, made it so clear in July, that they wanted a change.\nWe were making announcements without proper plans.\nWe announced that we would leave the European Union before we had a plan for growth outside the EU.\nWe made it the law that we would deliver Net-Zero by 2050, and only then did we start thinking about how we would do that.\nWe announced year after year that we would lower immigration but despite our efforts immigration kept going up.\nThose mistakes were made because we told people what they wanted to hear first and then tried to work it out later.\nThat is going to stop under my leadership.\nIf we are going to turn our country around, we’re going to have to say some things that aren’t easy to hear.\nLet’s start with our problems.\nWe think we are rich, but we are living off the inheritance that previous generations left behind. A complacency that Britain will always be wealthy and a refusal to live within our means.\nWe owe it to that next generation to leave an inheritance for them and not mortgage their future to make our lives more comfortable.\nAnd that will demand the kind of tough soul-searching conversations we’re not having right now.\nEnergy supply so vulnerable, more vulnerable than ever and our energy is far, far too expensive when it should be secure, cheap, and plentiful.\nDemography is Destiny. People are having fewer children. Our society is getting older, we are living longer and needing more support towards the end of our lives.\nLook at productivity: A shrinking group of people are working to support an ever-growing number of those who are unable, or unwilling to work.\nThe information age means it is easier than ever for rogue governments to destabilise us and for rogue companies and countries to steal our know-how.\nAnd no ifs, no buts. We simply cannot take all the millions of people who want to come here from elsewhere.\nOur country is our home, it is not a hotel.\nIf people arriving don’t want to integrate into British culture, they shouldn’t be here.\nIt is not controversial to say that.\nAnd that’s why we need new Leadership.\nIt doesn’t matter what colour of government you have these structural problems need fixing.\nGovernment needs to focus on the things that matter.\nBut it isn’t because it is already doing too much – and it’s doing it badly.\nThis has to stop. Because the dream of every generation – that our children can have a better future than we did – is slowly dying.\nIt’s dying because as our problems have got more urgent our politics has got less serious.\nSince July, there has been more discussion in Parliament on Oasis tickets than on our £2.7 trillion debt pile. That has to stop.\nThe young people I speak to are deeply despondent that their country is unable to provide them better opportunities let alone guarantee health, wealth, and prosperity.\nI share these concerns they motivate me every day.\nAnd I worry that our public services will continue to deteriorate despite us paying ever-increasing taxes to sustain them.\nAnd I worry that our armed forces will not be upgraded fast enough for a darker and more dangerous world.\nThat’s why Labour have to course correct now.\nBut, instead, we see them cancelling the good things we did and then doubling down on our mistakes.\nLabour are shrinking the economic cake right in front of us. Wrecking business confidence. Destroying jobs. They are suffocating the spirit of enterprise.\nTiny bits of growth in the economy can hide millions of personal recessions.\nLife gets tougher as wages slip further behind another round of price rises.\nMillions of mortgages will be fixed at higher rates than necessary a direct result of Rachel Reeves’s economic mismanagement.\nMillions of jobs will never be created because business owners decide it is just too hard and there is no point if the Chancellor and HMRC are just going to punish them for it.\nLabour treat business as a cash machine\nAs if its only purpose is to give them ever more money to satisfy their desires for ever more spending.\nBusiness success is treated with suspicion. A burden to be tolerated rather than celebrated.\nIt doesn’t have to be like this.\nLast Friday, I spoke with a group of workers in Derbyshire.\nThey are the backbone of our country. They have little time for politics because they are trying to build a better life for themselves and their families.\nThey want Government to do what it says it is going to – and they don’t really ask for much more.\nOne lady, a single parent, told me just how much impact, rising prices were still having.\nThat it just seemed to be ‘one thing on top of another.’\nThat ‘nothing seems to be getting better.’\nAnd it ‘feels like no-one’s looking at it.’\nOur country is tired of politicians promising the earth but never having a plan to deliver it.\nThey’ve seen it all before. And they aren’t falling for it again.\nAnd part of this is because too many politicians haven’t worked normal jobs or run proper businesses.\nMost of Starmer’s Cabinet have barely even worked for a business, let alone built one.\nThey’ve never ever had to live with the consequences of their mistakes.\nSo, we need change.\nChange that actually sorts out our problems.\nChange that we should have done more of.\nChange that Keir Starmer is clearly not bringing.\nAnd that means the Conservative Party doing things differently under new leadership.\nFirst, we must restore trust. We will start by fulfilling the role the British people gave us: being an effective opposition. Fighting for common sense and truth. Building a plan which actually delivers.\nWe need the government to do well, in order for our country to do well.\nBut they are failing on the basics. Labour may have a supermajority in Parliament, yes, they do, but they are fast losing their legitimacy in the country.\nAnd why?\nBecause during the election Starmer hid that he doesn’t want what the British people want.\nBut everyone can see now the truth.\nHe’s a lawyer, not a leader.\nSecond, we are absolutely going to keep saying what ordinary people think.\nWe’re not going to be quiet about things that are too important for our country.\nIn the last two weeks, people have told us to be quiet about the decades-long scandal of rape gangs, because they’re uncomfortable about potential racial and cultural motivations behind these crimes.\nWell, the Conservative Party is under new leadership.\nWe will not do that. Those victims have waited too long for justice.\nLet’s take the Post Office: another scandal that needed addressing. Hundreds of postmasters wrongfully convicted. Decent lives ruined a national scandal.\nWe were told it was being sorted that ministers didn’t need to get involved. Yet the system was so slow. So, I made sure victims got justice with an unprecedented law to quash the unfair convictions of sub postmasters.\nUnder my leadership our party is going to be about telling it straight.\nWe need more people in politics who will do the right thing – and who will use their common sense even when they are attacked.\nWhen I was a Minister I took on extremists who were putting women and children in harm’s way.\nThey called me a transphobe.\nThey even called me homophobic they said I was fighting culture wars as I tried to stop young children from receiving irreversible transgender procedures without any evidential basis.\nThat same ideology led to male rapists being put in female prisons, this was one scandal other politicians were too scared to tackle and tried to ignore. I fought and I won.\nWe will NOT ignore.\nThird, we are going to push Keir Starmer to do the right thing. For the good of the country, we can’t afford for Labour to fail.\nWe will back Keir Starmer when he does the right thing. I don’t care who gets the credit.\nWe just have to start getting the country back on track.\nFinally, we are going to tell people why Conservatism matters.\nWe have gone through many iterations over these past 14 years. At times, it felt like our core beliefs had become secondary.\nIt left people disillusioned.\nIt made the task of governing harder.\nAnd it didn’t work.\nNo more.\nTo rebuild trust we have to show how Conservatism improves the lives of British people.\nWe will rediscover the idea that everyone contributes towards society not just calculates what they can take out of it.\nWe will again be the party of meritocracy.\nWe believe that if you do right by your community, family, and society, you will succeed.\nAnd if you don’t, you likely won’t.\nOur society is treating people who do best, badly; and the people that do worst, well.\nEverything is upside down.\nThat’s the opposite of fairness.\nFairness is the idea that the ledger of life reflects effort, agency, and contribution.\nYou know what helps working people?\nIt’s world class schooling that allows them to master complex topics, doesn’t sugar coat and prepares them for the ups and downs of the future.\nYou know what helps working people?\nBeing able to walk down the high-street and not see anti-social behaviour or casual disregard of our neighbourhoods because local bureaucrats have given up and crime is not punished.\nYou know what helps working people?\nEnsuring that they don’t spend January until June earning taxes for the government.\nYou know what else helps working people?\nA government that demands higher standards from public services.\nThat’s able to discern between public spending that is vital, moral, and fair and public spending that is wasteful and neglectful.\nThat’s my Conservatism.\nA Conservatism which deals with the problems of today.\nWhich prepares us for the challenges of tomorrow.\nA conservatism which leaves a better legacy to the next generation of young people young people who will be around long after those in power now have left the stage.\nReal Conservatism is inter-generational.\nIt is guardianship.\nIt isn’t a quick buck for today.\nIt’s the guarantee that tomorrow will be better, richer, and safer.\nAnd why does this matter so much to me?\nIt’s because I know what it is like to have something and then to lose it.\nI don’t want Britain to lose what it has.\nI grew up in a poor country and watched my relatively wealthy family become poorer and poorer despite working harder and harder as their money disappeared with inflation.\nI came back to the UK aged 16 with my father’s last £100 in the hope of a better life.\nSo, I have lived with the consequences of terrible governments that destroy lives and I never, ever want it to happen here.\nI became an adult fairly early, living as a lodger with a friend.\nStudying part time at an FE college to get my A-levels while working at McDonald’s to pay my way.\nI know what it is like to feel alone.\nI know what it is like to have to decide between paying for food or paying a bus fare.\nI did NOT study politics.\nI studied engineering and after that I went to night school to get another degree.\nSo, I see politics the way most people see it as an outsider.\nNot having the perfect language or the perfect presentation but wanting to fix things.\nI am fascinated by how to make things work and I can see how our country is just not working for ordinary people out there. I’m determined to change that.\nSo, the Conservatives are under new leadership. We are going to do something different.\nAnd this is my message to people watching today.\nWe need a government that supports, not punishes those who do the right thing.\nWe need to rebuild the state to be more focused, more efficient and – most importantly – more effective.\nWe need to make our country more resilient, secure, and prosperous.\nWhere hard work is rewarded.\nWhere children can have a better life than their parents.\nIt may not feel like it right now, but our country’s best days are ahead of us.\nBritain is a land of opportunity not a country to apologise for.\nSo, if you want real plans rather than announcements, join us.\nAnd if you want a better country for our children, join us.\nTogether, we can fix the damage that Labour is inflicting.\nTogether, we can make politics work again for the first time in a generation.\nThe Conservative Party is changing.\nWe are under new leadership we are back in the service of the British people,\nAnd we are going to give you your country BACK.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_budget-squeeze-households-good-news-essex-police/content_12.html": "The changing of the clocks at the weekend to British Summer Time has been a welcome return to lighter evenings, and the recent sunshine has been something of a relief from the grim news of recent weeks. Good weather is what we need, especially in a week when the cost of day to day bills is set to increase again by an average of £1191 as the effects of Chancellor, Rachel Reeves’ catastrophic mismanagement of the economy become clear. Under this Labour Government, an average household will see energy bills, council tax, water bills, car tax, TV licences, phone bills and broadband costs increase, at a time when household finances are already squeezed.\nHowever, I was pleased to hear the previous Conservative Government’s commitment to policing has paid off, with our Brentwood policing team reporting a reduction in crime and anti-social behaviour , and the number of vehicle thefts down by 26%. I meet regularly with the policing team and will ensure they are thanked for their diligence.\nMy thanks this week go to all those involved in dealing with the fire at the Phoenix Epping Hotel in North Weald last week, from the fire crews who attended from Ongar and further afield, to the Home Office and Epping Forest Council officers who found new accommodation for those affected. It was clearly a very distressing event for the hotel’s inhabitants, and I was very pleased to see the local community in North Weald and Ongar rallying around to offer support and help as needed.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_category_Reports/content_35.html": "Ofgem Guide to Help Available From Energy Suppliers 8th March 2021 As the restrictions in response to COVID-19 have continued, Ofgem has been working closely with the energy industry to ensure consumers, particularly vulnerable... Reports\nPrime Minister's statement on coronavirus (COVID-19): 31 July 2020 31st July 2020 Prime Minister Boris Johnson made a statement on coronavirus. Delivered on: 31 July 2020 (Transcript of the speech, exactly as it was delivered) Good afternoon... Reports\nNext Steps to Open Schools 26th May 2020 Yesterday, the Prime Minister outlined the next steps of the Government’s plan to safely reopen our schools and our economy. Thanks to this country’s collective... Reports\nBuilding Homes and Moving House During Coronavirus Pandemic - Update 14th May 2020 The Housing Secretary has announced a plan to restart the housing market in England, allowing anyone to move home safely while getting the vital construction... Reports\nProtecting Jobs and Businesses by Extending the Coronavirus Job Retention Scheme 14th May 2020 The Coronavirus Job Retention Scheme has protected millions of jobs and businesses across the UK during the outbreak – and the Chancellor has been clear that he... Reports\nAlex welcomes funding boost for schools in Brentwood and Ongar 14th October 2019 More children across Essex, including Alex Burghart's Brentwood and Ongar constituency will be able to access a world-class education thanks to a major funding... Reports\nAlex Welcomes Measures to Improve Train Punctuality in Brentwood and Ongar 2nd October 2019 Brentwood and Ongar Member of Parliament, Alex Burghart, has joined Conservative Transport Secretary Grant Shapps in welcoming changes to the way that train... Reports\nHMRC Beats Phone Scammers 18th June 2019 New controls deployed by HMRC mean fraudsters can no longer spoof most of the department’s helpline numbers. Scammers mimic legitimate HMRC helpline numbers... Reports\nHMRC Issues Scams Warning 23rd April 2019 HMRC is warning people to be vigilant about phone calls from fraudsters pretending to be the UK tax authority. HMRC received more than 60,000 reports of phone... Reports",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_expanding-high-speed-broadband-brentwood/content_6.html": "NIneteen thousand additional businesses and homes in Brentwood now have access to full-fibre broadband with average top speeds of 1,130Mbps thanks to recent investment by nexfibre, Virgin Media O2’s partner, to expand its full-fibre wholesale network in the area\nThe first phase of work to bring full fibre broadband to Brentwood was completed at the beginning of the year, has been completed, meaning residents can now access Virgin Media services for the first time, offering speeds up to 20 times faster than the local average. These hyperfast connections, offering top speeds of 1,130Mbps, are perfect for busy households working remotely, streaming Ultra HD TV shows and films, video calling friends and family, and playing games online.\nI was invited to meet some of the Virgin Media O2 team as they completed the work in the town. It is good to know my constituents have access to some of the fastest broadband speeds in the UK and there are plans to make gigabit broadband available to even more residents in the area.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_alex-burghart-mp-welcomes-benefits-essex-next-generation-gigabit-broadband/content_17.html": "- Essex is set to benefit as part of the first phase of the Government’s new £5 billion Project Gigabit which will deliver lightning fast broadband across the country.\n- Prioritising rural and remote areas, more than one million households and businesses will be able to access next generation gigabit broadband in the first phase of the project.\n- Through this project the Conservative Government is delivering on its manifesto promise to level up the entire country as we build back better.\nAlex Burghart MP has welcomed the Conservative Government’s £5 billion Project Gigabit that will see more than one million hard to reach homes and businesses benefit from lightning fast broadband.\nUp to 140,000 homes and business across Essex and the wider area will reap the rewards of Project Gigabit, with next-generation broadband speeds built to them.\nThis project prioritises areas that currently have slow connections and which would otherwise have been left behind in broadband companies’ rollout plans, putting the investment in place to make their available speeds rocket to more than 1,000 megabits or one gigabit per second. It means families no longer having to battle over bandwidth and will give people in rural areas the freedom to live and work more flexibly. Contracts for these first areas will go to tender in the spring with spades in the ground in the first half of 2022.\nProject Gigabit will also make £110 million available to connect public sector buildings such as GP surgeries, schools and libraries in hard to reach areas, as well as investing £210 million in the Gigabit Broadband Voucher scheme, which will help cover the installation costs of bringing gigabit connectivity to homes and businesses in rural areas.\nIn plugging in and powering up every corner of the UK, this Conservative Government is helping to accelerate our recovery from the pandemic and level up the country, creating jobs and spreading wealth across Britain as we build back better.\nCommenting, Alex Burghart MP said:\nFamilies and businesses across Brentwood and Ongar are relying on the internet now more than ever to work, shop and stay in touch with loved ones, so connection speeds have never been more important. I am delighted that Essex has been prioritised in Project Gigabit and that homes and businesses across the region will be benefitting from lightning fast broadband. By investing in hard to reach areas across the UK, this Conservative Government is creating jobs and spreading wealth across Britain as we level up and build back better.”\nPrime Minister Boris Johnson said:\nProject Gigabit is the rocket boost that we need to get lightning-fast broadband to all areas of the country. This broadband revolution will fire up people’s businesses and homes, and the vital public services that we all rely on, so we can continue to level up and build back better from this pandemic.”\nDigital Secretary Oliver Dowden said:\nProject Gigabit is our national mission to plug in and power up every corner of the UK and get us gigafit for the future.\nWe have already made rapid progress, with almost 40 percent of homes and businesses now able to access next-generation gigabit speeds, compared to just 9 percent in 2019. Now we are setting out our plans to invest £5 billion in remote and rural areas so that no one is left behind by the connectivity revolution.\n“That means no more battling over the bandwidth, more freedom to live and work anywhere in the country, and tens of thousands of new jobs created as we deliver a game-changing infrastructure upgrade.”\nENDS\nNotes to Editors\n- Investing £5 billion through Project Gigabit to deliver gigabit broadband across the country, so that no community is left behind. Project Gigabit will see more than one million hard to reach homes and businesses benefit from lightning fast broadband (DCMS, Press Release, 19 March 2021, link).\n- Delivering for people across Cambridgeshire, Cornwall, Cumbria, Dorset, Durham, Essex, Northumberland, South Tyneside and Tees Valley in the first phases of Project Gigabit. Up to 510,000 homes and businesses across these areas will have gigabit broadband built to them in the first phase of the project (DCMS, Press Release, 19 March 2021, link).\n- Making £110 available to connect public sector buildings in the hardest to reach parts of the UK. GP surgeries, libraries and schools will also be amongst those benefitting from revolutionary gigabit infrastructure (DCMS, Press Release, 19 March 2021, link).\n- Investing £210 million into the Gigabit Broadband Voucher Scheme for immediate financial support in getting gigabit speeds. People in rural areas will be able to access the voucher scheme to support our mission to get next-generation broadband speeds to hard to reach areas (DCMS, Press Release, 19 March 2021, link).\n- Levelling up the country, boosting house prices and creating jobs through a £2.6 billion scheme to roll out superfast broadband to ‘commercially unviable’ parts of the UK. The programme has extended fast, reliable connectivity to homes which would previously have been on the wrong side of the UK as we level up the country (DCMS, Press Release, 3 February 2021, link).\n- Connecting 500,000 premises to gigabit broadband since summer 2018. Almost 500,000 premises across the UK have been connected to gigabit-capable broadband since summer 2018 (DCMS, Press Release, 8 August 2020, link).",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_smartphone-free-childhood/content_25.html": "A highly significant question for parents in the modern world is when to give your child a smartphone. This is because of increasingly clear data that exposes the risks to children’s mental health as well as dangers of giving young people untrammelled access to everything on the internet/\nLast week I had a very interesting meeting in the new Shenfield Library building with three local parents – Jordana, Geoff and Jodie – who are representatives of Smartphone Free Childhood, a grass roots charity set up to educate parents and schools of the risks for children of using smartphones.\nAs a parent who is very firmly of the view that young children should not have smartphones I was very pleased to meet them. (Last week the Conservative Party tabled an amendment to the Government’s education legislation to ban smartphones in school but were defeated on the vote by Labour MPs). There is now a lot of interest in this movement from local primary schools and their parents – many of whom feel pressured into buying their child a phone because so many classmates have one.\nJordana, Geoff and Jodie all had different reasons to get onboard with the campaign, from the fact that phones put distance between adults and families to seeing what mental health problems and addiction to social media can have on older children and trying to slow this behaviour being passed to the younger generation.\nThe internet has changed a lot since the 1990s when it started to enter all our lives. Lots of adults – myself included – spend far too much on it. We have a duty to make sure children grow up in the real world and that they are protected from the sort of content that would never have come close to previous generations of young people. Having a proper conversation about children and smartphones is long overdue – I am very glad to see that local parents are having it.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_ongar-news-roads-and-aromas/content_26.html": "A very happy new year to all Ongar News readers!\nThe last year was a busy one with many local people contacting me about a huge range of issues.\nLast month I held a public meeting with residents who have been complaining about a strong smell coming from the composting site behind Ashlyn’s farm shop in North Weald. Reports of a periodic smell have been coming through for some time with no resolution, so I invited representatives from the Environment Agency, Essex County Council and Epping Forest District Council to speak to local people and outline what each organisation is doing to monitor work at the site and ensure it keeps within its environmental permit and planning conditions.\nThe outcome was to ask residents to contact Epping Forest District Council to report any strong odours so local environmental health officers can visit the area when the smell is very bad so they can build up a dossier to establish whether a statutory nuisance is being caused. Those who attended the meeting should now have those contact details for the Council and I will be happy to pass that information on to anyone else who is interested.\nI’m also in talks with Essex County Council on two road safety issues – the need for a Weight Restriction Order on Ongar High Street to stop huge lorries rumbling past pedestrians and buildings at the pinch point, and for something to make school drop off and pick up times safer for the children and parents of Stapleford Abbotts Primary School.\nIn December I discussed these issues with the new lead member for Highways on Essex County Council, Tom Cunningham, on the High Street in Ongar and received his assurances that he would look into them.\nI’ll be working hard to resolve these problems this year, and if there is anything else I can do to help with any further issues please do get in touch. I look forward to continuing to represent you and all that Ongar offers in 2024.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_ongar-news-weight-restriction-order/content_39.html": "My slow but steady campaign calling for a Weight Restriction Order (WRO) to be put in place on Ongar High Street to stop huge lorries using our historic town centre as a cut through when other A roads are blocked or busy, continues.\nLast month I had a meeting with the Leader of Essex County Council, Cllr Kevin Bentley, to ask for progress on this six year campaign. As all Ongar residents know, the pinch point on the high Street is very narrow. Old buildings tremble as lorries thunder through, and pedestrians are at risk as they walk on the narrow pavements on each side of the pinch point.\nI’ve made it clear to Cllr Bentley that something needs to be done. A Weight Restriction Order would mean any overweight vehicles having or causing an accident on the High Street would not be insured, as they should not be there. Cllr Bentley has suggested a Temporary Traffic Restriction Order would be a first step, and would enable the Council to see how a WRO would work in the long term.\nThe fight goes on and I will continue to update you through these pages.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_ongar-news-campaigns-update-post-general-election/content_29.html": "After a busy and tough General Election campaign, I was delighted to be re-elected as your Member of Parliament in the early hours of 5 July. As the only candidate to live in Ongar and have a day to day knowledge of what the town has and needs, I am honoured to have been returned as your Parliamentary representative.\nThis means my campaign to bring a Weight Restriction Order to deter massive lorries from thundering through the High Street continues. I am continuing to call on Essex County Council, the Environment Agency and landowners to ensure ditches and drains are kept clear to alleviate flooding – if the rain this summer is anything to go by so far, we need free-flowing ditches and drains more than ever.\nThe frustration with potholes continues – I do always refer correspondents to Essex County Council, which is the local authority responsible for mending the roads, and to their county councillors, who have a direct line to the Highways team to highlight areas of most concern and call for urgent repairs. Though it is pleasing that some roads such as Greensted Road have now finally been resurfaced.\nI’m also keeping an eye on composting smells on the Ongar border, speeding traffic in Stapleford Abbotts, and plans for a huge Google Data Centre in North Weald. I know there will be other issues arising, so if you think I can assist in bringing them to the attention of Ministers or Government teams please do get in touch.",
  "https_www_alexburghart_org_uk_/https_www_alexburghart_org_uk_news_autumn-budget-spending-review/content_4.html": "- Alex Burghart MP has welcomed the Conservative Government’s Autumn Budget and Spending Review, saying it will help working families in the East of England meet the cost of living, support businesses’ recovery, deliver world-class public services, and drive economic growth.\n- Key announcements to help level up the East of England include £87 million through the Levelling Up Fund for five projects, over £411 million for local roads maintenance over the next three years, and three new community diagnostic centres to improve health outcomes.\n- People and businesses in the East of England will also benefit from a reduction in the Universal Credit taper rate, an increase in the National Living Wage to £9.50 an hour, a freeze in fuel and alcohol duty, as well as cuts to business rates, new tax reliefs, and record spending on infrastructure and R&D.\nThe Budget prioritises helping working families and vulnerable households with the cost of living, including through a significant tax cut for low-income families by reducing the Universal Credit taper rate from 63 per cent to 55 per cent, a 6.6 per cent increase in the National Living Wage to £9.50 an hour – giving a £1,000 pay rise to 2 million of the lowest paid – lifting pay restraints for public sector workers, a freeze in fuel duty for the twelfth consecutive year, and a freeze in alcohol duty – alongside radical reform to make the system simpler, fairer and healthier.\nBusinesses will also benefit from new measures, including a 50 per cent cut in business rates next year for 90 per cent of retail, hospitality and leisure – alongside a freeze of all rates – the creation of new business rates relief to encourage green technologies and improvements to properties, and a doubling of creative industries tax reliefs for the UK’s world-leading theatres, orchestras, museums and galleries.\nOther measures to drive economic growth include record investment in our roads, railways and broadband; supporting innovation through a record £20 billion spending on R&D; and a huge uplift in skills training through T-levels, Institutes of Technology, and apprenticeships.\nAs part of the three year Spending Review delivered alongside the Budget, total government departmental spending will increase by £150 billion by 2024 – a 3.8 per cent annual real terms increase – the largest real terms increase this century, and record levels of capital investment not seen in 50 years.\nThis funding increase will help to deliver on the Conservative Government’s key manifesto promises, including building 40 new hospitals, recruiting 20,000 police officers, and raising per pupil spending in schools to record levels.\nUnderpinning these measures, the Budget strengthens the country’s public finances and will get debt falling again, following the £400 billion package of support put in place during the pandemic. The new fiscal rules set out today by the Chancellor will require the government to only borrow to invest and get debt falling by 2024, in line with the Conservative Government’s 2019 manifesto commitment.\nAlex Burghart MP has welcomed the Chancellor’s Autumn Budget and Spending Review, which provides the foundations for a stronger economy in every part of the United Kingdom, including the East of England, as the country continues its recovery from the pandemic.\nMeasures that will benefit the East of England include over £411 million for local roads maintenance over the next three years, over £87 million for smaller transport improvement priorities through the Integrated Transport Block, and a share of £24 billion for strategic road upgrades, including the A428 Black Cat to Caxton Gibbet and six A47 dualling and upgrade schemes.\n£87 million will also be delivered for five projects through the first tranche of the Conservative Government’s £4.8 billion Levelling Up Fund – including £19.9 million to upgrade coastal attractions at Southend-on-Sea, £20 million to build a new interactive science lab in Peterborough, £20 million to build over 300 new homes and 2,000 square metres of community space in Luton.\nThe Racehorse Inn in Westhall will also receive £96,600 of funding through the new Community Ownership Fund, helping to protect valued community assets.\nThe Budget also confirmed that five new Community Diagnostic Centres will be built across the East of England in 2021-22, expanding diagnostic capacity across the country whilst targeting investment at areas of deprivation.\nThe East of England will also benefit from a share of the £2.6 billion UK Shared Prosperity Fund – focused on helping people into jobs and supporting businesses across the UK – £560 million funding for the Youth Investment Fund and National Citizen Service, and £5 billion for Project Gigabit, rolling out gigabit capable broadband for homes and businesses across the UK.\nOther nationwide measures that will benefit people in the East of England include a significant tax cut for low-income families by reducing the Universal Credit taper rate from 63 per cent to 55 per cent, a 6.6 per cent increase in the National Living Wage to £9.50 an hour – giving a £1,000 pay rise to 2 million of the lowest paid – increasing pay for public sector workers, and freezes in fuel and alcohol duty.\nCommenting, Alex Burghart MP said:\nThe Autumn Budget and Spending Review will make a real difference to people in our constituency of Brentwood and Ongar, helping working families with the cost of living, supporting businesses with their recovery, and investing in our public services. Today's Budet shows how the Government is delivering on its promise to level up and improve opportunity for people as we build back better.\"\nCommenting, Chancellor of the Exchequer Rishi Sunak said:\nOne year ago, this country was in the grip of the biggest recession in 300 years. Thanks to our Plan For Jobs, we are today recovering faster than our major competitors, more people are in work, and growth is up. But uncertainty in the global economy means that recovery is now under threat.\nThat is why this Budget and Spending Review delivers a stronger economy for people in the East of England – strengthening our public finances, helping working families meet the cost of living, supporting businesses, delivering stronger public services, and driving economic growth.\nThis is a Budget which will level up the East of England. It is a Budget which provides the foundations for a stronger economy.”\nENDS\nNotes to Editors\nKey Budget measures:\nThis Budget helps working families meet the cost of living and supports vulnerable households:\n- Cutting tax for low-income families by reducing the Universal Credit taper rate. To make sure work pays, and to help the lowest-income families in the country, the taper rate will be cut by 8 pence, taking it down from the current 63p to 55p. We are also increasing the Work Allowance by £500; taken together, this is a tax cut for 2 million low-income families worth £2.2 billion next year, or an extra £1,000 in their pocket. And we will introduce this no later than December 1st. This has been advocated by the Resolution Foundation, TUC, Centre for Policy Studies, Joseph Rowntree Foundation and the Centre for Social Justice. As an example, a single mother of two working full-time on the National Living Wage will be better off by around £1,200 a year – while a working couple with two children, both paid the National Living Wage, one working full-time and one part-time, will be better off by £1,800 every year.\n- Increasing the National Living Wage by 6.6 per cent to £9.50. A Conservative government introduced the NLW in 2016. We are implementing the recommendations of the independent Low Pay Commission, raising the pay of 2 million of the lowest paid workers; someone on the NLW will see an annual salary increase of £1,000. We are also increasing public sector pay following a period of more targeted pay.\n- Freezing fuel duty for the twelfth year in a row. Due to rising global oil prices, the average cost of filling up the typical family car has gone up by £3.40 in the last eight weeks alone. Today we are freezing fuel duty for the twelfth year in a row, a £1.5 billion tax cut, meaning the average driver has saved £1,900 since 2010.\n- Radically simplifying alcohol duty to make the system fairer. As a result of leaving the EU, we are now able to reduce the number of alcohol bands from fifteen to just six, based around taxing alcoholic content. We are also introducing a new Small Producer Relief so small cidermakers are incentivised to grow larger. We are cutting the price of English sparkling wine and prosecco by as much as 64 pence, and cutting the tax on draught fruit ciders by 20 per cent. And until this new system is in place, we will freeze all alcohol duties for the third year in a row, including for whisky – a tax cut for families worth £500 million every year.\n- Boosting pubs by cutting beer duty. We are also introducing a new Draught Relief which will apply a new, lower rate of duty on draught beer and cider – cutting duty by 5 per cent, the biggest cut to cider duty since 1923 and the biggest cut to beer duty for 50 years. This will boost British pubs by nearly £100 million a year – and means a permanent cut in the cost of a pint by 3 pence.\n- Creating a new lower rate of Air Passenger Duty for domestic flights within the UK. Currently, flights within and between the four nations of the UK pay the same duties as international flights. From April 2023, flights between airports in England, Scotland, Wales and Northern Ireland will be subject to a new lower rate of APD than international flights, cutting duty by half for 9 million passengers. We will also introduce a new ultra long-haul band for the 5 per cent of passengers travelling the furthest.\n- These build on steps we have already taken to help people with the cost of living. We have already put in place a £500 million Household Support Fund to help vulnerable families across the country this winter.\nThis Budget supports businesses to recover from the pandemic and incentivises them to invest:\n- Cutting business rates by at least 50 per cent next year for 90 per cent of retail, hospitality and leisure businesses – and freezing all rates. Any eligible business – such as pubs, gyms, cinemas, restaurants and hotels – can claim a 50 per cent discount on their bills, up to a maximum of £110,000 per business. Taken together with Small Business Rates Relief, that’s a business tax cut worth £7 billion for over 700,000 eligible businesses – the biggest business rates tax cut in 30 years, and which comes on top of the £16 billion of support we have put in place throughout the pandemic. And we are cancelling next year’s planned increase in the business rates multiplier – a tax cut itself worth £4.6 billion.\n- Creating new business rates reliefs to incentivise improvements and green investment. As called for by business organisations, these reliefs represent a new £750 million tax cut on investment. And to further support investment we are extending the £1 million Annual Investment Allowance for a further 15 months.\n- Reforming the tonnage tax. Previously as a member of the EU, ships could qualify for special treatment in the British tax system while sailing under the flag of another country. Now we have left the EU, our tonnage tax will – for the first time ever – reward companies for adopting the flag of the United Kingdom.\n- Doubling tax reliefs for the creative industries sector. On top of the £850 million we are providing for the creative industries sector over the next five years, we are also extending tax relief for museums and galleries by another two years to the end of March 2024 and doubling the tax reliefs for orchestras, theatres and museums from midnight tonight until April 2024 – a tax cut for culture worth almost £250 million.\n- Widening our generous business rates relief for regional airports across England. In January, we introduced the Airport & Ground Operations Support Scheme (AGOSS) to support English airports with fixed costs such as their business rates. We are today extending this support by a further six months, equivalent to a full business rates holiday for almost all regional airports.\n- A fair corporation tax rate on banks. Financial services are one of our most important industries, employing over 1 million people, two thirds outside London. We are retaining a corporation tax surcharge of 3 per cent, meaning that the overall corporation tax rate on banks will, in 2023, increase from 27 per cent to 28 per cent – higher than the standard 25 per cent paid by others. We are also raising the annual allowance to £100 million to support competition, consumers and challenger banks.\nThis Budget delivers stronger public services and levels up all four corners of the UK:\n- Increasing total departmental spending by £150 billion by 2024: a 3.8 per cent annual real terms increase, the largest real terms increase this century, and record levels of capital investment not seen in 50 years.\nDepartment for Health and Social Care\n- Increasing health spending by 3.9 per cent in real terms over this Parliament – an increase of £41 billion.\n- Largest health capital in a decade – funding 40 new hospitals, 70 hospital upgrades, more operating theatres for catch up, record R&D including for genomics and 100 new community diagnostic centres.\n- Eradicating mental health dorms – replacing over 1,200 beds with more dignified en-suite rooms.\n- Investing over £500 million a year in public health and prevention – providing weight management services and investing in early years support, on top of maintaining the public health grant.\nDepartment for Education\n- Increasing core schools funding by over £4.7 billion – ensuring reals terms per pupil funding rises to record levels, and £200 million to fund annual Holiday Activities and Food programme.\n- Increasing skills funding by 42 per cent in cash terms – meeting our National Skills Fund commitment – across skills bootcamps, traineeships, apprenticeships, more 16-19 hours, Lifetime Skills Guarantee and Multiply.\n- Tripling SEND capital provision to £900 million a year – building additional SEN and also more social care places.\n- Supporting education recovery – through an extra £1.8 billion to extend learning hours for 16–19-year-olds and to help schools support the most disadvantaged pupils, taking total to almost £5 billion.\n- Early Years: £150 million investment in workforce, £170 million more per year for providers, reforms to Children’s Social Care, and £300 million for new Family Hubs and the Start for Life programme.\nHome Office\n- Keeping our country safe – providing £540 million to complete recruitment of 20,000 extra police officers by 2023, alongside cutting crime by more funding for programmes like Safer Streets Fund and County Lines.\n- Delivering the next stage of our points-based immigration system, backed by £628 million, and investing £74 million to replace the Border Force fleet.\nMinistry of Justice\n- £500 million funding for court backlogs, completing modernising courts programme, delivering 20,000 prison places\n- £200 million more annual funding to tackle reoffending, 85 per cent increase in Victims funding, 15 per cent more probation staff.\nDepartment for Levelling Up, Housing and Communities\n- Investing an additional £1.8 billion for building homes – delivering on our £10 billion housing supply commitment and unlocking 1 million new homes this Parliament, focused on brownfield development.\n- Tackling rough sleeping with £640 million a year – an 85 per cent increase compared to 2019-20, to get rough sleeping numbers to the lowest in a decade.\n- Confirming over £5 billion to remove unsafe cladding from the highest-risk buildings.\nDepartment for Work and Pensions\n- Over £1 billion for specialised disability employment support – to enhance opportunities into and within work.\n- £6 billion Plan for Jobs: Work Coaches, Kickstart, Youth Offer, Over 50s offer, In Work Progression.\nDepartment for Transport\n- Investing over £35 billion in rail infrastructure – meeting our commitment to reverse the Beeching closures as well as providing £5.7 billion to keep essential services running.\n- Investing £31 billion in roads across the Parliament – delivering over 60 upgrades and a further pipeline of over 50 local upgrades, including £2.5 billion for roads maintenance outside mayoral areas to fill millions of potholes.\n- Doubling down on Net Zero – meeting our £5 billion commitment for buses, cycling and walking – tripling the size of England’s net zero emission bus fleet – and investing over £1 billion more to decarbonise transport.\n- Providing £5.7 billion for City Region Sustainable Transport Settlements in eight city regions.\nDepartment for Environment, Food and Rural Affairs\n- Ensuring total farm support in England of £2.4 billion, in line with our manifesto commitment, and maintaining farm budgets in Scotland, Wales and Northern Ireland with Bew uplift.\n- Providing £100 million for our UK Seafood Fund to support modernising the industry and sustainable practices.\n- Supporting Net Zero with £125 million more to take Nature for Climate Fund to £725 million (trees/peat), £250 million new funding to halt biodiversity loss, improving access to green spaces including through new Community Forests and funding free food waste collections in every area from 2025.\nDepartment for Business, Energy and Industrial Strategy\n- Providing significant R&D investments of £14.2 billion in 2024-25 – including fully funding association to Horizon Europe, increasing core science budgets, and £1 billion for Innovate UK.\n- Supporting Net Zero with over £15 billion investment – including £3.9 billion to decarbonise buildings.\n- Investing over £1.4 billion in the British Business Bank to support the Start Up Loans scheme and providing £52.5 million for the Regional Angels Programme, and the £1.4 billion Great British Investment Fund.\nDepartment for Culture, Media and Sport\n- Upgrading digital infrastructure – with £1.2 billion for gigabit-capable broadband and an extra £180 million for the Shared Rural Network – as well as ensuring safety online with £110 million for our Online Safety regime.\n- Investing £850 million in culture and heritage and a year of celebration in 2022 – supporting High Streets, renovations of museums/galleries, the 2022 Queen’s Platinum Jubilee and Commonwealth Games in Birmingham.\n- Investing in sport and youth services – with £205 million for grassroots football, £22 million to refurbish more than 4,500 public tennis courts, funding our bid to host the 2030 men’s Football World Cup, Tour de France and Women’s Rugby World Cup and delivering the UEFA Women’s European Championships, and meeting our commitment to a £500 million Youth Investment Fund with 300 new/renovated youth facilities.\nMinistry of Defence\n- In 2020 the MOD received a multi-year settlement providing £24 billion over four years – the largest sustained increase in the Defence budget since the end of the Cold War.\nForeign, Commonwealth and Development Office\n- Investing in global challenges – with £1.4 billion for girls’ education, including our largest ever contribution to the Global Partnership for Education (£430 million), and at least £2.4 billion to tackle climate change.\n- Supporting global health – we will remain one of the biggest donor countries to the WHO and to Gavi by providing at least £3.6 billion, and we will meet our commitment to donate 100 million COVID-19 doses.\nDepartment for International Trade\n- Promoting inward investment in the UK – by expanding of the Office for Investment and the Global Entrepreneur Programme, as well as establishing a new Global Talent Network for science and tech, in places like Boston, Silicon Valley and Bangalore.\n- Investing in export promotion services – by expanding the recently launched Trade and Investment Hubs in Scotland, Wales, Northern Ireland, and the north of England.\nCabinet Office\n- A new single online portal for exports – helping us to seize the opportunities of EU exit by simplifying the exports process for smaller businesses.\n- Funding the Office for Veteran’s Affairs – investing in new treatments for mental and physical health issues.\nThis Budget and Spending Review will help to level up the East of England:\n- Levelling Up Fund: £87 million in total for 5 projects from the first tranche of allocations from the Fund:\n- £19.9 million to upgrade coastal attractions at Southend-on-Sea\n- £20 million to build a new interactive science lab in Peterborough.\n- £20 million to build over 300 new homes and 2,000 square metres of community space in Luton.\n- £6.8 million to upgrade the Clophill Roundabout in Central Bedfordshire.\n- £19.9 million to develop a Community Wellbeing Hub in Houghton Regis.\n- Community Ownership Fund: £96,600 will be allocated to the Racehorse Inn in Westhall from first round of the Fund to protect valued community assets.\nOther announcements for the East of England include:\n- Over £411 million of local roads maintenance funding between 2022-23 and 2024-25 (enough to fill over 5 million potholes over the next 3 years) and over £87 million for smaller transport improvement priorities through the Integrated Transport Block.\n- £39 million of investment for Norwich, including funding for a new mobility hub at Norwich Rail Station through the Transforming Cities Fund.\n- £3.16 million will be allocated towards the regeneration of 2 estates in the East of England from the £14 million estates regeneration share of the Brownfield Land Release Fund: £2.3 million towards the ‘Heart of Greenstead’ regeneration project in Colchester; and almost £860,000 towards the Middlegate Estate in Great Yarmouth.\n- Allocation of share of £70 million Zero Emission Bus Regional Area (ZEBRA) funding to Cambridgeshire & Peterborough to transition around 30 buses for use on five Park & Ride routes across the city.\nThe East of England will also benefit from its share of national programmes:\n- Building 3 Community Diagnostic Centres in the East of England in 2021-22, which expand diagnostic capacity across the country whilst targeting investment at areas of deprivation. We are funding £2.3 billion over the Spending Review period for diagnostics across the country which can increase the number of Community Diagnostic Centres in regions like the East of England over the next three years.\n- Over £2.6 billion for the UK Shared Prosperity Fund over the Spending Review, focused on helping people into jobs and supporting businesses across the UK this includes giving hundreds of thousands of adults the opportunity to develop their numeracy skills though the Adult Numeracy Programme ‘Multiply’.\n- £560 million funding over the Spending Review for the Youth Investment Fund and National Citizen Service.\n- £5 billion for Project Gigabit, rolling out gigabit capable broadband for homes and businesses across the UK.\n- £2.6 billion for local road upgrades over this Parliament including the Great Yarmouth Third Crossing, A140 Long Stratton Bypass in Norfolk as well as the Lake Lothing Third Crossing in Suffolk.\n- £24 billion strategic roads investments including the A428 Black Cat to Caxton Gibbet and six A47 dualling and upgrade schemes."
}