{
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_campaigns_fairer-funding/content_23.html": "Fairer Funding for Cambridgeshire’s GPs\nResidents across Cambridgeshire are finding it increasingly difficult to secure GP appointments when they need them the most.\nFigures reveal that since 2017, funding for GP services in Cambridgeshire has been frozen. Due to an unfair funding formula imposed by central government, our county receives the lowest funding per person in the entire country.\nThe Liberal Democrats are campaigning to change this unfair formula and to secure more investment in primary care, bringing more GPs to Cambridgeshire.\nFairer Funding for Cambridgeshire’s GPs\nPlease sign our petition below to show your support for our campaign for a fairer funding formula for Cambridgeshire.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team_doug-dew/content_34.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_after-the-2024-general-election/content_52.html": "After the 2024 General Election\nAfter the 2024 General Election\nThe General Election saw super results for Liberal Democrats — now with 72 MPs, including three from Cambridgeshire: Ian Sollom in St Neots and Mid Cambs, Pippa Heylings in South Cambs and Charlotte Cane in Ely and East Cambs.\nSadly, we weren’t successful in Huntingdon. Locally Liberal Democrats have done well in recent elections — not least winning the last three council by elections in Huntingdonshire — but the tactical voting web sites were suggesting people instead vote Labour and there was a big jump in the Labour vote. Ben Obese-Jecty, the Conservative candidate won, though with majority decimated.\nLiberal Democrats are deeply committed to local government. Nationally we seek power to give much of it away to local government, arguing that decisions are best made as close as possible to the people affected to them. We have a super group of County, District and Town councillors, and are looking forward to the good work they’ve been doing leading to the election of more councillors in the local elections in 2025 and 2026.\nCambridgeshire is changing. In 2014, when Boris Johnson was looking for a safe Conservative seat in order to make a return to parliament, one of the ones he looked at was South Cambs. Now it has a Liberal Democrat-run District Council and a Liberal Democrat MP.\nI was introduced to Huntingdon constituency in 2019 and have stayed involved since then. It was a great delight to be at the count when the Tories lost control of Huntingdon District Council on 2022, celebrating with our successful candidates and commiserating with the few others. We were out at the Godmanchester Gala two days after the General Election and I’m looking forward to working with our Liberal Democrat councillors and council candidates over the coming years, looking forward to Liberal Democrats taking control of Hunts District Council in 2026 and sending an MP for Huntingdon to Westminster in the next General Election.\nSee Mark Argent's video, recorded at the Huntingdon Councillors' surgery on 27 July",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_page-9/content_29.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nCllr Nathan Hunt took to the Great Ouse to help clean the river and call for greater infrastructure investments from water companies\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nLib Dem parliamentary candidate for St Neots and Mid Cambridgeshire, Ian Sollom, has joined calls for revised proposals from the Greater Cambridge Partnership (GCP) for congestion charging in Cambridge to be scrapped\nThe Lib Dems have announced their candidate for the new constituency of St Neots and Mid Cambridgeshire, former South Cambridgeshire District Councillor and now St Neots resident, Ian Sollom\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team_graham-wilson/content_37.html": "Cllr Graham Wilson\nExperienced Cambridgeshire County Councillor (CCC)\n- Experienced, long-serving councillor for Godmanchester and Huntingdon South\n- Lived in the area for more than 36 years with my wife, and two children who have now left home\n- First elected to CCC in 2009 having served as Godmanchester Town Mayor (non-party political role)\n- Retired chartered engineer worked in private and public sectors for over 40 years\n- Active community champion working with residents to solve problems\n- Challenging chair of CCC Audit and Accounts Committee, with strong links to internal and external auditors\n- Former member of Adults and Health Committee, working to improve CCC and NHS services in Cambridgeshire\n- CCC appointed councillor on Cambridgeshire and Peterborough Audit and Governance Committee, Greater Cambridge Partnership Assembly and Great Ouse Regional Flood and Coastal Committee",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-11/content_66.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nThe Liberal Democrats are committed to supporting British farming to continue safeguarding our environment and producing the high quality food we all want for generations to come.\nWe cannot let the Conservatives make the people who can least afford it pay for their mistakes and economic chaos.\nLiberal Democrats have a positive plan to fix bus, tram and rail services - allowing people to access services, boosting local economies and protecting our environment.\nAlex Cole-Hamilton makes his keynote address to Autumn Conference 2023.\nDaisy Cooper delivers her Autumn Conference Keynote Speech.\nEveryone deserves to feel safe in their own homes and walking down their own streets. For too many people in the UK, however, that is simply not the reality today.\nThat is the fair deal the Liberal Democrats are fighting for.\nWhy we need to see more Liberal Democrats ready to serve in London and across the UK.\nIt's time for a new era in education: one where every child's potential is nurtured and celebrated. The Liberal Democrats are committed to creating a fair and equitable education system that truly invests in our children's future.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team_geoff-seeff/content_31.html": "Cllr Geoff Seeff\nCllr Dr Geoffrey Seeff, or Geoff as he prefers to be called, is a Chartered Accountant/management consultant with a doctorate in the field of Corporate Social Responsibility.\nFor most of a long professional career, which included a secondment to CLG serving as Head of Grants Appraisal and a period as Deputy Chairman of the Finance and Management Faculty of the ICAEW, he specialised in the economics of urban regeneration and has advised UK and overseas government agencies, local authorities, private sector developers and funders and has helped deliver many successful major projects.\nGeoff was one of the founder convenors of the SDP and has been a passionate and active member of the Liberal Democrats, participating in several national policy working groups and standing, albeit unsuccessfully, as a parliamentary candidate in every general election, except the last, since 1997. He was elected as the County Councillor for St Neots Eatons Division in a by-election in February 2023 since which time, apart from taking up the concerns of residents and participating in the Council’s proceedings, he sits on the Adults and Health Committee, the Communities, Social Mobility and Inclusion Committee and, given his background, the Audit and Accounts Committee.\nHe recently brought a motion to full Council requiring the provision of written information on allergens contained in the ingredients of foods served in restaurants and other outlets and which was passed without dissent.\nGeoff is married to Deanna, a psychotherapist, and they have two daughters and four grandchildren, which occupies a major part of their lives. Geoff tries to keep fit and swims regularly. He is also a very enthusiastic if less than virtuoso jazz violinist and saxophonist and, on the few occasions he is able to break away from his various commitments, he can be found jamming away with like-minded souls at one of several Cambridge watering holes.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-7/content_51.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nLet us commit to building a future where every child feels safe, supported, and valued in our schools.\nLiberal Democrats are leading the charge to clean up our rivers, lakes and coastlines. It's time to put an end to sewage dumping, protect our precious waterways, and ensure a sustainable water system for generations to come.\nLiberal Democrats are unwavering in our commitment to liberal values and international cooperation. We believe in a United Kingdom that stands tall on the world stage, promoting peace, security, and democracy.\nLiberal Democrats have passed new policy with a comprehensive plan aimed at boosting cancer survival rates and improving the quality of life for patients and their families.\nThe Government is missing an open goal by failing to protect more of the treasured sporting events which bring people together. Liberal Democrats will give sport back to the people.\nToday marks International Women's Day—a moment to honour women's achievements, acknowledge their invaluable contributions, and reflect on the journey towards gender equality that still lies ahead.\nReflecting on the year’s International Women’s Day theme of “invest in women”, I am sadly reminded of how much further we still need to go.\nLiberal Democrats will continue to stand up for international law and for a lasting peace.\nTomorrow, my bill to ban conversion therapy will be debated in the House of Lords.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-21/content_56.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nLiberal Democrats will stand up for carers, so we can provide their children with a better start in life, no matter their background.\nWe have made incredible strides when it comes to protecting the fundamental human rights of those with LGBT+ identities, but we still have so much work to do.\nRichard Foord has pulled off a spectacular victory.\nOur carers deserve so much better than this. They deserve to be supported, not penalised. That’s why Liberal Democrats are campaigning to increase the Carer’s Allowance by £1000 each year.\nHer service; her sense of selflessness; her steadfast commitment to the nation. These values and her service have defined Her Majesty’s seven decade reign, and will continue to define her.\nRichard is an incredible candidate, whose dedication to others has shone not only through his career, but also in his voluntary roles in the community.\nScrapping the Protocol would represent a new low. It would be an egregious breach of international law.\nThe anticipated Somerton and Frome election will be a close two horse race between the Lib Dems and the Conservatives.\nLiberal Democrats are winning and growing stronger in England, Scotland and Wales.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_about/content_41.html": "Our Local Party\nWe’re fighting for our area all year round - not just election time.\nThe Huntingdon Liberal Democrats are the local party for the whole of Huntingdon constituency and some parts of the North West Cambridgeshire constituency - reaching from Yaxley to the Offords, and including the market towns of Huntingdon and St Ives.\nWe have a brilliant team of councillors and campaigners fighting for their local areas - on local issues like road maintenance and social housing, and wider issues like the environment, social care, and wider liberal values.\nHuntingdon Political History\nHuntingdon's most famous MP was Oliver Cromwell. Between 1983 and 2001 John Major was MP, serving as Foreign Secretary, Chancellor of the Exchequer and Prime Minister 1990-1997. In 1992 John Major achieved 66% of the vote, but things have been changing. Following the elections to the European Parliament in 2019 Liberal Democrats were polling over 20% and in that year's General Election we achieved a near-doubling of our vote for the Huntingdon parliamentary seat.\nIn the 2024 General Election, we managed to win the new neighbouring constituency of St Neots and Mid Cambridgeshire - marking the first time that anywhere in the historic county of Huntingdonshire has been represented by a Liberal Democrat Member of Parliament.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-13/content_70.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nThe armed forces community - service personnel, their families and veterans - deserve a fair deal. For too long, they have been taken for granted by this Conservative Government.\nSlavery, in all its forms, is an affront to the fundamental British principle of individual liberty. No human being should ever be enslaved.\nThe Liberal Democrats have become the first UK party to commit to protecting the triple lock on pensions in the next Parliament.\nWe’re heading to Bournemouth for the party’s first in-person autumn conference in four years. As ever, the agenda is packed full of topical debates on the biggest issues facing Britain today.\nHundreds of NHS ambulance staff across the country are waiting to complete essential driver training, new data from the Liberal Democrats has shown. This is despite dangerous delays to response times and a shortage of ambulance drivers.\nFood prices have soared by 30% in the last two years, the biggest rise on record.\nLiberal Democrats demand water firms measure how much sewage they are discharging into waterways\nA Freedom of Information investigation by the Liberal Democrats has found hospitals with chemicals leaking in patient areas and others with multiple broken fire alarms.\nSarah Dyke smashes the Conservatives with the best result of the night in Somerton and Frome",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_andrew-wood-wins-yaxley-by-election/content_50.html": "Lib Dem Andrew Wood wins Yaxley and Farcet by-election\nOn the 21st March, Lib Dem Local Champion Andrew Wood won the county council by-election in Yaxley and Farcet - making the Liberal Democrats the largest group on Cambridgeshire County Council.\nThe Conservative and Labour vote shares were almost havled - showing the Lib Dems are best placed to beat the Tories across Cambridgeshire.\nNew County Councillor, Andrew Wood said:\n\"I moved to Yaxley in 1997 and feel incredibly fortunate to call this area my home.\nMy first sizeable public activity was my involvement in the initial Yaxley Festival in 2013, which brought a wonderful sense of community to the village and which I was very proud to play my part as Secretary of the event, working with an inspiring team of people.\nIt was my strong desire to give back to the community that led me to join Yaxley Parish Council in 2012, eventually becoming vice chairman of the council in 2023. My experience as a parish councillor means that I have a unique understanding of the issues facing our communities and that I have a strong record of getting things done for our area.\nHowever, my time as a parish councillor has also made it clear to me that we are often overlooked and neglected by the Conservatives, who for too long have taken our votes for granted here. This isn’t good enough; I’m glad to be our newest County Councillor so that I can do things differently to how the Conservatives have in the past.\nI passionately believe that being accountable and visible in the community is essential for any County Councillor. Unlike others, I will not vanish after election time; you will hear from me all year round and always have the chance to make your voice heard or to hold me to account.\nThe County Division of Yaxley and Farcet has a great history and a distinct character. One of my top priorities will be to make sure that we have a strong, local, independent voice that will speak up for our needs, and protect the unique character of our villages. We cannot allow more and more housebuilding without action to prevent flooding and proper protection of our green spaces.\nIt is due to the area’s rich history, that I am passionate about the retention of the its character, from the Napoleonic connections of Norman Cross to the many historic elements of Yaxley and Farcet. We have a lot to be proud of and should not allow our history to be lost.\nGreat Haddon\nWhilst many new housing developments are welcomed, the increasing size of Peterborough is beginning to encroach on Norman Cross, Yaxley and Farcet. All developments should be managed responsibly, whilst respecting the individuality of local villages. I am keen to encourage the retention of green space between the borders of our villages and surrounding developments and the retention of their character.\nOn behalf of Yaxley Parish Council, I have been liaising with our local MP. Peterborough City Council, Cambridgeshire County Council, Middle Level Commissioners (the local drainage authority) and the developers, to control the recent significant increase in surface drainage into Yaxley. This has increased the amount of flooding in the area over recent months and is beyond the capacity of the original watercourse.\"",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team_dave-shaw/content_14.html": "Cllr Dave Shaw\nDave Shaw has been a District Councillor for Brampton since May 2022.\nHe has lived in Huntingdonshire his whole life. He moved from Buckden to Brampton over 30 years ago at the age of 11, where he attended Hinchingbrooke School and got his first job in retail shortly after leaving.\nHe has worked in security, tech support and in 2006 started work at Brampton Post Office where he became Postmaster and, in that capacity, has been serving the people of Brampton and surrounding area for over 16 years.\nOutside of work and politics, Dave is very practical and enjoys DIY. He also enjoys weekends away in his caravan, being outdoors, listening to music and doing fun activities with his two daughters.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_successful-summer-bbq/content_47.html": "Successful Summer BBQ\nThe sun shone on our Summer BBQ this year, we all gathered to relax and celebrate the wins that Huntingdonshire have had over the last year.\nGeoff Seeff was successfully elected in the county council by-election in the Eatons (St.Neots). Geoff has been busy representing his residents whilst sitting on the Audit and Accounts committee, Adult and Health Committee along with the Social Inclusion and Mobility Committee.\nIn a hard fought campaign in Yaxley and Farcet our local candidate Andrew Wood won the county council by-election in March penetrating the Blue wall in the north of Huntingdonshire.\nThe next By-Election arrived only a few weeks later and our team successfully got back on the campaigning trail winning the District seat of Great Paxton with our local candidate James Catmur.\nOur campaigning ramped up again in June for the July General Election which saw an amazing 72 Liberal Democrat MPs voted into Parliament, one of which is our own Ian Sollom to the newly formed St.Neots and Mid Cambridgeshire Seat.\nIan Sollom MP shared his experience of his first week in Parliament and talked about the atmosphere in the corridors of Westminster.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team_nathan-hunt/content_10.html": "Cllr Nathan Hunt\nNathan is a District Councillor for Huntingdon East, and a Vice Chair of the Overview and Scrutiny Panel for Environment, Communities, and Partnerships. He scrutinises Council policy and performance to ensure the council is being effective, and as a ward Councillor, stands up for his residents to make sure the Council is working for them.\nAlongside Jo, he has led efforts to improve Huntingdon’s Riverside Park, successfully getting footpaths cleared, and calling for more investment in facilities.\nOutside of politics, Nathan works in energy, decarbonising Britain's electricity. He also enjoys retro games, and can often be found in the gym.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_can-ancient-festivals-inspire-a-more-inclusive-future/content_58.html": "Can Ancient Festivals Inspire a More Inclusive Future?\nIn an age where political and cultural divides often take centre stage, Padstow, a charming coastal town in Cornwall, offers a breath of fresh air with its annual 'Obby 'Oss Festival. As a vibrant celebration of community, history, and tradition, the not-for-profit festival transcends these divisions, providing a blueprint for integrating local customs into modern society.\nThe 'Obby 'Oss Festival dates back centuries, with its first documented mention in 1803. Its origins remain shrouded in mystery, though it may be connected to the ancient Celtic festival of Beltane or Germanic celebrations during Þrimilci-mōnaþ. Regardless of its beginnings, the festival remains an integral part of Padstow's cultural identity.\nCentral to the event are the Old 'Oss and Blue Ribbon 'Oss teams, each representing different sections of the town. Participants don white outfits adorned with their respective team's colours and engage in processions featuring the 'Obby 'Oss – a hobby horse constructed from an oval frame draped in black oilskin with a small horse's head attached. The Old 'Oss, or Red 'Oss, is tied to the Golden Lion Inn, while the Blue Ribbon 'Oss has historical links to the Temperance movement. To join the processions, individuals must have family roots in Padstow, emphasizing the importance of local heritage.\nMusic and dance also play a significant role in the festivities, with accordions, melodeons, and drums providing the soundtrack for the 'May Song' which echoes through the streets to sing in the month of May:\n\"Unite and unite and let us all unite,\nFor Summer is a come unto day,\nAnd wither we are going we will all unite,\nIn the merry morning of May.\"\nAt its core, the festival celebrates friendly competition between the Old 'Oss and Blue Ribbon 'Oss teams, fostering a sense of unity and shared identity. This spirit of cooperation not only strengthens bonds within the community but also promotes a more inclusive and diverse society.\nThe benefits extend beyond fostering social cohesion. Padstow's local economy experiences a boost from increased tourism, as visitors from around the UK and abroad flock to witness this unique spectacle. Local businesses, including hotels, restaurants, and shops, benefit from the influx of patrons.\nIt offers valuable lessons for modern society. As people become more disconnected from their roots, the festival provides a model for how communities can use folk traditions to promote social unity and celebrate their shared cultural heritage. This sense of belonging can inspire individuals to take pride in their local customs, creating an environment where diversity is embraced and valued.\nIn a world where liberalism is often associated with individualism and globalization, the 'Obby 'Oss Festival provides a refreshing counterpoint. It demonstrates how deeply rooted traditions can coexist with modern values, fostering a sense of community across all ages and shared identity without sacrificing the principles of openness and inclusivity.\nAs communities around the world seek ways to address the challenges of contemporary society, they can look to Padstow for inspiration. By promoting a spirit of cooperation and shared heritage, local traditions can become powerful tools for fostering social cohesion and bridging the gap between the past and the present.\nSt Ives in Cambridgeshire, with its rich history and notable figures including Oliver Cromwell and Sir Clive Sinclair, could serve as the ideal venue for a modern folk festival. A new \"Digital Festival\" could be centred around a milestone in the town's history the collective endeavour leading to the creation of the Sinclair Executive Calculator. This innovation marked a significant turning point, bringing advanced technology within reach of the everyday person.\nThe festival would serve as a lively commemoration of this pivotal moment in technology. Designed to have a broad appeal that spans multiple generations, it would honour our shared heritage. Harnessing the power of nostalgia, it aims to attract local, national, and international attention. In addition, it would stimulate extensive media coverage and academic interest, while securing sponsorships that contribute to its sustainability and growth.\nWith these elements in place, St Ives could play host to a festival that not only appreciates its historical significance but also unites people in a celebration of innovation and shared heritage. Much like Padstow's 'Obby 'Oss Festival, this modern festival could create a synergistic blend of tradition and modernity, crafting an inclusive space that honours the past while eagerly embracing the future.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_improvements-announced-to-the-huntingdon-ring-road/content_53.html": "Improvements announced to the Huntingdon Ring Road\nCambridgeshire County Council have announced safety improvements to the Huntingdon Ring Road, following calls for improvements.\nThe short term changes include improvements to signage to remove areas where there are currently gaps and updated cycling maps on the County Council's website and in libraries. \"End of Route\" signs have already been installed on Ambury Road.\nLong term, options to upgrade sections of the Ring Road to improve walking and cycling provision are being explored (as part of the Cambridgeshire Walking and Cycling Infrastructure plan). Options to improve walking and cycling provision across the whole Ring Road and wider area are being explored as part of the Active Travel Strategy and Huntingdonshire Transport Strategy.\nNathan Hunt (Lib Dem District Councillor for Huntingdon East), who has been campaigning for improvements said: \"This announcement is great to see. The County Council and its leadership have been listening and they're showing a real will to sort these issues out. Improved signage is a good start and addresses one of the main issues, and I look forward to working with the Council Council to explore more of the long term options as well\".",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_lib-dem-councillors-call-for-safety-improvements-on-the-huntingdon-ring-road/content_57.html": "Lib Dem Councillors call for safety improvements to the Huntingdon Ring Road\nHuntingdon East District Councillors Nathan Hunt and Jo Harvey have called safety improvements to the Huntingdon Ring Road and the footpaths around it.\nFollowing a tragic incident in 2020, Nathan and Jo have been calling for upgrades to protect vulnerable pedestrians and cyclists and to ensure a similar incident can never happen again.\nThey organised a site visit, which was attended by Dr Nik Johnson (Mayor of the Cambridgeshire and Peterborough Combined Authority), Cllr Lucy Nethsingha (Lib Dem Leader of Cambridgeshire County Council) and Cllr Graham Wilson (Lib Dem County Councillor for Godmanchester and Huntingdon South), so they could see the issues with the current situation.\nNathan said: \"It's been great to raise awareness of these issues and talk about possible solutions to help prevent another tragedy. I'm really grateful to Nik, Lucy and Graham for taking the time to visit and see the problems first hand and have a positive chat about what we can do to fix these problems.\"",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-10/content_68.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nHear from Councillor Lisa Smart, Liberal Democrat Candidate for Hazel Grove.\nLiberal Democrats are calling for meaningful action to reverse the decline in our natural environment.\nAll children deserve to be properly supported by their parents. Child maintenance payments are vital for the well-being of children. Liberal Democrats will keep campaigning to reform the Child Maintenance Service so it works for children.\nWe will continue to protect the rights of vulnerable people in the UK and around the world against these deplorable Conservative attacks.\nIn her speech, Wendy called for taxpayer-funded handouts for disgraced former ministers to be scrapped, as analysis reveals £530,000 was paid out in ministerial severance payments over the past year.\nThe Liberal Democrats are steadfast in our commitment to supporting Ukraine, isolating Russia, and upholding the values of justice and accountability. We stand with President Zelensky and the Ukrainian people.\nKira Rudik addresses Liberal Democrat Autumn Conference 2023.\nThe Liberal Democrats will create a fair deal for housing. Taking on the big developers, delivering new homes, improving renters’ rights and protecting our environment - together we can tackle the housing crisis.\nBeing able to vote is a fundamental democratic right. Yet thanks to the Conservatives, it’s now at risk.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_volunteer/content_24.html": "Become a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-8/content_61.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nMunira Wilson MP has brought a bill before the House of Commons today, aimed at ensuring every school has a qualified mental health professional.\nLiberal Democrat Leader Ed Davey has unveiled a new ‘Tory Removal Service’ campaign poster, as he announces a new plan to force a General Election and stop Rishi Sunak clinging on to power.\nEd Davey rings in election year with powerful call to “transform the nature of British politics for good”\nEd Davey's Christmas Message 2023\nWe need politicians who genuinely care – ready to put in the graft and capable of taking the political initiative. No-one can possibly still believe the UK’s Conservatives are up to this. I am completely convinced the Liberal Democrats are.\nAs the warmth and glow of the candles grow each evening, I hope it may serve as a reminder that even in the darkness, there is hope. Hope for a brighter tomorrow.\nAlmost 2,000 water users reported being ill last year afters swimming and surfing - nearly triple the number on previous years\nBoris Johnson was never fit to be Prime Minister. He should reap no benefits, in money or in honours, for the disgraceful way he behaved in office.\nThe government’s failure to meet this target is putting people’s lives at risk.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-19/content_49.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nA dedicated cross-departmental Minister for Rural Communities would help end the Conservatives’ neglect of rural areas.\nCampaigning for fair votes has been part of the Liberal Democrat mission ever since we were founded. Last night, Ed Davey made a speech at the IPPR think tank about why it’s time has come - and how to make it happen.\nToday is Carers Rights Day - a chance for us to keep beating the drum for unpaid carers and raising awareness about their rights.\nEveryone is being forced to pay the price for Conservative chaos.\nFar too many people are struggling to get a GP appointment when they need one, leaving them waiting anxiously for the care they deserve.\nThe sheer quantity of raw sewage being dumped into Britain’s rivers and coastal areas is a scandal and a disgrace.\nThanks to the Conservatives’ disastrous mini-budget, we are facing a mortgage crisis.\nToday, Liberal Democrats in the House of Lords have strongly opposed the Government’s draconian Public Order Bill.\nWe do not need another Conservative Prime Minister lurching from crisis to crisis, we need a general election.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team/content_3.html": "Meet the Huntingdon team\nWe have a great team of elected councillors and members. Find out about them here.\nHuntingdon and Godmanchester\nBrampton\nHemingford Grey and Houghton\nCllr Doug Dew\nCounty Councillor for The Hemingfords & Fenstanton and District Councillor for Hemingford Grey & Houghton\nView\nSt Ives\nYaxley and Farcet",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-6/content_46.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nFamilies who remortgaged in 2023 are facing a mortgage bombshell of almost £9bn this year, with commuter belt areas in the Blue Wall hardest hit, new analysis commissioned by the Liberal Democrats has revealed.\nFor the first time since 1996 the Liberal Democrats won more seats than the Conservatives in the Local Elections.\nEd Davey has said Rishi Sunak is living in a “parallel universe,” after today’s figures reveal NHS targets are being missed\nTen years ago today, the UK’s first same-sex marriages took place.\nLiberal Democrat Leader rallies his party ahead of this year's General Election.\nIt's time for change. We cannot sit idly by as our local services crumble. Liberal Democrats will always stand up for a fair deal for communities.\nLet's focus on what truly works: tackling the backlog, creating safe routes, and upholding our commitment to human rights. As Liberal Democrats, we will continue to fight for a fairer and more compassionate asylum system.\nNavalny cast a light on the corruption of Putin and his cronies. His tragic death, at the hands of Putin, cannot and will not stifle the democratic ideals that he fought for. Together, let us be a voice that speaks for those who have been silenced.\nWe urgently need to implement our plan to fix our crumbling NHS hospitals. Without it, more patients will suffer unnecessarily at the hands of this Conservative government’s neglect of our health service.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_ed-davey-visits-hunts-to-help-turf-out-the-tories/content_6.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Sir Ed Davey has visited Huntingdon constituency to support local candidates who aim to “turf out the Tories” across the area.\nEd helped plant a new wildflower bed in Offord D’Arcy with candidates and councillors, in the division which local champion and current parish councillor Liam Beckett hopes to gain from the Conservatives.\nWhile visiting and speaking to local media, Ed highlighted the Conservative Party’s record in government, slashing funding for road maintenance and social care.\nHe also highlighted concern about the current Labour government’s National Insurance hikes, which are hitting working people across Cambridgeshire.\nSpeaking to the Hunts Post, Davey said that the Lib Dems “have a real chance of winning majority control” on Cambs County Council, and later commenting that the area is fertile ground for the party.\nSpeaking on the wider political picture, Ed highlighted that the Liberal Democrats are the only party calling for the UK to stand up to Donald Trump’s damaging and reckless tariffs.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team_brett-mickelburgh/content_13.html": "Cllr Brett Mickelburgh\nBrett Mickelburgh has been a District Councillor for Godmanchester, Hemingford Abbotts and the Offords since May 2022. He serves as the Executive Councillor Finance and Resources.\nHe works as the Chief Technology Officer for a not-for-profit organisation best described as a “charity services charity”. He has also spent four years in management consultancy and has worked across many business sectors including healthcare, finance, as well as at a utility company and two government departments. He has two children with his wife and fellow Councillor Debbie.\nOutside of politics, Brett is a FA level six qualified referee who can be found officiating for the Hunts Youth League, Cambridgeshire County League and Women’s National League. He does this to put time back into a sport he loves, because he couldn’t have played if someone hadn’t done the same for himself.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_state-of-huntingdonshire-district-council/content_45.html": "State of Huntingdonshire District Council\nA year ago I stood before you as the new Executive Leader of the Joint Administration for Huntingdonshire District Council.\nTwelve months on, and I am pleased to be able to update you on all that has been achieved in that time, which has seen us record better delivery and progress on our critical actions compared to the previous year.\nBut I want to start by placing on record my sincere thanks to the officers and Members who have supported everything achieved over the last year.\nWe committed that we would:\n- work in cooperation towards a greener, fairer Huntingdonshire\n- commend the excellent work undertaken by council staff\n- set a new strategic direction for the council.\nThe Joint Administration's key objectives over the last year would focus on the following:\n- Tackling climate change and caring for the environment\n- Enhancing employment opportunities and supporting businesses\n- Supporting the needs of residents\n- Improving the housing situation\n- Strengthening our communities.\nAs I said last year, our ability to deliver these priorities would greatly depend upon the district's finances.\nWe inherited an £8 million structural deficit with no plan to address it. We inherited low reserves as the 'rainy day' they were reserved for arrived and stayed. The reserves look healthy until you realise they are either capital or ring-fenced reserves, which we cannot use to offset a budget deficit on our day-to-day expenditure.\nHence, our first challenge as a new administration was to get underneath those financial figures and understand the detail and not just what they meant for this year, but the years ahead because knowing the financial position underpins our operational and strategic decision–making. We know that over the next four years, we need to find ways to save money or generate income to combat rising costs, inflation and cuts in government grants.\nWe have not shied away from the fact that there would need to be some tough decisions that we have had to take, and this continues to be the case. Council's agreement on the budget principles gave a clear steer about how we should prioritise our thinking in making the savings needed.\nWe agreed that we would:\n- protect front-line services to our most vulnerable people to avoid individuals or families falling into crisis through our continued approaches built on prevention and early intervention\n- deliver a balanced budget, using our savings in the short term to insulate the residents of Huntingdonshire from service cuts due to global market issues\n- balance the need for fees, charges and tax increases with the demands on our services, our community's ability to pay and central government certainty over funding\n- look to make further pushes towards a more efficient council, maximising the use of technology and ensuring returns on investments where the council uses its own money\n- pause commercial investment activity in the short term whilst the market instability continues, but we will consider other options\n- have regard for the things that the community tell us are important in setting out our budget proposals.\nAs we have tried to support our residents through these times as best we can, we have also made commitments to support our staff by:\n- funding a 4% pay award\n- use of a windfall to make a one-off payment of £1,000 to permanent and contracted members in recognition of the cost-of-living crisis\n- introducing the Vivup - a benefits scheme which over 400 employees have signed up for to make regular savings on things such as their weekly shop\n- being open and transparent with staff about the resources we have\n- committing to co-produce a workforce strategy that addresses all staff recruitment, retention and reward.\nSo how have we done against the five objectives we set last year?\nTackling climate change and caring for the environment\nWe recognised that Huntingdonshire must proactively tackle the climate crisis and ecological emergency.\nWe acted upon this by agreeing on a Cost of Living and Climate Change motion on 12 October 2022, which recognised that the current cost of living and climate crises require joint attention to support the well-being of residents and businesses.\nA Climate Crisis and Ecological Emergency was formally recognised at the Full Council meeting in February 2023, with the council's Climate Strategy and associated Action Plan also adopted. The strategy and action plan, developed throughout 2022, was drafted alongside service leads following councillor and stakeholder engagement last summer, along with a meeting with Anglia Ruskin University to involve young adults.\nThe Climate Strategy and Action Plan sets out how we will apply a 'green lens' to all our decision-making - embedding the climate and green agenda into all our policy-making and considering environmental impacts and opportunities to improve the environment. Doing so provides positive examples for businesses, residents, and our peer local authorities, as we encourage them to follow our lead and do what they can to reduce their environmental impact.\nWe are doing more on the ground to protect and increase biodiversity within our parks and open spaces. Recently this has seen the promotion of our alternative land management initiative, which has seen us work with Town and Parish councils to identify 231 individual plots that are currently the most suitable areas within the district to change the way we manage them to enable more plants, insects, birds and mammals to flourish.\nThrough our partnership with Groundworks, we have supported the Green Recovery Project, which sees job-seekers work as part of a small team and develop their skills in conservation, grounds maintenance and practical horticulture whilst creating new habitats and improving biodiversity.\nEnhancing employment opportunities and supporting businesses\nTo enhance employment opportunities and support businesses, we have looked to promote Huntingdonshire as a location for investment in high-tech, highly-skilled and green economic opportunities and jobs.\nThis has seen us launch the new 'Invest in Huntingdonshire' website and 'Made in Huntingdonshire' campaign to establish an inward investment baseline. We are now working with partners to promote business support, business start-up programmes, and grant schemes as part of the UK Shared Prosperity initiative.\nWe also continue to work with partners to support the provision of career advice and technical and vocational learning, including apprenticeships and boosting our English as a Second Language provision in our district. Our Economic Development Team has been focussing on ensuring businesses participate in the Local Skills Implementation consultation for future provision.\nSupporting the provision of high-speed broadband and mobile phone coverage across the district is necessary, and we have worked with Connected Cambridgeshire to continue improving connectivity across the community.\nSupporting the needs of residents\nA year ago, we stated our commitment to ensuring that Huntingdonshire residents have the highest possible quality of life and the role that good employment, health and social connection play within that. This came at a time when residents faced a growing affordability challenge, which sadly continues today.\nHowever, at the end of March 2023, Housing Benefit of £24.7m and Council Tax Support of £7.3m had been paid to help with rental and Council Tax costs, respectively. A further £230k had been paid to assist with rental costs via Discretionary Housing Payments. This is higher than the £212k we reported for 2021/22 due to more government funding being allocated.\nIn addition to our support through housing benefits and council tax support, our work over the last year has also seen us support the Energy Bills Rebate Scheme, which closed at the end of November with circa £9.5m paid to over 61,000 households in the district to assist with the rise in utility bills.\nThe Resident Advice and Information Team helped residents in need to secure a total of £78,534 in vouchers from the Household Support Fund, more than double the £35,860 awarded in the previous year.\nOur One Leisure teams continue to offer services that support people’s physical and mental health. Last year, we had 1,299,902 One Leisure admissions and around 48,500 attendances at our Lifestyles programmes last year.\nThe efforts of our One Leisure Direct Team to support the Concessionary Membership Scheme have seen an 88% increase in demand following the inclusion of a flyer in the annual Council Tax billing mailout. The scheme allows individuals who meet the eligibility criteria to access One Leisure Facilities at a discounted rate at certain times. Over 1,000 individuals now benefit from this scheme, many of whom had never used the facilities.\nImproving the housing situation\nAs we look to improve the housing situation across the district, we said we would update the Local Plan and other relevant policies. This hefty work got underway at the start of this year, and several consultations with residents, businesses and other stakeholders have already taken place, including for the Call for Sites and Issues Papers.\nWhile developing a new Local Plan will go on over many years, this last year, we have seen 456 new affordable homes delivered. This exceeds the number recorded in 2021/22 (311) and is the highest number reported for this measure in the last ten years. The previous maximum was 440 delivered in 2019/20.\nOur Resident Advice and Housing teams have continued to support people who have fallen on hard times, prevented 459 people from becoming homeless, and helped 751 households become housed through the housing register.\nWe have also seen two Community Infrastructure Levy funding rounds held this financial year. A total of £7,215,929.20 was allocated through the funding rounds, including £750,000 to support the new headquarters of MAGPAS at Alconbury Weald.\nStrengthening our communities\nTo strengthen our communities, we have worked with accredited community organisations to ensure our services fulfil local needs and are delivered in the way that best builds community and resident capacity.\nOur Health Inequalities project, which saw us receive £250,000 from the Integrated Care System, has looked to boost physical activity in the least active groups by working with the community organisations that lead and commission specific projects for their communities. This project has been critical in our longer-term response recognising the link between physical health and income, and the connection between physical activity and mental health, a crucial barrier to employment and skills for some in our communities.\nFrom strength and balance to yoga, art socials, activity days and after-school clubs - not forgetting the hobby hubs and men's sheds. We have funded 55 new community-based prevention activities with over 1,000 attendances.\nOver the coming year, we will build upon this community engagement model as we progress our 2023/2024 project, which will generate evidence-based interventions for those at risk of frailty and cardiovascular disease.\nWe have also partnered to provide more excellent leisure and health opportunities to enable more people to be more active more often. In addition to the stellar increase in concessionary One Leisure memberships, we have worked with at least 75 organisations throughout 2022/23 across sports and physical activity. Our work this year has also seen St Neots Primary Care Network commission services from Active Lifestyles for the first time. Many of the Recognised Organisations funded through the Health Inequalities project have commissioned both the sports and health teams to deliver work requested by their communities in their consultations.\nIn recognition of the impacts of the cost-of-living crisis on some residents, the Community Chest fund launched an application process for Warm Hubs in October 2022. Applications were welcomed from voluntary and community groups and town and parish councils who wished to provide a safe, warm space to residents across the district who may have been struggling to afford to stay warm at home. In total, £7,170 was awarded to warm spaces applicants between October and March.\nWe have also supported those Ukrainian refugees who have moved to the district through the Homes for Ukraine scheme. With fewer people arriving from Ukraine, our attention has turned to helping these guests move into their own privately rented accommodation. We have appointed a housing officer to support hosts and guests and help ensure that suitable and affordable properties can be found.\nOur work to strengthen communities has also seen us enable and support community planning by advising towns and parish councils seeking to develop or update Neighbourhood Plans. The Great Gransden Neighbourhood Plan was made at Full Council in March. The Giddings, Hamerton and Winwick have commenced preparing a joint neighbourhood plan, and the Stukeleys also prepared their neighbourhood plan, with a referendum taking place on 8 June.\nLooking ahead\nWhat we have achieved over the last 12 months provides us with a solid foundation on which to build.\nIn March, we agreed on a new Corporate Plan, which informs everything we do as we refocus our vision, review our priorities and work with staff, residents, partners, communities and businesses to lead Huntingdonshire into the future with confidence.\nThe Corporate Plan outlines our three key priorities:\n- improving the quality of life for local people\n- creating a better Huntingdonshire for future generations\n- delivering good quality, high value-for-money services with reasonable control and compliance with statutory obligations.\nThe first two priorities are each split into three outcomes. For the 'Improving quality of life' for local people's priorities, these are:\n- improving the happiness and well-being of residents\n- keeping people out of a crisis\n- helping people in crisis.\nAnd for the 'Creating a better Huntingdonshire for future generations' priority, our outcome statements are:\n- improving housing\n- forward-thinking economic growth\n- lowering our carbon emissions.\n'Working together' continues to be an overarching principle for us as a council as we look to achieve these priorities. We cannot go it alone. The challenges we face can only be solved through working collaboratively; the responsibility is not the council's alone.\nTo that end, Do, Enable, Influence is a crucial phrase for us as the Corporate Plan calls on the council to play more of an enabling role, to make more use of partnership working and to empower people to reduce demand for traditional public services. Our role is to help residents and businesses thrive. Only by working with people can we ensure that Huntingdonshire is a place where people can have a good life and take advantage of the opportunities that benefit them.\nCentral to this is communicating regularly with residents, meaningfully engaging with them in the broadest possible aspects of our work and listening and responding to concerns in shaping policies and priorities.\nOver the last 12 months, we have sought a range of views on topics including the development of our budget principles, an understanding of the services residents value, our Climate Strategy, our Electric Vehicle Charging Strategy, our Local Plan, and the Huntingdonshire Futures Place Strategy, which I will come on to more in a moment.\nIn addition to the views of our residents, we will continue to draw on insights from councillors of all political persuasions and work together to ensure that the council provides good services and good value.\nWe will continue to work constructively with the Cambridgeshire & Peterborough Combined Authority, Cambridgeshire County Council, and colleagues in health. Over the last year, we have grown positive and productive relationships with local town and parish councils, other public bodies, business partners and the third sector. Investment in these critical relationships will continue as we stay as close to our communities as possible.\nI mentioned the Place Strategy and, over the last year, we undertook more engagement on this programme of work than any other as we brought together the views of residents, including our young people, businesses, stakeholders and partners to develop Huntingdonshire Futures, which creates a shared vision and a plan of goals and actions for Huntingdonshire up to 2050. The views and feedback we received in the development of this strategy will also be used to inform other programmes of work.\nBy investing time and developing this shared strategy with our stakeholders and partners, who will continue to champion or lead on parts of it, we can influence better outcomes for our residents and communities to ensure that Huntingdonshire remains one of the best places to live in the country.\nOver the summer, we will bring stakeholders back together to bring the strategy to life. As part of this, we will continue to search for our 'guiding lights' - examples from other parts of the country or abroad that may inspire us to adopt similar initiatives. These initiatives, along with our partners and stakeholders, will challenge our existing way of thinking and encourage us to achieve better outcomes for Huntingdonshire.\nI am proud of all that has been achieved over the last year as we continue to deliver a greener, fairer Huntingdonshire for all.\nThank you.\nCllr Sarah Conboy\nExecutive Leader, Huntingdonshire District Council",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_page-1/content_7.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nCllr Nathan Hunt took to the Great Ouse to help clean the river and call for greater infrastructure investments from water companies\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nAs another round of public consultation on East West Rail closes, Ian Sollom MP has called on EWR to answer some important questions.\nFixing local health services must be at heart of government agenda.\nLiberal Democrat Ian Sollom has been elected as the first MP for the new consistency of St Neots and Mid Cambridgeshire.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team_nic-wells/content_38.html": "Cllr Nic Wells\nNic Wells has been a District Councillor for St Ives South since May 2022. Nic has chaired the Corporate Governance committee and is now Chair of the Licensing committees. He also serves on the Overview and Scrutiny panel for Performance and Growth.\nNic is active as a trustee of Disability Huntingdonshire and as treasurer of Houghton and Wyton tennis club. He also has a busy family life with four adult children, eight grandchildren and a stepson.Nic has lived in Huntingdonshire since 1980, working in IT technical and management roles until he retired in 2020.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-4/content_22.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nThe Liberal Democrats have laid out a bold and ambitious plan to restore the UK’s natural environment and ensure that everyone can access a clean, healthy, and thriving green space.\nFor many people, Buy Now Pay Later is a useful and convenient solution, offering them flexibility with their purchases. But consumers need stronger protections.\nWith the right investment, we have the opportunity to turn things around and ensure that every child, regardless of their background, has the chance to succeed.\nLiberal Democrats want to fix our broken relationship with Europe. Giving young people the opportunity to live, study and work in Europe is a vital first step.\nThe Liberal Democrats are committed to transforming maternal and neonatal care and ensuring inclusive care for all, so we can create a safer, more compassionate healthcare system for everyone.\nOur market system should balance businesses’ needs and the rights and freedoms of workers.\nThe last ten days have been immensely difficult for our country.\nAfter years of neglect, the top priority of the incoming Labour government should now be to save our health and care services.\nThere are now more Liberal Democrat MPs than ever before",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-3/content_36.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nRead Ed Davey's speech to the Liberal Democrats' Autumn Conference in Brighton\nCarers are not just support for their loved ones—they are the glue holding our fragile social care system together. They deserve more than token acknowledgements or empty promises.\nLiberal Democrats believe that everyone has the right to enjoy clean, safe water and unpolluted rivers, lakes, and coastlines. We are committed to ending the national sewage scandal and holding water companies accountable for their environmental impact.\nLiberal Democrats have passed new policy to stand up for bereaved families and kinship carers, so more young people can grow up in a loving, stable home.\nWe are committed to tackling the challenges facing our music industry head-on. By doing so, we can maintain the UK’s reputation as a global leader in music, while giving future generations the chance to share in its success.\nThe Liberal Democrats are committed to rebuilding the trust and compassion that the UK was once known for. We believe that our country has a responsibility to support those in need, no matter where they are in the world.\nFor too long, years of neglect and mismanagement by the previous Conservative Government have pushed our prison system into a deep crisis.\nThe Liberal Democrats have long championed proportional representation, advocating for a voting system where every vote truly counts. We believe that reforming our electoral system is crucial for a fairer democracy and better governance.\nWe believe everyone deserves high-quality healthcare, accessible when and where it’s needed and free at the point of use.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_search/content_15.html": "Lorna Dupre, Liberal Democrat Candidate for Mayor of Cambridgeshire and Peterborough This evening we'll be joined by Lorna Dupre, the Liberal Democrat candidate for Mayor of Cambridgeshire and…\nFairer Funding for Cambridgeshire’s GPs Residents across Cambridgeshire are finding it increasingly difficult to secure GP appointments when they need them the most. Figures reveal that since…\nCounty Councillor Andrew Wood Cllr Andrew Wood was elected to Cambridgeshire County Council in a by-election in 2023 winning the seat off the Conservative Party. He represents Yaxley and Farcet.\nCllr Nic Wells Nic Wells has been a District Councillor for St Ives South since May 2022. Nic has chaired the Corporate Governance committee and is now Chair of the Licensing…\nCllr Geoff Seeff Cllr Dr Geoffrey Seeff, or Geoff as he prefers to be called, is a Chartered Accountant/management consultant with a doctorate in the field of Corporate Social Responsibility. …\nCllr Dave Shaw Dave Shaw has been a District Councillor for Brampton since May 2022. He has lived in Huntingdonshire his whole life. He moved from Buckden to Brampton over 30 years ago at the…\nCllr Patricia Jordan First elected in 2007, I've cherished representing my constituents and still vividly recall helping my first resident with a waste issue. Guiding residents to the right…\nCllr Jo Harvey Jo Harvey is a District Councillor for Huntingdon East. Having been elected in May 2022, Jo has been busy as the Vice-Chair of the Corporate Governance committee, as well as…",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-2/content_26.html": "Lib Dem Ian Sollom wins in St Neots and Mid Cambridgeshire\nLiberal Democrat Ian Sollom has become the first MP for the new constituency of St Neots and Mid Cambridgeshire, and Huntingdonshire's first ever Lib Dem MP.\nLiberal Democrat Ian Sollom has become the first MP for the new constituency of St Neots and Mid Cambridgeshire, and Huntingdonshire's first ever Lib Dem MP.\nLib Dem Andrew Wood has won a County Council seat from the Conservatives, making the Lib Dems the largest group on Cambs County Council - while the Tory and Labour vote shares collapsed.\nEdna served as a Magistrate in Cambridge for over 25 years, including many years chairing the Youth Court, and currently chairs the Cambridgeshire and Peterborough Fire Authority\nHuntingdon Liberal Democrats have chosen Mark Argent to be their prospective Parliamentary Candidate for the next General Election\nHDC has installed new CCTV in Huntingdon to help tackle anti-social behaviour.\nA look into how we’re delivering what we promised in last year’s District elections, and more about HDC’s Climate Conversation.\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.\nNo child should ever have to experience sexual abuse. These are horrifying crimes that cause so much harm to the children who are victims. We will keep up the pressure so that the action needed to make our communities safe all children finally happens.\nGovernment must deliver the change people are yearning for\nA new charity single to support young carers\nPippa Heylings reports from the global climate summit in Baku\nWhat the Government is doing, and why we're opposing it.\nOctober is Black History Month - a chance to celebrate the Black British community, acknowledge their contributions and discover their stories.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_lib-dem-councillor-takes-to-the-river-for-paddleboard-litterpick/content_16.html": "Lib Dem Councillor takes to the river for paddleboard litterpick\nA Lib Dem councillor has recovered significant amounts of rubbish out of the River Great Ouse in Huntingdon, including plastic waste that dates back to 2016.\nDistrict Councillor for Huntingdon East, Cllr Nathan Hunt, litterpicked the section of the Great Ouse between Huntingdon Riverside Park and the Causeway in Godmanchester, using a paddleboard to navigate the waterway.\nHe managed to fill multiple buckets with plastic and other waste - with some of the stranger finds being plastic toy eggs, a nerf dart, and full two litre bottle of soft drink.\nThe oldest piece of rubbish recovered via the paddleboard was a plastic bag used to package chives, which dated back to 2016 - nearly a decade ago.\nCllr Hunt said: “I'm really passionate about keeping our river and park clean - and sometimes that means taking things into my own hands.”\n“It's shocking how long litter can remain in the environment for, so picking it is absolutely vital. We all have a role to play in getting rid of our rubbish properly and protecting our waterways.”\n“Water companies also need to be investing in infrastructure to reduce the amount of sewage that they discharge into our rivers - both here in the Great Ouse and across the country.”",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_edna-murphy-chosen-as-liberal-democrat-candidate-for-police-and-crime-commissioner/content_60.html": "Edna Murphy chosen as Liberal Democrat candidate for Police and Crime Commissioner\nCambridgeshire and Peterborough Liberal Democrats are delighted to announce that Edna Murphy has been chosen to be the party’s Police and Crime Commissioner candidate.\nEdna offers a unique blend of experience and insight into the role of Police and Crime Commissioner. She served as a Magistrate in Cambridge for over 25 years, including many years chairing the Youth Court, and she currently chairs the Cambridgeshire and Peterborough Fire Authority, recognized as one of the most successful and respected in the country.\nCurrently a County Councillor for Bar Hill Division, she is also a member of the Board of the Cambridgeshire & Peterborough Combined Authority.\nEdna highlights her key priorities:\n“The police need to do more on persistent problems such as sexual assault and on new priorities such as fraud. On both of those, victims currently report to the police just one in six or one in seven of the crimes they experience, which shows just how low victims’ confidence is in the service. That needs massively to improve.\n“I'll fight not just for fair funding for Cambridgeshire policing but also for smarter spending, moving away from policies that don’t work to reduce crime, such as short prison sentences for non-violent offenders, and towards solutions that truly make us safer by making it less likely that any of us will be victims of crime in the future.\n“I'll champion effective crime reduction strategies such as restorative justice, tackling prolific offenders, and evidence-driven community policing.\n“Above all, I'll ensure that the police are proactive and treat victims with respect, not just as statistics.”",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_donate/content_30.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the window\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team_patricia-jordan/content_18.html": "Cllr Patricia Jordan\nFirst elected in 2007, I've cherished representing my constituents and still vividly recall helping my first resident with a waste issue. Guiding residents to the right resources is crucial, as is giving them a voice, even when I can't personally solve their problems.\nNow, as part of a coalition, listening is even more vital for reaching consensus. This principle of listening guides my interactions with everyone, from residents and officials to the opposition.\nI believe that visiting residents and holding regular surgeries are essential for truly understanding their concerns.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_st-neots-eatons-report/content_32.html": "St Neots Eatons report\nIt is now just over 6 months since I was elected as County Councillor for the Eatons and it has flown by as I have never been so busy in my life… and I can say in all honesty that I am not one who has at any time ever sat around waiting for things to happen. Apart from the main council meetings and the meetings and pre-meetings of the committees I have been appointed to — Health, Community, Pensions and Audit and Accounts — and, most importantly, assisting residents with their queries — there are workshops, training sessions, site visits and liaison with hospitals, police, schools and the district and town councils. However, I suspect that residents are not much interested in how I spend my time but the outcomes of my interventions so I list below a selection of the issues that I have been Involved with in the period:\nConcerned about the need for more childminders in our new estates to allow the freedom of parents to return to employment, one of my colleagues called for restrictive covenants prohibiting the conduct of business activities from the home to exclude registered childminding. I supported and spoke to this Council motion as these blanket covenants are only included for marketing purposes in order to reassure prospective purchasers that they won’t be surrounded by neighbours carrying out noisy and environmentally unfriendly activities or attracting obstructive parking. There is no evidence that developers make any attempt to enforce the covenants once they have sold off the estate. Childminding is a benign activity that brings many social and economic benefits and I am pleased to say the Council agreed and is making efforts to ensure the policy is implemented by district councils in the County and taken up nationally.\nFollowing a lead from fellow councillors, I was concerned that Section 106 funds, money due from developers to contribute towards community activities in St Neots, had been misallocated or not collected when it was due. I pursued enquiries through the Finance Department and, although not yet confirmed, believe that a not insignificant sum of money will be recovered and made available towards the town’s transport infrastructure. The enquiry has triggered a full audit of the administration of Section 106 agreements across the County so there may be wider implications.\nThe County Council has launched a wide-reaching campaign to reduce the level of smoking in adults and children, a cause of so much ill health among residents and, as a consequence, an additional medical and cost burden on the NHS which, as we all know, is under enough strain from non-preventable causes. As it happens the prevalence of smoking cigarettes is much less in Huntingdonshire than in other parts of the County (around the national average of 15% compared to parts of Cambridgeshire where the rate is practically double that figure) but there are worrying trends amongst certain sections, most particularly children who are being encouraged to vape — which was meant to be a measure to wean smokers from tobacco products not become an introduction to the habit. There are a number of educational initiatives being implemented which we all endorsed but I proposed that the health committee through its chairman should recommend to the Secretary of State for Health the adoption of the inspired New Zealand legislation that prohibits the sale of tobacco products to anyone currently under the age of 11 with the threshold increased by a year in each successive year. This is designed to stop young people starting to smoke in the first place and, conceivably, will eventually result in only a handful of the very elderly continuing to smoke.\nThe County launched a new grant regime, the Cambridge Priorities Capital Fund, designed to provide financial assistance for capital projects undertaken by charities and the voluntary sector, typically refurbishment of village community halls or the purchase of equipment for special needs or targeted groups such as youth clubs. Recognising that construction and indeed most other costs had risen over the past few years, I was instrumental in ensuring that the maximum grant level is realistic, now set at £40,000 from the originally proposed £20,000, and that co-funding with other public and private sources would be encouraged allowing projects to have greater impact. Expressions of interest from relevant St Neots organisations and were invited with submissions of interest due the end of September 2023. I hope to find that some of those will have been successful in their bids.\nAs noted in the separate story about the avoidance of the use of chemical weedkiller and the consequential proliferation of weeds in our roadside verges and gullies, I have been liaising with highways officers on everyone’s favourite subjects of potholes, parking, 20 mph limits, overgrown trees and signage. I don’t always get the result that residents might hope for but I usually get a response that explains the reason why something is being done or not done and challenge it where I feel there is cause.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-1/content_54.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nCllr Nathan Hunt took to the Great Ouse to help clean the river and call for greater infrastructure investments from water companies\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nTalking with voters after the 2024 General Election and thinking of the future\nThe sun shone on our Summer BBQ this year, we all gathered to relax and celebrate the wins that Huntingdonshire have had over the last year.\nThe full transcript of Cllr Sarah Conboy’s annual speech as Lib Dem leader of Huntingdonshire District Council\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team_andrew-wood/content_5.html": "County Councillor Andrew Wood\nCllr Andrew Wood was elected to Cambridgeshire County Council in a by-election in 2023 winning the seat off the Conservative Party. He represents Yaxley and Farcet.\nCllr Andrew Wood was elected to Cambridgeshire County Council in a by-election in 2023 winning the seat off the Conservative Party. He represents Yaxley and Farcet.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_page-6/content_9.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nCllr Nathan Hunt took to the Great Ouse to help clean the river and call for greater infrastructure investments from water companies\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nIan Sollom responds to Michael Gove's announcement of a Development Corporation for the Cambridge area\nWith his Autumn Statement Jeremy Hunt has shown how little the Conservatives care about the everyday struggles of people in St Neots and Mid Cambridgeshire trying to access NHS services.\nNew Home Office statistics have revealed that a shocking 2845 burglaries went unsolved across Cambridgeshire in the year ending June 2023.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_page-7/content_21.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nCllr Nathan Hunt took to the Great Ouse to help clean the river and call for greater infrastructure investments from water companies\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nNHS waiting lists in Cambridgeshire for basic diagnostic tests - including MRI and CT scans - grew by 51% between June 2019 and July 2023, up to 28,820\nA major new poll has shown that the Liberal Democrats are the main challengers to the Conservative Party in the new St Neots and Mid Cambridgeshire constituency at the next election\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral, as part of a plan to boost survival rates and improve treatment for those affected by the disease\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_lib-dem-ian-sollom-wins-in-st-neots-and-mid-cambridgeshire/content_59.html": "Lib Dem Ian Sollom wins in St Neots and Mid Cambridgeshire\nThe win was one of the 3 gains the Lib Dems made across Cambridgeshire - meaning the Lib Dems have more Cambridgeshire MPs than the Tories, and the same number as Labour.\nIn his acceptance speech, Ian thanked the people of the constituency, and highlighed that he'll work to be an MP for all, regardless of how they voted.\nTo everyone in St Neots and Mid Cambridgeshire, regardless of how you voted, I want you to know that I will keep listening to you and I will keep fighting for you every day for that fair deal you deserve. To be elected to represent you is a true honour. I won't let you down, so let's get to work.\nIan Sollom MP",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_page-2/content_8.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nCllr Nathan Hunt took to the Great Ouse to help clean the river and call for greater infrastructure investments from water companies\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nThe Liberal Democrats have today announced that their manifesto will include a plan to abolish Ofwat and replace it with a new regulator with real teeth that can crack down on water companies dumping filthy sewage into rivers and beaches.\nThe Liberal Democrats have today (24th May) announced that their five year plan to give patients in a legal right to see a GP within a week or 24-hours if in urgent need will be in their General Election manifesto.\nLiberal Democrat Parliamentary candidate Ian Sollom for St Neots and Mid Cambridgeshire has said that this is ‘our chance to bring change’ in the constituency.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-17/content_65.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nThe NHS is in crisis after years of this Conservative government running it into the ground and there is still no sign of progress on the long promised 40 new hospitals. And Conservative MPs just jeer from the sidelines. It is an insult to millions suffering across the country.\nA Lib Dem investigation has revealed shocking reports of patients slipping over on sewage, staff becoming ill and urine & faeces leaking into offices and wards.\nSome areas in England now have almost 3,000 registered patients for every fully qualified GP.\nThousands of people are stranded in hospital beds because there aren’t enough care workers to look after them at home or in a care home.\nEach year, thousands step up to support a child who is unable to live with their birth parents.\nA typical family has been left almost £1,200 poorer in the 100 days since Rishi Sunak became Prime Minister\nThe Government has caved into the Liberal Democrat campaign to end sewage discharges into rivers.\nToday marks the beginning of LGBT History Month - a time to discover the stories of the LGBT+ community, acknowledge the prejudice they have faced, and celebrate the progress that has been achieved.\n292 Conservative MPs voted to allow sewage dumping by water companies in our rivers, lakes and coasts for at least 15 more years.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-12/content_71.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nThe UK should be one of the healthiest countries in the world. Yet our country has the worst healthy life expectancy in Western Europe.\nLiberal Democrats champion not only a greener future but a more equitable one, where the fashion industry takes responsibility for its impact on both the planet and people.\nIn our pursuit of a sustainable future, we must ensure that no one is left behind.\nPeriods are not just a monthly inconvenience, but they can be painful, unpleasant and expensive.\nFrom Suella Braverman to BBC Chair Richard Sharp; from Nadhim Zahawi to Nadine Dorries, it feels like the sleaze and standards scandals never stop.\nOur candidate for Eastbourne speaks to conference\nEvery child deserves a great start in life.\nLiberal Democrats are calling for tutoring to become a permanent fixture in England’s schools.\nUnder this Conservative Government, the UK's economy has been plagued by sluggish growth, dwindling investment, and regional disparities.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-5/content_48.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nEvery vote for the Liberal Democrats is a vote to elect a strong local champion who will fight for a fair deal for you and your community.\nFor a Fair Deal\nWe have a fair plan to fund a rescue package for our health services.\nCaring isn't just Ed's story, it's the story of millions, caring for each other, dealing with tough times, and keeping going with love.\nThe Liberal Democrats have launched their ambition to extend free school meals to all primary school children, funded by a new share buyback tax.\nLiberal Democrats are calling for a bold share buyback tax that would incentivise productive business investment, support the transition to net-zero and help raise vital funds for our public services.\nThe Liberal Democrats have a five-year plan to give patients a legal right to a GP appointment within a week, or 24 hours if urgent.\nThe Liberal Democrats are standing up for our NHS, addressing the cost of living crisis, and ensuring everyone gets the support they need.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team_debbie-mickelburgh/content_27.html": "Cllr Debbie Mickelburgh\nDebbie Mickelburgh has been a District Councillor for Godmanchester, Hemingford Abbotts and the Offords since May 2022. She is Chair of the Huntingdonshire Liberal Democrats.\nShe is a qualified primary school teacher and has worked in Education for over 15 years. She has two children with her husband and fellow Councillor Brett.\nShe is also a serving Town Councillor, as well as being a member of the Scout Executive Committee, an FA qualified football coach at Godmanchester Town football club and a member of the local Baptist church.\nDebbie aims to provide a voice for the many groups and people she encounters daily within her community, as well as young families, children, educators and women.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-15/content_69.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nThis could lead to countless missed or delayed diagnoses as people go without the care they need, creating a ticking time bomb for our NHS.\nMore than three in five local areas in England have seen a rise in the number of people per dentist.\nLiberal Democrats are calling for a new statutory guarantee that all burglaries will be attended by police and properly investigated.\nEd Davey has smashed the ‘Blue Wall’ with a yellow tractor, as he officially launched our English local election campaign in Hertfordshire.\nWe love our country and want to transform it for the better. To build a liberal Britain, and spread real opportunity to every city, town and village across our great United Kingdom. To deliver the fair deal that the British people deserve.\nEverybody should be able to get the high-quality care they need, when they need it. But across the country, social care services are in crisis.\nThe anti-refugee Braverman Bill is immoral, unworkable and incredibly costly.\nCllr Mike Ross, leader of Hull Council, addresses Spring Conference 2023.\nEveryone deserves a fair chance to succeed in life and access to the same opportunities. Sadly that is not the case in the UK.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_events/content_4.html": "Lorna Dupre, Liberal Democrat Candidate for Mayor of Cambridgeshire and Peterborough\nThursday 27 February, 1930, Zoom\nThis evening we'll be joined by Lorna Dupre, the Liberal Democrat candidate for Mayor of Cambridgeshire and Peterborough in the election in 1 May.\nThis role carries powers devolved from Westminster, and is likely to become more significant in the local government re-organisation. This event will give us a chance to find out more about Lorna and her vision for the mayoralty, in a county with three Liberal Democrat MPs and (hopefully) a Liberal Democrat County Council.\nPlease click “book” to book to receive a Zoom link. The event is free, but you will need to click “checkout” to complete your booking. You'll receive a confirmation email with a click to “download ticket”, which contains the Zoom link.\nWe run regular events throughout the year, some online and some in person.\nRecent discussions around policy have looked at:\n- the Greater Cambridge Partnership's proposals for transport in Cambridgeshire (Sarah Conboy)\n- factors affecting success for young people in education (Peter Downes)\n- smart motorways (James Catmur)\n- where we are in the light of Brexit — and the prospects for rejoining the EU (Mark Argent).\nRecent speakers at our annual dinner include Lucy Nethsingha and Norman Lamb.\nInformation on forthcoming events appears under the Events menu.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-20/content_62.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nThe bravery shown by the women of Iran over the last few weeks has been inspiring. Liberal Democrats will do all we can to ensure the UK Government stands with them.\nThis Conservative government has brought the NHS to its knees and patients are paying the price.\nTruss must scrap this budget to save the economy and give those on benefits a much needed lifeline this winter.\nOctober is Black History Month - a time to celebrate the Black British community, recognise their contributions and discover their stories.\nStatement from Ed Davey, Leader of the Liberal Democrats, on the death of Her Majesty The Queen.\nLiz Truss and the Conservatives are completely out of touch with the British people.\nLocal shops, pubs and restaurants could all close their doors for the last time over the coming months unless the government steps up.\nTheir bravery - in the face of six months of brutal atrocities perpetrated by Putin’s regime - is an inspiration to us all.\nThis is an emergency. Cancel October's planned energy bill rise to save people £1500.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_huntingdonshire-district-councillor-jo-harvey-honoured-with-grassroots-award/content_12.html": "Huntingdonshire District Councillor Jo Harvey Honoured with Grassroots Award\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nJo’s passion for cricket and community engagement has been instrumental in bringing inclusive cricket sessions to the Coneygear Centre. These sessions, run in partnership with Cricket East and the Community Development Manager, provide opportunities for everyone to enjoy the sport despite the challenges posed by the unsafe condition of the current cricket pavilion, which also prevents junior cricket from taking place.\nThanks to Jo’s leadership and enthusiasm, plans are now underway for a brand-new community pavilion, set to open for the 2025 season, offering a safe and welcoming space for cricket and other activities.\nJo’s partner, Malcolm, has also played a key role by becoming a trained cricket coach to support these sessions. Her children, Andrew and Kathryn, actively participate as well. Kathryn, aged 10, shared her gratitude:\n“Thank you for inspiring me to play cricket and getting me to try something new. It felt like the beginning of a new sport I still like. It helps me believe in myself.”\nBeyond her work with cricket, Jo is a trustee of the Huntingdon Action Community Project, a charity dedicated to enhancing community wellbeing through education and creative play for children.\nJo’s tireless efforts continue to make a lasting impact on the lives of local residents, and this award is a well-deserved recognition of her commitment to building a stronger and more inclusive community.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_page-3/content_19.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nCllr Nathan Hunt took to the Great Ouse to help clean the river and call for greater infrastructure investments from water companies\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nThe Lib Dems in St Neots and Mid Cambridgeshire are celebrating a by-election win in the ward of Great Paxton. Previously a Conservative-held seat, the Lib Dem candidate converted this into a victory.\nReplacing business rates with a new, fairer levy on commercial property owners instead of tenants would be a major boost for towns.\nNew figures released by the Environment Agency have shown that Anglian Water which covers Cambridgeshire discharged sewage a staggering 31,623 times last year, a 97% rise compared to in 2022.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team_jo-harvey/content_44.html": "Cllr Jo Harvey\nJo Harvey is a District Councillor for Huntingdon East. Having been elected in May 2022, Jo has been busy as the Vice-Chair of the Corporate Governance committee, as well as sitting on two Overview and Scrutiny Panels.\nJo is passionate about helping people with their mental health, and is a Peer Support Worker at a mental health group in Huntingdon, which she set up. She hopes to influence the District Council to do more to support residents with their mental health.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_going-zero-carbon-heating/content_25.html": "Going \"Zero Carbon\" heating\nInsulate – Think hard about what you can do to make the building thermally more efficient. Think about the right temperature for each room and insulate to help achieve them. Go back and insulate some more.\nA heat pump is a radically different form of heating, your whole heating philosophy and regime has to change. It takes about a week to get a older house 'warm' and if you turn the heating up it takes 4-8 hours for the temperature to rise (if the room is already 'warmish'). Most users do not understand that. It would mean keeping a room at say 15C all the time and increasing it to 20C a day or two before it is needed. You need to get a good control system (people seem to fail to do so) - every room needs to have its own temperature – ancillary spaces are heated to 13C, some rooms to 15C unless needed, some to 17C and some to 20C but be aware that the systems on the market are not that easy to use.\nAnyone who does not pre-plan heating will be cold as they can no longer just ‘turn the temperature up’. Many people will, for now, not understand this. Remove the manual wall thermostat as it would be far too late to turn it up if people are already in the room\nInsulate some more once you have installed things and have worked out where it does not work as well as hoped - we recently added insulation in the ceiling between a downstairs bedroom and the upstairs rooms and it has made a real difference. We are now adding thermal film to our windows to keep the house cooler in summer, as every window faces south.\nYou almost certainly do not need new radiators, no matter what the installer tries to sell you (unless they are knackered), you need a new heating philosophy and users who can plan their usage ahead of time. Live through one winter and then decide if you really need to change any radiators or really need every room to be warm. If you do find that you need new ones just use a good local plumber and radiators you source, with thermostats.\nTalking to other people I have found that it seems they got cheaper prices because items were 'left out'. If you want hot water when the heating is off you need a bit more plumbing, wiring and a valve that directs the heat pump water loop to the hot water not the radiators. It seems that some installers 'save' you money by leaving this out. They will then explain that you cannot use the heat pump to cool the house (but they will not say that it is because it would also chill your 'hot' water).\nInstallation\nThe installation process is slow and needs planning carefully. Brexit and Covid had messed up supply chains in my case so it took longer than hoped – a good supplier will only book the fitting of equipment once everything needed is already on site – so it could frustrate you to have fitting dates cancelled or to watch the equipment sat waiting for a while.\nStart with how you will heat (and in the future cool?) the house. Note that a heat pump can work backwards and provide cool radiators (down to about 18C if you do not insulate all the pipes – but turn the radiators off in bathrooms to avoid a puddle under the radiator after a shower) and thus give you some ‘comfort cooling’ - as the country gets warmer the need will increase. A heat pump will deliver warm water, not very hot water. It will be hot enough for a shower but maybe not a hot bath and you do not need to add cold water to it for washing up, etc.\nFor a heat pump you can go air or ground, but for ground needs enough land so air is more likely. Check on the need for planning permission (if you buy one large unit it is not needed in HDC, but two smaller units need it) or listed building consent. Be aware that most installers of heat pumps will just use ‘standard’ settings – a heat pump system will have masses of possible settings and it pays to work with them [slowly] to find the settings that work for your lifestyle and house.\nThink about how you will source energy. You can buy or you can generate it. Solar panels make a lot of sense, but they will work best in the summer (when you do not need heating but may need cooling) and not so well in the winter. Wind turbines may be a solution for the winter, but you need land (and, weirdly, planning permission if you have a heat pump). So solar for summer, wind for winter. Do check for planning, listed building and conservation district consent.\nIf you generate power, you may want to store it to avoid buying it when the sun isn’t out, or the wind isn’t blowing. That will require some form of storage device such as batteries, heat stores, etc. The easiest is to only heat your hot water when energy is ‘free’, but consider using smart sockets on devices so you only run things when you produce energy. Washing machines, dryers, dishwashers, etc. can all be set so they only run when it makes sense. Do remember to check the house with your smart meter (before batteries are fitted) to make sure things are not on when not needed.\nThis switch is not cheap, check for grants to help with the costs. Current energy prices mean that the payback period is much reduced, but the upfront costs are high – very roughly £10,000-£15,000 for an air source heat pump, £5,000-£7,500 for solar panels and £10,000 for a battery.\nExperience\nI am James Catmur, and I was elected for Great Paxton ward in 2024, this is my experience of fitting a low CO2 system to my home.\nMy house was heated with oil as there is no gas in the village where I live, the oil boiler was 25 years old and the oil tank was cracking, so both needed replacing. That meant I was looking at spending about £5,000-6,000 to stay on oil heating, it made sense to look for an alternative. The primary driver to the project for the family was ‘no more oil and almost no CO2’.\nThe house was built in the 1820s and when we bought it was very badly insulated. Every time we had ever done any work on the house we added insulation, but we still have some uninsulated external walls – aerogel is a good way of insulating these with little loss of room space, but it is not cheap.\nWe decided to go for an ASHP, as the garden was not large enough for a ground source one, solar panels and a battery. The whole installation took about a year.\nThe first phase was the ASHP, which kept on being delayed due to supply chain problems. We had planned that for the summer when heating is not needed. Once all the equipment was safely in the garage the installation was booked and it took about 2 days during which the whole boiler room and hot water system were changed. We then spent about 6 months adjusting all the ASHP settings to get the system to work well for our house and our lifestyle (and then made further adjustments a year later). We did replace one very old radiator and spent a lot of time getting rid of sludge from the old heating system (even though we had flushed it before the installation). Having lived through one winter we know we must either replace one more radiator or improve the insulation in one or two rooms with some aerogel boards. We accept that bedrooms are fine at 17C. We made sure we bought an ASHP that was large enough for a fully occupied house, but with the children away at university, their rooms are only heated to 13C, until a week before their return home for holidays.\nHaving learnt about supply chain problems, we waited until all the equipment for the solar panels was in the garage and then booked their fitting. Fitting took about 2 days and then there was little more to do to the system except set up all the smart plugs to ensure we only use electricity during the peak of the day (we plan on 5 hours after sunrise until 2 hours before sunset, as the panels do not face fully due south, and the morning is spent topping up the batteries).\nWith the batteries we did the same process – equipment in the garage, 2 months delay for fitment, 2 days to fit. Not a huge amount to learn but we can watch them charge and discharge, plus export the excess to the grid.\nWe planned the system with the idea that net, over a year we would not buy any electricity. That does not mean no cost, as we will have to buy electricity in the depths of winter (when all the wind farms mean it is more likely to be green) and export in the summer. Overall, it seems we got the design about right. Over the first year we had bought 3700kWh and exported 1600kWh. With the batteries and solar panels installed in summer we typically consume about 10kWh per month and export about 150kWh. Clearly, that changes during the winter.\nAfter the first year our total net energy consumption had dropped by almost 90%, from 19MWh to 2.1MWh and with current energy prices the pay back period will be about 9 years (with a grant and assuming we would have had to spend £5k to stay on oil)\nI have now got an electric vehicle that I aim to only charge when the sun is out (ideally when the house batteries are full so the car gets charged from solar power I would otherwise export), being careful to match the current drawn by the car to the power generated by the solar panels. The car can charge at 2kW or 2.5kW so I typically use 2kW as the panels generate less than 4kW. At the moment this is managed manually on my apps, but it would be good to automate it. It does mean net energy consumption for the house and transport has increased to 4.0MWh\nThe final step has been to buy solar and wind energy from an energy cooperative. My net energy consumption will then be less than zero.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-9/content_64.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nShock poll reveals staggering number of working UK adults say they have missed work in the past year due to being stuck on waiting lists or attempting to see a GP or dentist\nToday is an important opportunity to remember those who have lost their lives to transphobia, and reflect on how we as a society can end this loss of life.\nAs Liberal Democrats, we have always stood in support of a lasting peace and a two-state solution in Israel and Palestine.\nIt is vital that we stand up against all forms of Islamophobia, and work together to end religious hatred everywhere.\nEmployees should not have to wait any longer for safe and respectful workplaces.\nMental health is as important as physical health.\nRishi Sunak’s speech was so out of touch he may as well have been living on another planet.\nWatch or read Liberal Democrat Leader Ed Davey's speech to Autumn Conference.\nLiberal Democrat Leader Ed Davey sets out a five-year cancer plan to boost survival rates, including a new legal right for patients to start treatment within 62 days of an urgent referral.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1/content_20.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nCllr Nathan Hunt took to the Great Ouse to help clean the river and call for greater infrastructure investments from water companies\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nTalking with voters after the 2024 General Election and thinking of the future\nThe sun shone on our Summer BBQ this year, we all gathered to relax and celebrate the wins that Huntingdonshire have had over the last year.\nThe full transcript of Cllr Sarah Conboy’s annual speech as Lib Dem leader of Huntingdonshire District Council\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_page-8/content_17.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nCllr Nathan Hunt took to the Great Ouse to help clean the river and call for greater infrastructure investments from water companies\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nAt the GCP Board meeting on Thursday 28th September, board members voted not to proceed with the congestion charging proposals\nIan Sollom and other leading Lib Dems in Cambridgeshire have committed to rejecting the congestion charge proposals and developing alternative plans for better public transport and active travel\nSt Neots and Mid Cambs Lib Dem candidate Ian Sollom condemns Tory delays to plans to replace Hinchingbrooke Hospital, which was built with crumbling RAAC concrete\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_hunts-lib-dems-win-in-st-neots-the-eatons/content_28.html": "Hunts Lib Dems win in St Neots The Eatons\nThe Lib Dems have won another seat on Cambridgeshire County Council.\nLiberal Democrat Geoff Seeff was elected to Cambridgeshire County Council after winning the St Neots The Eatons by-election, held on the 16th Febuary 2023. This win comes soon after we welcomed Cllr Doug Dew from the Conservatives, strengthening our team on the County Council.\nSpeaking to The Hunts Post after the election, Cllr Seeff said: \"Our surveys and canvassing during the election campaign identified three key issues on the minds of residents of the Eatons - the state of the roads and road safety, difficulties in accessing primary healthcare and the lack of progress of the town centre regeneration.\nOn the roads, my colleagues on the county council have already re-allocated budgets towards dealing with potholes and people will already see that repair work is underway - although there is still much to do.\nMy job will be to ensure that the Eatons receives its fair share of funding and is given priority where it is needed most (heavy lorries along certain roads exacerbate both problems).\"\nThe results were:\nAndrew Jennings, Conservative — 746 votes.\nColin Maslen, Independent — 360 votes.\nTaylor Purdon, Labour — 250 votes.\nGeoff Seeff, Liberal Democrat — 1042 votes. ELECTED",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-16/content_63.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\n\"Britain deserves so much better than the lack of a plan, lack of leadership, lack of commitment that we see from the Conservatives.\" Sarah Olney MP addresses Spring Conference 2023.\nLiberal Democrat plans would cut energy bills for consumers and businesses, reduce emissions and set Britain on a path to a sustainable future.\nThe UK abandoning the current stance of continuous deployment of Trident submarines, at this crucial time, would send the wrong signal to Putin.\nEveryone should be able to access an NHS dentist if they need one and no-one should be forced to face an impossible choice, between paying hundreds of pounds for private care or going without. Our plan would fix this mess.\nIt’s important to set out our case for an online world that is safe and make clear to those who abuse that space that we will not rest until we are successful.\nThis International Women’s Day, I will be celebrating so many incredible women - who have brought us this far; who work tirelessly for equality; and who will take us even further in the years to come.\nLiberal Democrat Leader Ed Davey is demanding the Chancellor cancels plans to hike the average household energy bill by £500 in April, and cuts people’s bills instead.\nLiberal Democrats continue to be proud to stand shoulder to shoulder against tyranny, and we will stand with Ukraine until they are victorious.\nRegulations covering workers rights, parental leave, child safety and more could be scrapped by this Conservative Government.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_local-survey_get-in-touch/content_43.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk/content_1.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nCllr Nathan Hunt took to the Great Ouse to help clean the river and call for greater infrastructure investments from water companies\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nAs another round of public consultation on East West Rail closes, Ian Sollom MP has called on EWR to answer some important questions.\nFixing local health services must be at heart of government agenda.\nLiberal Democrat Ian Sollom has been elected as the first MP for the new consistency of St Neots and Mid Cambridgeshire.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_our-team_sarah-conboy/content_11.html": "Cllr Sarah Conboy\nExecutive Leader of Huntingdonshire District Council\nSarah Conboy is a District Councillor for Godmanchester, Hemingford Abbotts and the Offords.\nAfter a career in education as a primary teacher and head of a Moderate Learning Difficulties Department, Sarah led local and national programmes to recruit and retain teachers before working as a senior civil servant at the Department for Education. Sarah is the CEO of a small Cambridgeshire charity that supports parent carers whose children have special needs and disabilities.\nShe has been a District Councillor for over nine years and became the Executive Leader of the Huntingdonshire District Council in May 2022, when the Joint Administration was formed. She oversees the council’s strategic direction, ensures policy implementation, manages resources, and represents the Council in public and official matters. She collaborates with Council Members and staff to achieve community goals and improve services.\nSarah is passionate about joined-up services and the art of the possible.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_page-4/content_33.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nCllr Nathan Hunt took to the Great Ouse to help clean the river and call for greater infrastructure investments from water companies\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nCommenting on the Spring Budget Lib Dem parliamentary candidate for the new constituency of St Neots and Mid Cambridgeshire, Ian Sollom, said:\nDuring a visit to St Neots on Saturday 2 March, Lib Dem Leader Sir Ed Davey met partners and users of the town’s Citizen Hub as well as small business owners.\nCambridgeshire saw a 65% rise in four week waits for GP appointments last year when compared to 2022, House of Commons Library research commissioned by the Liberal Democrats has revealed.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_our-manifesto-18-months-on-climate-change/content_42.html": "Our Manifesto, 18 months on: Climate Change\nLast year, during the Huntingdonshire District Council elections, we promised to take ambitious action to fight climate change - and we're delivering.\nHuntingdonshire District Council now has a Lib Dem leader (Cllr Sarah Conboy), and we're delivering on our promises.\nOur manifesto said: \"we will lead by example, with the Council setting ambitious sustainability targets, requiring new buildings to reduce greenhouse gas emissions to near-zero by 2030, provide healthy places to live, reduce water usage and manage runoff.\"\nHere's just some of what we've done:\nWe've declared a Climate Emergency:\nOne of the new administration's first acts was to declare a climate emergency, publicly acknowledging the crisis the climate emeregency poses and publicly declaring our commitment to doing our part in addressing it.\nWe've delivered a climate strategy, in record time:\nHaving declared a climate emergency, we went and created a strategy to start delivering on our commitments.\nThe new HDC Administration delivered, scrutinised and adopted a new, robust and ambitious climate strategy within a year of taking office - a timeline which others said was impossible.\nWe've also launched an action plan to make sure we're constantly monitoring and regularly reporting on our progress.\nWe've kicked off an ongoing Climate Conversation:\nHDC now has an ongoing climate conversation, with regular events, to make sure we're engaging with the public, listening to a wide range of voices in the community and helping them shape our actions.\nThe next climate conversation community event is Saturday 18th November 2023, at Hinchingbrooke Country Park, between 10am and 3:30pm - and everyone's welcome.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-14/content_67.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nThe Liberal Democrats are proud to be champions of the NHS.\nToday is Windrush Day - where we acknowledge the outstanding economic, social, and cultural contribution the Windrush generation have made to the United Kingdom.\nBy-election candidate vows to “fight tirelessly for our local health services”, demanding more GPs and funding for Bedfordshire. Liberal Democrats become bookies favourite to win the by-election after flying start to the campaign.\nThe Conservatives have dropped the new law to crack down on puppy smuggling.\nThe Lib Dem Bill will give an estimated 2.4 million carers across the UK a statutory right to take five days of unpaid leave per year, helping carers to better balance work and care.\nI will keep fighting for the rights of the entire LGBT+ community, until true equality is achieved.\nLiberal Democrats gained 407 councillors and control of 12 councils in England, giving us our best result in decades.\nBritish people are struggling with eye-watering food prices and yet this Conservative Government is refusing to help. Liberal Democrats are putting forward a proper plan to make food cheaper.\nThis is a devastating blow to our country’s environment.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-22/content_39.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nAn in-depth look at how we did in the May elections\nLocal council elections are being held in Scotland, Wales, London and many other parts of England on Thursday 5 May. Find out how, when and where to vote Liberal Democrat:\nLiberal Democrats want a way forward which works for Britain - that cuts down red tape, reduces costs for businesses and makes people better off as a result.\nThis collective outpouring of grief has to be a watershed moment.\nOur health and social care heroes have supported this country in a time of crisis. Now it’s our turn to support them, and tackle the growing mental health crisis in the health and care sector.\nThe Liberal Democrats have today published a comprehensive blueprint for replacing the broken business rates system.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_success-new-cctv-in-huntingdon-to-tackle-anti-social-behaviour/content_35.html": "Success! New CCTV in Huntingdon to tackle anti-social behaviour\nA new deployable CCTV camera has been installed in Huntingdon Town Centre following calls from councillors and businesses.\nHuntingdonshire District Council have installed the new deployable CCTV camera in Huntingdon to help tackle anti-social behaviour in the Town Centre.\nHDC has worked with Huntingdon BID and Hunts Business Against Crime to install the camera, which links directly to a central control room in the town.\nThe District Councillors for Huntingdon East, Nathan Hunt and Jo Harvey, who have both been campaigning for more action against ASB said: “This news is fantastic. We know that people want our town to be safe and that’s why it’s one of our top priorities.\nThe administration at HDC is committed to fighting anti-social behaviour, and we’ll continue to do everything we can.”\nYou can find out more from HDC's press release, available here.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news-1_page-18/content_55.html": "St Neots Eatons report\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nGeoff Seeff reports back, six months after winning the St Neots Eatons by-election\nCambridgeshire County Council have announced improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nKeith Brown writes about ancient (and not so ancient) festivals as ways of creating a more inclusive future\nHuntingdon East Councillors Nathan Hunt and Jo Harvey have called for safety improvements to the Huntingdon Ring Road to protect pedestrians and cyclists.\nLib Dem Geoff Seeff wins the St Neots The Eatons County Council by-election\nCouncillor for Great Paxton ward and Hunts Lib Dems Vice Chair James Catmur shares his experience transitioning to Heat Pump household heating.\nLib Dems set out plan to tackle NHS crisis including recruiting more GPs and allowing pharmacists to prescribe more medicines\nThe government needs to step up efforts to recover billions of pounds in unpaid taxes, instead of asking the public to clean up their mess.\nAmbulance delays for life-threatening calls reached a new record high in December, shocking new NHS figures have revealed.\nThis year there should be jubilant celebrations of the Windrush 75th Anniversary. But instead we hear reports regarding Conservative plans to go back on Wendy Williams' recommendations.\nThe NHS is collapsing in front of our eyes whilst the Prime Minister and Health Secretary are nowhere to be seen.\n\"The New Year is an opportunity to turn the page and look ahead. And although things are tough for millions, I sense change is possible - so I look to the New Year with hope and optimism.\"\n\"From my family to yours: We wish you a Happy Christmas full of peace, joy and love. And hope. For a better future.\"\nWe are deeply concerned that both renters and homeowners could face homelessness during one of the most difficult Winters in living memory.\nToday, Liberal Democrats in the House of Lords are using a rare Parliamentary procedure called a ‘Fatal Motion’ to try to block the new Voter ID regulations.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_page-5/content_2.html": "Ed Davey visits Hunts to help “turf out the Tories”\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nLiberal Democrat leader Ed Davey visited the Offords to support local candidates in the upcoming County Council elections\nCllr Nathan Hunt took to the Great Ouse to help clean the river and call for greater infrastructure investments from water companies\nJo Harvey, Liberal Democrat Huntingdonshire District Councillor, has been awarded the prestigious Grassroots Award 2024 in recognition of her outstanding contributions to the Huntingdon North community.\nSchools in Cambridgeshire are set to be hit with a £14.6m cut to spending power in 2024/25 data from the National Education Union (NEU) reveals\nThe number of patients waiting more than four hours in Cambridgeshire’s A&Es has risen by 88% compared with four years ago\nLabour classes the new constituency of St Neots and Mid Cambridgeshire as a “non-battleground” for the party ahead of the next General Election\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_huntslibdems_org_uk_/https_www_huntslibdems_org_uk_news_article_mark-argent-to-stand-in-huntingdon-constituency-at-general-election/content_40.html": "Mark Argent to stand in Huntingdon Constituency at General Election\nHuntingdon Liberal Democrats have chosen Mark Argent to stand in the next General Election.\nMark is has been involved with Huntingdon Liberal Democrats since the 2019 General Election, where we achieved an 87% increase in our vote, which was well ahead of the national trend.\nSince then, five decades of Conservative control on Huntingdonshire District Council have come to an end. We're looking forward to putting a strong case for Liberal Democrat values in the General and subsequent County and District Council Elections.\nMark's priorities in going to Westminster are:\n-\nsecuring resources for Huntingdonshire to help people struggling to afford places to live and to spread the benefits of the “Cambridge bubble”;\n-\nworking to ensure that the NHS, both locally and nationally, has the resources it needs to meet our physical and mental health needs now and in the future.\n-\nacting on climate change, and building a thriving zero carbon economy; and\n-\nrepairing our fractured relationship with the EU.\nMark is a regular contributor to Liberal Democrat Voice and blogs at markargent.com/blog"
}