{
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_labour-conference/content_52.html": "Labour Conference\n.\n.\nCllr Paul Taylor, attended on behalf of the Lichfield District Council’s Labour group and confirmed our application to join as an associate member of the Co-operative Councils Innovation Network\n.\n.\n.\n.\n.\nCllr Jacob Marshall also attended the conference as the delegate for the Lichfield Constituency Labour Party, which meant he was voting on policy on our behalf. He also attended fringe events about education, the care system, Al and planning/development.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_sorting-out-local-flooding/content_20.html": "Sorting out local flooding\nA great bit of casework from Lichfield City Cllr Jacob Marshall about ongoing flooding for the last couple of years. Let’s hope this means Staffordshire County Council will finally sort this issue.\nJacob commented – It is nice to finally get a result for my constituents, but it’s unfortunate that it has taken a Lichfield Live article to spur the County Council into action on this. For two years, residents have been reporting dangerous flooding on this road, raising ticket after ticket, submitting video evidence of near misses and lobbying county councillors. Hopefully they’ll finally fix it this time. https://lichfieldlive.co.uk/2024/10/29/action-being-taken-to-tackle-long-term-flooding-issue-in-lichfield-county-council-chief-says/",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_special-educational-needs/content_27.html": "Special Educational Needs\nParents and families across the constituency have reached out to our MP, Dave Robertson, to share their experiences of Special Educational Needs and Disability provisions across Staffordshire. Dave joined other MPs across Staffordshire to write to the County Council Leader to highlight the issue and seek a meeting to find a way to improve the provision for vulnerable young people across the county.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_rosemary-lodge/content_60.html": "Rosemary Lodge\nOur Deputy Mayor, Cllr Claire Pinder-Smith had a fabulous afternoon at Rosemary Lodge Residential Home earlier this week. Wonderful to chat to some of the residents, families, staff and volunteers. Even the brief rain didn’t ruin our afternoon!",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield/content_1.html": "Dave Robertson our candidate for Lichfield constituency\nIt is an honour to again be selected as the Labour party candidate for Lichfield constituency. Lichfield has been my home since before I learned to call a place home. I have had the absolute privilege over the last 33 years to learn in our local schools, shop on our local high streets and call many of our neighbours lifelong friends.\nWe are blessed to live in such a beautiful and historic part of our country, with stunning natural environments in places like Chasewater, Admaston, and along the Trent; with amazing architecture in the historic centre of Lichfield and in many of our villages; with the amazing people and communities that call Lichfield, Burntwood and our villages home, and who truly make our constituency all that it is.\nOver the last 14 years, though, we have all seen our local area be let down by successive Conservative governments. The closure of local doctors’ surgeries, police stations and community venues; the lack of investment in our schools and our economy; the absence of any action on sewage spills in our waterways; a total failure to respect and support our high streets; and the worst cost of living crisis in living memory.\nBut it doesn’t have to be this way, we can rebuild and renew the infrastructure we rely on and the bonds between our community. That’s why I’m proud to be standing on a Labour Party platform offering a decade of national renewal, and for a mission led government that will change Britain for the better.\nTogether, on 4th July, we can turn a page on the inaction, sleaze and crisis of the last decade and half, we can vote for change which will get the NHS back on its feet, support our high streets and properly value our natural environment. On 4th July we will all have the power to vote for change and for a brighter, more hopeful future.\nPromoted by Colin Ball on behalf of the Labour Party Lichfield constituency, care of 10 Vale Close, Lichfield, WS13 7LJ",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_call-for-equality-training-for-lichfield-district-councillors-as-soon-as-possible/content_56.html": "Call for Equality Training for Lichfield District Councillors “As Soon As Possible”\nWith the publication of Lichfield District Council’s Equality & Diversity statistics, Our workforce equality, diversity and inclusion data.pdf, the Leader of the Principal Opposition Labour Group has called for greater awareness of equality impacts for Council members.\nCllr Sue Woodward has welcomed the Council’s commitment to addressing Equality and Diversity issues across its workforce but says more needs to be done to ensure members are fully aware of the implications of their decisions.\nThe report states that in December 2022, the Council employed 315 people, of which 129 were female (41% compared to 51% of residents in\nthe district) and 186 were male (59% compared to 49% of residents in the district). Just over 3% of our of the Council’s employees were from black and other ethnic backgrounds (compared to 5% of the district) and of those staff who provided the information 2.7% stated they had a disability (compared to 18% of\nresidents living in the district).\nCllr Woodward said:\n“In terms of the Council workforce, progress is being made to ensure that it reflects the Lichfield District communities that it serves and I welcome this but more still needs to be done on the recruitment of women, black and ethnic minority officers and officers with disabilities. We must not allow the needs of these groups to be overlooked.\nOf more concern to me is that the membership of the Council, the elected councillors, is far less diverse than our communities. This makes it all the more important for councillors to be aware of impacts on the under-represented groups in our communities and in our workforce when we are making decisions.\nI’ve seen far too many examples of inappropriate behaviour and language since the elections. The bias may be unconscious, or not, but it can not be ignored.\nI’ve therefore called on the Leader and Chief Executive to ensure that Equality & Diversity training for councillors will be organised as soon as possible, that it should be made compulsory for all members and that direct advice should be given to members who are felt to have crossed certain lines. I’ve had positive responses from the Council Leader and Chief Executive but now want this to happen as soon as possible.”",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_a-safer-community/content_43.html": "A Safer Community\nUnder the Conservatives, Ministers and Police and Crime Commissioners police numbers have reduced and now we are 4th from bottom with 161 officers per 1000,00 population compared to say neighbouring Leicestershire with 204 per 100,00. In addition, the force is in “Special Measures”. Our local PCSOs need all the help they can get, and we will give it to them.\nWork with our communities and partners to reduce anti-social behaviour.\nWe help to ensure residents, visitors and those working in the area do not suffer any form of harassment, alarm or distress caused by others who behave in an anti-social and nuisance manner. If necessary, the Council can issue a Community Protection Warnings and Notices. We will take action whether it is litter, flytipping, graffiti or threatening behaviour.\nInvest in activities for our young people.\nThe County Council cut the Youth Service some years ago, but we will try to find activities for our young residents so that they are safe at night.\nImprove and update CCTV schemes where anti-social behaviour is a problem.\nCCTV is an excellent deterrent for crime and anti-social behaviour, as long as they are switched on, and using the latest technology. We will have a programme of reviewing the schemes we have seek to add others where needed.\nHelp our local residents to make our streets safer.\nWe need to hear what issues residents have in their own streets. We want to hear from young people as well as our older residents on what they think would make them feel safer.\nWork with police and local communities to reverse the amount of car crime in our area.\nWe will work in partnership with our local Police and Police and Community Support Officers to have meaningful strategies to reduce the increase in car crimes in our district. It is vital that we try to make up for the cuts in Police numbers we have seen in Staffordshire under the Government since 2010.\n- Fairer and More Prosperous Economy\n- A Greener Future\n- A Safer Community\n- A Healthier District\n- A Great Place to Live",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_labour-say-that-the-demolition-of-the-multistorey-provide-a-chance-to-solve-some-of-the-issue-caused-by-pedestrianisation/content_80.html": "Labour say that the demolition of the multistorey provide a chance to solve some of the issue caused by pedestrianisation.\nPic: Google Streeview – The Birmingham Road multi-storey car park.\nLichfield District Council has proposed demolishing the multistorey to get the redevelopment to finally restart the Friarsgate project which fell apart in 2018. The council is also planning for a “meanwhile use” for the land once the demolition has taken place which would see the area freed up used as an outdoor theatre and cinema, in addition to food and retail stalls.\nBut Cllr Colin Ball and Cllr Dave Robertson warned that the cabinet risked missing a chance to solve some of the issues caused by pedestrianisation by not seeing the car park as part of the wider City Centre.\nCllr Dave Robertson, deputy leader of the Labour Group, said “Just because the site is part of the Friarsgate area doesn’t mean you can forget everything else. We needed a plan for the car park, but we should really be using this space to fix some of the problems that the council has caused with their bungled implementation of pedestrianisation. There’s a chance here to create some disabled parking spaces and to find a way to connect them to the new cinema and the Three Spires shopping centre. The ‘meanwhile use’ suggested by the council seems to be a plan to create another market square 250 yards way from the one we already have.”\nCllr Colin Ball, shadow cabinet member for A Great Place to Live, said that while it was good to see progress on the redevelopment, the council could not afford to focus solely on that scheme. “I am very glad that something is finally happening with the redevelopment of the city centre and particularly with the car park – we’ve already waited too long for the development to happen and this will hopefully bring it forward faster. But that alone isn’t good enough. Why not think about different parts of the city centre can support each other and think about how some blue badge bays here would benefit the businesses at that end of Lichfield?”",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_working-with-citizens-advice/content_55.html": "Working with Citizens Advice\nA great partnership between our MP and citizens advice, to help residents in Lichfield, Burntwood and the Villages the support they need. Please get in touch with Dave Robertson MP to book in for this support. https://lichfieldlive.co.uk/2024/10/19/new-drive-to-make-sure-local-residents-are-receiving-support-they-are-eligible-for/?utm_content=buffercaf2b&utm_medium=social&utm_source=facebook.com&utm_campaign=buffer",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_many-opportunities-ahead-says-labour-group-leader-in-response-to-lib-dems/content_78.html": "“Many opportunities ahead”, Says Labour Group Leader in Response to Lib Dems\nResponding to a statement by Lib Dem Group Leader at Lichfield District Council, the Leader of the largest Opposition Labour Group Cllr Sue Woodward said:\n“I think Cllr Ray has proved my point for me.\nLet me explain this really clearly and simply to him and to others accusing me and my Labour Group of missing an opportunity to seize control, of staying on the side-lines or of some sort of moral cowardice.\nThe electorate in Lichfield District have voted for change, the sort of change I‘ve longed for in the 24 years that Labour has been in opposition here. No longer do the Conservatives have a majority of 21 as they did at the last election; they have no overall majority at all. This opens up many opportunities ahead for other voices to be heard especially the voices of residents who have not been listened to in the past.\nHowever, the reality is that Lichfield District electors, in spite of what a Conservative Government have thrown at them, still voted for more Conservatives councillors than Labour or Lib Dem councillors: 23 Conservatives, 17 Labour and 7 Lib Dems. I may not like it, I certainly wish it had been different but that is the reality.\nIf we had gone into some sort of pact, that would have given a majority of one for a Labour/Lib Dem administration. That would mean that every single Labour and Lib Dem councillor would have to attend every single meeting of the Council to take decisions forward – and electors should take a look at the attendance records up to now of some of the key people in this debate.\nThat would lead to instability and uncertainty and a lack of progress on subjects which electors have been crying out for – leisure facilities in Lichfield, the promised cinema, action on the pile of rubble that is Friarsgate but also on real investment in my town of Burntwood, in Fazeley and in the rural villages which all appear to be invisible to the Lib Dem Group.\nI firmly believe that there are many more opportunities now for all voices to be heard and that is what I am hearing from the current Conservative leadership. If Labour and the Lib Dems don’t like a proposal from the Conservatives or they don’t come up with a budget that spreads the Council’s resources more fairly, then we can vote against it. At last, it gives a look-in to long-neglected areas and issues such as climate change.\nThis is a time for cool, calm heads and a focus on residents’ priorities rather than what might seem on the surface to be quick and easy fixes. Cllr Ray and his colleagues need to compose themselves, think this through in a far less heated way and remember that Labour will keep this constantly under review, not just in a knee-jerk less than a week after the elections but for the four years ahead.”",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_july-6th-2024-thank-you-to-all-who-voted-labour/content_45.html": "Thank you to all who voted Labour\nSo many people in Lichfield were motivated to vote Labour that our Constituency recorded one of the highest swings in the country. We are so grateful to the volunteers who distributed leaflets, who went out and door knocked and provided the social media feeds that have given us such a great Labour result.\nBut the biggest thanks goes to every single person who voted Labour on July 4th. It is a clear mandate for change. Dave Robertson will go as Lichfield’s MP to London ready to face the tough decisions that need to be made. It is up to us to sort out the chaos in our services and the financial mess created over the last 14 years. The process of change starts now.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_lichfield-and-burntwood-schools-benefit-from-labour/content_49.html": "Lichfield and Burntwood Schools Benefit from Labour\nThree local schools are in the first wave to benefit from new Labour funding to boost early years childcare.\nLabour’s candidates for the County Council Elections –\nDarren Ennis, Burntwood South welcomes funding for Springhill Primary Academy\nJane Smith, Burntwood North welcomes funding for Boney Hay Primary Academy\nBen Watkins, Lichfield Rural North welcomes funding for St Stephens Primary School in Fradley.\nLabour promised it – Labour delivered it!",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_period-power-in-lichfield/content_65.html": "Home » Period Power – in Lichfield\nGreat to be announced as a #PeriodDignity *city*, thanks to the work of our District and City Cllr Rosie Harvey-Coggins! – with Period Power.\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_mission-driven-government/content_71.html": "Mission-driven government\nAfter 13 years of the Tories, nothing in this country seems to work anymore.\nFive Tory Prime Ministers and what has our country got to show for it?\nPrices going through the roof, longer hospital waiting lists and crime on the rise.\nLast week, Keir Starmer set out how the next Labour government will be driven by five missions that will give Britain its future back.\nThousands of supporters have shown us that they’re backing our plan to build a better Britain by chipping into our fund to beat the Tories in the next general election.\nKeir Starmer’s five missions for a better Britain:\n- Secure the highest sustained growth in the G7\n- Build an NHS fit for the future\n- Make Britain’s streets safe\n- Breakdown the barriers to opportunity at every stage\n- Make Britain a clean energy superpower\nThe choice at the next election couldn’t be more clear.\nRishi Sunak is too weak to lead.\nHow can he get a grip on the country when he can’t get a grip on his own party?\nJust look at his Home Secretary, who he rehired after breaking security rules. His former Chair of the Tory Party, who failed to pay millions in tax. And his Deputy Prime Minister, up to his neck in bullying allegations.\nBritain deserves better.\nThe next Labour government, with Keir Starmer as Prime Minister, will restore Britain’s hope and deliver on the change our country needs.\nHelp us make it happen.\nThank you,\nTeam Labour",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_shocking-waste-dump/content_24.html": "Shocking Waste Dump\nThe scale of the waste dumped on Watery Lane on was staggering.\nYour Labour MP, Dave Robertson, was shocked by the scale when he visited the site on the morning it was discovered. He has raised the matter in the House of Commons and has made the following comment\n“This was not a few tyres out the back of a transit van,” Mr Robertson said.\n“This was an industrial scale, enormous fly-tip, which meant that the lane was completely unpassable from the north.”\nThe risk to residents and the loss of trading for commercial premises near the site is significant and Dave will be following up the matter to ensure that the illegal dumpers are caught and brought to justice.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_back-to-school-uniform-bank/content_36.html": "Back to School Uniform bank\nLichfield City Council’s Back to School uniform bank. Thank you to everyone who donated uniform, and Tesco for letting us have our donation station in your store. And thank you to all of the city councillors, our sheriff, the civic officers and our members for helping run the days. We’ve helped so many families this year with the expensive cost of uniform, and saved lots of uniform from landfill by finding it a new home.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_imprint/content_7.html": "Imprint\nWebsite Promotion\nWebsite Promoted by James Blackman on behalf of the Labour Party Lichfield, Burntwood & Rural Areas, care of 27 Gilbert Road, Lichfield, WS13 6AR\nCandidates Imprints\nJames Blackman:\nPromoted by David Robinson on behalf of James Blackman of the Labour Party Lichfield, Burntwood & Rural Areas, care of 27 Gilbert Road, Lichfield, WS13 6AR\nPaul Taylor:\nPromoted by Di Evans of 74 Chorley Road, Burntwood, WS7 2NX on behalf of Paul Taylor of 42 Princess Street, Burntwood, WS7 1JN.\nDi Evans:\nPromoted by Di Evans of 74 Chorley Road, Burntwood, WS7 2NX.\nMartin Shortman:\nPromoted by Steve Norman of 77 Ironstone Rd, Chase Terrace. Burntwood , WS7 1LZ.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk/content_8.html": "For a long time Lichfield, Burntwood and the Villages have had Tory control at the Constituency, County, District and City/Town Council level. The Tories have ignored the sense of Labour’s ideas and have implemented privatisation and cut backs to the detriment of us all – think of the privatised potholes!\nIn 2023 voters gave us a chance to improve the District – we won enough seats for there to be no overall control. But do not have the power to bring in our proposals. However gaining control of Burntwood Town Council and Lichfield City Council means we are making changes at the grass roots level.\nIn 2024 after a tremendous effort from many local volunteers and an excellent campaign from our candidate Dave Robertson, we finally have a Labour MP representing us in Parliament\nHowever we cannot rest there – our focus is now on the County Council elections in May where we need to ensure that Labour’s voices are clearly\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_labour-leader-at-lichfield-district-council-introduces-front-bench-team/content_83.html": "Labour Leader at Lichfield District Council Introduces Front-Bench Team\nFollowing recent elections which saw the Labour Party increase their number of councillors by seven, the Leader of the Labour Group at Lichfield District Council has announced her Shadow Cabinet.\nCllr Sue Woodward said:\n“There is a real opportunity now for Labour councillors to influence decision-making far more than has been possible in the past 24 years and we want to make sure that the communities we represent are listened to as well.\nThere is amazing strength and depth of skills and experience across the Labour Group. I’m proud to lead such a capable and committed Group.”\nAlong with Deputy Leader, Cllr Dave Robertson, the Labour front bench will lead on the themes of their Labour 2023 manifesto as follows:\n- A Fair & Prosperous District – Cllr Darren Ennis\n- A Greener District – Cllr Paul Taylor\n- A Safer District – Cllr Di Evans\n- A Healthier District – Cllr Claire Booker\n- Place-making across the District – Cllr Colin Ball\nCllr Woodward added:\n“We are waiting to hear the final details of Conservative Cabinet appointments but, rather than shadowing an individual portfolio holder, we are intending to take a more thematic, cross-cutting approach to services and decision-making across the Council as a whole.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_focus-on-best-outcomes-for-ldc-residents-not-political-stirch-ups-opposition-leader-on-talk-of-pacts/content_79.html": "Focus on best outcomes for LDC residents, not political stirch-ups – Opposition Leader on Talk of Pacts\nResponding to questions about whether a pact with the Lib Dem to take over control of Lichfield District Council was being considered , the newly-elected Leader of the Labour Group Cllr Sue Woodward has said\n“First of all, I want to say many thanks to the electors of Chase Terrace who put their faith in me and Steve to represent them for the next four years. We will not let you down.\nHaving been elected as my Labour Group’s Leader on Saturday, I made it clear to my colleagues that I want us all to focus on getting the best outcomes for our residents and not political stitch-ups behind closed doors. People have had enough of ding-dong politics and I want to cooperate with the majority Group at the Council as far as possible, as well as the Lib Dems, in focusing all our efforts on making the best possible decisions on behalf of our communities. It’s time for grown-up politics now.\nIf anyone thinks that I’ve gone soft on the Conservatives, they can think again. I will challenge them every step of the way. Over the 24 years that they have been in control, they have made many half-promises about supporting some of Labour’s local priorities which were not honoured. That cannot and will not be the case anymore – they will have to get support from outside their group at council meetings.”\nOutgoing Opposition Leader, Cllr Steve Norman, said:\n“Sue has one of the sharpest political brains and is the most hardworking, caring and co-operative councillor I know. ‘So what attracted you to the hardworking Labour activist Sue Woodward?’ Mrs Merton could have asked me in 1994.\nIf we want a ‘Better Council’ then we should see if this approach works for 12 months, I hope and believe it will, but it will take all members of all three parties to play their part.”",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_about-us_a-safer-community/content_6.html": "A Safer Community\nUnder the Conservatives, Ministers and Police and Crime Commissioners police numbers have reduced and now we are 4th from bottom with 161 officers per 1000,00 population compared to say neighbouring Leicestershire with 204 per 100,00. In addition, the force is in “Special Measures”. Our local PCSOs need all the help they can get, and we will give it to them.\nWork with our communities and partners to reduce anti-social behaviour.\nWe help to ensure residents, visitors and those working in the area do not suffer any form of harassment, alarm or distress caused by others who behave in an anti-social and nuisance manner. If necessary, the Council can issue a Community Protection Warnings and Notices. We will take action whether it is litter, flytipping, graffiti or threatening behaviour.\nInvest in activities for our young people.\nThe County Council cut the Youth Service some years ago, but we will try to find activities for our young residents so that they are safe at night.\nImprove and update CCTV schemes where anti-social behaviour is a problem.\nCCTV is an excellent deterrent for crime and anti-social behaviour, as long as they are switched on, and using the latest technology. We will have a programme of reviewing the schemes we have seek to add others where needed.\nHelp our local residents to make our streets safer.\nWe need to hear what issues residents have in their own streets. We want to hear from young people as well as our older residents on what they think would make them feel safer.\nWork with police and local communities to reverse the amount of car crime in our area.\nWe will work in partnership with our local Police and Police and Community Support Officers to have meaningful strategies to reduce the increase in car crimes in our district. It is vital that we try to make up for the cuts in Police numbers we have seen in Staffordshire under the Government since 2010.\n- Fairer and More Prosperous Economy\n- A Greener Future\n- A Safer Community\n- A Healthier District\n- A Great Place to Live",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_areas/content_2.html": "Join\nGet Involved\nDonate\nLabour Party Lichfield, Burntwood & The Villages\nAreas\nBurntwood Labour Party\nLichfield Rural North\nChasetown Ward\nLabour's Missions\nA Great Place to Live\nA Healthier District\nEconomic Growth\nA Safer Community\nA Greener Future\nPhoto Id Registration\nNews\nEvents\nContact us\nHome\n»\nAreas\nAreas\nFollow on social media\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_keir-starmer-visited-staffordshire/content_62.html": "Keir Starmer visited Staffordshire to lay out Labour’s stance on crime.\nI was honoured to be invited to be in the audience as first, Yvette Cooper MP, Labour’s Shadow Home Secretary set out some of the shocking crime figures, particularly figures relating to rape and sexual violence against women and girls: a truly appalling figure of 1.3% of rape cases are prosecuted and yet around 300 women in this country are raped every day, every single day.\nHow on earth did we, as a supposedly civilised country, get here?\nThe simple answer is 13 years of Tory Government. Their choice to cut public services while giving tax breaks to the rich isn’t without consequences for police, health services, education, youth provision, early support interventions and much more.\nKeir set out clearly and confidently his four goals to make Britain safer:\n- restoring public confidence in every police force\n- halving the incidents of knife crime,\n- reversing the downward trend in the proportion of crimes solved and\n- halving the levels of violence against women and girls.\nStraightforward, but by no means easy to achieve. What he did show, however, was his absolute determination to focus on crime.\nFighting crime is a Labour cause\nAs he said, “Fighting crime is a Labour cause,” because it is ordinary hardworking families who suffer most from what some call low-level crime – and he dismissed that term completely saying:\n“Whatever the crime: anti-social behaviour, hate crime, serious violence, it’s always working people who pay the heaviest price. Working class communities who have to live under its shadow. That’s why tackling crime – law and order – will always be so important for my Labour Party.”\nOne particular comment resonated with me. Keir said, “Cleaner streets make safer streets.” It’s called the broken windows theory where visible signs of decay, vandalism and even the smell of cannabis depresses people’s pride in their area, giving the impression that no-one cares.\nLabour does care, and in Burntwood and across the District we have worked hard to ensure we grow civic pride through caring for our communities.\nThe Burntwood Response and Repair Team, BuRRT,\nIntroduced by Labour-controlled Burntwood Town Council is a case in point. If we wait for the District or County Councils to carry out minor repair jobs, we’ll wait for a very long time. It’s the same with CCTV in The Dimbles, lobbied for by Labour Councillors (though let down in part by Conservatives at Lichfield District Council).\nBoth the timing and the venue for this important announcement were significant. It came the day after Dame Louise Casey’s damning report on the Metropolitan Police was published. And it was made in a County where our Police Force is in special measures. The effect on police morale is devastating and yet the Home Secretary and the Conservative Police, Fire & Crime Commissioner here fail to act or take any responsibility. They also completely fail to acknowledge that their years of economic decline and austerity cuts have anything to do with the current state of policing here.\nStaffordshire has seen one of the biggest drops in police officer numbers since 2010 in the whole of England and Wales, from 2161 to 1595 last September. As in other public services, police officers are asked to do more and more with fewer and fewer people.\nThat’s where confidence, both within the police and among the general public, starts to break down. Labour will reverse those trends and Keir was in bullish mood about this subject, motivated by his experience and so close to his heart.\nAuthor: Sue Woodward",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_councillors-create-new-food-security-champion-to-help-tackle-hunger-in-lichfield/content_81.html": "Councillors create new “food security champion” to help tackle hunger in Lichfield.\nAfter a letter was sent to all candidates by Lichfield Foodbank during the local elections calling on all levels of government to deliver an action plan on the issue, the Labour group at Lichfield District Council has now submitted a motion for members to take the first steps on that path.\nCllr Sue Woodward, who leads the principal minority group, said:\n“The cost of living crisis has hit every household in Lichfield district, none more so than those who are struggling to meet their food bills. The work by food banks and other voluntary organisations is so very important and is to be commended – but we all hope that food poverty will soon be a thing of the past. The motion we are putting to council is a first step along this path.”\nThe motion proposed four key actions:\n- Appoint a Food Justice Champion who will lead at Lichfield District Council on tackling food poverty locally\n- Map and promote sources of assistance across the district,\n- Set up and support a food partnership to bring together partners with a mutual interest in addressing food insecurity.\n- Develop an action plan to address food insecurity across the district.\nCllr Woodward said:\n“I don’t doubt that candidates were supportive of the principles behind the Lichfield Foodbank letter, but now we need practical steps put in place. We also need to bring together all of the organisations working on food injustice and to see councillors driving this forward. At present, someone in need may not know where to go and I’ve learnt a lot over the past few weeks about just how many volunteer groups are out there offering help. I hope this motion will receive cross-party and public support and that we can make some real progress across the whole district.”\nThe motion was unanimously supported at meeting of the council on 11th July.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_lichfield-labour-announces-candidates-for-county-council-elections/content_5.html": "Lichfield Labour announces candidates for County Council Elections\nThe County Council elections on 1st May have a greater significance than normal. It is important for the scale of expenditure (the County Council spends 3/4th of a billion delivering services), and the Tories have had control there for 16 years. What have they done with those 16 years? Driven services into the ground- an almost entirely privatised children’s care home system, a dysfunctional SEND process and moon crater roads.\nBut this year as we head towards Unitary Authority Status the selection of County Council Members will have a bit affect on the type of Unitary Authority. Whether it is one that continues the failed policy of outsourcing all experience and skill, or a Labour one focused on providing services for residents.\nLabour introduced our Candidates at its Launch Event, with support from the West Bromwich Labour group. Wishing Kate Greening, Jacob Marshall and Ben Watkins well for a hectic campaign.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_news_page_4/content_37.html": "Our Deputy Mayor, MP and former Mayor, at the Lichfield Pride March today. What an excellent event, thank you so\nWednesday 10th July: Congratulations to Dave Roberston MP, who was sworn into Parliament on his birthday no less!Such a wonderful\nSo many people helped Labour get out its message during the long and memorable election campaign. Many were able to\nSo many people in Lichfield were motivated to vote Labour that our Constituency recorded one of the highest swings in\nFor those of us who support Labour, for those of us that simply wanted a change, we won. In the\nIt is an honour to again be selected as the Labour party candidate for Lichfield constituency. Lichfield has been my\nLabour Opposition at Lichfield District Council Reviews Its First 100 Days – and Plans for Future Labour Opposition councillors at\nWith the publication of Lichfield District Council’s Equality & Diversity statistics, Our workforce equality, diversity and inclusion data.pdf, the Leader of the Principal\nThe Mayor of Lichfield is ditching an outdated civic event in favour of supporting a project helping families struggling with\nLichfield City Council established a Climate Change and Biodiversity Committee at its meeting of 24 July. The Committee, an initiative\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_liz-stamatelatos-and-hannah-jell-for-curborough/content_48.html": "Liz Stamatelatos and Hannah Jell for Curborough\nOur candidates for the the Curborough by-elections are Hannah Jell for Lichfield City Council and\nLiz Stamatelatos for Lichfield District Council.\nHannah and Liz both work in healthcare. We all recall how we applauded the healthcare workers during the pandemic, and now we should listen to what they have to say about our Community.\nHannah and Liz are passionate about listening to people, solving the problems that trouble them, and doing what they can to help others. They will put those skills to use if elected in Curborough on May 1st.\nPlease do vote for Liz and Hannah, and Vote Labour – the only party that has the healthcare sector at it’s heart.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_about-us_a-great-place-to-live/content_31.html": "A Great Place to Live\nPeople need homes and help and support to get a home, but we also need to get the balance right when it comes to development. We need encourage the right quality development along with the infrastructure that is needed.\nWe want to nurture our home-grown talent and celebrate our heritage. We must also not leave any community behind because it doesn’t matter where you live in the district, we want you to help us make a great place to live.\nEncourage protection for renters, and support people aspiring to own their own home.\nPeople who rent need the advice about their rights so they can feel secure in their own home. We will work with advice organisations and residents to make them aware of their rights. Affordable housing is the term used in planning, but many developers try to find ways around the number of such properties they are obliged to build. We will help our residents – and those who want to move here get the best support available to us.\nSupport development that meets the needs of local people.\nWe know we get no support from the district’s MPs over the amount of housing that is allocated to us and there is limited power over design of developments. We will learn from other authorities and best practice to seek to get the kind of development that fits local needs rather than speculative development – especially where the Green Belt is threatened.\nPromote arts, culture and our rich and diverse heritage throughout the district.\nLichfield District is rich in cultural and industrial heritage. Of course, we have the Cathedral and the National Memorial Arboretum, but we also have our mining history. There are also forgotten stories like that of Britain’s first black school teacher Labour also believes we have a lot of cultural talent, whether music groups, singers, dancers, or visual artists that would benefit from support from the council.\nWe will work harder to involve the community to help us make better informed decisions.\nPoor quality consultations leave people feeling ignored and prevent the council from acting on their concerns – like we’ve seen recently with City Centre pedestrianisation. We will make it clear what the purpose of consulting is and hold public meetings so that we can hear each other. To make better decisions for residents we need to know their aspirations, hopes – and complaints. Labour will listen to people.\nEnsure schemes like discretionary housing payments and local council tax support reach the people that they need to.\nThe cost-of-living crisis is indeed a crisis for many of our vulnerable neighbours and the help that is available must be provided to the best our ability to ensure the most needed get the help they need. We will carry out a review of the current schemes to ensure that targeted support is there and all the help that can be provided is provided.\n- Fairer and More Prosperous Economy\n- A Greener Future\n- A Safer Community\n- A Healthier District\n- A Great Place to Live",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_curborough-community-centre-30th/content_50.html": "Curborough Community Centre 30th!\nCurborough Community Centre’s 30th Birthday Community Party – A great day today at Curborough Community Centre’s 30th birthday party, helped by our councillors, members and MP Dave Robertson.\nCurborough Community Centre’s 30th Birthday Community Party – A great day today at Curborough Community Centre’s 30th birthday party, helped by our councillors, members and MP Dave Robertson.\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_thank-you-west-bromwich-labour/content_17.html": "Thank you West Bromwich Labour\nA great team of Labour Party Members from West Bromwich (together with their and our MP!) came to Lichfield to help us with Canvassing for the County Council Elections on May 1st.\nReally wonderful to have their support! Thanks you!",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_a-little-labour-celebration/content_72.html": "A Little Labour Celebration\nSo many people helped Labour get out its message during the long and memorable election campaign.\nMany were able to join a bring and share picnic to celebrate Dave Robertson’s win, and the happy mood was not damped by the English summer weather.\nMany thanks to the George and Dragon for allowing us to use their garden (and buy their excellent beers!)",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_labour-opposition-at-lichfield-district-council-reviews-its-first-100-days/content_14.html": "Labour Opposition at Lichfield District Council Reviews Its First 100 Days\nLabour Opposition at Lichfield District Council Reviews Its First 100 Days – and Plans for Future\nLabour Opposition councillors at Lichfield District hailed their recent Away Day a success and a clear signal that Labour is making real changes at the Council. After the 100 Days marker since the elections, Labour now seeks to build on the changes they’ve brought about so far\nThe session was held at Chasewater Innovation Centre and Labour Group Chair, Cllr Colin Ball, said:\n“I came away from our session feeling really buoyed up, not just by the work we have done so far but, given the depth and breadth of the skills and knowledge of our members, the potential we have to make a real difference to the lives of local residents. There was a great deal of enthusiasm in the room and a clear consensus about our strategies in the months ahead. If any of the Conservatives haven’t yet realised that things have changed at the Council, and will continue to change, they need to wake up very quickly.”\nPrincipal Opposition Leader, Cllr Sue Woodward, said:\n“I’m certainly proud to lead the Labour Opposition and we have notched up some real successes in our first 100 Days. We have a very capable and committed Shadow Cabinet, which has been recognised by the Council Leadership. Labour members have been active in scrutinising proposals by the Cabinet including volunteering for Task Groups that are able to scrutinise in detail proposals on Pedestrianisation, the new Leisure Centre, Climate Change and the City Centre Masterplan.\nWe have taken through our Food Insecurity motion with unanimous support and will now be making progress on mapping sources of help and bringing together a partnership of organisations supporting food injustice. Whether it is Full Council meetings, Committee Meetings or briefings and training sessions, Labour members, new and old, are far more engaged than Conservative backbench members and it’s great to be able to lead such an effective team.\nThere’s a lot more to be done though. The culture of the organisation is changing and we want to work with all parties to achieve a better council but too many still think of Lichfield District Council as it was previously, an almost one-party state. With additional members now, we are certainly making our presence felt.”\nFollowing May’s local elections, Labour now holds 17 seats and the Conservatives hold 23. With the Lib Dems holding 7 seats, the Conservatives are the biggest political Group but no longer have an overall majority.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_another-successful-back-to-school-event/content_35.html": "Another Successful Back to School Event\nAfter the success of the Back to School Uniform Event in the Guildroom’s, we held a second event at the Social Club, and one alongside the food bank. Our final event has been at Curborough Community Centre. Thanks to all the volunteers who collected uniforms. To those who checked and washed them. To those who stored them, set them out and helped with finding the right sizes. Thanks also to everyone who came to collect a uniform and saved the world’s resources by reducing waste and making good use of good clothing. Brilliant!",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_labour-wins-in-lichfield-constituency/content_32.html": "Labour Wins in Lichfield Constituency\nFor those of us who support Labour, for those of us that simply wanted a change, we won.\nIn the early hours of 5th July 2024 Dave Robertson was elected the MP for Lichfield and made his acceptance speech at the Burntwood Sports Centre.\nThank you to all the election officials and counters who brought us such a quick result. Thank you to everyone who voted Labour. A wonderful night for us all!",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_news_page_3/content_25.html": ". . Cllr Paul Taylor, attended on behalf of the Lichfield District Council’s Labour group and confirmed our application to\nAfter the success of the Back to School Uniform Event in the Guildroom’s, we held a second event at the\nCllr Paula Knight and Cllr Ann Hughes had a great day today at the Lichfield City Council’s Community day today.\nLichfield City Council’s Back to School uniform bank. Thank you to everyone who donated uniform, and Tesco for letting us\nGreat to be announced as a #PeriodDignity *city*, thanks to the work of our District and City Cllr Rosie Harvey-Coggins!\nCllr James Blackman and Dave Robertson MP attended the welcome home event last Friday for Sophie Capewell, to congratulate her\nThe Deputy Mayor Cllr Claire Pinder-Smith, Chair of the District Council Cllr Ann Hughes and Cllr Sharon Taylor visited the\nOur Deputy Mayor, Cllr Claire Pinder-Smith had a fabulous afternoon at Rosemary Lodge Residential Home earlier this week. Wonderful to\nCurborough Community Centre’s 30th Birthday Community Party – A great day today at Curborough Community Centre’s 30th birthday party, helped\nGreat to see the new leader Cllr Rosie Harvey-Coggins and deputy Cllr Jacob Marshall being selected to lead Lichfield City\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_opposition-call-for-lichfield-district-council-to-share-friarsgate-plans-with-public/content_74.html": "Opposition Call For Lichfield District Council to Share “Friarsgate” Plans With Public\nThe long-running saga of the plans for Friarsgate, impacting the whole of Lichfield City Centre, now needs full public disclosure and explanation, says the Principal Opposition Group at Lichfield District Council.\nLabour councillors are calling upon the leadership at the Council to share the overall plan for the now-renamed Birmingham Road Site and associated proposals such as the cinema plans for the former Debenhams store.\nLabour Opposition Leader at the Council, Cllr Sue Woodward, said:\n“At present, we are getting only piecemeal information about what is being proposed, some confidential and some not, and it’s time now for all District councillors and, more importantly, the public we represent to be given a clear overview of how the various pieces of the jigsaw puzzle fit together. I have now written formally to the Council Leader and Chief Executive to ask that this happens as soon as possible for the sake of transparency and accountability.”\nCllr Dave Robertson, Deputy Opposition Leader and City Councillor said:\n“We’ve all already waited far too long for this development to come forward. It’s almost 20 years since the Council first discussed this and the public deserve to see the plans for our City. After the bungled pedestrianisation of the Market Square this plan must include adequate car parking for people with disabilities. I have already put forward some suggestions for a more appropriate ‘meanwhile use’ which I hope will bear fruit.”\nCllr Colin Ball has been chairing a task group on proposals for the Birmingham Road Site and the wider city centre strategy for several years. He said:\n“I’m certainly pleased to see things moving forward as a lot of time and effort has been put in behind the scenes on the best ways forward. I certainly want to see full disclosure now. This doesn’t mean a free pass for the LDC leadership. In fact, I have certain red lines that I have shared with them around infrastructure and appropriate housing but it’s time for the overall plans to be made public.”",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_out-and-about-in-lichfield/content_58.html": "Out and About in Lichfield\nGreat day today with some of the Labour4Lichfield team, having a chat with Lichfield residents on the doors about local issues. If there are any issues that either a city or district councillor, or your MP can help with, please get in touch!\nWell done to Jacob, Dave (MP), Kate and Liz!",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_our-new-labour-mp-was-sworn-into-parliament/content_59.html": "Our new Labour MP was Sworn into Parliament\nWednesday 10th July: Congratulations to Dave Roberston MP, who was sworn into Parliament on his birthday no less!\nSuch a wonderful feeling to have a Labour MP in Lichfield, Burntwood and the rural villages. We know that you will serve your constituents well Dave!",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_the-pothole-challenge/content_23.html": "The Pothole Challenge\nThank you to all the very large number of Labour supporters who went out on Saturday 18th January to find and report potholes throughout the Burntwood and Lichfield region. Wow, did we find some!\nPotholes are almost always a matter for the County Council. In Staffordshire the Tory County Council has outsourced the pot hole repair work, and many would say it has not been a great success. The new Labour government has provided ring fenced funding to repair potholes so we are beginning to see a difference with many repairs taking place. However years of neglect means that there is still an awful lot to do.\nEverywhere our volunteers went they found holes, and reported them. Our task now is to see how many are repaired within the next few weeks.\nIt is nice that some of the Conservative Councillors clearly felt we had touched a nerve as they rushed out to find holes that they claimed that they had filled. Nice try – but we know how many have not been filled!\nWe have the County Council Elections in May – we need every Labour vote that we can to stop the madness that has been the outsourcing of so many skills from County Hall. Please do volunteer to help Labour get the best result possible.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_ben-watkins-labour-candidate-for-lichfield-rural-north/content_34.html": "Ben Watkins Labour Candidate for Lichfield Rural North\nBen Watkins is a strong advocate for Lichfield Rural north, comprising of Boley Park, Fradley and Streethay. Ben lives in Boley Park and understands the structure and workings of Councils. He is employed in Data Analysis within Walsall Council, specialising in Education and Social Care.\nBen has been a City Councillor for two years and has helped the citizens of Staffordshire in countless ways. He works very hard on many areas that are at the heart of Labour’s agenda.\nHe is passionate about Education and particularly SEND Provision – an area that is a key part of his work.\nHe is a keen cyclist and will campaign to provide safer routes to schools and to the shops. His objective is that we all have the opportunity to choose whether to take the car – or cycle safely. As a cyclist he is acutely aware of how much work needs doing to reduce the potholes!\nHealth care and information about healthcare is also a primary interest. Helping to spread the message about how to remain in good health, and how to improve the health prospects of the next generation, is very important to him.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_news_page_2/content_9.html": "The scale of the waste dumped on Watery Lane on was staggering. Your Labour MP, Dave Robertson, was shocked by\nThank you to all the very large number of Labour supporters who went out on Saturday 18th January to find\nA great bit of casework from Lichfield City Cllr Jacob Marshall about ongoing flooding for the last couple of years.\nA great partnership between our MP and citizens advice, to help residents in Lichfield, Burntwood and the Villages the support\nIt’s great to support community projects in Lichfield as part of the grants committee at Lichfield City Council. At the\nParents and families across the constituency have reached out to our MP, Dave Robertson, to share their experiences of Special\nThank you to the lovely people of Morley Road in #Burntwood for the warm reception on the doorstep this lunchtime.\nGreat day today with some of the Labour4Lichfield team, having a chat with Lichfield residents on the doors about local\nCllr Russ Bragger was at Lichfield Markets last Friday, talking to market stall holders about the running of the markets,\nA great Councillors’ surgery today with Cllr Jacob Marshall, Cllr Matt Field and Cllr Colin Ball. Please get in touch\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_team/content_33.html": "Your Local Team\nPlease find links to your local Labour Councillors by Burntwood Council, Lichfield District & City Councils\nLichfield Executive\n- Chair: Andrew Fox\n- Secretary: Ed Strain\n- Vice Chair: Rosie Harvey-Coggins\n- Treasurer: Ben Watkins\n- Women’s Officer: Katie Farelly.\n- Social Media Officer: James Blackman\n- Other members: Cathy Wood, Dave Robertson and Ann Hughes.\nElection of two auditors and an observer for Lichfield City Council Labour City Council.\n- Auditor: Jacob Marshall\n- Observer for the city council group: Jane Middleton\nElection of Delegates to Constituency Labour Party\n- Paula Knight\n- Rosie Harvey-Coggins\n- Ann Hughes\n- Cathy Wood\n- Hannah Jell\n- Claire Pinder-Smith\n- Katie Farelly\n- Ben Watkins\n- Jeyan Anketell\n- James Blackman\n- Colin Ball\n- Dave Robertson\n- Ed Strain (ex-officio, Branch Secretary)",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_labour-candidates-champion-neurodiversity-in-lichfield-district-council-elections/content_64.html": "Labour Candidates Champion Neurodiversity in Lichfield District Council Elections\nIn the upcoming Lichfield District Council, Lichfield City Council, and Burntwood Town Council elections, two of Labour’s candidates are campaigning to bring their unique perspectives as neurodiverse individuals to council decision-making. James Blackman, who lives with dyslexia, and Paul Taylor, who has ADHD and Asperger’s Syndrome/Autism Spectrum Disorder Level 1, are committed to advocating for the neurodiverse. They also hope to demonstrate that neurodiversity is not necessarily a barrier to participation in local politics.\n“Neurodiversity” refers to the natural variation of human brains and minds, including conditions such as dyslexia, ADHD, and autism.\n“As someone who has navigated the challenges of dyslexia, I understand firsthand the barriers that neurodiverse individuals face in education and the workforce,” said James, a Labour candidate in Leomansley. “Despite these challenges, I have successfully established two carbon-neutral businesses: a digital marketing agency and a logistics software company. I was also President of Lichfield & Tamworth Chamber of Commerce.”\nPaul Taylor, a successful DJ, global tax manager, and incumbent Town and District Councillor representing Burntwood, added, “I was diagnosed with ADHD and ADS1 in adulthood, but I’m familiar with the hurdles these conditions can create. These experiences give us a unique understanding of how council decisions impact the lives of neurodiverse people. We are committed to ensuring that Lichfield District Council is inclusive and responsive to the needs of all its citizens.”\nAs neurodiverse individuals, Paul and James understand and advocate for the needs of other neurodiverse residents.\n“Labour’s candidates have a proven track record of success and a deep commitment to diversity, inclusion, and representation,” said James Blackman. “We are ready to hit the ground running and get to work for the people of Lichfield. We urge voters to support us in these critical elections.”\nThe Labour Party is proud to champion diversity in these elections. “40% of our candidates are female, at least three candidates live with physical disabilities, and with at least three BAME candidates, we truly represent the whole district,” said Paul Taylor.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_the-work-of-the-grants-committee/content_47.html": "The Work of the Grants Committee\nIt’s great to support community projects in Lichfield as part of the grants committee at Lichfield City Council. At the last council meeting, grants were approved for Late Night Listeners, Liberty Jamboree, a new blue plaque honouring JL Petit (artist), and Community Speed Watch.\n- Applications are now open for the Lichfield City Council grant committee! Applications are open until 20th January 2025. Forms can be accessed by emailing [email protected], in person from the council offices at Donegal House on Bore Street or by visiting the grants section on the website at www.lichfield.gov.uk.\n- https://lichfieldlive.co.uk/2024/10/15/groups-invited-to-apply-for-funding-from-lichfield-city-council/?utm_content=bufferc3a7e&utm_medium=social&utm_source=facebook.com&utm_campaign=buffer",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_scrutiny-of-health-services-called-for-by-local-labour-candidates/content_73.html": "Scrutiny of health services called for by local Labour candidates\nAuthor: Rosie Harvey Coggins\nWaiting times of more than a year for local health services have been found in an investigation by the I newspaper into menopause treatment services. Wait times at Burton and Derby hospitals were 3rd highest in the country, with their average wait time being 479 days from GP referral. The NHS target time is 18 weeks.\nLabour Party candidates from the Lichfield District have called for an improvement to these services.\nRosie Harvey-Coggins, Labour Party candidate for St. John’s, Lichfield said: “Getting early access to these services can be life changing for so many women. Almost one million women leave employment due to menopause symptoms. Negotiating with workplaces to implement menopause friendly working policies is part of the important work I have already undertaken but more needs to be done to ensure that women who are suffering symptoms including joint pain, depression and disturbed sleep can get the correct care.”\nSharon Taylor, Labour Party candidate for Boney Hay and Central, Burntwood says: “Every woman’s journey through menopause is a very personal one. It can be very isolating, affecting all aspects of your life, your mental health, your ability to work, friendships and relationships. But it doesn’t have to be like that. Menopause is now reasonably well understood, but sadly the information isn’t reaching the women who need it.\nI have experienced the gap in menopause support myself with no NHS services locally, this is why with two other local women, we founded a monthly Menopause Support Group. It’s so important to know that you are not alone, to talk about what you are going through and to be signposted to the support you need.”\nWomen in Burntwood and the surrounding areas who are interested in attending the Burntwood Menopause Support Group can find out more details on Facebook at https://www.facebook/groups/burntwoodmenopausesupport\nThe Labour candidates have agreed to ask Lichfield District Council’s Overview & Scrutiny Committee to investigate how these life changing services can be improved.\nSources as follows:\nhttps://inews.co.uk/women-menopause-appointments-2025-2275134",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_matthew-turner-labour-candidate/content_18.html": "Matthew Turner Labour Candidate\nThe City Council By Election in the Stowe Ward will be contested by our very own Matthew Turner!\nMatthew comes from this area and lives with his wife and baby daughter in the city. He is a human rights barrister and works to support others, particularly the vulnerable. He will be working for others in Stowe if we all get together and elect him!\nPlease, if you live in the Stowe Ward, can you make every effort to either cast your postal vote or turn up to vote in person for Matthew on Thursday February 13th. City Council by elections have a relatively low turnout so your vote is especially important – if you vote Labour!\nThe seat was held by the Lib Dems but we know that Reform and others are contesting it as well. We really want to show Reform that they are not the way Lichfield wants to go, so please do vote…vote Matthew.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_labour-members-welcome-publication-of-city-centre-animation/content_70.html": "Labour Members Welcome Publication of City Centre Animation\nMembers of the Labour Opposition Group at Lichfield District Council have welcomed the release of an animation showing plans for the Lichfield City Centre Redevelopment Scheme which have been under wraps for many months.\nSince the elections in May, Labour councillors have been briefed in confidence on the overall strategy for the long-awaited plans for the former Friarsgate site and the wider City Centre but called for the “full public disclosure and explanation” a month ago, They are pleased that at last this has happened.\nCllr Colin Ball, who has chaired a Task Group on the City Centre Redevelopment Plans for several years, said:\n“I welcome this step forward so that all of the council members and the public can see how the parts of the scheme fit together. It’s understandable that a lot of the plans have had to be confidential due to commercial sensitivities but the public we represent need to have the same overview. I’m pleased that the Council Leadership has now accepted what we, as Opposition members, have been calling for.”\nLabour Group Leader, Cllr Sue Woodward, said:\n“We are certainly supportive of the overall vision, which has been a very long time coming. This doesn’t mean that we are offering a blank cheque and will continue to challenge the Leadership as the plans progress but this is a really positive sign of progress.”\nShe added:\n“Cllr Pullen’s comments at last week’s council meeting that our call for full exposition were ‘frustrating’ as Labour members had been briefed on the plans were a bit disingenuous. All of the briefings we’ve had have been in confidence, and we have honoured this confidentiality while also calling for the plans to be made public as soon as possible. He can’t have it both ways.”",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_paul-taylor-lichfield-rural-west/content_10.html": "Paul Taylor – Lichfield Rural West\nPaul Taylor is Labour’s Candidate for Lichfield Rural West\nHe is committed to ensuring our Rural Villages get a fair share of the funding\nThat we work to fix our broken roads and infrastructure\nStand up for Improved Local Services\nFix the broken SEND system",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_lunar-new-year-year-of-the-snake/content_26.html": "Lunar New Year – year of the Snake\nThe Lichfield Labour Party team is looking forward to welcoming you all to the Lunar New Year celebration in the Guildhall on Saturday February 1st! Doors will be open from noon to 3pm and we hope that we have something to please everyone… The Town Crier has kindly offered to call you all in!\nThe Kai Ming Association will be demonstrating their Tai Chi Chuan, with an opportunity for you to participate. There will be plenty of activities to join in with such as Calligraphy, Origami, Table Decoration making (and a chance to buy), Mask Colouring, some face painting and even the chance to try and speak a few words of greeting in Cantonese! Try the Chopstick Challenge and your luck at the Tombola.\nThere will be opportunities to register to participate in sports, such as Sailing, Golf, Badminton and Wing Chun, whilst folk who have purchased a house with a garden for the first time can register for an opportunity to find out what they can do with it!\nThere will be assistance and support, with Job 22 looking to help those wanting to upgrade their employment, Labour Councillors will be on hand to provide advice and support, whilst East and South East Asians for Labour will be here to help put across why Labour is the political party for us all.\nFinally QT will be here making their wonderful waffles, whilst tea and coffee will also be available.\nIt is all free! The event has been funded and organised by Lichfield Labour – so we do ask that if you can, please make a Donation, all of which will go to MHA Charity – supporting the elderly to live more fulfilling lives.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_a-great-place-to-live/content_16.html": "A Great Place to Live\nPeople need homes and help and support to get a home, but we also need to get the balance right when it comes to development. We need encourage the right quality development along with the infrastructure that is needed.\nWe want to nurture our home-grown talent and celebrate our heritage. We must also not leave any community behind because it doesn’t matter where you live in the district, we want you to help us make a great place to live.\nEncourage protection for renters, and support people aspiring to own their own home.\nPeople who rent need the advice about their rights so they can feel secure in their own home. We will work with advice organisations and residents to make them aware of their rights. Affordable housing is the term used in planning, but many developers try to find ways around the number of such properties they are obliged to build. We will help our residents – and those who want to move here get the best support available to us.\nSupport development that meets the needs of local people.\nWe know we get no support from the district’s MPs over the amount of housing that is allocated to us and there is limited power over design of developments. We will learn from other authorities and best practice to seek to get the kind of development that fits local needs rather than speculative development – especially where the Green Belt is threatened.\nPromote arts, culture and our rich and diverse heritage throughout the district.\nLichfield District is rich in cultural and industrial heritage. Of course, we have the Cathedral and the National Memorial Arboretum, but we also have our mining history. There are also forgotten stories like that of Britain’s first black school teacher Labour also believes we have a lot of cultural talent, whether music groups, singers, dancers, or visual artists that would benefit from support from the council.\nWe will work harder to involve the community to help us make better informed decisions.\nPoor quality consultations leave people feeling ignored and prevent the council from acting on their concerns – like we’ve seen recently with City Centre pedestrianisation. We will make it clear what the purpose of consulting is and hold public meetings so that we can hear each other. To make better decisions for residents we need to know their aspirations, hopes – and complaints. Labour will listen to people.\nEnsure schemes like discretionary housing payments and local council tax support reach the people that they need to.\nThe cost-of-living crisis is indeed a crisis for many of our vulnerable neighbours and the help that is available must be provided to the best our ability to ensure the most needed get the help they need. We will carry out a review of the current schemes to ensure that targeted support is there and all the help that can be provided is provided.\n- Fairer and More Prosperous Economy\n- A Greener Future\n- A Safer Community\n- A Healthier District\n- A Great Place to Live",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_news/content_4.html": "Three local schools are in the first wave to benefit from new Labour funding to boost early years childcare. Labour’s\nBen Watkins is a strong advocate for Lichfield Rural north, comprising of Boley Park, Fradley and Streethay. Ben lives in\nOur candidates for the the Curborough by-elections are Hannah Jell for Lichfield City Council and Liz Stamatelatos for Lichfield District\nKate is committed to our Community and… To ensuring that our society looks after and cares for our older citizens\nJacob Marshall is Labour’s candidate for Lichfield City South Jacob has a track record, as a City Councillor of helping\nPaul Taylor is Labour’s Candidate for Lichfield Rural West He is committed to ensuring our Rural Villages get a fair\nThe County Council elections on 1st May have a greater significance than normal. It is important for the scale of\nA great team of Labour Party Members from West Bromwich (together with their and our MP!) came to Lichfield to\nThe Lichfield Labour Party team is looking forward to welcoming you all to the Lunar New Year celebration in the\nThe City Council By Election in the Stowe Ward will be contested by our very own Matthew Turner! Matthew comes\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_lichfield-city-council-have-a-new-labour-leader-and-deputy/content_69.html": "Lichfield City Council have a new Labour Leader and Deputy\nGreat to see the new leader Cllr Rosie Harvey-Coggins and deputy Cllr Jacob Marshall being selected to lead Lichfield City Council this week, after an excellent general election campaign where the previous leader Dave Robertson was elected our MP. Good luck to you both!",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_back-to-school-bank/content_54.html": "Back to School Bank\nThe Mayor of Lichfield is ditching an outdated civic event in favour of supporting a project helping families struggling with the cost of school uniforms and equipment.\nCllr Ann Hughes confirmed she would replace the ‘Mayoress at home’ afternoon tea event. Instead, she will host the Mayor’s School Uniform Bank session at the Guildhall from 2pm to 4pm on 25th August.\nThe child-friendly session will offer free refreshments and a chance to pick up pre-loved uniform and educational equipment to help those struggling with cost of living challenges ahead of the new year.\nCllr Hughes said:\n“This event replaces the very traditional Mayoress at Home tea party, with its echoes of a world long gone. Uniform exchanges offer vital help at a time of severe financial pressure for families. They also contribute to saving the environment by avoiding clothes waste. We all know that children grow faster than clothes wear out, and it’s good to share rather than throw away.”\nFurther collection events will be held on dates to be confirmed at Life Church and Boley Park Community Centre.\nCllr Hughes said: “The uniform exchange worked well last year and we want it to take place on a larger scale, promoted by myself as Mayor with the support of Lichfield City Council. Clean, good quality items of school uniform, branded items from all city schools as well as generally useful trousers, skirts, jumpers and PE kits etc can be donated at the city council offices in Donegal House, or at Tesco Extra, Morrisons, St Chad’s Church and the Life Church at Netherstowe. We particularly need secondary school blazers and stationery items are also useful.”",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_city-council-establishes-climate-change-and-biodiversity-committee/content_61.html": "City Council Establishes Climate Change and Biodiversity Committee\nLichfield City Council established a Climate Change and Biodiversity Committee at its meeting of 24 July.\nThe Committee, an initiative of the controlling Labour Group, received cross-party support when discussed at the Council meeting. Councillor Rosemary Harvey-Coggins, the Council’s Deputy Leader, proposed the creation of the Committee and was elected as Chair. The Committee also includes members from the Liberal Democrat and Conservative parties.\nCllr Harvey Coggins said:\nThe continued burning of fossil fuels, intensively farming livestock, and deforestation are major contributing factors to the earth’s temperature rising, adding enormous amounts of greenhouse gases to the atmosphere.\nThe effects of this are most devastating to those already marginalised by society. Women constitute 70% of the world’s poor and are more likely to look for income from industries that will be most affected by climate change, for example agriculture. And it is worth noting that in this crisis, forms of inequality work together. Black, migrant, old and disabled people will be disproportionally affected.\nBut there is hope. We are not at the point of no return. A change can be made by aiming towards net zero carbon emissions, by moving from a reliance on coal, oil and gas to renewable energy, and by increasing biodiversity to protect the landscape.\nThe establishment of the Committee was seconded by the Leader of the City Council, Councillor Dave Robertson.\n“It’s almost four years since the City Council declared a climate emergency but that was followed by very little real action to try and reduce carbon emissions across our city. I’m really proud that, after the change in control in May, the council has set up this committee to bring forward ideas about how we can make a difference on one of the biggest issues facing our community”\nWhen asked about the impact that a parish council committee could have to what is a worldwide problem, Cllr Harvey Coggins said:\nThe City Council is not too small to make a difference, there are several groups operating locally who are very small, but their impacts are significant. We wish to work with those groups and add to their efforts with our own. In turn, acting locally and including some of those most marginalised, will encourage others to act on their own initiative or contribute to the efforts of this Committee. The greatest threat to our climate is the belief that someone else will solve the crisis.\nNotes:\nThe Committee consists of six councillors, four from the controlling Labour Group (Cllrs R Harvey Coggins (Chair), E Strain (Vice Chair), J Blackman and A Hughes (Mayor). The minority group members are Cllr A Rushton (Liberal Democrat) and A Lax (Conservative).\nThe committee aims to examine how the council can reduce its own impact on the environment, identify further ways of supporting biodiversity across the City and, working together with other councils and local groups, lead the behavioural changes needed to preserve the environment.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_news_page_5/content_67.html": "Lichfield City Council is allocating £10,000 of its Grants Reserve towards provision of summer activities for children and families. In\nMembers of the Labour Opposition Group at Lichfield District Council have welcomed the release of an animation showing plans for the\nAfter a letter was sent to all candidates by Lichfield Foodbank during the local elections calling on all levels of\nPic: Google Streeview – The Birmingham Road multi-storey car park. Lichfield District Council has proposed demolishing the multistorey to get the\nThe long-running saga of the plans for Friarsgate, impacting the whole of Lichfield City Centre, now needs full public disclosure and\nFollowing recent elections which saw the Labour Party increase their number of councillors by seven, the Leader of the Labour Group at\nResponding to a statement by Lib Dem Group Leader at Lichfield District Council, the Leader of the largest Opposition Labour\nResponding to questions about whether a pact with the Lib Dem to take over control of Lichfield District Council was being considered , the newly-elected\nBurntwood Town Councillor and Blue Badge holder, Cllr Kathy Coe, has spoken out on behalf of other Blue Badge holders about\nThe candidates for Chase Terrace ward in May’s Lichfield District Council elections standing as “Labour and Co-operative” say that they\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_an-act-of-rememberance/content_46.html": "An Act of Rememberance\nThe Deputy Mayor Cllr Claire Pinder-Smith, Chair of the District Council Cllr Ann Hughes and Cllr Sharon Taylor visited the Commonwealth War Cemetery in Cannock Chase for a special wreath-laying peace ceremony. This poignant event, held in unity with our visitors from Bremen, Germany, served as a powerful reminder of our shared history and the enduring bonds of peace between nations. A big thanks to Staffordshire County Council\nand The Staffordshire Council of Voluntary Youth Services.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_lichfield-councillor-surgery/content_57.html": "Lichfield Councillor Surgery\nA great Councillors’ surgery today with Cllr Jacob Marshall, Cllr Matt Field and Cllr Colin Ball. Please get in touch if there is any local casework that we can help with! A number of residents came in to get help for local issues. Jacob picked up a bit of casework in his patch from a concerned resident in Leamonsley about a derelict building. If anyone has any other casework we can help with in the area, don’t hesitate to get in touch…",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_markets-are-a-wonderful-part-of-lichfield-life/content_53.html": "Markets are a wonderful part of Lichfield Life\nCllr Russ Bragger was at Lichfield Markets last Friday, talking to market stall holders about the running of the markets, in his role as chair of the Lichfield City Council’s markets working group.\nOur regular Tuesday, Friday and Saturday markets are flourishing as well as the Producer’s market on the first Sunday of the month, the food festivals and the vegan market. Something for everyone!",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_about-us/content_12.html": "A chance to make Lichfield District Fairer and Greener\nA Fairer District\nFor a long time Lichfield, Burntwood and the Villages have had Tory control at the Constituency, County, District and City/Town Council level. The Tories have ignored the sense of Labour’s ideas and have implemented privatisation and cut backs to the detriment of us all – think of the privatised potholes!\nIn 2023 voters gave us a chance to improve the District – we won enough seats for there to be no overall control. But do not have the power to bring in our proposals. However gaining control of Burntwood Town Council and Lichfield City Council means we are making changes at the grass roots level.\nIn 2024 after a tremendous effort from many local volunteers and an excellent campaign from our candidate Dave Robertson, we finally have a Labour MP representing us in Parliament\nHowever we cannot rest there – our focus is now on the County Council elections in May where we need to ensure that Labour’s voices are clearly\nA Greener District\nThe whole of the district should benefit from council investment and their share of its services.\nLabour proposed a Climate Emergency for Lichfield District in December 2019, and the Conservatives supported it – but they have missed targets and delayed involving our residents – nationally and locally it became very difficult to believe they really think that there is an emergency…but we know there is.\nWe will engage with our residents to help us get to Carbon Net Zero before 2050.\nWhilst we work to win seats at the County Council elections we will continue to work with partners to improve the lives of all our residents and make Lichfield District “a great place to live”.\nPlease click on the links below to view each individual policies\n- Fairer and More Prosperous Economy\n- A Greener Future\n- A Safer Community\n- A Healthier District\n- A Great Place to Live\nLichfield District Labour Group 2023",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_chase-terrace-ward-proud-to-be-flying-the-cooperative-flag/content_66.html": "Chase Terrace ward proud to be flying the Cooperative flag\nThe candidates for Chase Terrace ward in May’s Lichfield District Council elections standing as “Labour and Co-operative” say that they are proud to be flying the Cooperative flag\nSteve Norman and Sue Woodward are members of both the Labour Party and its sister Party, The Cooperative Party and are therefore now standing as Labour & Co-operative Candidates. They believe that they are the first candidates for Lichfield District Council to do so.\nSince 1927, the Labour Party and the Co-operative Party have maintained an electoral agreement which allows for candidates to stand on a joint Labour and Co-operative platform. There are over 1,200 Labour & Co-operative Councillors across the country, alongside 26 Labour & Co-operative MPs and numerous MSPs, MSs and Mayors.\nSteve Norman said:\n“Being a Co-operative member signals a belief in the values of honesty, openness, social responsibility, fairness and caring for others. This is what I came into politics for and to put these values into action.”\nSue Woodward said:\n“For me, cooperation is about inclusion and partnership working. People don’t want councils doing things to them but with them and we have seen real progress on partnerships and co-production here in Burntwood, not least as members if the Cooperative Councils Innovation Network.”\nAlthough Sue and Steve are the only official Labour & Cooperative candidates, other candidates across Lichfield District and also longstanding members of the Cooperative Party including Diane Evans (a candidate in Boney Hay & Central ward) and Raj Kulkarni (standing in Boley Park).\nDi Evans said:\n“I strongly believe in Cooperative Party values their values have proved so important for Burntwood, where we work together, trust and listen to each other, to ensure that our town continues to develop as a thriving and vibrant area for the benefit of all residents.”\nRaj Kulkarni said:\n“After 23 years of local Conservative rule and 13 of national Conservative rule, our society is too divided. Now more than ever we need to reunite society. The Cooperative Party has the values to do this, in partnership with the Labour Party. I am proud to help in this endeavour.”\nJoe Fortune, General Secretary at the Co-operative Party added:\n“The Co-operative Party is a growing force in councils across the country. Together we have brought change on issues like modern slavery, fair tax, high streets and food justice. We have achieved so much, but there is still much more to do.\n“This May, the Co-operative Party will be standing a record number of candidates. I’m excited to see us elect these brilliant candidates and see the co-operative difference they will make at town halls across the country.”",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_allocation-of-reserves-to-support-summer-projects/content_68.html": "ALLOCATION OF RESERVES TO SUPPORT SUMMER PROJECTS\nLichfield City Council is allocating £10,000 of its Grants Reserve towards provision of summer activities for children and families.\nIn light of the cost-of-living crisis it is hoped that such grant provision will facilitate and expand events providing parents and families with an increased choice of free and low-cost activities during the school summer holidays.\nCouncillor Colin Ball, Chair of the City Council’s Grants Advisory Committee said.\n“We know that there have been cutbacks across the board in services for children and young people over the past few years. This is an opportunity for the City Council to support children and families over the summer – a chance to see families having fun in these difficult times.”\nDave Robertson, Leader of Lichfield City Council said “”The cost-of-living crisis continues to make life difficult for families across the City. As the school holidays arrive, we know that many household budgets will be even further stretched and so we’re eager to work with partners across Lichfield to provide activities for young people this summer by freeing up this funding to help things happen.”\nApplicants can apply for a maximum of £2,000. However , consideration will be given to requests for higher amounts from community organisations who are seeking to provide additional staffing resources to support a co – ordinated effort with other partner organisations or authorities. Anyone interested should request an application form by emailing [email protected]. Or collect from the City Council Offices, Donegal House, Bore Street. Lichfield WS13 6LU",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_areas_chasetown-ward/content_30.html": "Chasetown Ward\nHello and we hope you’re well,\nAs your Labour candidates for Chasetown ward in the local elections for Lichfield District Council on 4th May, we are writing to ask for your support by introducing ourselves and highlighting some of the things we want to achieve by working hard to improve for all of the residents of our town.\nDarren Ennis\nBorn and bred in Chasetown, I am really passionate in making sure this part of our town gets the best it can. My own business Haywoods Blinds is in the ward and I employ people from across the town.\nOver the last 8 years as a Chasetown Councillor, I helped and supported local businesses, local community groups, and residents and I want to carry this work on.\nWorking with community groups to improve the lives of Burntwood residents is a key goal for making a Better Burntwood and something we need to build on and make thrive. We will carry on flying the Chasetown Flag and making sure we get all the investment and resources to help deal with the issues affecting us all in our town.\nLaura Ennis\nIn the last 4 years as a Burntwood Councillor I have gained great knowledge and experience. This has been done through working to help residents with issues from social housing, fly tipping and anti-social behaviour.\nI walk around Chasetown every day taking my children to school at St Joseph’s and Theresa’s Primary School on the High Street. Also working at the school, gives me the chance to see the development of our young children and this spurs me on to make our Town the safest environment it can be offering the best education for our children.\nA vote for us, is a Vote for Common Sense, Community Spirit, and a Better Burntwood. As Labour Councillors we will continue to:\n- Support our local businesses and community groups: specifically, on Chasetown High Street, St Anne’s Church, Chasetown Methodist Church, Chasetown Football Club and Burntwood Rugby Club to name a few.\n- Continue to protect the Green Belt, defending it in planning meetings and raising awareness locally. Also championing Chasewater which is the Crown Jewel of our Town.\n- Provide cleaner streets by tackling litter, fly-tipping and parking issues. Working with Burntwood Litter Heroes and liaising with the Council’s amazing maintenance team to make sure our area looks great.\n- Improve Community safety, providing greater reassurance against crime. Will challenge the local Conservative Police and Crime Commissioner and request more visible policing in Chasetown now that we locally have a new policing model.\n- Spend your money wisely, with sound, fair and transparent budgets. We will champion extra investment within the Chasetown Ward.\nOur manifesto for 2023, which highlights our 5 core aims:\n- Fairer and More Prosperous Economy\n- Greener Future\n- Safer Community\n- Healthier District\n- Great Place to Live\nIf you would like and further information or would like to discuss any local issues, then please do not hesitate to get in touch by email.\nDarren Ennis, District Candidate [email protected]\nLaura Ennis, District Candidate [email protected]\nYour Labour Candidates for Chasetown\nBurntwood Town Council & Lichfield District Council Elections, 4th May 2023",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_a-healthier-district/content_21.html": "A Healthier District\nBetter physical and mental health for our residents will be an important goal for a Labour Lichfield District Council. We can lobby the primary care services as a district council, holding them to account, as well as improving the services we provide to help people lead happier, healthier lives.\nThis means working to improve our environment as well ensuring our leisure services reach out to all groups in the district.\nImprove air quality by encouraging cycling, walking and better public transport.\nIt is no good being outside getting exercise if the air quality is not good. We will endeavour to reduce the barriers that deter people from walking or cycling or jogging working with our partners at the County Council and elsewhere. We will also investigate ways we can show a need for extra bus routes.\nEnable our residents to live healthy and active lives.\nImproved, in-house, Leisure Services is the key here but also education and support for clubs, whether where people are able to socialise, such as the open and warmer spaces. Physical as well as mental health is important and grants for such groups in villages would help to increase these opportunities. A Labour Council will be on the side of people who need help.\nSupport the relationship between communities and the health services they rely on.\nLocal Conservatives have rejected a plan to invest in local GP services; and there are now plans to close a Health and Wellbeing Centre moving 5000 extra patients to already over-stretched services. A Labour Council will speak up for you and not stay silent on this important issue.\nDeliver top class leisure and sporting facilities for all our communities.\nA new leisure centre in Lichfield, proper management of Burntwood leisure centre and improvements to leisure opportunities for the surrounding areas. Labour will stop wasting money on outsourcing and spend it on services that people want.\nSupport local groups to establish regular community sporting events.\nWe want to encourage sporting events throughout the district, whether they are fun runs or more serious competitions. We can help fund and provide expert advice for local communities wanting to put provide one for their village or town.\n- Fairer and More Prosperous Economy\n- A Greener Future\n- A Safer Community\n- A Healthier District\n- A Great Place to Live",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_events/content_3.html": "Join\nGet Involved\nDonate\nLabour Party Lichfield, Burntwood & The Villages\nAreas\nBurntwood Labour Party\nLichfield Rural North\nChasetown Ward\nLabour's Missions\nA Great Place to Live\nA Healthier District\nEconomic Growth\nA Safer Community\nA Greener Future\nPhoto Id Registration\nNews\nEvents\nContact us\nHome\n»\nEvents\nEvents\nSearch\nNear...\nDates\nand\nList\nSearch Results View Type\nList\nGrouped Lists\nGrid\nMap\nCalendar\nSearch\nShow Advanced Search\nSearch\nDates\nand\nNear...\nLocation Options\nCountry\nAll Countries\nUnited Kingdom\nRegion\nAll Regions\nState/County\nState/County\nWithin\n5\n10\n25\n50\n100\ndistance units\nMiles\nKilometers\nCategories\nCategories\nTags\nTags\nLichfield Events\nNo Events\nPowered by\nEvents Manager\nFollow on social media\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_labour-launches-its-local-election-campaign/content_63.html": "Labour Launches its Local Election Campaign\nLabour candidates for the elections to Lichfield District Council on 4th May got together to launch their campaign this week and to agree their Manifesto for a Fairer, Greener Lichfield District.\nMeeting in Lichfield’s Hub at St Mary’s, candidates and activists endorsed their “exciting and progressive” plan for Lichfield District and agreed that, while campaigning so far has shown very positive results, they will not be complacent about any results until votes are counted.\nHeading up the meeting as Labour’s Chair, Cllr Dave Robertson outlined campaign plans and said:\n“We have worked together as a team to bring forward an exciting and progressive Plan for the District. We have learnt from the many Conservative failures over recent years and will now put forward an alternative Labour vision which will resonate, I’m sure, with voters.”\nLabour Opposition Leader at Lichfield District Council, Cllr Steve Norman, said:\n“We are ambitious but certainly not complacent and will work hard over the coming weeks to try to get our great team of candidates elected. While the Tories fall out amongst themselves, I am proud of the Labour team we are putting to the electorate and I hope we can add to the strong Group we already have at LDC.”\nYou can read all about Labour’s plans for a better Lichfield District at www.yourlocallabour.co.uk.\n— End —\nCllr Steve Norman – 07866015165\nCllr Dave Robertson – 07866491068",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_areas_burntwood/content_41.html": "Burntwood Labour Party\nAre you tired of Burntwood being short-changed by the Conservative Government and councils? It’s time for a change. Vote for Labour Councillors and candidates who are passionate about Burntwood’s future and will fight for its fair share of funding. They will be strong and effective voices for our town, championing the views of residents and working hard to make a real difference. Don’t wait any longer for a brighter future for Burntwood. Vote Labour now, and let’s make it happen together.\nThe Labour-run Burntwood Town Council is making a real difference in our community. With the monthly Burntwood Producers’ Market now in its third year and the upcoming Burntwood Wakes Festival set to be bigger and better than ever, we’re committed to bringing our town together and creating opportunities for local businesses and residents.\nWe’re also taking practical action to improve Burntwood with the BuRRT repair team, and fighting to keep the Methodist Church in Princess Street for use by local community groups. But we need your support to make even more progress. Join us in our efforts to reopen The Oak at Sankey’s Corner, an eyesore in our community, with a grant of £250,000 already secured. Together, we can build a better Burntwood.\nVote Labour on 4th May.\n“We have worked together as a team to bring forward an exciting and progressive Plan for Burntwood and the District. We have learnt from the many Conservative failures over recent years and will now put forward an alternative Labour vision which will resonate, I’m sure, with voters.”\n— Cllr Dave Robertson\nOur Plan\nOnly Labour has a cohesive plan to create a fairer, greener future for Burntwood.\nFairer and More Prosperous Burntwood\nA Conservative-run District Council has wasted £millions on Friarsgate and endless consultations. Labour will invest fairly across the district, including Burntwood and the surrounding areas.\nA Greener Burntwood\nEV recharging points, improved cycling infrastructure, better recycling processes and working with schools will all create a greener district.\nA Safer Burntwood\nActivities for young people, stronger policing of anti-social behaviour, increased CCTV and concentration on car crime will make Burntwood feel safer.\nA Healthier Burntwood\nGreener transport is healthier transport, and improved delivery of leisure facilities with a better community relationship will create a healthier Burntwood.\nA Better Burntwood\nProtection for renters, more sympathetic development with appropriate infrastructure and increased arts and culture activities will make Burntwood feel like a better place to live.",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_a-greener-future/content_40.html": "A Greener Future\nThe Climate Emergency has risen up the priority agenda – particularly for the next genera-tion. Labour proposed and got support for the District Council declaring a Climate Emergency in 2019 but if you look at the website you would be forgiven for thinking it hadn’t happened. This will change under a Labour Administration.\nInvest in recharging points to encourage electric car use.\nIf visitors who have invested in an electric car don’t believe they will find a charging point when they go shopping or eat at a restaurant or just take time visiting, they will give us a miss and spend money elsewhere.\nImprove cycle parking facilities to support and encourage cyclists.\nCyclists carry their own locks but if there no racks to attach their bikes to they will be deterred from shopping or visiting locally. We want to encourage this environmentally friendly form of transport and will seek advice from cycling groups to achieve this.\nWork with local schools and community groups to achieve our Climate Emergency target.\nThe Council has missed a number of targets – even after the councillor in charge was removed. This Conservative administration has not involved you, the community, to make real progress. Labour takes this seriously and will seek your help and work with our local schools to get to net carbon zero before 2050.\nImprove the waste to be recycled by working with residents – not against them.\nRecycling rates have reduced, and the blue bag introduction has been public relations disas-ter instead of a boost to recycling rates. Labour introduced kerbside collection of recycla-bles, the first district council in the County, and will do again.\nWe will also look at bringing back food waste recycling.\nThere are facilities just outside our district that we could use and so we will learn from other councils already using them with a plan to reintroduce kitchen waste caddies and reduce waste even further.\n- Fairer and More Prosperous Economy\n- A Greener Future\n- A Safer Community\n- A Healthier District\n- A Great Place to Live",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_contact-us/content_28.html": "Contact us\nLabour Party Lichfield, Burntwood & The Villages\nStanding up for the residents of Lichfield, Burntwood & Surrounding Rural Areas\nGet in touch via Email\nPlease fill in the form if you have any assistance\nStanding up for the residents of Lichfield, Burntwood & Surrounding Rural Areas\nPlease fill in the form if you have any assistance\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_a-golden-homecoming/content_42.html": "A Golden Homecoming\nCllr James Blackman and Dave Robertson MP attended the welcome home event last Friday for Sophie Capewell, to congratulate her on her Olympic gold medal in cycling. Thank you LICHFIELD SPORTS CLUB and Lichfield City Cycling Club for organising this great event!",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_jacob-marshall-lichfield-city-south/content_39.html": "Jacob Marshall – Lichfield City South\nJacob Marshall is Labour’s candidate for Lichfield City South\nJacob has a track record, as a City Councillor of helping people with Local Issues\nJacob works in the Education sector and will improve our local schools\nJacob has a deep knowledge of the Staffordshire Fostering System and is passionate to improve it",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_areas_lichfield-rural-north/content_19.html": "Join\nGet Involved\nDonate\nLabour Party Lichfield, Burntwood & The Villages\nAreas\nBurntwood Labour Party\nLichfield Rural North\nChasetown Ward\nLabour's Missions\nA Great Place to Live\nA Healthier District\nEconomic Growth\nA Safer Community\nA Greener Future\nPhoto Id Registration\nNews\nEvents\nContact us\nHome\n»\nAreas\n»\nLichfield Rural North\nLichfield Rural North\nYour Team\nChair\n: James Blackman\nVice Chair\n: Darren Ennis\nBranch Secretary\n: Dave Whatton\nBranch Treasurer\n: Toby Ryder\nFollow on social media\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_marching-with-pride/content_75.html": "Home » Marching with Pride\nOur Deputy Mayor, MP and former Mayor, at the Lichfield Pride March today. What an excellent event, thank you so much to the organisers!\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_about-us_a-healthier-district/content_15.html": "A Healthier District\nBetter physical and mental health for our residents will be an important goal for a Labour Lichfield District Council. We can lobby the primary care services as a district council, holding them to account, as well as improving the services we provide to help people lead happier, healthier lives.\nThis means working to improve our environment as well ensuring our leisure services reach out to all groups in the district.\nImprove air quality by encouraging cycling, walking and better public transport.\nIt is no good being outside getting exercise if the air quality is not good. We will endeavour to reduce the barriers that deter people from walking or cycling or jogging working with our partners at the County Council and elsewhere. We will also investigate ways we can show a need for extra bus routes.\nEnable our residents to live healthy and active lives.\nImproved, in-house, Leisure Services is the key here but also education and support for clubs, whether where people are able to socialise, such as the open and warmer spaces. Physical as well as mental health is important and grants for such groups in villages would help to increase these opportunities. A Labour Council will be on the side of people who need help.\nSupport the relationship between communities and the health services they rely on.\nLocal Conservatives have rejected a plan to invest in local GP services; and there are now plans to close a Health and Wellbeing Centre moving 5000 extra patients to already over-stretched services. A Labour Council will speak up for you and not stay silent on this important issue.\nDeliver top class leisure and sporting facilities for all our communities.\nA new leisure centre in Lichfield, proper management of Burntwood leisure centre and improvements to leisure opportunities for the surrounding areas. Labour will stop wasting money on outsourcing and spend it on services that people want.\nSupport local groups to establish regular community sporting events.\nWe want to encourage sporting events throughout the district, whether they are fun runs or more serious competitions. We can help fund and provide expert advice for local communities wanting to put provide one for their village or town.\n- Fairer and More Prosperous Economy\n- A Greener Future\n- A Safer Community\n- A Healthier District\n- A Great Place to Live",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_news_page_6/content_51.html": "In the upcoming Lichfield District Council, Lichfield City Council, and Burntwood Town Council elections, two of Labour’s candidates are campaigning\nAuthor: Rosie Harvey Coggins Waiting times of more than a year for local health services have been found in an\nThe Jo Cox Foundation is calling upon candidates in the forthcoming local elections to sign up to its Civility Pledge,\nAuthor: James Blackman – Candidate for Leomansley Ward As a business owner myself in Lichfield, I understand the challenges every\nI was honoured to be invited to be in the audience as first, Yvette Cooper MP, Labour’s Shadow Home Secretary\nLabour candidates for the elections to Lichfield District Council on 4th May got together to launch their campaign this week\nAfter 13 years of the Tories, nothing in this country seems to work anymore. Five Tory Prime Ministers and what has\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_kate-greening-labour-candidate-for-lichfield-city-north/content_11.html": "Kate Greening – Labour Candidate for Lichfield City North\nKate is committed to our Community and…\nTo ensuring that our society looks after and cares for our older citizens\nThat our children benefit from safe spaces, the services that they need and the opportunities they deserve\nThat we tackle the anti social behaviour so that we all feel safer in our communities\nPlease vote for Kate Greening in the County Council Elections on the 1st May",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_out-and-about-in-burntwood/content_44.html": "Out and About in Burntwood\nThank you to the lovely people of Morley Road in #Burntwood for the warm reception on the doorstep this lunchtime. Always great to hear from so many people that they’re happy to see their MP out and about. Well done to Dave, Kate, Russ, Ann and Angela!",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_lichfields-community-day/content_38.html": "Lichfield’s Community Day\nCllr Paula Knight and Cllr Ann Hughes had a great day today at the Lichfield City Council’s Community day today. Pictured here with the Samuel Johnson Birthplace Museum and LICHFIELD LITTER LEGENDS (which Paula is part of). Thanks to all the staff at the city council staff for organising the day (Guildhall Lichfield Lichfield Markets)",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_burntwood-town-councillor-and-blue-badge-holder-cllr-kathy-coe-speaks-out/content_82.html": "Burntwood Town Councillor and Blue Badge holder Cllr Kathy Coe Speaks Out\nBurntwood Town Councillor and Blue Badge holder, Cllr Kathy Coe, has spoken out on behalf of other Blue Badge holders about the negative impacts of Lichfield District Counci’s implementation of the pedestrianisation of Lichfield City centre.\nShe said:\n“Surely it is not beyond the understanding and capabilities of the District Council to protect the disabled parking spaces so that those people who are recognised as having mobility difficulties can access the city centre, can go shopping, meet up with friends for a coffee or a meal. Blue Badge holders enjoy going out and socialising too! Trying to find a suitable parking space is a nightmare in Lichfield and I think it damages the local economy too as people become more reluctant to even try to park in a place that meets their needs.”\nCllr Coe, herself a wheelchair user, was moved to speak out about the human impact of the loss of Blue Badge parking when she received the following from a Burntwood Resident:\n“I am 71 years old and have MS.I am able to walk but have to have my carer with me for support as I have balance and fatigue problems and she has to drive me as I had my licence revoked due to my illness.I was very angry to hear the council were thinking of suspending blue badge parking in the centre.Yes,there are car parks with some disabled parking,but not many,which means extra walking.The multi story car park has no lift,sloping floors and very tight parking spaces.Not suitable for the needs of some disabled drivers and people with wheel chairs.We visit Lichfield most weeks and contribute to the economic side of the city by shopping there.The local banks have closed,so Lichfield is the nearest.There are also several health and medical services in the centre.\nA high percentage of the centre is already pedestrianised ,so I feel strongly that the route for disabled drivers to park and pass through is not a lot to ask.”\nCllr Coe added:\n“This person completely echoes my own feelings about this but, as a councillor, I have a responsibility to speak up for the many disabled drivers and Blue Badge holders in a similar position. Eighteen\nmonths doesn’t sound so much like a trial period to me but a backdoor way of making it permanent. It will certainly be a trial for those of us who will effectively be shut out of the city centre for a year and a half.”",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_keep-it-civil-civility-pledge/content_77.html": "Keep It Civil”: Invitation to Candidates to Sign Up to Civility Pledge\nThe Jo Cox Foundation is calling upon candidates in the forthcoming local elections to sign up to its Civility Pledge, seeking to end the abuse and intimidation of those who put themselves forward for public office.\nThe call has been echoed by Cllr Sue Woodward, who is seeking a return to Lichfield District Council on 4th May. She is asking candidates across Lichfield District to sign too. The link is –\nhttps://www.jocoxfoundation.org/civility_pledge\nShe said:\n“Personal abuse should not be tolerated and I hope candidates, of all political parties and none, agree. Low level abuse can lead to horrific consequences as we saw with the murders of Jo Cox and David Amess. Our candidates in this district can show their commitment to ending abuse by taking a stand and signing up to this pledge.”\nShe has already received positive responses from fellow candidates and hopes to see far more signing up in the weeks ahead.”\nShe added:\n“I’m no shrinking violet where robust debate is concerned about but personal abuse via social media can be really pernicious and it’s women in politics who experience this most. It puts many people off standing for election, which undermines our democracy.\nHaving experienced this myself, I want to make a stand and hope fellow candidates will join me.”",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_about-us_a-greener-future/content_29.html": "A Greener Future\nThe Climate Emergency has risen up the priority agenda – particularly for the next genera-tion. Labour proposed and got support for the District Council declaring a Climate Emergency in 2019 but if you look at the website you would be forgiven for thinking it hadn’t happened. This will change under a Labour Administration.\nInvest in recharging points to encourage electric car use.\nIf visitors who have invested in an electric car don’t believe they will find a charging point when they go shopping or eat at a restaurant or just take time visiting, they will give us a miss and spend money elsewhere.\nImprove cycle parking facilities to support and encourage cyclists.\nCyclists carry their own locks but if there no racks to attach their bikes to they will be deterred from shopping or visiting locally. We want to encourage this environmentally friendly form of transport and will seek advice from cycling groups to achieve this.\nWork with local schools and community groups to achieve our Climate Emergency target.\nThe Council has missed a number of targets – even after the councillor in charge was removed. This Conservative administration has not involved you, the community, to make real progress. Labour takes this seriously and will seek your help and work with our local schools to get to net carbon zero before 2050.\nImprove the waste to be recycled by working with residents – not against them.\nRecycling rates have reduced, and the blue bag introduction has been public relations disas-ter instead of a boost to recycling rates. Labour introduced kerbside collection of recycla-bles, the first district council in the County, and will do again.\nWe will also look at bringing back food waste recycling.\nThere are facilities just outside our district that we could use and so we will learn from other councils already using them with a plan to reintroduce kitchen waste caddies and reduce waste even further.\n- Fairer and More Prosperous Economy\n- A Greener Future\n- A Safer Community\n- A Healthier District\n- A Great Place to Live",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_news_page_1/content_22.html": "Three local schools are in the first wave to benefit from new Labour funding to boost early years childcare. Labour’s\nBen Watkins is a strong advocate for Lichfield Rural north, comprising of Boley Park, Fradley and Streethay. Ben lives in\nOur candidates for the the Curborough by-elections are Hannah Jell for Lichfield City Council and Liz Stamatelatos for Lichfield District\nKate is committed to our Community and… To ensuring that our society looks after and cares for our older citizens\nJacob Marshall is Labour’s candidate for Lichfield City South Jacob has a track record, as a City Councillor of helping\nPaul Taylor is Labour’s Candidate for Lichfield Rural West He is committed to ensuring our Rural Villages get a fair\nThe County Council elections on 1st May have a greater significance than normal. It is important for the scale of\nA great team of Labour Party Members from West Bromwich (together with their and our MP!) came to Lichfield to\nThe Lichfield Labour Party team is looking forward to welcoming you all to the Lunar New Year celebration in the\nThe City Council By Election in the Stowe Ward will be contested by our very own Matthew Turner! Matthew comes\nClick on icons below to follow us locally",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_about-us_a-fairer-and-more-prosperous-economy/content_13.html": "A Fairer and More Prosperous Economy\nWe want the District Council’s resources to be distributed more fairly across the district for the benefit of everyone who calls our area home.\nEveryone knows Burntwood does not get its fair share of investment, but rural areas miss out too and we will work with the local parish and town councils to redress this imbalance. Whilst warehousing and transport is welcome light manufacturing is more labour intensive and brings skills and higher paid jobs into the area, so we want to help this sector in particular.\nWe will provide fair investment across the whole district.\nPutting all your eggs into one basket, as the Conservatives have done over 20 years with Friarsgate, has not been successful. We want to look at ways of investing in other areas too that would help villages and benefit the environment.\nWe will develop a local growth plan by working with local businesses.\nWe need thriving businesses to for our local economy and we will listen to businesses to see how we can help them improve and grow.\nIntroduce a Good Business Charter to celebrate the best of our local businesses.\nWe will raise good business practices, encourage improvement in business and celebrating what our local companies do well in partnership with the Council.\nEncourage internal investment through Community Wealth Building and local procurement.\nWe will adopt an interventionist approach to economic development that prioritises and harnesses resources to generate wealth for local residents and build an inclusive local economy.\nGet the development of the Friarsgate site moving.\nAlmost a quarter of a century of broken Conservative promises and delays have cost our area dozens of jobs with nothing to show for it. It’s time to stop the meaningless consultations and delays. Labour will get the project moving.\n- Fairer and More Prosperous Economy\n- A Greener Future\n- A Safer Community\n- A Healthier District\n- A Great Place to Live",
  "https_yourlocallabour_co_uk_dave-robertson-our-candidate-for-lichfield_/https_yourlocallabour_co_uk_labour-engaging-with-local-businesses/content_76.html": "Labour Engaging with local businesses\nAuthor: James Blackman – Candidate for Leomansley Ward\nAs a business owner myself in Lichfield, I understand the challenges every single sector is facing and I am not going to lie, running a business is challenging particularly if you’re a micro business (0-9 employees). Often the government particularly this one has provided little support or incentives to help effectively grow micro businesses which make up 95% of all businesses in the UK (5.2 Million Micro Businesses)\nOne of the biggest problems at the moment is the cost of living and supply chain, both go hand in hand, this then is compounded by late payments of invoices and getting the skilled staff we all need to make our businesses work and prop up the local economy.\nI have personally campaigned as former President of Lichfield & Tamworth Chamber of Commerce making sure Micro & Small businesses are paid on time without having to do the hokey cokey with large businesses to get paid. I managed to get 130 businesses in the West Midlands to sign a pledge to pay their suppliers in 30 days.\n£24bn is owed to SME’s in the UK, on average it works out to £6k per annum is owed.\nHow can Labour locally help the economy?\nWe can help massively. Believe it or not, many very successful businesses are Labour supporters. We do want to make money to help the wider community and support local suppliers. Within Lichfield, we have a proliferation of exciting businesses, from web designers to drain cover manufacturers, blind manufacturers, food producers, pubs, and restaurants. Lichfield has it all.\nWe can’t rely on the Tory council to help with local business, as from history they can’t deliver on any large-scale projects. We as the residents of Lichfield can work together to grow the economy. Its very simple approach and totally logical.\nLichfield Labour is looking to support the economy by getting local businesses to work together, reduce their supply chain and use other local businesses. The talent and expertise are all within a 10-mile radius of the Cathedral.\nBusinesses working together make a stronger economy\nIf businesses looked more inward within Lichfield, the money will stay in Lichfield. For example why use Go Daddy or Fast Hosts for your business websites? Use a local company to host your company. They cost the same.\nDon’t let the fees flow out to the Cayman Islands; put it into the businesses in the local area (city centre). Look at using local food producers; it may cost a little bit more, but in fact, you’re supporting a local business. Not only that you’re reducing the milage which in turn reduces your carbon footprint.\nBuy your lunch at local café’s and restaurants/sandwich shops. If they’re buying locally and you spend buying lunch with them rather than Greggs, Tescos, or Waitrose, you know that your local shop will keep employing staff locally, rather than your money going to shareholders outside the area. Again, you would be reducing the mileage your sandwich makes which in turn reduces your carbon footprint.\nLabour is here to listen to your business needs! Our members are extremely well connected and are active in business networking groups and can listen to how we can help your business grow.\nRead our Manifesto on A Fairer and More Prosperous Economy"
}