{
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_campaigns_petition-bring-banking-hub-portchester/content_23.html": "I love Portchester, with its rich history, fantastic community groups and great shopping precinct, and I'm passionate about its regeneration.\nBut since we lost Lloyds Bank, we have been without a dedicated banking facility.\nThat's why I'm now campaigning for a banking hub in Portchester. It's the ideal location where banks can join together and provide face-to-face services.\nIf you support bringing a banking hub to Portchester, sign my petition below.\nSuella",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_contact/content_5.html": "Skip to main content\nMain navigation\nAbout Suella\nNews\nCampaigns\nIn Parliament\nContact Suella\nArticles\nMinisterial Roles\nContact\nLeave this field blank\nSuella Braverman, MP for Fareham and Waterlooville\n14 East Street, Fareham, PO16 0BN\nSuella Braverman\nSuella Braverman\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_campaigns_defence/content_29.html": "With our rich heritage of the Royal Navy locally, I am a keen supporter of our Armed Forces. In an increasingly uncertain and dangerous world, the job they do is more vital than ever in keeping us all safe. I will continue to press ministers to make the Armed Forces a priority.\nFully Equipping Our Aircraft Carriers\nOn 20th May 2024, I asked the Minister for Defence Procurement about how the increase in defence spending would be used to fully complement our aircraft carriers.\nWe are rightly proud of our Royal Navy in Fareham, and our aircraft carriers in Portsmouth have created thousands of jobs and been a real asset to our defences.\nHowever, we know that the Carrier Strike group lacks the jets, frigates, destroyers and submarines that were originally planned.\nSpeaking in the Chamber, I asked James Cartlidge MP, Minister for Defence Procurement:\n“In Fareham, we are rightly proud of our world-class aircraft carriers docked in nearby Portsmouth, providing thousands of jobs and being a huge credit to our Royal Navy. However, we all know that neither the Queen Elizabeth nor the Prince of Wales has as many jets, small warships or submarines as originally planned. Will the Minister please tell me how further defence spending will be used to bring online the full complement of F-35 jets, for example, so that our carrier strike group has the full capability to meet the modern threats of today?”\nArmed Forces Parliamentary Scheme\nAs a member of the Armed Forces Parliamentary Scheme from 2015 to 2017 I have visited a number of military facilities, both locally and around the world. The Armed Forces Parliamentary Scheme, which was launched in 1989, opens a unique window into the world of everyday life in the armed forces and the tasks they are asked to undertake on our behalf. The objective of the scheme is to help parliamentarians understand the work of the armed forces and foster genuine personally informed contributions to participate in defence debates.\nI joined the scheme in 2016 and visited different branches of the armed forces. Members are given the chance to select which branch of our armed forces they wish to be assigned to: the Royal Navy; the Royal Air Force; or the Army.\nI visited the British Army Training Unit Suffield (BATUS) in Calgary, Canada, as a guest of the Army. I met a wide range of serving troops as they underwent combat training, and met with soldiers from all ranks of the British Army, including those from the Royal Tank Regiment, Tactical Operations, Commanding Flight Officers, Royal Signals, Royal Electrical and Mechanical Engineers and the light Infantry.\nOn another visit, I was welcomed onboard HMS Prince of Wales, while it was being built in Rosyth dockyard, where I met the men and women of the Royal Navy who will be responsible for operating the vessel from their future base port of Portsmouth Naval Base. I was given an in-depth tour of the ship’s facilities, weapons stations and flight-deck.\nI spent time with troops here in the UK on a number of other deployments. I trained for three days at The Defence Academy, Shrivenham, where I got my hands on the Army’s latest weaponry and took part in live firing using the SA80 assault rifle and the L129A1 sharpshooter rifle, among other weapons. But my longest, and most challenging visit was with 1 Assault Group Royal Marines and 45 Commando during a cold weather training exercise in Norway.\nI graduated from the scheme in August 2017.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_government-announces-tv-license-fee-freeze/content_15.html": "On Monday 17 January the Government announced that they are freezing the TV licence fee for the next two years. Suella welcomed these measures that will help to support families by keeping the cost of living down. In Monday’s announcement the Government confirmed that the fee will remain at £159 until 2024 before rising in line with inflation for four years.\nIn response to the BBC wanting to raise the annual fee to £180, Nadine Dorries MP, Secretary of State for Digital, Culture, Media and Sport, argued that “at a time when families are facing a sharp increase in their living costs we simply could not justify asking hard-working households to pay even more for their TV licence.” In agreement with this, Suella is pleased that sensible action has been taken that will benefit working-families and pensioners who are currently feeling the pressures of global inflation the hardest.\nIn 2019 Suella wrote to the BBC expressing her deep concerns over the BBC’s decision to end the free TV licence for over-75s. In her letter to the BBC Suella said, “We all know that elderly people are more susceptible to illness, loneliness, restricted mobility and disease, which means the ability to watch TV and remain entertained and informed in their homes is a huge lifeline.” In knowing how important the license is, Suella took comfort in the fact that the action being taken by the Government will be of significant benefit to many Fareham residents.\nSuella is very supportive of the BBC and believes it is a fundamental institution in our society and around the world. The BBC has played an important role in providing us with first-class information and entertainment over the last 100 years, the measures announced on Monday will still see the BBC receiving significant funding. By introducing the freeze, the BBC will still be able to continue producing their widely appreciated content, whilst at the same time helping people to meet their costs of living.\nThe BBC license freeze is one of the first steps in the Government’s road map for reform of the BBC. In light of the huge changes in the broadcasting landscape over the past decade, Suella agrees that the Government should rightfully be taking action to keep the BBC up to date with its audience.\nCommenting Suella Said:\n“The BBC wanted the fee to rise to over £180 by the end of the settlement. Instead, it will remain fixed at £159 until 1 April 2024. That’s more money in the pockets of pensioners; in the pockets of families who are struggling to make ends meet.”",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_wates-house-success/content_10.html": "HOME OFFICE DROPS WATES HOUSE PLANS\nI am delighted with the news today that the Home Office has dropped plans to house illegal migrants at Wates House. A copy of my press release and media statement is below. I have also published a short video on Youtube.\nI am delighted that the Home Office has listened to me and local people and that Wates House will no longer be used for illegal immigrants. Thank you to over 1,000 local people who signed my petition.\nAs soon as I was informed about these planes, I wrote to the Home Secretary and urged the Home Office that housing asylum seekers at Wates House would be inappropriate, unsafe and wrong. I am glad that they listened to my requests.\nWe know this won’t be the end of the matter. This terrible Labour Government scrapped the Rwanda deterrent on day one of taking power, has overseen a record level of illegal crossings and has no plans to stop the boats.\nI continue to urge FBC to lease Wates House to house local people. We have an excellent Conservative Council, and this is the perfect time for them to step in for residents on the housing waiting list’.\nThank you all again for your help and messages of support. It is greatly appreciated.\nSuella",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_contact-suella/content_2.html": "Before contacting Suella, please read the following:\nWhen making contact, please include your full name and home address. All emails will receive an automatic reply to confirm receipt. If you do not receive this or other email correspondence that you may be expecting, then please check your junk/spam folder. Please note, we can only respond to emails that are not part of a mass mailing campaign. My views and opinions on national issues which I receive bulk emails on, can be found here:\nYou can write to me at the following address:\nThe Rt Hon Suella Braverman KC MP\nMember of Parliament for Fareham and Waterlooville\n14 East Street\nFareham\nPO16 0BN\nTel: 01329233573\nEmail: Click here to complete the email contact form.\nPlease provide your full name and Fareham home address within all correspondence. Our Privacy Policy can be found here.\nYou can also follow me on Facebook and Twitter, and subscribe to her email newsletter on the homepage.\nUseful websites and telephone numbers:\nPopular links\nUK Parliament\nWho is my MP?\nCitizens Advice Bureau\nNHS West Hampshire\nNHS local walk-in centres\nHampshire Police\nHampshire Police & Crime Commissioner\nHampshire Fire and Rescue\nSouth Central Ambulance Service",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_labour-waging-open-war-businesses/content_25.html": "The Telegraph, 14th March 2025\nLabour is waging an open war on businesses\nThe Government is relying on a discredited economic model that will impoverish us all\nWhenever I speak to small business owners in Fareham and Waterlooville – or anywhere across the country, for that matter – the conversation quickly turns to how they are coping under the new Labour Government.\nFrom cafés and pubs to dry cleaners and hairdressers, the story is the same: they are struggling. And not in a vague “times are tough” sort of way. It is much worse than that. They are struggling in the “we may not survive this” way.\nThe first hammer blow comes in the form of Labour’s changes to employer National Insurance contributions (NICs). From April 1st, the rate rises from 13.8 per cent to 15 per cent, while the threshold for contributions drops from £9,100 to £5,000.\nThe British Chambers of Commerce estimates that nearly a million businesses – overwhelmingly SMEs – will be forced to make difficult choices as a result. Some will cut back hiring. Others will slash wages or working hours. Many will simply close.\nTake the case of one local restaurateur I spoke with. He is a man who has spent 20 years building up his business. He told me he will have to entirely shut one of his three branches. The others, meanwhile, will have to cut their opening hours simply to cope with the sheer weight of staffing costs.\nFor employers in sectors like retail and hospitality – where payroll is a huge proportion of overheads – this will be devastating. The Office for Budget Responsibility estimates that these changes alone will add nearly 2 per cent to payroll costs. For an employee on a £50,000 salary, that’s an extra £1,106 per year in tax for the employer.\nThis will lead to a slower economy, a weaker labour market, and fewer opportunities – particularly for those on low wages. Labour claims to be the party of workers. In fact it is actively sabotaging the very businesses that employ them.\nAnd if the NIC hike was a kick in the stomach, Labour’s Employment Rights Bill is a strangulation. It is a trade unionist’s dream; it is written in the language of 1980s class warfare.\nListening to Labour MPs in Parliament this week, you could be forgiven for thinking that Arthur Scargill was about to triumphantly march through the chamber. Their worldview remains binary: bosses bad, workers good. And this Bill is a revenge fantasy that punishes employers for a variety of imagined sins.\nThe measures are staggering in their economic illiteracy. Day-one unfair dismissal rights for employees – once a safeguard earned after two years of service – will now be automatic. This means small business owners, already facing punishing tax hikes, will also find it harder to dismiss underperforming staff. They will think twice before hiring anyone at all.\nFor those using zero-hours contracts – a lifeline in sectors like hospitality – Labour has also decided to interfere. SMEs will be forced to guarantee hours after just 12 weeks of work. At the same time they will be hit with compensation costs for last-minute shift changes. The reality of this will be fewer flexible jobs and fewer work opportunities for young people.\nThe Government’s own impact assessment is damning: £5 billion in new costs for businesses over the next decade. The Regulatory Policy Committee rated the Bill as “not fit for purpose.”\nAnd then there is the naked power grab for the unions. Labour is handing them everything they have ever wanted. The minimum notice period for strikes is being cut from 14 to 10 days; this makes it even harder for businesses to plan ahead.\nStrike mandates will now last for a year instead of 6 months – effectively ensuring prolonged disruption. Union officials will also be given greater access to workplaces. This gives them free rein to organise and agitate.\nThe results will be predictable: more strikes, less productivity, greater costs for business. At a time when Britain needs to be leaner, more competitive and more flexible, Labour is doing the opposite – dragging us back to the sclerotic economic model of the past.\nAnd yet, when challenged on this, Angela Rayner couldn’t name a single business that supports the Bill. Not one. The silence was deafening. That’s not because businesses are shy about their view – it is because Labour has waged open war on them.\nThe consequences of these policies will be severe. Hiring freezes, closures, job losses, inflationary pressures – Labour is setting up Britain for economic ruin. Will they realise before it’s too late? Or will they continue their crusade against the very businesses that keep this country running?\nSuella",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_suella-progressing-campaign-protect-tpo-trees/content_19.html": "Last month, I updated Fareham and Waterlooville residents on the disappointing situation where Fareham Borough Council was forced to remove Tree Preservation Orders (TPOs) from seven trees.\nContinuing this campaign, I wrote with Paul Holmes, MP for Hamble Valley, to the Lords Minister for Housing and Local Government, asking for further assurances from the Government on this issue.\nIn previous correspondence, the Minister stated, “I can assure you that I have passed on your comments to departmental officials for their consideration.” Responding, we asked for an update on the departmental officials’ conclusions.\nFurthermore, we asked for an update on their review of the reintroduction of Article 5 certificates—a potentially useful tool to stop the felling of TPO trees.\nWe have not received a response from the Department yet.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_politics-conviction/content_35.html": "I recently had the pleasure of penning an article for Finitio. A news channel for employers and job seekers. I wrote about my experiences as an MP as well as my thoughts and advice for anyone of thinking of going into politics.\nBeing an MP is no ordinary job. It’s a calling where you must juggle many roles—representative, employer, employee, team player, and even entrepreneur—all at once. You need to be proactive, tough, determined, and adaptable. These are qualities that are just as important in business as they are in politics.\nAfter a decade in Parliament, one thing is clear: you must stay true to yourself and stick to your principles. They’re the politicians who act, not just follow the crowd. I’ve always hoped to be one of them—someone who prioritises the country’s needs over personal or party interests.\nSadly, many newly elected Labour MPs are realising the hard way that politics doesn’t always match up with their ideals. Just weeks after taking office, they were forced to vote to cut the Winter Fuel Allowance and back a tax on small family farms. Privately, many are torn between their conscience and the party machine. But in today’s Labour Party, you can’t rise through the ranks without compromising your principles.\nIt’s clear from history that some of the most well-known MPs have been among the most controversial. Thatcher, Blair, Corbyn, Johnson, and Farage. Whether you agree with them or not, one thing is true: they are politicians who didn’t shy away from standing up for what they believed in, even if it wasn’t popular. Love or loathe them, they were and are unapologetically themselves. Politics is about making difficult decisions, not trying to please everyone. After all, outside Westminster, in pubs and living rooms across the country, people speak their minds. So, why should politicians be any different?\nI came into politics because I genuinely care about this country. My parents came here as immigrants, worked hard, integrated, and embraced everything that makes Britain great. When I see mismanagement and decline, I don’t just get angry—I become motivated. This is a wonderful nation, but we’ve lost some of our confidence. We are not realising our potential. We need leaders who believe in Britain and can restore pride in what made it great.\nBeing an MP is a busy and varied job. There’s the day-to-day work of helping constituents with issues like school places, roads, and pensions. It doesn’t matter whether people voted for me or not—my job is to represent everyone in Fareham and Waterlooville and help them as best I can. Whether it’s holding surgeries or public meetings, I’m always learning what matters most to the people who put their trust in me.\nThen there’s the big stuff —the issues that grab the headlines. These are the moments when you need to be sure of your position. In politics, confidence matters. If you’re clear about your views, your message will come across strongly. It’s like any other field: if you believe in what you’re doing and work hard at it, you’ll succeed.\nI’ve had the privilege of holding several Ministerial roles, including as Home Secretary, which is the job I’m probably best known for. But even from the centre of power, I found myself frustrated by how hard it is to make real, lasting change. I pushed for us to leave the ECHR and cut levels of immigration, but I kept hitting a brick wall. That’s the nature of politics—frustrating, slow, and often maddening.\nBeing an MP is a balancing act. On the one hand, I’m a local representative, working hard to fix the issues that matter most to my constituents. On the other, I’m constantly campaigning for causes that impact the country. Every five years, I’m judged by the public, which is both the privilege and challenge of being an elected official. And as we saw with the Conservative Party’s crushing defeat last year, the public’s judgment can be swift and unforgiving.\nThe Conservative Party, which I’ve had the honour of representing at four General Elections (2015, 2017, 2019, and 2024), is still recovering from its biggest defeat. Too many in the party are reluctant to admit that more of the same isn’t enough anymore. The political landscape has changed, and we need to adapt.\nIn 2019, millions of people voted for a party that promised to govern with conservative values. But instead, we became too focused on appeasing critics and trying to win over the wokerati elite of Westminster. We lost sight of the real concerns of everyday British people. People don’t want to pay higher taxes—they want to keep more of their money. They want better services, strong borders and less interference from the government. That’s the essence of common-sense conservatism, but for too long, we missed the mark.\nWe raised taxes on individuals and small businesses to levels never seen before when we should have been cutting them. We allowed immigration to spiral when it should have been brought under control. And we got caught up in virtue signalling—whether it was kneeling for BLM or embracing net-zero energy policies at a time when we should have been securing energy independence. These were missed opportunities, and the consequences are clear.\nWe need to learn from leaders like President Trump, who shook up the political system in ways that left the establishment stunned. I was lucky enough to attend his Inauguration, and it was obvious: the old ways of doing politics no longer work. People are demanding politicians who stand by their principles and act with conviction. From Italy to Argentina, from the Netherlands to the El Salvador, the political mainstream is being shaken up. It’s time for us to listen.\nIf you’re thinking about getting into politics, my advice is simple: go for it—but make sure you know what you’re signing up for. Start small—get involved in local politics and focus on the issues that matter in your community. Even small actions can have a big impact if you stay focused on the bigger picture. Politics is about people—so be decent, be honest, and stay true to your values. If you do, success will follow.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_plan-jobs-restart-scheme-goes-live/content_26.html": "This Government’s Plan for Jobs is helping millions of people across the country who have been directly impacted by the Covid-19 pandemic. As we continue on the Prime Minister’s roadmap to recovery and sectors of our economy reopen, we have seen recent improvements in the employment figures with a continued increase in the number of vacancies and workers on company payrolls. We know that those who have been out of work for longer periods might need extra help to move back into employment. As announced last year, the Restart Scheme will give Universal Credit claimants who have been out of work for between 12 to 18 months enhanced and tailored support to find jobs.\nFor some this might be bespoke training to take advantage of opportunities in a growth sector or to succeed in a major recruitment exercise, for others it might be support to get the right certificates to take up a job in a different industry such as construction or transport or to update skills such as IT. Importantly, providers will work with employers, local government and other partners to deliver tailored support for individuals – they are the experts and have detailed knowledge of local labour markets and skills shortages in their area.\nReferrals will be made over a three-year period and the Restart Scheme is expected to help more than a million Universal Credit claimants who are expected to look for and be available for work but have no sustained earnings, with £2.9bn of funding allocated The scheme will be rolled out across England and Wales, as a fully devolved matter HMT have confirmed consequential funding for Scotland and Northern Ireland separately.\nDWP Work Coaches have started conversations with claimants from 28th June 2021, with referrals to providers expected from 12th July 2021. DWP has worked with providers across England and Wales to implement the Restart Scheme as quickly as possible while building on its long experience of successfully delivering large scale schemes.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_events_feed/content_27.html": null,
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_cdn-cgi_l_email-protection/content_16.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_ministerial-roles/content_6.html": "Home Secretary\nI served as Secretary of State for the Home Department between September 2022 to November 2023, appointed by both Prime Ministers Liz Truss and Rishi Sunak. My priorities were stopping the small boats crossing the Channel, common sense policing and keeping the British people safe. I was the most senior woman in the UK Government.\nAttorney General\nBetween 2020 and 2022, I was the Attorney General (the government’s most senior Law Officer, attending Cabinet), under Boris Johnson. As Attorney General, I successfully challenged the ‘Colston Statue’ case in which the Court of Appeal agreed with me that human rights cannot be a defence to serious damage caused in course of protests. I also oversaw improvements at the Crown Prosecution Service and Serious Fraud Office. I was the first Minister after Boris Johnson to visit Ukraine in June 2022 to lead global efforts to support the War Crimes prosecutions by the Ukrainians against Russians suspected of murder, rape and other horrific crimes against civilians.\nParliamentary Under-Secretary of State at the Department for Exiting the European Union\nIn Theresa May’s government in 2018, I served as a Junior Minister in the Department for Exiting the European Union. During this time, I was responsible for the Withdrawal Agreement Bill. I resigned from this position in 2018 when it became clear that the Withdrawal Agreement would keep Northern Ireland inside the Customs Union and annex Northern Ireland to the European Union. I voted against the Withdrawal Agreement 3 times, making me one of the ‘28 Spartans’.\nPrior to my ministerial career, I was a PPS to the Treasury and sat on the Education Select Committee.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_category_Media/content_17.html": "The 2025 Margaret Thatcher Freedom Lecture 3rd April 2025 It was my pleasure to deliver the annual Margaret Thatcher Freedom Lecture earlier this year in Washington D.C. The full video can be found here: https://www... Media\nMy latest interview with Spectator TV! 3rd April 2025 Following the UK hosting the first major international summit to tackle illegal migration, I had the pleasure of joining Spectator TV to discuss whether Labour... Media\nLabour's employment rights bill is terrible for the economy 26th March 2025 In the House of Commons I asked my Conservative colleague Kevin Hollinrake MP for his advice on what advice he would give to employers in Fareham &... Media\n‘Migrant’s Rights Are Taking Priority Over the Human Rights of British People!’ 25th March 2025 On my latest appearance on GB News, 25th March 2025, I warned the UK has become a “paradise” for asylum seekers due to activist lawyers, NGOs, and a legal... Media",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_category_Opinions/content_28.html": "Suella: Speaker Bercow has ensured the Government has to improve its Brexit deal 18th March 2019 Published in The Telegraph - 18.03.19 Can people trust their politicians? That seemingly trite question will be tested over the next 10 days. As an MP who gave... Opinions\nTelegraph: Let's not be cowed by fear into accepting there is no alternative to this defeatist, fake Brexit 3rd December 2018 My parents emigrated to the United Kingdom from Kenya and Mauritius in the 1960s. They were born during the British Empire and admired this country. The UK that... Opinions\nYour services, your say 6th August 2018 Since first being elected in 2015, local health issues and services have been a priority for me. I have been working closely with Fareham Community Hospital... Opinions\nWhat Brexit means for the Conservatives 29th March 2018 We are, rightly, asking what Brexit means for not just our country, but our party. It is not unfathomable that other parties are asking of themselves the same... Opinions\nBroadband in Fareham 4th September 2017 Broadband in the UK has been evolving at a rapid pace. As recently as 2004 only 50% of UK households had internet connection. Even in 2010, only 45% of... Opinions\nTrade after Brexit will not just benefit Britain, but the world 28th July 2017 As the new Chairman of the European Research Group, I am passionate about making the uplifting case for Brexit: that of opportunity, freedom and prosperity... Opinions\nWe need a radical plan to reform family justice in the coming Conservative manifesto 23rd April 2017 On June 8th, the country will have the chance to choose a Conservative government, with Theresa May’s steady hand at the helm. And as we embark on a new journey... Opinions\nBrexit is a golden opportunity for women 17th March 2017 Last week we marked International Women’s Day – a day to celebrate our contribution to social, economic, cultural and political achievements. Rightly we should... Opinions\nI’m Proud Of This Government’s Action On Domestic Abuse 10th March 2017 Raped, beaten and destitute, Sarah (names changed) had nowhere else to go. Aged 28, and with her young son, she faced no other option than to leave the place... Opinions",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_suella-objects-southen-waters-latest-plans/content_33.html": "I've submitted my objection and concerns to Southern Water as part of their latest consultation as part of the Hampshire Water Transfer and Water Recycling Project.\nMore information on the project can be found on Southern Water's website\nLocal community group Havant Matters has also set up a very useful website; this has lots of information and is a great reference to use.\nMy five-page objection is here. I am objecting to the proposals over concerns about water quality, biodiversity impacts on Langstone Harbour, harm to The Solent, the inadequate consideration of alternative options and Southern Water's disregard for local people.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_suella-opposes-southern-waters-dramatic-price-increase/content_11.html": "I have written to the CEO of Southern Water, strongly objecting to their outrageous price increases. It it totally unfair for executives excessive bonuses when Southern Water continues to fail local people.\nThe full word text is below, and a copy of the letter attached.\nSent on Tuesday 29th April 2025\nAs Member of Parliament for Fareham and Waterlooville, I am writing in complete opposition to your latest increase in charges for local residents.\nTo increase wastewater charges by 51.5% at a time when most other bills are going up shows a complete ignorance of the views of local residents, highlighted by the deftness shown to the wishes of the community by Southern Water in numerous consultations on all aspects of the company.\nSouthern Water has made no attempt to justify this increase in charges and can point to no tangible improvement in its services that would justify a price increase at all, let alone one that hikes the average bill up by over £200 annually. Investment in ‘water recycling’ projects and other unproven technologies has been regularly opposed by the community, and yet is prioritised over improvements to basic services that so many Hampshire residents rely on.\nSouthern Water also has a track record of repeated failure, being subject to total fines of over £126 million by Ofwat for dumping raw sewage, including a record £90 million fine after 51 offences of breaching environmental law. Time and again, local residents have made clear their views on price increases, pollution treatment, and their opposition to untested technology being used in unnecessary projects, and time and again, Southern Water has completely ignored their concerns and ploughed on ahead regardless.\nIt is hard not to see this price increase as passing the burden of Southern Water’s continued failings onto local people, who are seeing no return on a more expensive failing service. Southern Water seems to have almost no regard for how low its reputation has shrunk. It has so far refused to make any improvements to alleviate local residents' opinion that it is one of the worst utility companies in the country.\nI note that last year you took home a £183,600 bonus, with Southern Water’s executives being paid over £1,000,000 in base pay, bonuses, and pensions, and yet local residents are still subject to appalling failings on leakage, sewer flooding, and the feeling that Southern Water simply does not care about them.\nIt can’t be right that Southern Water are able to increase its charges so exorbitantly when residents consistently receive a poor service in return.\nThe money received by Southern Water should go directly towards fixing our local water infrastructure, delivering a better service to consumers, and not to paying executives or shareholders. I urge you to strongly reconsider this decision to impose further costs on local residents.\nYours sincerely,\nSuella\nRt Hon Suella Braverman KC MP\nMember of Parliament for Fareham & Waterlooville",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_category_Westminster-News/content_14.html": "Suella Welcomes Government's Plans to Live With Covid 24th February 2022 Earlier this week the Prime Minister unveiled the Government's plans for how England will live with Covid in the future. In his statement to the House of... Westminster News\nSuella Welcomes £350 Government Support for Households in Fareham to Help with Energy Costseham to Help with Energy Costs 1st February 2022 As the UK economy continues its recovery from the pandemic, the Conservative Government have stepped in to confront the global inflationary pressures caused by... Westminster News\nGovernment Announces TV License Fee Freeze 21st January 2022 On Monday 17 January the Government announced that they are freezing the TV licence fee for the next two years. Suella welcomed these measures that will help to... Westminster News\nSuella Visits Eastern Hampshire Police Investigation Centre 29th October 2021 Last week the MP for Fareham visited the Eastern Hampshire Investigation Centre, off the back of her initial visit in 2019, when the facility opened. Hampshire... Westminster News\nSuella's Budget Statement 28th October 2021 Yesterday we witnessed the Conservative Government’s Autumn Budget and Spending Review. This was a comprehensive budget that will help working families meet the... Westminster News\nPlan for Jobs Restart Scheme Goes Live 5th July 2021 This Government’s Plan for Jobs is helping millions of people across the country who have been directly impacted by the Covid-19 pandemic. As we continue on the... Westminster News\nNew Post-Pandemic Educational Recovery Plan Announced 10th June 2021 Throughout this crisis, children across Fareham have exhibited unwavering resilience and fortitude by seamlessly adapting to the unfamiliar space of online... Westminster News\nPrime Minister Publishes Integrated Review 20th March 2021 I was pleased that the Prime Minister has recently published the Integrated Review, the most comprehensive articulation of a foreign policy and national... Westminster News\nBudget Shows Conservatives’ Commitment to Protecting Jobs and Livelihoods as we Build our Future Economy 3rd March 2021 Budget delivers on commitment to provide security and stability to the British people through the pandemic – providing over £407 billion of support for families... Westminster News",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_new-bursary-ex-service-personnel/content_36.html": "I have welcomed a move by the Government that will see pupils in Fareham and across the country benefit from the leadership of our Armed Forces.\nThe government has unveiled a new £40,000 bursary for ex-service personnel to retrain as a teacher. From September 2018, courses at universities nationwide will offer the incentive to veterans who have left full-time employment in the British Army, Royal Air Force or Royal Navy in the last five years, or anyone leaving before training begins.\nThe new bursary will help ex-personnel – who have spent their career honing the discipline, motivation and unique skills needed to become great teachers –transition to the classroom where they can share their expertise and professionalism with the next generation.\nThe bursary is part of the Department for Education’s commitment to the Armed Forces Covenant – the nation’s promise to those who serve or who have served – and will be offered on priority undergraduate courses in biology, chemistry, computing, maths or modern foreign languages.\nOur ex-service personnel offer a level of expertise, life experience and professionalism that cannot be found anywhere else. Qualities developed through their military experience, such as leadership and self-discipline, are directly transferable to the classroom and to pupils themselves. I know this would be of great benefit to pupils in Fareham. They have already given so much service to our country, it is only right that we support them to retrain when they decide to return to civilian life.\nEducation Secretary Damian Hinds said: \"academic standards are rising, with 1.9 million more children in good or outstanding schools and a record 15,500 more teachers than in 2010. We want this trend to continue and to explore every opportunity to attract the best and brightest into teaching. Our ex-servicemen and women – who have already contributed so much to our country – have a wealth of experience and expertise that can be shared in the classroom, teaching pupils the knowledge they need to succeed alongside vital skills, such as leadership and self-discipline.\"\nDefence Secretary Gavin Williamson said: \"our incredible troops have unrivalled life experiences and world-class skills that will motivate and inspire a generation of children in classrooms across the country. Through leadership, teamwork and problem solving, veterans are ideally suited for a career in teaching once they leave the Armed Forces. This programme not only offers our valued veterans a new and fulfilling career, it will help our children achieve their aspirations and life goals.\"\nChief of Defence People, Lieutenant General Richard Nugee said: \"this initiative, under the Armed Forces Covenant, is another great addition to our wider resettlement offer of courses, mentoring, and advice, helping our serving personnel successfully transition into civilian life.\"\nI graduated from the Armed Forces Parliamentary Scheme last summer, a scheme that enables MPs to experience life in different parts of the forces so they can be better informed in debates. I completed a number of exercises in the UK with the Army, and took part in cold weather training in Norway with the Royal Marines Commandos (as seen in the picture).",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_category_Local-News/content_13.html": "Suella opposes Southern Water's dramatic price increase 1st May 2025 I have written to the CEO of Southern Water, strongly objecting to their outrageous price increases. It it totally unfair for executives excessive bonuses when... Local News\nSuella to Host 2025 Health Summit 10th April 2025 Later this month, I will be hosting my annual Health Summit. I am holding this important community event to give Fareham & Waterlooville residents a chance to... Local News\nSuella objects to Southen Water's latest plans 9th April 2025 I've submitted my objection and concerns to Southern Water as part of their latest consultation as part of the Hampshire Water Transfer and Water Recycling... Local News\nWates House - success! 5th April 2025 HOME OFFICE DROPS WATES HOUSE PLANS I am delighted with the news today that the Home Office has dropped plans to house illegal migrants at Wates House. A copy... Local News\nLocal Conservative MPs unite to oppose water recycling at new Havant Thicket reservoir 27th March 2025 Local Conservative MPs have united to oppose water recycling at the new Havant Thicket reservoir. Suella has joined Havant MP Alan Mak and East Hampshire MP... Local News\nMore Chagos Labour chaos! 10th February 2025 Speaking in the House of Commons, Suella said: \" I think I am right in saying that I am the only Member of the House of Commons, if not Parliament as a whole... Local News\nWaterlooville Regeneration: Have Your Say! 6th February 2025 You have the opportunity to take part in Havant Borough Council’s consultation on the regeneration of Waterlooville’s Town Centre. The next stage of engagement... Local News\nSUELLA’S FIGHT TO SAVE HENRY CORT: Help Stop Henry Cort’s Closure Before It’s Too Late 6th February 2025 I’ve talked to many Fareham residents about Hampshire County Council’s proposals to close Henry Cort Community College. If this goes ahead, the education of... Local News\nSuella Progressing with Campaign to Protect TPO Trees 5th February 2025 Last month, I updated Fareham and Waterlooville residents on the disappointing situation where Fareham Borough Council was forced to remove Tree Preservation... Local News",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_suellas-budget-statement/content_30.html": "Yesterday we witnessed the Conservative Government’s Autumn Budget and Spending Review. This was a comprehensive budget that will help working families meet the cost of living, support businesses’ recovery, deliver world-class public services, and drive economic growth across the country. It is a budget that will aid the people of Fareham in their recovery from the pandemic.\nWe have been able to deliver such a revolutionary budget, as thanks to our economic plan, our recovery will be quicker than expected. The OBR now expects the economy to return to pre-pandemic levels by January, earlier than previously expected. Similarly, the long-term damage to the economy is expected to be 2 per cent rather than 3 per cent. This has allowed us to introduce several measures to help working families, public services, and businesses. The economy is growing, and debt is falling. This budget puts us on track for economic recovery and prosperity.\nThis Conservative Government is resolute in its commitment to vulnerable households and this budget will aid families with the cost of living. The budget has introduced a significant tax cut for low-income families by reducing the Universal Credit taper rate from 63 per cent to 55 per cent, a 6.6 per cent increase in the National Living Wage to £9.50 an hour, giving a £1,000 pay rise to 2 million of the lowest paid and lifting pay restraints for public sector workers. Furthermore, we have introduced a freeze in fuel duty for the twelfth consecutive year, and a freeze in alcohol duty, alongside radical reform that will allow people in Fareham access to a simpler, fairer and healthier system.\nI know that businesses in Fareham have expressed concern over businesses rates and I am therefore pleased that businesses will also benefit from new measures, including a 50 per cent cut in business rates next year for 90 per cent of retail, hospitality and leisure, alongside a freeze of all rates, the creation of new business rates relief to encourage green technologies and improvements to properties, and a doubling of creative industries tax reliefs for the UK’s world-leading theatres, orchestras, museums and galleries.\nOther measures to drive economic growth include record investment in our roads, railways and broadband; supporting innovation through a record £20 billion spending on R&D; and a huge uplift in skills training through T-levels, Institutes of Technology, and apprenticeships.\nFinally, we are also introducing a new Draught Relief which will apply a new, lower rate of duty on draught beer and cider, cutting duty by 5 per cent, the biggest cut to cider duty since 1923 and the biggest cut to beer duty for 50 years. This will mean that you will be paying less pounds for your pint. I am proud to be part of a Government that has delivered on its promises so comprehensively and that has provided a robust budget for the whole of the United Kingdom from Fareham to Falkirk.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news/content_7.html": "Suella opposes Southern Water's dramatic price increase Thursday, 1 May, 2025 I have written to the CEO of Southern Water, strongly objecting to their outrageous price increases. It it totally unfair for executives excessive bonuses when Southern Water continues to fail local people. The full word text is below, and a copy of the letter attached. Sent on Tuesday 29th April 2025 As Member of Parliament for Fareham and Waterlooville, I am writing in complete opposition to... Local News\nWe must abolish the Equality Act 28th April 2025 Individual worth needs to come before group identity: this is the best foundation for justice One thing became unmistakably clear after the Supreme Court’s... Articles\nThe WHO has not just lost its way – it has been captured 20th April 2025 My article for The Telegraph on the World Health Organization and the need for urgent reform. Broader coverage is here: UK in race to opt out of WHO lockdown... Articles\nWe need to wake up to the tragedy of British Steel 14th April 2025 We need to wake up to the tragedy of British Steel The Labour Government’s net zero absolutism is undermining our national security and economic self... Articles\nSuella to Host 2025 Health Summit 10th April 2025 Later this month, I will be hosting my annual Health Summit. I am holding this important community event to give Fareham & Waterlooville residents a chance to... Local News\nSuella objects to Southen Water's latest plans 9th April 2025 I've submitted my objection and concerns to Southern Water as part of their latest consultation as part of the Hampshire Water Transfer and Water Recycling... Local News\nMother jailed for Southport X post should be freed 8th April 2025 Mother jailed for Southport X post should be freed I recently shared my thoughts on the case of Lucy Connolly. I believe she should be freed from prison. My... Articles\nWates House - success! 5th April 2025 HOME OFFICE DROPS WATES HOUSE PLANS I am delighted with the news today that the Home Office has dropped plans to house illegal migrants at Wates House. A copy... Local News\nThe 2025 Margaret Thatcher Freedom Lecture 3rd April 2025 It was my pleasure to deliver the annual Margaret Thatcher Freedom Lecture earlier this year in Washington D.C. The full video can be found here: https://www... Media\nMy latest interview with Spectator TV! 3rd April 2025 Following the UK hosting the first major international summit to tackle illegal migration, I had the pleasure of joining Spectator TV to discuss whether Labour... Media",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_privacy/content_12.html": "This document outlines how Suella Braverman processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Suella Braverman\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Suella Braverman .\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Suella Braverman , or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Suella Braverman via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk/content_1.html": "I'm honoured to be the Member of Parliament for Fareham and Waterlooville. On this site, you can find my news, articles, and more about me. I'd love to hear from you, so please feel free to get in touch.\nSign my petition urging Hampshire County Council to repurpose Henry Cort for SEN children.\nI'm now campaigning for a banking hub in Portchester. It's the ideal location where banks can join together and provide face-to-face services.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_campaigns_young-people/content_34.html": "Apprenticeships\nI think it’s vital that every young person in Fareham is aware of the opportunities that are available to them. I believe apprenticeships don’t just enormously benefit the individual, giving them the opportunity to earn while they learn, but also wider society by enabling us to have a skilled workforce and by raising productivity in the businesses they join.\nLocally, I am continuing to champion apprenticeships by hosting my annual apprenticeships fairs – connecting businesses, offering locals and national opportunities to the very talented young people we have here in Fareham. Since 2015, there have been 5,750 apprenticeship starts in Fareham.\nAt my last event, I was delighted to welcome around 200 young people from local schools, colleges and users of the Fareham Job Centre. On the day, people were able to meet and engage with a diverse range of employers. This included the following organisations: Office for National Statistics, Barclays, Platinum Care Solutions, Fareham College, Kiwi Education, City of Portsmouth College, Reach4Skills, Warsash Maritime School, Military Mentors, NATS, Safran, Caldera, Kelvion, Solent University, Showcase Training, The Estée Lauder Companies, Royal Army, Armorgard, Saab Seaeye Ltd, and Hampshire County Council Skills & Participation.\nIt was lovely to see so many friendly stallholders and current apprentices on hand to share their valuable experiences. It’s also great to hear of the success stories that have come out of the fairs. I recently met with people who had gained apprenticeships from one of my previous fairs and was delighted to see how they have flourished since deciding to do an apprenticeship. As such, it was fantastic to see that there were lots of opportunities offered on the day, with many more people registering interest for a variety of future positions.\nIf you are a local business and would like to participate in my next Apprenticeships, Skills and Jobs Fair, please do get in touch.\nFareham College\nI am very supportive of the introduction of T-Levels. A few years ago, I was delighted to visit Fareham College with the Secretary of State for Education to unveil their new T-Level teaching facilities. Fareham College is an outstanding local institution, and these new developments typify the school’s forward-thinking and innovative ethos.\nThe introduction of T Levels represents an exciting opportunity for students to actively launch their desired careers by honing relevant industry skills that will place them in good stead post-education. The revamped facilities at Fareham College ensure that local students will benefit from the latest technological advancements and trade expertise.\nSEND\nOn Monday 29th April 2024, I raised my concerns with the Education Minister about Labour’s cruel policy to add 20% to fees for independent schools, which will be incredibly damaging for our excellent SEND schools in Fareham like St. Francis’s and Heathfield School.\nSpeaking in the Chamber, I said:\n“St Francis School and Heathfield School are two excellent special educational needs schools in Fareham, supporting a variety of children with conditions ranging from Down’s syndrome to epilepsy, but around the country there are 95,000 children at independent special educational needs schools. Does my hon. Friend agree that Labour’s misguided attack on independent schools will be harmful and punitive to vulnerable children all around the country?”\nMichaela Community School\nMichaela Community School is an excellent free school and I’m proud to have been involved in its set up as Chairman of Governors in 2014. I’ve been championing our Free Schools policy for years. I’ll keep doing so because I believe these schools improve the lives of children.\nThanks to the autonomy they enjoy, teachers are empowered to innovate in education. That’s how we raise standards for children.\nAnd here’s the debate I led in Parliament a few years ago setting out how we get more out of free schools. If we want to improve educational outcomes and social mobility we need to build more Michaela’s around the country: https://hansard.parliament.uk/commons/2019-06-19/debates/CBF61E6C-746E-4DB9-9FB2-8F3A65E5F9FF/FreeSchools",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_mother-jailed-southport-x-post-should-be-freed/content_32.html": "Mother jailed for Southport X post should be freed\nI recently shared my thoughts on the case of Lucy Connolly. I believe she should be freed from prison. My comments in the article from The Sunday Telegraph are below:\nLucy Connolly is a victim of a politicised two-tier justice system in Starmer’s Britain, and she should not be in prison.\nYes, her comments were crass, tasteless and vile, and I disagree with them. Lucy deleted them quickly and apologised for her error of judgement.\nThat is why the sentence of 31 months’ custody for her first-time offence seems excessive.\nShe has deliberately been made an example of to intimidate others into silence. George Orwell was out by 40 years. Otherwise, he was spot on.”",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_about-rss/content_3.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_labour-doing-nothing-secure-our-borders/content_24.html": "15th February 2025, The Telegraph\nWe must free ourselves from these absurd human-rights shackles\nIs that it? That’s what the government’s latest plan to “smash the gangs” left me thinking. Their Border Security, Asylum and Immigration Bill was debated in Parliament this week and left a lot to be desired. Surprise, surprise, it won’t stop the boats.\nWhat was I expecting? Sir Keir Starmer has spoken occasionally about his “personal mission” to address the migration crisis, citing his experience in tackling organised crime as DPP. Yvette Cooper, meanwhile, has dismissed the Rwanda scheme as an “unworkable gimmick.” The rhetoric is polished, but the results paint a different story. Since the ‘adults have been in charge’, illegal crossings have increased by 30 per cent. The number of migrants in hotels has gone up by 6,000, enforced and voluntary returns of small boat arrivals are down and the asylum backlog is up.\nThis week alone the Telegraph reported a series of perverse judgements which saw a Gazan family allowed to come to the UK on the basis that they qualified under our Ukrainian Refugee Scheme, a Nigerian woman’s human rights claim to stay here bolstered by her membership of a terrorist group and a Ghanaian winning the right to stay in Britain after a “proxy” marriage she did not attend. So much for Starmer’s ‘Plan for Change’. Illegal migrants are making the most of this Labour government and heading to the Kent coast in their droves. Assisted by the liberal lawyer elites embedded in our government, our judiciary and our establishment, Britain’s borders have been flung wide open.\nThe fatal flaw with Labour’s approach is painfully obvious. As the National Crime Agency and the newly appointed Border Security Commander have made clear, deterrence is critical if the gangs are to be robbed of their business model. Deterrence means more than just quicker processing and more prosecutions – it means that those who come will not be allowed to stay. Labour’s plan of focussing on arresting and prosecuting migrants more swiftly is almost laughable in its naivety. Anyone with experience in this field will tell you that, once someone sets foot on UK soil, our criminal justice system, asylum appeals, and legal loopholes work to facilitate their stay.\nTalk to any Border Force officer, and they’ll explain how rights of appeal, legal challenges, and endless reconsiderations trap our system in bureaucratic stasis. Even if the pilot of a migrant boat is arrested, they’ll likely invoke their rights under Article 8 of the Human Rights Act and these days, argue that their child can’t eat foreign chicken nuggets! Good luck securing a prosecution under those circumstances. It might sound cynical, but the truth is that the vast majority of those arriving on small boats are economic migrants coming here for money, not fleeing war zones. And Labour’s plans do nothing to address this fundamental problem.\nThe reality is that those coming here illegally know the risk of deportation is so low they’re ready to gamble their lives on a treacherous journey across the Channel. Our open borders have fuelled a vile industry of smugglers ready to risk lives for profit. Every time someone drowns, it’s a sickening reminder of the horror of their final moments and the shame that our country couldn’t prevent it.\nThat’s why Labour’s scrapping of the Rwanda scheme (while flawed in its execution, the plan was a step in the right direction) is wrong. It sends a simple message to those weighing up the risks: if you get here, you’ll most likely get to stay. Labour’s Bill this week goes further in opening our borders and incentivising the people smugglers: it gets rid of the laws that I delivered as Home Secretary which banned illegal migrants from claiming asylum or British citizenship and ends the powers to remove illegal migrants from the UK. Granted, the previous Conservative government failed to stop the boats but at least we made more of an attempt through our Rwanda scheme than this lot.\n£150 million has been pledged – mostly to the French, on top of the hundreds of millions we gave them when we were in office. There are drones over the Channel (presumably alongside the ones we’ve been using for years) and a snazzy rebranding as the “Border Security Command.” I’ll admit, it’s catchier than the “Small Boats Operational Command” I set up in 2023. But the most innovative idea? The new Border Security Commander has been empowered to… “write an annual strategic document and report on progress”. Hardly Trump-style action.\nSo, what is the solution? Firstly, we need a deterrence that stops the boats from setting out in the first place. That’s why the Rwanda scheme is the right idea. But to make that deterrence work – and this is where we Conservatives patently failed – we need to fundamentally overhaul our human rights laws. That means scrapping the Human Rights Act, extricating ourselves from the European Convention of Human Rights and the Strasbourg Court and reforming our judicial review framework. And lastly, we need more heavily resourced and functional operations: greater powers to our Border Force officers, more immigration detention spaces and quicker processing. If Starmer were serious about what he pledges, he could amend his pathetic Borders Bill to include these changes. Of course, he won’t.\nOther countries, like the USA, Italy, Greece and now Denmark are demonstrating what is possible when there is the political will to reclaim control over the border. Millions of pounds and snappy slogans won’t be enough. It is up to our political leaders to grasp the nettle and fix this crisis. The question is: who will do so?",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_campaigns/content_20.html": "Petition: Bring a Banking Hub to Portchester I love Portchester, with its rich history, fantastic community groups and great shopping precinct, and I'm passionate about its regeneration. But since we lost...\nPetition: Bring special education needs school to Henry Cort I’m determined to save The Henry Cort Community College. To support my campaign, please sign my petition below. Hampshire County Council have taken the decision...\nPetition: Stop Southern Water's waste water plans Southern Water are proposing a scheme to clean recycled effluent—wastewater—at Budds Farm to turn it into drinking water, which will be used to top up the new...\nPetition: Stop Wates House Asylum Plans The Home Office is proposing to house asylum seekers in Wates House, Fareham. I consider it inappropriate for asylum seekers to be accommodated in this area...\nSave Our Shopping Centres We need to improve our local shopping centres. That’s why I’ve supported local developers as they invest in WV, for example on Wellington Way where we are...\nCrime & Policing As Home Secretary, I fought hard for victims of crime and for the law-abiding patriotic majority. I increased the powers available to the police to take knives...\nYoung People Apprenticeships I think it’s vital that every young person in Fareham is aware of the opportunities that are available to them. I believe apprenticeships don’t...\nHealth The NHS is a vital service, and one we all care about deeply. My mother worked as a nurse for 45 years, so it is particularly close to my heart. Doctors and nurses do an amazing job and want what is best for their patients, and we in return rely on being able to access dedicated healthcare where and when we need it.\nInfrastructure, Transport and Housing Improving local infrastructure and transport, along with local planning issues across Fareham, are important priorities for me. We need to keep investing in proper travel connections and the services to support people in their work and leisure time. M27\nDefence With our rich heritage of the Royal Navy locally, I am a keen supporter of our Armed Forces. In an increasingly uncertain and dangerous world, the job they do is more vital than ever in keeping us all safe.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_parliament/content_22.html": "Utilities: Fees and Charges | Department for Energy Security and Net Zero | Written Answers To ask the Secretary of State for Energy Security and Net Zero, what steps his Department plans to take to ensure that increased charges by\nUtilities: Fees and Charges | Department for Energy Security and Net Zero | Written Answers To ask the Secretary of State for Energy Security and Net Zero, whether his Department plans to take steps to allow consumers to challenge t\nAffordable Housing: Housing Benefit | Department for Work and Pensions | Written Answers To ask the Secretary of State for Work and Pensions, what assessment her Department has made of the potential impact of maintaining the leve\nElectric Vehicles: Excise Duties | Treasury | Written Answers To ask the Chancellor of the Exchequer, whether her Department plans to use the newly applied Vehicle Excise Duty on Electric Vehicles to im\nHousing: Standards | Ministry of Housing, Communities and Local Government | Written Answers To ask the Secretary of State for Housing, Communities and Local Government, if she will make an assessment of the potential merits of bring\nRoads: Investment | Department for Transport | Written Answers To ask the Secretary of State for Transport, whether she plans to include improvements to connecting commuter roads in villages and towns in\nRoads: Standards | Department for Transport | Written Answers To ask the Secretary of State for Transport, what steps her Department plans to take to improve road (a) services and (b) networks.\nHousing: Construction | Ministry of Housing, Communities and Local Government | Written Answers To ask the Secretary of State for Housing, Communities and Local Government, whether her Department has made an assessment of the numbe\nHousing: Construction | Ministry of Housing, Communities and Local Government | Written Answers To ask the Secretary of State for Housing, Communities and Local Government, whether her Department has made an assessment of the quali\nHousing: Construction | Ministry of Housing, Communities and Local Government | Written Answers To ask the Secretary of State for Housing, Communities and Local Government, whether her Department has made an estimate of the number&",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_campaigns_petition-bring-special-education-needs-school-henry-cort/content_18.html": "I’m determined to save The Henry Cort Community College. To support my campaign, please sign my petition below.\nHampshire County Council have taken the decision to relocate Henry Court Community College to North Whiteley. I know many of you will share my disappointment at this decision.\nI'm urging HCC to repurpose the site into a dedicated school for Special Educational Needs (SEN) children.\nHenry Cort is an excellent school and we have seen an exponential rise in the number of children diagnosed with SEN in Hampshire. This site would be perfect for providing the support and services needed for SEN children and their families.\nMy history of actions on Henry Cort\n- On 5th February, I spoke in the House of Commons, asking the Secretary of State for Housing Communities & Local Government to urgently stop the proposals. Link to clip here.\n- On 3rd February, I wrote to HCC, formally responding to their consultation. In this letter (attached), I objected to the proposals and stipulated that, should HCC ignore the community and close Henry Cort, the site should be repurposed as a SEND education provider.\n- I wrote to many local residents, encouraging them to have their say and take part in HCC’s consultation which ended on 14th February.\n- On March 17th I raised the issue again in the House of Commons during the Children's Wellbeing & Schools Bill.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_feed/content_9.html": null,
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_map-locations/content_8.html": "This map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_category_Articles/content_4.html": "We must abolish the Equality Act 28th April 2025 Individual worth needs to come before group identity: this is the best foundation for justice One thing became unmistakably clear after the Supreme Court’s... Articles\nThe WHO has not just lost its way – it has been captured 20th April 2025 My article for The Telegraph on the World Health Organization and the need for urgent reform. Broader coverage is here: UK in race to opt out of WHO lockdown... Articles\nWe need to wake up to the tragedy of British Steel 14th April 2025 We need to wake up to the tragedy of British Steel The Labour Government’s net zero absolutism is undermining our national security and economic self... Articles\nMother jailed for Southport X post should be freed 8th April 2025 Mother jailed for Southport X post should be freed I recently shared my thoughts on the case of Lucy Connolly. I believe she should be freed from prison. My... Articles\nThe police are facing terminal decline 1st April 2025 The Telegraph, 28th March 2025 The police are facing terminal decline We often hear about the public’s loss of confidence in the police. This is no longer just... Articles\nThe Politics of Conviction 25th March 2025 I recently had the pleasure of penning an article for Finitio. A news channel for employers and job seekers. I wrote about my experiences as an MP as well as my... Articles\nLabour is waging an open war on businesses 14th March 2025 The Telegraph, 14th March 2025 Labour is waging an open war on businesses The Government is relying on a discredited economic model that will impoverish us all... Articles\nI will never be truly English: here is why 26th February 2025 The Telegraph, 26th February 2025 I will never be truly English: here is why For decades, political leaders have been afraid to celebrate Englishness for fear... Articles\nLabour is doing nothing to secure our borders 15th February 2025 15th February 2025, The Telegraph https://www.telegraph.co.uk/news/2025/02/14/labour-doing-nothing-border…... Articles",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_news_suella-speaker-bercow-has-ensured-government-has-improve-its-brexit-deal/content_31.html": "Published in The Telegraph - 18.03.19\nCan people trust their politicians? That seemingly trite question will be tested over the next 10 days. As an MP who gave up my Ministerial job over the Prime Minister’s Withdrawal Agreement in November to vote against it twice, I am being pulled between conscience and surrender.\nCan I keep those promises that I made as a Leave campaigner of taking back control of our laws, striking free trade deals, controlling migration and escaping the subordination of the European Court of Justice? Pledges repeated by the PM herself and in the Conservative manifesto upon which we all stood? The vow that ‘No deal is better than a bad deal’?\nIf I vote for the PM’s deal, I most definitely cannot keep any of those promises. Of that I am sure. The PM’s deal is not Brexit, or rather, it is a sham Brexit. Yes, we leave the institutions of the EU on March 29th but beyond that, Brexit evaporates. For the duration of the Implementation Period and its extension, ie until December 2022 (over 6 years after the Referendum), we will still be following EU laws, with no say whatsoever on them. Our courts will be bound by the ECJ and Free Movement will continue.\nIf I vote for the deal now, what will I say when I am asked why we are disabled from striking that free trade deal with the USA? Why we can’t set our own tariffs or are still following EU rules and regulations? What will I say when border checks between GB and NI mean that part of our nation is treated differently by the EU to the rest of the UK? What will I say when we try to leave the NI Backstop only to find ourselves locked in protracted legal battles because we relinquished our right to leave to a handful of unelected, unaccountable quasi-judicial arbitrators?\nAs the Attorney General confirmed last week, the ‘legal risk remains unchanged.’ This is a deal which squanders all of the benefits of Brexit whilst retaining the handicaps.\nWhat about the case for compromise? The alternative to rejecting this deal, I am told, is a horrific extension to Article 50 and ‘No Brexit’. Brexiteers have been bullied by the establishment into this false and irreconcilable choice. The true choice should include a WTO Brexit, of course, which still remains the legal default in the event that no extension is agreed.\nI accept the votes in Parliament last week but I do not accept buckling now in the face of a sordid stitch-up and the threat of consequences which are out of my hands, only to enable a deal which will only harm our country’s interests in the long term.\nThere is still time to secure those legal changes to the NI Backstop as set out in the Brady amendment: a unilateral way out or a hard end date. There are also many known and unknown unknowns. Will there even be another vote if nothing changes? The Speaker's statement today makes that unlikely. I still do not know the enormity of any extension yet. Any extension will ultimately require endorsement by the Government, which will be its responsibility. I will do all I can to stop it.\nMany of my colleagues have been grappling with this Catch-22. Everyone will weigh up the risks and the facts in their own way and I see the logic that if we ‘just get out now’, we can move on from this interminable argument. I do not criticise and have nothing but respect for those who have lambasted the deal only to find themselves voting in favour of it now. They are taking ‘the win’ but with regret.\nAs for me, I cannot right now, take the phony prize. Just as soon as the celebratory balloons deflate and the champagne goes flat after the Brexit Day parties, so will the trust with the British people be lost.",
  "https_www_suellabraverman_co_uk_/https_www_suellabraverman_co_uk_campaigns_petition-stop-southern-waters-waste-water-plans/content_21.html": "Southern Water are proposing a scheme to clean recycled effluent—wastewater—at Budds Farm to turn it into drinking water, which will be used to top up the new water reservoir being created at Havant Thicket.\nThis means that, because of a water sharing arrangement with Portsmouth Water, it will then be supplied to local homes in the area as drinking water.\nThe technology is unproven in the UK and I have a lack of confidence in Southern Water to operate the scheme.\nIf you agree with me and do not believe local people want or support drinking recycled wastewater, fill in your details below to sign my petition against Southern Water's plans and tell the Labour government to reject the proposals.\nThank you,\nSuella"
}