{
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_out-about-reporting-potholes/content_33.html": "Over the weekend I reported some large potholes in Clowne on Harlesthorpe Avenue and Southgate Crescent (pictured), as well as the smaller potholes and surface deterioration on Chestnut Drive and Ramper Avenue. I've also asked for an update on the one's on Cliff Hill/Low Road - I'll update residents as soon as I receive a response. I also took some photos to update the Council on the state of Ringer Lane.\nI've been getting around the constituency as much as I can to help try and get our roads back in shape. But I cannot see every pothole, so please let me know about the ones in your area: https://www.mark-fletcher.org.uk/help-mark-fix-our-roads",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_mark-visits-brockley-primary-school/content_15.html": "Last week, I had the pleasure of visiting the amazing Brockley Primary School in Shuttlewood, where I was given a tour around the school by the headteacher and two of the school governors. The positivity and hard work of the staff and leadership team has created a great atmosphere for learning and the children were happy, friendly, and very well behaved – they are a credit to the local community.\nI am already looking forward to my next visit!",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_request-call-team/content_20.html": "Tweet Request a Call From the Team Leave this field blank Status message Sorry...This form is closed to new submissions.",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk/content_1.html": "Contact the current MP for Bolsover\nMark Fletcher is no longer the Member of Parliament for Bolsover. His office is now closed.\nContact the new Member of Parliament for Bolsover\nBy email - n[email protected]\nBy post - Natalie Fleet MP, House of Commons, London SW1A 0AA\nFurther contact details will be available online -https://members.parliament.uk/",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_bolsover-town-centre-levelling-funding-update-letter-residents/content_6.html": "Dear Neighbour,\nRe: Labour's £15m Bolsover Betrayal\nI am writing to you today to share some disappointing news. The Labour-run Bolsover District Council has submitted its final investment plan for the £15 million I secured for Bolsover town centre at the 2023 Autumn Statement. In doing so they confirmed my worst fears – this money is no longer going to be primarily spent in Bolsover town.\nYou will no doubt remember the headlines when the Government first announced this funding - even on Bolsover District Council’s own website (you might note they have conveniently deleted this page).\nUnfortunately, the allocation of this £15 million is tied to a bureaucratic technicality where it is known as 'place-based funding'. This enables the Council to decide where it is spent despite it having been fought for, and awarded for, the regeneration of Bolsover town centre. Regrettably, the Council has chosen to exploit this loophole to the fullest extent, opting to distribute the funds thinly across eight different places, conveniently represented by Labour Councillors. This decision not only massively dilutes the impact of the money but uses it to fund projects that have never been mentioned before in the entirety of my time as your Member of Parliament.\nThe current plans are incoherent, fail to meet the Government’s guidance for this fund, will not have the desired impact of levelling-up our town, and have been carefully curated for party-political purposes. A condition of the funds being released to the council is that their plans have the full support of their Member of Parliament and, at this time, I will not support them.\nI was very surprised when the local Labour Party decided to make securing the £15 million their own key campaigning pledge because this money had already been secured by me. But now it makes sense – they want to betray the town with the full knowledge of why it was secured in the first place and make me reject this money so I can be portrayed as the bad guy. Why would I want to block money that I secured in the first place?\nIn an ideal world, I would have £15m for each of the communities I represent. But I don’t, and I worked in good faith with the Council to put Bolsover first so that we could deliver for this community, improve our visitor economy, and bring jobs to Bolsover. In doing so we will boost tourism and bring more investment into our region, meaning we would have greater funding for long-term regeneration across the entire district.\nI realise it’s an election year and we should expect the Labour Party to pull stunts like this but that doesn’t take away from the genuine sense of betrayal and sadness I feel over this decision. From the outset I have been very clear about why this money was secured and what it was secured for – even Bolsover District Council agreed that it was to transform Bolsover town centre. Now they are playing political games and trying to make me look like a liar for standing up for what is right. I can’t accept that.\nThat’s why today I am asking Bolsover residents to do three things:\nI have launched a petition calling for Bolsover District Council to re-think their plans and instead put together a list of projects that actually focus on Bolsover town centre. I will be sending this petition to Leader of the Council Cllr Steve Fritchley and Cllrs Donna Hales, Ashley Taylor, Anne Clarke, Rowan Clarke, Cathy Jeffery and the fantastic Carol Wood. I am asking all Bolsover residents who want to see the £15 million used to regenerate the town – as was originally intended - to sign this petition and ask your neighbours to sign it too. You can find the petition online at: www.mark-fletcher.org.uk/labours-bolsover-betrayal or contact me for a paper copy.\nPlease call, email and write to your District Councillor asking them to spend the £15 million in Bolsover Town Centre. You can contact your Councillor using the details below;\nBolsover North & Shuttlewood\nDonna Hales [email protected]\nAshley Taylor [email protected]\nBolsover East\nAnne Clarke [email protected]\nRowan Clarke [email protected]\nBolsover South\nCathy Jeffery [email protected]\nCarol Wood [email protected]\nYou can speak to your Councillor by calling the Council’s enquiry line and asking to speak to them. The number to do this is 01246 242424.\nI have posted two videos to my Facebook page in which I outline the full history of their failed Levelling Up Fund bid and the Council’s decision to betray Bolsover. Residents deserve to know the truth about why they are no longer going to receive the funding they were promised. Please share this video with your friends and family.\nI know some residents will not like me because I’m a Tory, or just because I’m a politician, but I can put my hand on my heart and say I would never play political games with funding that I know means so much to residents. But the same doesn’t apply to the local Labour Party – they would rather I lose than Bolsover win. Frankly, I think that is shameful.\nWe have a final chance to fix this and I will do everything I possibly can to make that happen. With your support, we can make Cllr Fritchley change his mind and ensure this funding is used as it was intended – transforming Bolsover town centre.\nYours sincerely,\nMark Fletcher MP\nSign the petition and add your name now: https://www.mark-fletcher.org.uk/labours-bolsover-betrayal",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_cdn-cgi_l_email-protection/content_11.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_category_Newsletters/content_13.html": "Newsletter March/April 2024 18th April 2024 March to Mid-April Newsletter Dear Resident, I hope you enjoyed the Easter holidays! It's been a very busy few weeks since I sent out my 'Budget 2024 Update... Newsletters",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_about-rss/content_2.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_new-year-time-take-stock/content_34.html": "This time of year allows us to look back on the last twelve months. What we achieved and what we have to look forward to in 2024.\nAt the start of the year, we unfortunately had BUPA announce - without warning - they were closing the dentists. I am delighted that after working with Ministers at the Department of Health , and the local NHS, dental provision will return to the town early in 2024.\nAn interim caretaker service will operate from the site of the former Bupa practice while a long-term contract is finalised. This means Bolsover will once again have a permanent dental practice.\nIn August, our bid for a sixth form in the town was successful. This has been my most important campaign as an MP to date. Simply because it has the potential to change so many lives for the better.\nIt’s levelling-up in action, more opportunities, and improved life chances for young people living in Bolsover and the surrounding villages. I could not be any prouder of this achievement.\nIn November, I had the pleasure of being able to welcome the Prime Minister, Rishi Sunak MP, to The Bolsover School to celebrate the sixth form announcement. I genuinely hope the children in those classes will remember this moment for a lifetime.\nRegardless of politics, I think having the Prime Minister show his support for children in our constituency is amazing and it will help raise aspirations in areas which for too long have felt forgotten.\nLast, but my no means the least, the Chancellor, Jeremy Hunt MP, announced £15 million of funding for the regeneration of Bolsover Town Centre during the Autumn Statement.\nFor too long our local high streets have been neglected. That’s why I’m delighted to welcome the £15 million investment into the heart of Bolsover. The funding will support small businesses and regenerate our town centre to make it a more vibrant, convenient, and exciting place at the heart of our local community, as well as attracting tourists into our town.\nAlong with the recently announced sixth form, £24 million for the new urgent and emergent care department at Chesterfield Royal, and the new dental provision, we are making great progress in Bolsover.\nNow our attention must turn to delivering all of these projects.\nI hope you enjoyed the holidays and I wish you all the very best for 2024!\nWell where do I start … to say the General Election announcement came as a surprise, would be an understatement, but I'm looking forward to the next six weeks, speaking with residents is my favourite part of the job, so I hope to see some of you soon!\nThis will be my last update as yo",
  "https_www_mark-fletcher_org_uk_/http_www_mark-fletcher_org_uk_labours-bolsover-betrayal/content_8.html": "I secured £15 million for the regeneration of Bolsover Town Centre. But now Labour are playing games with YOUR money and have hijacked the bid. Tell your local representatives that you want the £15 million spent in Bolsover Town as originally agreed!\nSign the petition and add your name now: Click 'Next Page' below.\n“I call on Bolsover District Council to stick to the original funding agreement and spend £15 million on Bolsover Town Centre.''",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_accessibility/content_30.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_category_Local-News/content_9.html": "Potholes and Road Conditions 3rd January 2024 Potholes I’ve received a number of emails and calls regarding the state of our roads locally, which is completely understandable as they are in a poor state... ArticlesLocal News\nNew Year - A time to take stock 1st January 2024 This time of year allows us to look back on the last twelve months. What we achieved and what we have to look forward to in 2024. At the start of the year, we... ArticlesLocal News\nLocal PCSO recognised at Downing Street event 28th December 2023 It was an absolute pleasure to be able to welcome PCSO Suzanne Fox to Westminster and Downing Street, as part of an event to recognise local community safety... ArticlesLocal News\nBolsover Dentistry Update 15th December 2023 Residents across Bolsover should have received my recent letter updating them on the return of dental provision to the town. I met with NHS Derbyshire... ArticlesLocal News\nMy 4 Year Anniversary of representing Bolsover in Parliament 12th December 2023 Its been four years today since I was elected as MP for Bolsover which has been the greatest honour of my life. Despite the challenges of the pandemic, Russia's... ArticlesLocal News\nPM Rishi Sunak visits Bolsover School to welcome new sixth form 17th November 2023 Prime Minister Rishi Sunak today (Friday 17th November) to celebrate the town’s new sixth form. In August it was announced that the bid for a new free school... ArticlesLocal News\nMark visits Brockley Primary School 15th November 2021 Last week, I had the pleasure of visiting the amazing Brockley Primary School in Shuttlewood, where I was given a tour around the school by the headteacher and... Local News\nMark Fletcher Meets with Local National Farmers Union 10th September 2021 On Friday morning Mark met with the local National Farmers Union to discuss local farming and the pressures the industry is under. Farming has faced a number of... Local News\nMark Fletcher Holds Successful Scarcliffe Residents Surgery 3rd September 2021 On Friday Mark held his latest residents surgery in Scarcliffe to speak to residents about local issues. As well as holding his series of open forum village... Local News",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_local-councils/content_32.html": "Derbyshire County Council\nResponsibilities - Roads and Potholes; Adult Social Care; Libraries, Education/Schools; Business Licencing; Broadband; Public Health.\nWebsite - https://www.derbyshire.gov.uk\nContact Number - 01629 533190\nDistrict Councils\nBolsover District Council\nResponsibilities - Council Housing; Waste Collection; Recycling and Litter; Environmental Health; Dog Waste; Planning and Construction; Leisure Facilities.\nWebsite - https://www.bolsover.gov.uk/\nContact Number - 01246 242424\nNorth East Derbyshire District Council\nResponsibilities - Council Housing; Waste Collection; Recycling and Litter; Environmental Health; Dog Waste; Planning and Construction; Leisure Facilities.\nWebsite - https://www.ne-derbyshire.gov.uk/\nContact Number - 01246 231111\nParish Councils\nResponsibilities: Allotments, graveyards and cemeteries, bus shelters, community centres and village halls, footpaths, drainage, general spending in the parish, acquisition of land, having a say in planning, litter collection, public conveniences (such as toilets). Parish councils have a very wide ranging role and can help with many issues. For more information about the responsibilities of parish councils, follow the link here: LocalGov.co.uk - Your authority on UK local government - Parish council responsibilities\nAult Hucknall - 01246 851677 - [email protected]\nBarlborough - 01246 819776 - [email protected]\nBlackwell - 01773 810181 - [email protected]\nBrackenfield - 01773 570951 - [email protected]\nCalow - 07740 018584 - [email protected]\nClowne - 01246 811586 - [email protected]\nElmton with Creswell - 01909 724390 - [email protected]\nGlapwell - 07483 307611 - [email protected]\nHodthorpe and Belph - 01246 240495 - [email protected]\nHeath & Holmewood - 01246 857261 - [email protected]\nLangwith - 01623 746498 - [email protected]\nMorton - 01773 875185 - [email protected]\nOld Bolsover Town Council - 01246 823809 - [email protected]\nPilsley - 07565 158963 - [email protected]\nPinxton - 01773 580046 - [email protected]\nPleasley - 01623 819786 - [email protected]\nScarcliffe - 01246 240495 - [email protected]\nShirebrook Town Council - 01623 742475 - [email protected]\nShirland & Higham - 07912 270066 - [email protected]\nSouth Normanton - 01773 814306 - [email protected]\nStretton - 01283 537939 - [email protected]\nSutton-cum-Duckmanton - 01246 826955 - [email protected]\nTibshelf - 01773 875093 - [email protected]\nWessington - 07740 018584 - [email protected]\nWhitwell - 01909 726691 - [email protected]",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_getting-about-local-transport/content_24.html": "East Midlands Rail Timetables\nTimetable 01: Services to and from London St Pancras\nTimetable 02: Services from Liverpool and Manchester to Norwich\nTimetable 03: Services between Matlock, Derby, Leicester, Lincoln, Nottingham and Newark\nTimetable 04: Services from Nottingham to Worksop\nTimetable 05: Services from Derby to Crewe via Stoke-on-Trent\nTimetable 06: Services from Peterborough to Doncaster via Lincoln\nTimetable 07: Services from Nottingham to Skegness via Grantham\nConstituency Bus Services\nBarlborough\n53 - Sheffield - Clowne - Mansfield Stagecoach Grimsby-Cleethorpes\n53A - Halfway - Clowne - Pleasley - Mansfield Stagecoach Grimsby-Cleethorpes\n73 - Clowne - Renishaw - Crystal Peaks Stagecoach Yorkshire\n74 - Clowne - Spinkhill - Killamarsh - Crystal Peaks Stagecoach Yorkshire\n77 - Chesterfield - Staveley - Clowne - Worksop Stagecoach in Chesterfield\n77 - Chesterfield - Staveley - Clowne - Worksop Stagecoach Grimsby-Cleethorpes\n77A - Chesterfield - Worksop Stagecoach Grimsby-Cleethorpes\n77A - Chesterfield, New Beetwell Street - Worksop, Bus Station Stagecoach in Chesterfield\nBolsover\n1 - Newbold - Chesterfield - Hillstown - Langwith Stagecoach in Chesterfield\n1A - Newbold - Chesterfield - Hillstown Stagecoach in Chesterfield\n49 - Clowne - Bolsover - Glapwell - Holmewood - Clay Cross TM Travel\n53 - Sheffield - Clowne - Mansfield Stagecoach Grimsby-Cleethorpes\n53A - Halfway - Clowne - Pleasley - Mansfield Stagecoach Grimsby-Cleethorpes\n81 - Bolsover - Shuttlewood - Staveley - Markham Vale TM Travel\n583 - Long Duckmanton - The Bolsover School TM Travel\nClowne\n49 - Clowne - Bolsover - Glapwell - Holmewood - Clay Cross TM Travel\n53 - Sheffield - Clowne - Mansfield Stagecoach Grimsby-Cleethorpes\n53A - Halfway - Clowne - Pleasley - Mansfield Stagecoach Grimsby-Cleethorpes\n73 - Clowne - Renishaw - Crystal Peaks Stagecoach Yorkshire\n74 - Clowne - Spinkhill - Killamarsh - Crystal Peaks Stagecoach Yorkshire\n75 - Clowne Town Service Stagecoach Yorkshire\n77 - Chesterfield - Staveley - Clowne - Worksop Stagecoach in Chesterfield\n77 - Chesterfield - Staveley - Clowne - Worksop Stagecoach Grimsby-Cleethorpes\n77A - Chesterfield - Worksop Stagecoach Grimsby-Cleethorpes\n77A - Chesterfield, New Beetwell Street - Worksop, Bus Station Stagecoach in Chesterfield\nPleasley\n23 - Mansfield - Langwith Stagecoach Grimsby-Cleethorpes\n23B - Mansfield - Whaley Thorns Stagecoach Grimsby-Cleethorpes\n53 - Sheffield - Clowne - Mansfield Stagecoach Grimsby-Cleethorpes\n53A - Halfway - Clowne - Pleasley - Mansfield Stagecoach Grimsby-Cleethorpes\n135 - New Houghton - Shirebrook Community School McEwen Travel\nN12 - Mansfield - Warsop - Shirebrook - Pleasley - Mansfield Trent Barton\nPronto - Chesterfield - Mansfield - Nottingham Stagecoach Grimsby-Cleethorpes\nShirebrook\n1 - Newbold - Chesterfield - Hillstown - Langwith Stagecoach in Chesterfield\n12B - Mansfield - Shirebrook Stagecoach Grimsby-Cleethorpes\n23 - Mansfield - Langwith Stagecoach Grimsby-Cleethorpes\n23B - Mansfield - Whaley Thorns Stagecoach Grimsby-Cleethorpes\n135 - New Houghton - Shirebrook Community School McEwen Travel\n522 - Field Drive - Shirebrook Community School Stagecoach Grimsby-Cleethorpes\n524 - Whaley Thorns - Shirebrook School McEwen Travel\nSouth Normanton\n9.1 - the nines - Derby - Ripley - Alfreton - Sutton - Mansfield Trent Barton\n9.3 - the nines - Derby - Ripley - Alfreton - Mansfield Trent Barton\n56 - Chesterfield - Tibshelf - Alfreton Stagecoach in Chesterfield\n149 - Alfreton - Mickley - Hilcote - Sutton In Ashfield Littles Travel\n231 - Alfreton, Bus Station - Pinxton, Toll Bar Stagecoach Grimsby-Cleethorpes\nX1 - Chesterfield - Notitngham Stagecoach in Chesterfield\nTibshelf\n1 - Mansfield Woodhouse - Huthwaite – Alfreton Stagecoach Grimsby-Cleethorpes\n56 - Chesterfield - Tibshelf – Alfreton Stagecoach in Chesterfield\n140 - Hilcote - Tibshelf - Blackwell Schools McEwen Travel\n149 - Alfreton - Mickley - Hilcote - Sutton In Ashfield Littles Travel\n422 - Westhouses - Tibshelf School And Town End School McEwen Travel\nInformation found at bustimes.org",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_my-4-year-anniversary-representing-bolsover-parliament/content_10.html": "Its been four years today since I was elected as MP for Bolsover which has been the greatest honour of my life.\nDespite the challenges of the pandemic, Russia's invasion of Ukraine and energy crisis, we have made some great progress locally...\nSecuring Post-16 education with a new sixth form for Bolsover\n£15 million for the regeneration of Bolsover Town Centre\n351 extra police officers for Derbyshire\n£24 million for a new urgent and emergency care department at Chesterfield Royal Hospital\nStopping HS2 and lifting safeguarding\nRestoring NHS dental provision to Bolsover\n£17 million for a new urgent care village at Bassetlaw Hospital\n£8.5 million redevelopment of Bramley Vale Primary\n£30 million for local community diagnostics centers in Walton, Mansfield, and Kings Mill.\nDespite these achievements, I know there's more work to be done. Next year, I'll focus on local campaigns, including upgrades to Junctions 28 and 29 of the M1, improvements at Treble Bob Roundabout and Darfoulds Bridge, extending the Robin Hood Line, reopening the Maid Marion Line, and funding a new primary school for Tibshelf.\nI'm proud of what we've accomplished and keen to continue with your support. Thank you for entrusting me with this responsibility.",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_pm-rishi-sunak-visits-bolsover-school-welcome-new-sixth-form/content_21.html": "Prime Minister Rishi Sunak today (Friday 17th November) to celebrate the town’s new sixth form.\nIn August it was announced that the bid for a new free school sixth form by The Bolsover School and the Redhill Academy Trust had been successful. Mark Fletcher, MP for Bolsover, had been campaigning for the sixth form since being elected, as there is currently no post 16 education provision in the constituency.\nThis innovative new free school, set to open in 2026, will provide a range of academic and technical courses with strong ties to business and industry.\nHaving been invited by Bolsover MP Mark Fletcher, the Prime Minister was warmly welcomed by the Head Prefects and Matthew Hall, the Headteacher. He is the first sitting Prime Minister in history to visit the constituency.\nDuring his visit He was shown around the school by the Head Prefects, Georgia and Jacob, and Mr Fletcher, before joining Year 7 students, including Chloe Ellis and Prue Pope (pictured) in their science lesson experiments.\nCommenting local MP, Mark Fletcher, said:\n“It was an honour to welcome the Prime Minister to Bolsover today, the first time that a sitting PM has ever visited our Constituency.\nI’d like to thank him for taking the time to engage with students at the school. To see the faces of those year 7’s as he walked into the room is something I’ll never forget. For these young people to be able to spend time with the Prime Minister of the UK is an opportunity of a lifetime. It reiterates the PM’s commitment to improving education, and we’re going to see that here in Bolsover with the new sixth form\nI know the community are incredibly excited about what the sixth form will offer, and all I can say at this stage is Mr Hall and I are working flat out to get all the details sorted. Hopefully the Prime Minister will come back to open it in the future!“\nHeadteacher Matt Hall added:\n“We are very honoured to welcome Prime Minister Sunak to our school. It was an experience that students and staff will never forget.”\n“We had the unique opportunity to showcase our amazing school to the Prime Minister and for our students to tell him about their ambitions – to attend university, to follow exciting and challenging career paths, and to make a difference in the world.”\n“Bringing post-16 education to Bolsover will be a game changer for this community; nurturing aspirations, raising achievement and opening doors for ambitious young people. Once open, our enviable facilities will allow students to continue their studies in the sciences amongst an academic curriculum, giving them a springboard into university and industry.”\n“This is just the start of an incredibly exciting project, with work having already begun on procuring a site. Our modern academic sixth form centre will have the potential to improve employability and life chances in Bolsover and the surrounding area for generations to come.”",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_bolsovers-young-peoples-market/content_16.html": "On Saturday I attended the inaugural Teenage Market in Bolsover Town Square.\nIt was a pleasure to attend the market and see the enthusiasm and talent of the young people from our district. The event provided a great platform for them to showcase their skills and entrepreneurial spirit. Initiatives like this are vital in helping our young people achieve their aspirations and feel proud of their contributions.\nThe town square itself looked fantastic, and the recent resurfacing has made a real difference. The area now feels more welcoming and attractive for such events.\nI know a lot of hard work goes on behind the scenes to make these events successful and credit must go to Old Bolsover Town Council for making this happen.\nI look forward to attending more events in Bolsover Town Square and continuing to support our young entrepreneurs.",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_services-residents/content_12.html": "Need my help? Find everything you need here on this page.\nHere is my Services for Residents page. If there is anything that you would like my help with please do not hesitate to get in touch.\nWhether you would like to request a surgery appointment, have a phone call with me, or whether there's something my brilliant casework team can assist with - there's lots of ways I can help.\nYou can also find links to some brilliant local charities and other organisations that may also be able to lend a helping hand when you need it most.\nI look forward to helping!\nMark.",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_privacy/content_28.html": "This document outlines how Mark Fletcher processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Mark Fletcher\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Mark Fletcher.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Mark Fletcher, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Mark Fletcher via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_bolsover-dentistry-update/content_22.html": "Residents across Bolsover should have received my recent letter updating them on the return of dental provision to the town.\nI met with NHS Derbyshire Integrated Care Board last week where further discussions were held on patient lists for the new permanent practice.\nI will continue to provide further updates for residents in the new year.",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_marks-regular-newsletter/content_29.html": "Here you can read past copies of my newsletter. You can sign up for future editions below.\nAttachments\n| Attachment | Size |\n|---|---|\n| February 2024 Newsletter (4 MB) | 4 MB |\n| January 2024 Newsletter (5.46 MB) | 5.46 MB |\n| December 2023 (3.86 MB) | 3.86 MB |\n| November 2023 (6.58 MB) | 6.58 MB |\n| October 2023 (3.87 MB) | 3.87 MB |\n| Post 16 Education Special (3.35 MB) | 3.35 MB |\n| Late Summer 2023 (5.62 MB) | 5.62 MB |\n| Late July 2023 Newsletter (7 MB) | 7 MB |\n| Early Summer 2023 Newsletter (944.56 KB) | 944.56 KB |\n| Spring 2023 Newsletter (732.1 KB) | 732.1 KB |\n| AFPS Special Newsletter (264.92 KB) | 264.92 KB |\n| March 2023 Newsletter (897.84 KB) | 897.84 KB |\n| February 2023 Newsletter (621.29 KB) | 621.29 KB |\n| January 2023 Newsletter (484.29 KB) | 484.29 KB |\n| December 2022 Newsletter (868.87 KB) | 868.87 KB |\n| November 2022 (5.36 MB) | 5.36 MB |\n| October 2022 (4.91 MB) | 4.91 MB |\n| Summer Recap (4.49 MB) | 4.49 MB |\n| July 2022 (4.69 MB) | 4.69 MB |\n| June 2022 (1.22 MB) | 1.22 MB |\n| May 2022 (917.88 KB) | 917.88 KB |\n| Early April 2022 (3.3 MB) | 3.3 MB |\n| Late March 2022 (2.82 MB) | 2.82 MB |\n| March 2022 - Ukraine Special (3.64 MB) | 3.64 MB |\n| Mid March 2022 (3.68 MB) | 3.68 MB |\n| Early February 2022 (1.06 MB) | 1.06 MB |\n| Late February 2022 (5.13 MB) | 5.13 MB |\n| January 2022 (3.2 MB) | 3.2 MB |\n| HS2 and Local Railways ( special ) November 2021 (1.69 MB) | 1.69 MB |\n| Late November 2021 (2.3 MB) | 2.3 MB |\n| Mid-October 2021 (1.28 MB) | 1.28 MB |\n| Early September 2021 (2.27 MB) | 2.27 MB |\n| Late September 2021 (4.04 MB) | 4.04 MB |\n| July 2021 (2.68 MB) | 2.68 MB |",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_mark-fletcher-holds-successful-scarcliffe-residents-surgery/content_14.html": "On Friday Mark held his latest residents surgery in Scarcliffe to speak to residents about local issues.\nAs well as holding his series of open forum village hall meetings over the course of the summer, Mark has also continued to hold his regular series of resident’s surgeries.\nThe last visit of the Parliamentary recess was held in Scarcliffe at the Elm Tree pub where Mark met with a number of residents to discuss how he would be able to help.\nMark commented on the surgery:\n“I’ve really enjoyed today’s surgery in Scarcliffe, as always it’s a pleasure to see how I might be able to help residents and I’m grateful for them coming to see me.\"",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_cookies/content_27.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_newsletter-marchapril-2024/content_26.html": "March to Mid-April Newsletter\nDear Resident,\nI hope you enjoyed the Easter holidays!\nIt's been a very busy few weeks since I sent out my 'Budget 2024 Update' last month. I had two wonderful weeks back home for Easter recess, where Parliament rises and MPs return to the constituency, but now I'm back in Westminster with lots to be getting on with!\nThe biggest issue across our constituency continues to be potholes and the state of our roads. Derbyshire County Council are working hard to fill potholes and resurface roads across the county, but there's lots to do. I’ve already helped secure extra funding for our roads locally – with a further £176 million allocated for Derbyshire from HS2 savings. We are making progress with hundreds of potholes being filled throughout the area and some of our worst roads also being resurfaced. I know there's more work to be done, so I'll continue to try and get out and about across the constituency as much as I can, helping to get our roads back into shape.\nOver recent weeks we've also had some really positive economic news;\n- Inflation continues to fall.\n- The National Living Wage increased by 9.8% to £11.44 an hour.\n- 15 hours of free childcare a week became available to parents of 2 year olds.\n- National Insurance saw a further 2p cut - taking it from 12% last year to 8%. Saving workers on the average salary £900 a year.\n- And the State Pension increased by 8.5% - totalling £900 a year. This means the State Pension has increased by £3,700 since 2010 and over 30% since I was elected in 2019!\nAfter a challenging period, its clear that our plan is working. More jobs, wages up, inflation down, and the economy is growing. This, alongside recent tax cuts, will mean more money in your pocket. It’s important we stick to the plan.\nOne other issue I received a lot of correspondence on was the increase in Council Tax bills. Whilst almost all of us saw our bills increase, I was, like many residents across Elmton and Creswell, shocked to see the 93% increase in their council’s Parish Precept. I have written to the Parish Council, but I am yet to receive a response.\nElmton with Creswell Parish Council are holding a Special Public Meeting on Wednesday 17th at 7pm at Creswell Events Centre, to discuss the 93% increase in the Parish Precept. I will be in Westminster, so am unable to attend, but a representative from my office will be in attendance. I will continue to keep residents updated.\nFinally, the last few weeks have seen me welcome the Farming Minister, Sir Mark Spencer MP, to meet our local farmers, I’ve visited some wonderful schools, spoken to many residents on the doorsteps, and I’ve been getting my steps in while leafleting to update you on my work. I was delighted to present Mark North from the Freedom Project with an award - beating 650 other constituencies to be the best in the country! I welcomed Ros Horsley, Headteacher at Palterton Primary School, to Number 10 Downing Street. And Derbyshire received £14 million in additional funding for Special Educational Needs (SEN). I also was proud to attend the official opening of the new Bolsover dental practice. More on that + much much more below!\nI hope you enjoy this edition of my e-newsletter and I look forward to updating you next month. In the meantime, please do not hesitate to contact me if I can be of any assistance.\nBest wishes,\nMark\nFarming Minister Visits\nI was pleased to welcome the Farming Minster, Sir Mark Spencer MP to Elliott's Farm in Calow. We had a good roundtable discussion with a number of our brilliant local farmers, and toured the farm. I was sad to see their shop in Bolsover Town Centre close in January so was pleased to visit their fantastic farm shop on site. Thank you to Andrew and Nicola Elliot for inviting us and hosting the roundtable.\nOfficial Opening of the New Bolsover Dentist\nI was delighted to join the team at Treeline Dental Care, the new dentists in Bolsover town centre, to officially open the practice. After months of hard work ensuring dental provision returned to Bolsover after the previous practice closed last year, it was great to finally meet the team who will be providing dental care to our communities.\nMany residents have already been visiting the surgery and registering online. If you have already expressed your interest for being treated at the practice you don’t need to act you will receive an offer for an appointment in due course.\nFor now, the practice is prioritising children and treating those with urgent needs but it will expand into routine care at a later date. Once I have confirmation on when this will be, I will let you know.\nYou can contact the team on;\ntreelinedental.co.uk/new-patient-registration/\n01246 690 500\nI will continue doing all I can to further improve access to dentistry and better NHS services across our constituency.\nPotholes\nOur County Council has seen its road budget increase by 30% due to additional funding from the Government - with a further £176 million over the next ten-years from savings made by cancelling HS2. I'm working hard to get our roads back into shape and pushing for this funding to be delivered as quickly as possible.\nI continue to report hundreds of potholes across the constituency and liaise with the Cabinet Member for Highways to get some of the worst ones fixed. Over the Easter recess I was out in Clowne, Holmewood, Shirebrook, South Normanton, Bolsover, and Whitwell to report the state of our roads directly to the County Council, but if you know about a pothole or a road that needs resurfacing in your area please do get in touch and I'll work with the County Council to get it sorted\nIts also been great to see some road improvements across the constituency in recent weeks, including Hazelmere Road in Creswell (pictured), The Chine in South Normanton, Mansfield Road in Glapwell, and Victoria Road in Pinxton. We've also seen large and dangerous potholes on Boughton Lane in Clowne, Station Road in Whitwell, Elmton Road in Creswell, and outside Top Cat on Carter Lane in Shirebrook, plus many more, so thank you to Derbyshire County Council.\nI know there's a lot more work to do, so I'll keeping reporting potholes and chasing up enquiries, as well as requesting some of our worst roads for resurfacing. Please remember to report all potholes directly to Derbyshire County Council by using the link below.\nNew £14million SEN Funding for Derbyshire\nWe have some fabulous SEN provision within Bolsover, and I continue to work closely with the fabulous Stubbin Wood school in Shirebrook, however more can, and should, be done for our children with additional needs.\nI am too often contacted by parents who are finding it difficult to get the support they need for their child in their local school, and when I visit our local schools, and speak with our headteachers, provision and funding for young people with special educational needs is one of the main subjects raised.\nOur local authority is required to provide services for children and young people with SEND but we know that it’s not always easy for that provision to be made locally and at the level required.\nTo help, the Department for Education announced today further investment £850 million into local authorities across the country to improve services. £14 million of this has been allocated to Derbyshire, who can use this money to create new places in mainstream and special schools, as well as other specialist settings, and to improve existing buildings to make them more accessible and suitable for all.\nThis funding is part of a £2.6 billion package that has been committed to improve SEND services between 2022 and 2025, providing over 60,000 new places for children or young people with SEND or who require alternative provision. SEN schooling is a vital part of my plan to help the Bolsover constituency. I will continue to work hard to make sure the Government listens to what we have to say, and every child gets the start in life they truly deserve.\nStretton Handley Primary\nLast month, I had the pleasure of visiting Stretton Handley Primary in Woolley Moor. I had a tour of the school from headteacher Mrs Nicholson and got to see some amazing artwork on display, as well as host a whole school assembly to talk about my job and what I do as an MP.\nAfterwards I had a sit down with the year 5&6 class who asked me some very interesting questions about the most important law we've passed, whether I've made any laws, and my own experience in primary school. We also had a debate on why you should or shouldn’t be an MP and two children said they would like to do my job, so the Bolsover constituency may have a future MP from Woolley Moor!\nFreedom Community Project Wins MP's Choice Constituency Champion of the Year\nI was exceptionally proud this week to have been asked to present Mark North, CEO of Freedom Community Project, with the MP's Choice Constituency Champion of the Year award in Parliament.\nAll Members of Parliament had the opportunity to vote for the winner from nominations made by MP's across the country during UK Parliament Week.\nI am absolutely over the moon that Mark's Freedom Project was selected as the overall winner. There are organisations and people on the ground across our constituency who do phenomenal work within our communities day in and day out. Mark North and the Freedom Project are at the forefront of this.\nYou can read more about the award by clicking the link below.\nTiny Tots Nursery, Blackwell\nIt was great to visit Tiny Tots Day Nursery in Blackwell at the beginning of March – it was such a welcoming and calming environment for young children. The team obviously love their work, resulting in a really positive environment for the children. The early years are so very important in children's education, helping them to reach their full potential later in life. Last year the nursery received a very well-deserved OUTSTANDING report from Ofsted!\nThank you to Lisa and her team for all of their hard work in helping children from Newton, Pinxton, Blackwell, Westhouses and the surrounding areas get the very best start in life.\nPark House Primary, Lower Pilsley\nIn March, I visited Park House Primary School in Lower Pilsley. Education is one of my main passions and I'm always delighted to find a school with such considerate, engaged and enthusiastic children. It was a special non uniform day where the children took in some chocolate to add to their Easter raffle prizes.\nThe Headteacher, Mrs Kavanagh, showed me around and we had a good chat about some of the issues the school is facing, particularly with traffic and parking outside the school. I have made enquiries with Derbyshire County Council whether there is anything further can be put in place to help address the problems.\nMany villages and schools across the Bolsover constituency were built before cars were quite so prevalent, and many of the schools I visit experience similar problems, particularly around drop off and pick up times. I understand it's not always possible to walk your child to school, but I do encourage it wherever possible.\nDowning Street Headteachers Reception\nA few weeks ago, I attended a reception at 10 Downing Street with Ros Horsley, Headteacher at Palterton Primary School, to celebrate local education champions. It was great to speak to Ros about her school’s outstanding educational record and discuss how I can continue to support schools across our district.\nAt the event, we had an opportunity to speak to teachers from across the country about their successes and listened to a speech from the Minister for Schools, Damien Hinds MP.\nI have often received praise from parents about the work that Ros, and all of the fantastic staff at the school, do every day. It was great to have the opportunity to nominate Ros for the event and celebrate her work at the event.\nHeath Primary School\nA massive thank you to Mr Lynch for showing me around Heath Primary School a few weeks ago. I really enjoyed my tour of the school and seeing the new facilities, especially the massive hall, which I loved!\nIt was great to hear about the Embark Awards and efforts to encourage participation in the arts. The children are clearly very happy and engaging. The school is an absolute credit to the local community.\nI look forward to visiting again later this year!\nSafeguarding\nI had a very positive meeting with the Minister for Safeguarding and The Safeguarding Alliance to discuss the Government’s plans to prevent registered sex offenders from changing their names.\nAs you may know, I have been working with The Safeguarding Alliance to push for a ban on sex offenders changing their names for almost two years. It was almost a year ago to the day that I introduced the Sexual Offences (Prohibition of Name Change) Bill to the House of Commons, and I have had dozens of meetings on this issue since.\nThe Government has confirmed the law will be changed as part of the upcoming Criminal Justice Bill. Now, we must ensure the systems are in place so it can be enforced in the strongest terms and without delay. Once I have confirmation of exactly how this new law will be enforced, I will ensure to share this.\nI will continue my discussions with all stakeholders to ensure this Bill puts victims, and public safety, first.\nMorton Primary School\nIt was great to answer some thoughtful questions from the year 5&6 class at Morton Primary Academy on Friday! I also held a debate on banning school uniform, as an example of what my job is like in Parliament.\nDuring my visit I had a tour of the school facilities and listened to a wonderful story from Isaac.\nIt was great to hear about the schools efforts to engage with the local community since the academisation.\nA massive thank you to Miss Jackson for taking the time to show me around her wonderful school!\nBolsover Flowers\nIt was lovely to pop in on Marie and her team at Bolsover Flowers to welcome them to the town centre from their previous much-loved shop at Hillstown. The shop looks absolutely fantastic and the team are very busy getting orders together. As supporters of SSAFA and the RAF benevolent fund, and the team having links with the Armed Forces, the location by the Centotaph carries a special meaning for them. I wish them the very best of luck in their new shop.\nDog & Spoon Distillery, Westhouses\nI had a fascinating visit to the Dog & Spoon Distillery in Westhouses last week. A wonderful - award winning - small business right here in our constituency.\nThe business pride themselves on its sustainability and minimising waste, especially from water which is common with the distillation process.\nAs a gin drinker, it was very interesting to learn all about the process behind the end product!\nPlease check them out here: https://www.dogandspoondistillery.co.uk\nTrident Aid\nEarlier this month I met with a resident from Bolsover who runs Trident Aid, a charity which delivers humanitarian support to the people of Ukraine. Their next project is to deliver more medical aid to cities and villages, near the frontlines, to help the people who are left and most in need, including the elderly, disabled, and children.\nIt was great to meet a local resident in Bolsover, whilst out on Saturday, who is running an aid organisation to help support the people of Ukraine. I have received loads of emails about the war since Russia’s invasion and I’m incredibly proud of the Government’s military and humanitarian support.\nIf you would like to get in touch to help out please visit: https://tridentaid.org.uk/\nSlava Ukraini!\nNeed My Help - Book A Surgery Appointment\nIf you would like an appointment at my next surgery please email me at [email protected] or make a booking via my website below.\nAlternatively, feel free to email me, making sure to provide your FULL address and contact details. If you would prefer to speak to someone, feel free to give my office a call on 01246 932048.",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_work-experience/content_19.html": "I offer work experience opportunities to people throughout the constituency. The placement gives young people an insight into local politics and a chance to boost their skills. Work experience placements will be able to help with a number of tasks:\n- Casework (depending on complexity)\n- Researching issues\n- Writing press releases and getting an insight into communications work.\n- Having a chance to shadow me for the day, attending meetings in Westminster or in the constituency.\n- Assisting with various office duties.\n- Answering queries from constituents, either by 'phone or by email.\nWork experience is a brilliant way to see first hand the work that I do as our Member of Parliament. Whether you're looking to build skills or wanting to know whether working for an MP is for you, there's lot's to gain.\nIf you would like to join me for some work experience, please drop me an email at [email protected]",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_about-mark-fletcher/content_31.html": "My name is Mark Fletcher and I’m incredibly proud to be the MP for Bolsover, an area I now call home. I’m not from here originally, I grew up in Doncaster, a similar former mining area which feels unloved and left behind. I had a difficult life growing up, my mum died tragically while I was young, and I know what it’s like to feel ignored while the rest of the world moves forward without you. This is why I got into politics, I wanted to make a real difference and make sure opportunity is spread to everyone no matter where you grew up or what has happened to you in your past.\nBolsover is an amazing place, since coming here I have been blown away by the character of the different towns and villages across the constituency. My grandfather was a miner and my mum worked for British Coal, so I understand the unique challenges that the pits closing has left for us. It is my firm belief that with the right support and the right ambition we can bring industry and quality jobs back to Bolsover.\nComing from a state school background, I was the first member of my family to go to university and I had the opportunity to attend Cambridge and then on go to work in Westminster. As the Chief of Staff to the Prime Minister’s Trade Envoy to Uganda and Rwanda, I spent years promoting Britain’s international trade and development in other countries. I then moved into a role working on innovation in the healthcare sector therefore I know the great challenges that face the NHS and I understand the need for creative thinking to meet them.\nI am passionate about regenerating our area and fundamental to this is education. With education comes new ideas, ventures, business, jobs, and investment. I have been a Governor at two schools in the constituency and I am always working to improve outcomes and raise aspirations across our area.\nBolsover is a genuinely beautiful piece of this country and I’m passionate about showing the rest of the world what we have to offer. Our constituency has three distinct tourist attractions; Hardwick Hall, Bolsover Castle, and Creswell Crags. I want to create a more joined-up approach to these destinations by linking this to our cycle network, so that our area can benefit from cycle and short-stay tourism.\nI believe in a compassionate politics driven by my working-class British values. In 2016, I voted to leave the European Union as power needs to be accountable to the people and not held by unelected bureaucrats. In Parliament I am a member of a number of All-Party Parliamentary Groups (APPGs) which have allowed detailed discussion on a number of issues such as Domestic Abuse, our Regional Economy, and my own personal passion: British wrestling.\nYou can read about my primary campaigns here\nIf there are any issues I may be able to assist you with, please do not hesitate to contact me via email at [email protected], by post at 1 Market Place, Bolsover, S44 6PN, or telephone 01246 932048 or 020 7219 3000 to discuss your issue with my caseworker, or to arrange a telephone/video appointment.",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_request-surgery-appointment/content_23.html": "I hold regular face to face meetings with constituents at locations across the Bolsover constituency. These are normally on a Friday afternoon and take place in village halls, community centres and pubs to try and be as accessible as possible for my constituents. Unfortunately due to security concerns all surgeries are by advance appointment only. Please do let me know if you would like to attend an upcoming surgery by completing the form below.\nIn the meantime, if there are any issues I may be able to assist you with, please do not hesitate to contact me via email at [email protected], by post at 1 Market Place, Bolsover, S44 6PN, or telephone 01246 932048 or 020 7219 3000 to discuss your issue with my caseworker, or to arrange a telephone/video appointment.",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_bolsover-constituency-surgery/content_25.html": "I held my constituency surgery at my office in Bolsover earlier today. Thank you to all who came along.\nMy next surgery will be in Clowne on Friday 25th February, then South Normanton on 4th March, and Shirebrook on 18th March. Please email me [email protected] if you would like to make an appointment.",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_labours-bolsover-betrayal-0/content_5.html": "Earlier this month, following my letter and video to Bolsover town's residents about the Labour District Council's betrayal of the town's £15 million investment, the District Councillor for Bolsover North and Shuttlewood, Cllr Ashley Taylor, wrote an open letter to me outlining his views.\nIn the interests of openness, transparency and balance you can read his letter here (PDF)\nand you can read my reply here (PDF)\nSign the petition and add your name now",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_category_Articles/content_17.html": "Late May 2024 Newsletter - General Election called ! 29th May 2024 Well where do I start … to say the General Election announcement came as a surprise, would be an understatement, but I'm looking forward to the next six weeks... Articles\nGeneral Election Date Announced ! 22nd May 2024 So... the starting gun has been fired and there will be a general election on 4th July.... Articles\nBolsover's Young Peoples Market 20th May 2024 On Saturday I attended the inaugural Teenage Market in Bolsover Town Square. It was a pleasure to attend the market and see the enthusiasm and talent of the... Articles\n12 hr Spar to raise money for Youth Services in South Normanton 18th May 2024 On Sunday I have a great fun morning at The Post Mill centre supporting Rok-Ard Kickboxing and SNaP Youth with their 50/50 fundraiser. They're doing a 12 hour... Articles\nLabour's Bolsover Betrayal 24th April 2024 Earlier this month, following my letter and video to Bolsover town's residents about the Labour District Council's betrayal of the town's £15 million investment... Articles\nMark appears on BBC Politics East Midlands 21st April 2024 For a limited time you can watch the episode here BBC iPlayer - Politics East Midlands - 21/04/2024 We discussed my role as Assistant Whip in Parliament, Access... Articles\nElmton with Creswell Council Tax increase of 93% 18th April 2024 Last night Elmton with Creswell Parish Council held a public meeting for parishioners to raise their concerns about the 93% increase in the parish precept... Articles\nOut & About reporting potholes 15th April 2024 Over the weekend I reported some large potholes in Clowne on Harlesthorpe Avenue and Southgate Crescent (pictured), as well as the smaller potholes and surface... Articles\nPotholes in Shirebrook and Langwith 12th April 2024 I’ve been out in Shirebrook and Langwith today visiting the areas you have suggested in my roads survey. The pothole near Top Cat and the state of Langwith... Articles",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_general-election-date-announced/content_3.html": "Well where do I start … to say the General Election announcement came as a surprise, would be an understatement, but I'm looking forward to the next six weeks, speaking with residents is my favourite part of the job, so I hope to see some of you soon!\nThis will be my last update as yo",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_news_12-hr-spar-raise-money-youth-services-south-normanton/content_7.html": "On Sunday I have a great fun morning at The Post Mill centre supporting Rok-Ard Kickboxing and SNaP Youth with their 50/50 fundraiser. They're doing a 12 hour spar to raise funds for keeping their youth groups going - open till 8pm so do pop down - cakes, tombola, raffle and have a go at sparring (£2). Thank you to Georgina for the invite and for being kind on me. The event was a wonderful way to bring our community together and support the young people across South Normanton and Pinxton, and I hope the teams raised lots of money for Rok-Ard and SnaP Youth. I admire their work as a family-friendly kickboxing club and their efforts to keep teens away from crime and other influences.",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_local-and-national-support-services/content_18.html": "Consumer Issues\n|\nCitizen's Advice consumer Service |\n03454 040506 For a range of help on a number of legal issues. |\n|\nTRADING STANDARDS |\nContact through the Citizen’s Advice Consumer Service above Or find your local TS office https://www.gov.uk/find-local-trading-sta |\nDomestic Support Services\n|\nSAFEPLACE\n|\nhttps://www.derbyshire.gov.uk/safeplaces |\n|\nDERBYSHIRE DOMESTIC VIOLENCE HELPLINE\n|\n0800 198 668 |\n|\nNATIONAL DOMESTIC VIOLENCE AND SEXUAL ABUSE SERVICE |\n0800 2000 247\n|\n|\nREFUGE |\n0808 2000 247 |\n|\nWOMENS AID\n|\nEmployment\n|\nACAS\n|\n0300 123 1100 |\n|\nJOB CENTRE |\nFind your nearest Job Centre https://find-your-nearest-jobcentre.dwp.gov.uk/ Find a job https://www.gov.uk/find-a-job |\nEnergy\n|\nEnergy Saving Advice Service |\nFor grants eligibility. Tel: 0300 123 1234 Web: www.energysavingtrust.org.uk http://hec.est.org.uk/ for energy efficiency check |\n|\nEnergy Saving Trust\n|\n0300 1231234 |\n|\nOFGEM |\nThe government regulator for gas and electricity markets in Great Britain.\n|\n|\nUswitch |\nAccredited to energy regulator Ofgem, free and impartial switching service. 0800 6888395 |\n|\nWarm Home Discount Scheme\n|\nFor those on Guarantee Pension Credit or a low income. Tel 0345 6039439. Web: www.gov.uk/the-warm-home-discount-scheme/what-youll-get\n|\nHealth\n|\nCare Quality Commission |\nInspector of care services. Tel: 03000 616161 Web: www.cqc.org.uk\n|\n|\nHospitals |\nChesterfield Royal: 01246 277271 Kings Mill – Sutton in Ashfield: 01623 622515 Mansfield Community: 01623 622515 Ripley: 01773 743456 Royal Derby Hospital: 01332 340131 Royal Hallamshire (Sheffield) 0114 271 1900 |\n|\nNHS111\n|\nFree seven-day-a-week service to point patients to right place Telephone: 111 |\n|\nPharmacies |\nHousing\n|\nPATHWAYS\n|\nhttps://www.pathwaysofchesterfield.co.uk/ 01246 498204 |\n|\nRYKNELD HOUSING |\nhttps://england.shelter.org.uk/ 0808 800 4444 |\n|\nSHELTER |\nhttps://www.rykneldhomes.org.uk/\n01246 217670 |\n|\nWOMENS AID\n|\nLegal\n|\nDERBYSHIRE LAW CENTRE |\nMental Health\n|\nDERBYSHIRE RECOVERY & PEER SUPPORT SERVICE |\nHelpline to offer emotional support 01773 734989 Monday-Friday 9am to 5pm |\n|\nTalking Mental Health Derbyshire |\nTelephone: 0300 123 0542 Email: [email protected] |\n|\nSAMARITANS\n|\n01246 270000\n|\nMoney & Benefits\n|\nDERBYSHIRE UNEMPLOYED WORKERS CENTRE |\n01246 231441 |\n|\nCABMONEY – North East Derbyshire Citizens Advice Bureau (NEDCAB) |\n|\n|\nFinancial Ombudsman Service |\nFree and impartial for complaints about a financial service. Tel: 0800 023 4567 Email: [email protected] Web: www.financial.ombudsman.org.uk Twitter: @financialombuds Facebook: Search Financial Ombudsman Service |\n|\nFREEDOM COMMUNITY PROJECT |\nOutreach in various towns and villages throughout Bolsover District 0300 302 0334 or 0560 386 4495 |",
  "https_www_mark-fletcher_org_uk_/https_www_mark-fletcher_org_uk_map-locations/content_4.html": "Skip to main content\nMy map"
}