{
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_about-me-1/content_16.html": "Promoted by Malcolm Bride on behalf of Lara Chaplin at Dodo Works, 7 Ambrose Street, Cheltenham GL50 3LH\nTo contact Lara:\nTelephone, text or WhatsAPP 07821300412.\nEmail\nlara4labour@outlook.comAvailable on Teams and Zoom by request.\nTwitter @larachaplin\nwww.lara4labour.co.ukFacebook Lara Chaplin for Labour",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog_elected-chair-of-brigg-and-goole-constituency/content_6.html": "Finally moved back home to Lincolnshire and very proud to have been elected to the Chair's position.\nWe welcome new activists or members and would love to see old members for a cuppa and a political catch up.\nTo get involved please do email or ring me.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_my-journey_from-the-west-marsh-to-westminster/content_7.html": "Raised on the West Marsh in Grimsby, with the poorest, the best and brightest of people. Our teachers never mentioned university, it wasn’t even considered for a child like me. Thatcher at the helm, a time of desperation, of a decimated dock and fishing industry, of no hope, of watching my dad cry because the Tories took his job.\nMy sister, who is incredibly bright, should have gone to Oxbridge, denied though as she was a poor kid, and a university education simply wasn’t considered for people like us. I was homeless at 16, pregnant with my daughter at 18, despite this, I managed to achieve a great career and financial stability.\nMy background and career provide an understanding of how to support others to escape from poverty. A business and marketing expert, I am as comfortable talking to a group of businesspeople or specialists as I am on the doorstep. I am not a career politician and will do things differently. I am not afraid to shout if I feel that this will benefit our people. If I am privileged to be selected, I will work to engage and unite our CLP, and to give our area the best chance to return a Labour MP.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_my-journey/content_19.html": "I love dogs, horses, our beautiful countryside and our coast. I was married on Cleethorpes beach and am a proud YellowBelly.\nMy Labour family have provided support throughout my life. Labour to the core I believe our party is always a force for good.\nEducation is the answer to helping lift folk out of poverty. I love making a positive difference to others and have over the years helped many students find their dream job.\nRaised on the West Marsh in Grimsby, with the poorest, the best and brightest of people. I love our area, the coast, the countryside and the people.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog/content_2.html": "Keir Starmer sets out his vision for business.\nProud cohort four Jo Cox Women in Leadership graduate. THE Sisterhood.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_rss_xml/content_8.html": null,
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog_louise-haigh-visits-north-axholme-to-talk-about-our-lack-of-public-transport-and-poor-roads/content_24.html": "Louise Haigh, Labour's Shadow Transport Secretary visits North Axholme to talk to residents about our lack of public transport. She met a range of voters in our area and heard what local folk are saying which includes concerns about local roads and speed limits. A lack of a train service. Virtually no bus service and a variety of other issues.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog_graduated-from-jo-cox-women-in-leadership-programme/content_15.html": "Very proud to have graduated with a fabulous group of sisters from the Jo Cox Women in Leadership Programme.\nProvided by the Labour Party and the awesome Labour Women's Network this course is life changing.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_my-journey_my-labour-family/content_17.html": "I had been active for my Labour family since a young age, although not always able to afford the membership fees, this has not stopped me canvassing and campaigning for a fairer society and a Labour government.\nI am proud to have represented Tewkesbury as prospective Parliamentary candidate in the 2019 General Election. The CLP is in Tory heartlands and morale with members is often low given they feel they have no voice. Making sure our CLP was always welcoming, I encouraged local members to become much more active, improved our local membership numbers by almost doubling them and ensured that the Conservatives had to concentrate on fighting the Tewkesbury area, this made sure that Tory activists were too busy to fight in local Key Marginals such as Stroud and Gloucester.\nHaving had to move to the South-West as my husband, a proud Scunthorpe Steel Man had problems finding work I was honoured to be elected at the CLP Chair for Tewkesbury. My aim was to welcome, motivate and engage members and raise our voice in our region and nationally. Our members feel they have no voice with little prospect of a Labour MP, as such we have successfully submitted a range of Motions to send to regional and national conference as well as supporting our union colleagues supporting a plethora of causes, this has increased engagement with our members who now feel their opinions are heard outside of the constituency. I helped build a passionate Executive in our CLP and as such we have fielded candidates in the 2021 County and Borough elections, the first time ever our local CLP has fought for every seat in the area. We also provided some candidates for the wider Gloucestershire area.\nI am delighted that I have been finally able to move home to Lincolnshire and have very recently taken the Chairs position for Brigg and Goole. We hope to engage, enthuse, and welcome activists and new members and keep the Tories busy in our area. Helping paint our area a lovely warm red again and providing our people with a compassionate, visible, and competent MP is our goal as well as supporting our local Labour Councillors. Please do come and join our Labour family.\nI am currently the Women’s Representative for the South-West region for the Labour Party and so equality in the workplace and wider society is one of my passions. Women are still fighting for equal rights, pay and opportunities in most sectors. Menopause and perimenopause are still not understood or supported in many companies and limited paternity rights often leaves women with most of the responsibility for childcare.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog_southwest-region-women-s-officer/content_10.html": "Proud to have been elected as the Southwest regional Women's Officer. Looking forward to supporting our area to elect more Labour MP's and Councillor's.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_about-me/content_3.html": "lara4labour\nHome\nAbout Me\nAbout Me\nMy Journey\nBlog\nlara4labour\nHome\nAbout Me\nAbout Me\nMy Journey\nBlog\nAbout Me\nThis webpage is to promote Lara Chaplin.\nTo contact Lara:\nTelephone, text or WhatsAPP 07821300412.\nEmail\nlara4labour@outlook.com\nAvailable on Teams and Zoom by request.\nTwitter @larachaplin\nwww.lara4labour.co.uk\nFacebook Lara Chaplin for Labour\n+44-7821300412\n-\nLara Mobile\nlara4labour@outlook.com",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog_graduation/content_20.html": "Watching our fabulous students graduate is by far the best feeling. Making a positive difference is what teaching is all about.\nObtaining a UK qualification is valued throughout the world.\nEducation can lift people out of poverty, can help our economy, can help to solve the climate crisis, supports community understanding and cohesion, the list is endless.\nI am so proud of our teachers, our lecturers, our apprentice coaches but our education system needs supporting and should be free.\nI will fight for a fully funded education system, free for our people when they need it. I will also fight for students to have the choice for how they wish to study, including on-campus, hybrid, online and virtual.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog_vote-labour-in-north-lincolnshire/content_18.html": "lara4labour\nHome\nAbout Me\nAbout Me\nMy Journey\nBlog\nlara4labour\nHome\nAbout Me\nAbout Me\nMy Journey\nBlog\nHome\nBlog\nVote Labour in North Lincolnshire\nVote Labour in North Lincolnshire\n28\nApr\nDownload File\nMP4 • 0KB\n22\nNov\nGraduated from Jo Cox Women in Leadership Programme.\nGraduated from Labour's Future Candidates Programme\nElected Chair of Brigg and Goole Constituency.\nComments\nPost Comment\n* The email will not be published on the website.\n+44-7821300412\n-\nLara Mobile\nlara4labour@outlook.com",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog_graduated-from-labour-s-future-candidates-programme/content_11.html": "Proud graduate of Labour's Future Candidate programme. Now for the hard work to get a Labour government elected.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog_labour-are-the-party-of-gb-business/content_13.html": "Labour are the party of business.\nProfit and success are not dirty words for the Labour party - and neither is Brexit (cityam.com)",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk/content_1.html": "To contact Lara: Telephone, text or WhatsAPP 07821300412. Email lara4labour@outlook.com Available on Teams and Zoom by request. Twitter @larachaplin www.lara4labour.co.uk Facebook Lara Chaplin for Labour\nAbout Me\nPromoted by Malcolm Bride on behalf of Lara Chaplin at Dodo Works, 7 Ambrose Street, Cheltenham GL50 3LH\nTo contact Lara: Telephone, text or WhatsAPP 07821300412. Email lara4labour@outlook.com Available on Teams and Zoom by request. Twitter @larachaplin www.lara4labour.co.uk Facebook Lara Chaplin for Labour\nEducation is the answer to helping lift folk out of poverty. I love making a positive difference to others and have over the years helped many students find their dream job.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_my-journey_vote-labour-in-north-axholme/content_21.html": "lara4labour\nHome\nAbout Me\nAbout Me\nMy Journey\nBlog\nlara4labour\nHome\nAbout Me\nAbout Me\nMy Journey\nBlog\nHome\nMy Journey\nVote Labour in North Axholme\nVote Labour in North Axholme\n28\nApr\n28\nApr\n23\nNov\nEducation, Education, Education\n23\nNov\nFrom Beach to Countryside\n23\nNov\nFrom the West Marsh to Westminster\nComments\nPost Comment\n* The email will not be published on the website.\n+44-7821300412\n-\nLara Mobile\nlara4labour@outlook.com",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog_2021-conference-motion/content_14.html": "Tewkesbury Conference Motion 2021\nSocial care\nOur ambition for social care should be as far reaching as Bevan's formation of the NHS and cost should not be a barrier to high quality care. This pandemic has shown that frontline carers are essential to a properly functioning society and economy, yet two thirds don’t earn the real living wage and a quarter are on zero hours contracts. As a starting point, all care workers should be paid a least a real living wage and have secure full or part-time employment contracts. Many middle and low-income earners become part of a lottery if they get ill when they are elderly. This means for many a lifetime of work tied up in their homes is lost, as the family home has to be sold to pay for any residential nursing care. We feel that this ‘lottery’ is unfair as in many cases, inheritance lifts future generations out of poverty. We call on the Labour Party to set out a vision that:",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_my-journey_education-education-education/content_22.html": "I am a Course Director and Assistant Professor in the Higher Education sector and deliver learning in a range of business-related subjects. Students are the main reason I go to work each morning, and there can be no better reward than watching our learners go out into the world to make it a better place.\nEducation helped lift me out of poverty and I believe could hold the answer to truly levelling up our area. I was not only the first person in my family to go to university, but my community. Whilst I am grateful to a great Labour government for helping me achieve a university qualification, for folk who don’t live in a university town, we have a limited choice of degrees.\nOne of the positives to come out of the pandemic is the excellent virtual and hybrid delivery of learning that some of our university staff embraced. Our young people should be given the choice for on-campus, hybrid or virtual and this should be fully funded.\nEducation, Education, Education. Choice, Choice, Choice.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog_update-on-north-axholme-local-elections/content_23.html": "Simon and I would like to thank all voters who made us feel so welcome in the recent local elections. We did not win but will carry on acting as a voice for our community.\nWe had many Shadow Cabinet visitors to our area including Keir Starmer.\nOne of the most pressing issues locally is our lack of a post office, watch the space for a petition for one.\nIt was nice to observe that the speed limit has been reduced on the road out of Crowle towards the motorway but much more campaigning is needed to make this dangerous road safer.",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_my-journey_from-beach-to-countryside/content_5.html": "I support our rural community and understand some of the issues that our countryside folk have, from a lack of housing and transport to supporting our farming community, who are sadly taken for granted by the Tories.\nPassionate about buying in season, sustainable and local produce I believe if we all supported our local veg shop, butchers, and independent shops we could help do our bit for the climate. A Grimsby lass, my fish must come from my hometown. I know where all my food comes from and believe the British farming community have the highest welfare and hygiene standards in the world.\nLabour’s Buy, Make and Sell GB remains one of my favourite policies.\nI am a dog mum and have two rescue fur babies, Tewks (named after Tewkesbury) and Meggie (named after Cleethorpes).\nI love our area so much that I even got married on Cleethorpes beach! Would not be as easy to do today given the amount of sewage that the local Tory MPs voted to allow to pump onto the beach.\nI love a cake but as you can see by the images, baking isn’t one of my strengths!",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog_vote-labour-in-north-lincolnshire-1/content_12.html": "lara4labour\nHome\nAbout Me\nAbout Me\nMy Journey\nBlog\nlara4labour\nHome\nAbout Me\nAbout Me\nMy Journey\nBlog\nHome\nBlog\nVote Labour in North Lincolnshire\nVote Labour in North Lincolnshire\n12\nMay\n(1)Find 'lara chaplin' on TikTok | TikTok Search\n22\nNov\nGraduated from Jo Cox Women in Leadership Programme.\nGraduated from Labour's Future Candidates Programme\nElected Chair of Brigg and Goole Constituency.\nComments\nPost Comment\n* The email will not be published on the website.\n+44-7821300412\n-\nLara Mobile\nlara4labour@outlook.com",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_my-journey_lara-chaplin-labour-party-candidate-for-cheltenham/content_9.html": "Only Labour or the Tories can form the next government. Don't risk voting LibDem only for them to prop up Rishi Sunak!",
  "https_www_lara4labour_co_uk_/https_www_lara4labour_co_uk_blog_2022-conference-motion/content_4.html": "Conference Motion 2022\nSave Our GPs.\nMost of the contact that people have with the NHS is with General Practice. These vital services are the first step in diagnosing and treating most patients’ health conditions. This pandemic has shown - more than ever - that our GPs services are essential to a properly functioning society and economy, yet our GP practices are in crisis. NHS England and the BMA calls for 20,000 more staff to work in primary care excluding GPs. GPs are leaving, stressed, threatened. People cannot get an appointment to see a GP and must spend hours trying to talk to a medical professional. Conference notes that 12 years of Tory Government have failed our GP services. Conference believes it’s time to support our GP Practice so that everyone can access care when needed and staff who work in this vital area are developed and valued. Our ambition for our GP services should be as far reaching as Bevan's formation of the NHS and cost should not be a barrier to high quality care. We call on the Labour Party to set out a vision, codesigned by the frontbench, our relevant affiliated unions, Labour councillors, and other stakeholders, that:"
}