{
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news_home-much-more-just-house/content_13.html": "Many residents tell me they are fed up with being called NIMBYs when they make well-reasoned arguments about development proposals in their area.\nLike much in life, people are increasingly being pigeonholed into two categories: those who want no development at all and those who want no restrictions stopping it.\nThe reality is the vast majority if of people have a view that is somewhere between those extreme points.\nWhen I talk to people about their concerns about plans being put forward, including those that would see farmland, fields and our countryside paved over, the thread running through the conversations is the bigger picture – it’s about the overall impact on the area long into the future.\nDeveloping brownfield sites is not without challenges but we are living in a time of change where space within existing urban areas could be repurposed. While many of us perhaps have a vision of a countryside cottage, with the door surrounded by roses, as our dream, others would be happy to live above a business in the middle of Canterbury, with everything they need almost literally on their doorstep.\nWhile I have previously written that I cannot support the Labour-Liberal-led Canterbury City Council’s Draft Local Plan for a number of reasons, I am realistic\nand honest enough to know that local authorities have limited options and have to work within the rules laid down from on high.\nI personally think a new approach is needed which empowers communities to shape the future of their area. There also needs to be more of an infrastructure first approach and a better way of ensuring all of the positives promised within planning applications – be they new roads, schools, medical facilities, genuinely affordable houses or open spaces, etc – are actually delivered rather than get watered down as the developer pleads their scheme is no longer financial viable for them halfway through construction.\nI want to work towards a future where those who want to live in the area they grew up in are able to, by providing a mixture of housing, in suitable locations - but not at the expense of wrecking the very nature of what makes living here so special.",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_contact/content_17.html": "Skip to main content\nMain navigation\nHome\nAbout Louise\nNews\nContact\nContact\nLeave this field blank\n[email protected]\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_about-louise-harvey-quirke/content_4.html": "My name is Louise Harvey-Quirke, and I moved from Deal to Sturry in 1993. From the moment I moved, I felt a strong connection with the community, and it has been my privilege to serve and engage with the wonderful people who live in and around the local area, like me.\nI studied school in Sturry, leaving with GCSE's and entering the workforce in 1995. I've worked in various roles, always with a focus on serving the public and giving back to the community. Since 2015, I have worked at Canterbury Christ Church University, and more recently, I joined their apprenticeship programme in order to gain a degree in Chartered Management.\nMy strong family values and commitment to service were instilled in me by my father, now retired from the Royal Marine's Band Service. That dedication to our community led me to serve as a city councillor and even as the Sheriff of Canterbury, positions through which I strived to make a positive impact on our district's growth and wellbeing.\nIn addition to my city-level involvement, I've also served as a parish councillor, where I worked closely with local residents to address and support the needs of our neighbourhoods. As a local grassroots councillor, I was deeply involved in community initiatives, from improving local amenities to supporting small businesses and advocating for the protection of farmland and promotion of sustainable development. This extensive experience has provided me with a thorough understanding of local governance and the key concerns of our community.\nIn July 2024, I had the honor of standing as a parliamentary candidate, a role that allowed me to represent and advocate for our communities at a national level. This experience filled me with immense pride and deepened my commitment to serving our local area. I will always be profoundly grateful for the opportunity to champion the voices and concerns of the people I care so passionately about.\nTo address community issues effectively, I believe in being part of the community. Whether that is city, rural or coastal, I believe in being present locally, and actively engaging in Parliament. I am determined to champion the rights and well-being of local people and making a tangible positive impact on as many people's lives as possible. I'm passionate about encouraging a sense of belonging, wherever you may live in the constituency, and I'm always eager to connect with others who share a love for our area. Whether it's through local events, community projects, or simply sharing a conversation, I believe in the power of community engagement to create a brighter future for all of us.\nMy children, now grown, still live locally, continuing our family's deep roots in this beautiful area. My husband is a dedicated police officer who began his career with Kent Police in Canterbury. Our family has numerous local connections, and I consider myself a truly local person, wholeheartedly invested in the community's welfare and development.\nI'm passionate about community engagement, wherever you may live, and I'm always eager to connect with others who share a love for our area. Whether it's through local events, community projects, or simply sharing a conversation, I believe in the power of community engagement to create a brighter future for all of us.",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_events_feed/content_19.html": null,
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_accessibility/content_16.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk/content_1.html": "Latest News Policing: fostering a safer, stronger community When I served as a councillor, one of the most pressing concerns raised by… My stance on gender issues Since the start of my campaign, discussions on gender issues are raised the… From social housing to home ownership Throughout my campaign, I often find people are surprised when they hear about… My map Am I your candidate? Enter your postcode to confirm that Louise Harvey-Quirke for Kent County Council is your candidate. Postcode\nPolicing: fostering a safer, stronger community When I served as a councillor, one of the most pressing concerns raised by…\nMy stance on gender issues Since the start of my campaign, discussions on gender issues are raised the…\nFrom social housing to home ownership Throughout my campaign, I often find people are surprised when they hear about…",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news_remembering-deal-bombing-personal-reflection/content_21.html": "On the morning of September 22 1989, at 8:22, the IRA detonated a bomb at the Royal Marines School of Music in Deal. My father, one of the many musicians on duty that day, ran towards the blast to save his comrades. In doing so, he put himself directly in danger, just as anyone in service would do if their military family was under threat. On that fateful morning, 11 musicians died, and many more were left with scars that will never fully heal.\nThe pain and devastation caused by terrorist groups are all too familiar to me. The impact of such violence ripples through families, lasting for many years, and in some cases, a lifetime. As the daughter of a veteran, I understand the deep and enduring anguish that follows in the wake of these tragedies. My father's bravery and the loss of his comrades have profoundly shaped my perspective on security and community.\nIt is crucial to keep our country and communities safe to be better prepared against attacks like the one on the School of Music that day, and the many others that have followed since. The memories of those lost and the resilience of those who survived must drive us to strengthen our defences and foster unity within our communities.\nIn remembering the Deal bombing, we honour the courage and sacrifice of those who put their lives on the line for others. It is a reminder of the importance of vigilance, preparedness, and the unwavering commitment to protecting our way of life. By working together and investing in our armed forces and National Defence, we can build a safer future to ensure that such tragedies are not repeated.\nWe live in uncertain times. While the rising bollards across Canterbury attract media attention when they \"impale\" a car, it shouldn't be forgotten that they were installed following a view given to Canterbury City Council by the South East Counter Terrorism Unit that the city could be an attractive target to a potential attacker.\nWhile we watch and read reports of conflict around the world, including seeing a resurgent Russia bringing war to Europe and the constant loss of life in the Middle East, the first duty of any government has to be keeping the population safe. This doesn't just mean in a traditional way, as many of the wars of the future will be fought electronically, without a single bullet being fired, but with huge impact. It's crucial our armed forces are flexible and modernised so they can continue to protect us.\nAs we reflect on the events of that tragic morning in Deal, let us also recognise the enduring spirit of those who serve and the communities that support them. Together, we can stand strong against the threats that seek to undermine our peace and security, honouring the legacy of those who have sacrificed so much.\nThe Deal Memorial Bandstand was built in memory of those fallen soldiers, and each year, the Royal Marines Memorial Concert takes place to re-dedicate the bandstand. This year, the concert will be on 23rd June, at 3pm. I hope to see you there.",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news_love-loss-and-legacy-story-harvey-quirke-name/content_6.html": "Growing up, my sister Nicola and I were the only two daughters my parents had together. After their separation, our mother remarried and had more children, while our father did not. Thus, Nicola and I were the sole products of our parents' union. Like many siblings, we shared a bond that included plenty of bickering, but we were inseparable in many ways.\nAs a young adult, Nicola faced a life-altering diagnosis: a condition that meant she could not have children. This condition brought further complications, and in 2003, when she was just 21, Nicola was diagnosed with an inoperable brain tumour. She was given three months to live, but being the fighter she was, Nicola defied the odds and lived for six months, passing away in February 2004.\nThe Quirke name, carrying so much of our family's history and Nicola's memory, became even more significant to me. Being my father's only living daughter, it was important to me to preserve and honour the Quirke name.\nWhen I had my own children, I chose to give both of my daughters the surname Quirke, symbolizing a unity that transcended generations. When I married, I faced a dilemma: I wanted to honour my husband by taking his surname but could not imagine giving up the Quirke name.\nThe solution was a blend of respect and pride. I took my husband's surname to honour our new life together while retaining Quirke to respect my father's legacy and maintain the connection with my daughters and with Nicola. This decision united our family under a banner of love and remembrance, ensuring that the Quirke name continues to be a significant part of our lives.\nSo, you see, while some people may associate a double-barrelled name with wealth and influence, my name symbolises so much more, and it is something that I am incredibly proud of.",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_map-locations/content_20.html": "Skip to main content\nMain navigation\nHome\nAbout Louise\nNews\nContact\nMy map",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news_feed/content_15.html": null,
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news_policing-fostering-safer-stronger-community/content_12.html": "When I served as a councillor, one of the most pressing concerns raised by local residents was the apparent lack of community or neighbourhood policing. In my childhood, we all knew the local Bobby, a familiar and reassuring presence in our daily lives. Unfortunately, that familiarity has disappeared over the years, leaving many residents feeling disconnected and less secure.\nHaving worked closely with the Kent Police & Crime Commissioner, Matthew Scott, on several issues, I know that the return of community policing is high on his agenda. His commitment to this cause is unwavering, and he understands the critical role that local police officers play in fostering trust and safety within our communities.\nFrom my own experience, I know that many local residents feel reporting crimes is futile. However, I must stress how important it is to report all incidents. Kent Police, along with other organisations, rely heavily on data to allocate resources and develop strategies. If crimes go unreported, it creates the illusion that all is well when we know that is not always the case. Accurate reporting helps ensure that the true state of our community's safety is understood and addressed.\nThe Government is absolutely right to pledge another 8,000 police officers in the next term. This commitment brings me comfort, particularly as the spouse of a police officer. Knowing that more officers will be provided to offer that layer of support to my husband and his colleagues is reassuring. These additional officers will enhance our collective ability to maintain safety and security in our neighbourhoods.\nWe know there is still work to do. Restoring the sense of community policing will take time and effort, but with the support of dedicated officials like Matthew Scott and the government's commitment to increasing police numbers with a dedicated officer in every area, we are on the right path. By reporting crimes and engaging with local initiatives, we can all contribute to making our community a safer, more connected place.\nTogether, we can rebuild the bonds between residents and their local police, ensuring that everyone feels secure and supported. As an MP, I will absolutely play my part. But, your involvement is crucial, and I encourage everyone to take an active role in fostering a safer, stronger community.",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news_my-stance-gender-issues/content_2.html": "Since the start of my campaign, discussions on gender issues are raised the most on social media. Given the recent launch of the Conservative manifesto and proposed changes to the Equality Act 2010, I believe it is essential to share my perspective on this critical topic.\nCanterbury has always been a city of acceptance and compassion. Our community is known for its inclusivity, exemplified by hosting the largest Pride event in Kent, which has become the social highlight of the year. The spirit of our city is one of mutual care and respect, embracing diversity and championing equity and inclusion.\nFor those familiar with my background, you'll know that I am the proud parent of two courageous daughters. Their resilience and strength inspire me daily. My personal experiences with domestic abuse have driven me to actively participate in focus groups supporting the Kent Police and Crime Commissioner, demonstrating my commitment to the safety of women and girls. Ensuring that women and girls feel safe, respected, and heard, especially survivors of domestic abuse, is a cause close to my heart. Therefore, I believe that women's safe spaces are vital in our community. These sanctuaries provide a haven where women can feel secure and supported, and protecting these spaces is essential for the overall well-being of women and girls.\nHowever, the broader conversation on gender issues must also encompass the safety and respect of all individuals, including those who might feel marginalised or overlooked. It is not enough to solely focus on one group; our efforts must strive towards a system that promotes equity for everyone. Members of the LGBT community also deserve respect and privacy, including the simple dignity of being able to use restrooms without fear or harassment.\nIn light of this, my vision for Canterbury, Whitstable and the villages - and for our society as a whole - is one where everyone feels included and valued. I advocate for an equitable solution, ensuring that all members of our community feel safe, respected, and supported.",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news_louise-looks-ahead-tomorrows-pride-canterbury/content_9.html": "I’m looking forward to being part of Pride Canterbury tomorrow (Saturday, June 8), celebrating love, acceptance and empowerment in our wonderful city.\nFor many of us, Pride is a fantastic party, but it’s also a reminder of how far we as a society have come in terms of equality and inclusion – and how far we still have to go.\nIt is heart-breaking to know that there are people who are having to hide their true selves for fear of what others may think, say or do, and that there are people who feel they would be better off dead than being themselves.\nFriends and colleagues have shared that they do not feel comfortable holding hands with their partner in public, or told me of the abuse they face for simply trying to live an authentic life.\nPride is for all of us; a safe place to celebrate LGBTQ+ identities, and a place for those of us who are allies to show our support and to send a message that we stand for equality, for acceptance, and for kindness – today and always.\nI will be having a small stall outside St Peter’s Church (opposite Nando’s) from 9am. And, following the parade, I’ll be in Dane John Gardens, enjoying the celebrations!\nI hope to see you there!",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news_ending-sewage-scandal-cleaning-our-rivers-and-sea/content_11.html": "In 2024, it's nothing short of outrageous that we have a sewage system in place that is designed to discharge waste into our rivers and seas when there is seemingly little more than a trickle of rain. It's impossible to be sure, along the coast at Seasalter, Whitstable, Tankerton and Swalecliffe, whether the sea is safe enough to swim in.\nNot only have our beaches been blighted by the water companies struggling to move into the modern world at the sort of speed those of us living here want them to, but so have our businesses. Not just those fishing and harvesting shellfish, but all who rely on people coming to the seaside and spending money locally. I will take the anger and frustrations I've heard locally to the highest level and fight for improvements - not decades from now, but much more immediately, so we can be all be confident our sewage is being treated properly and we won't risk our health by enjoying a swim.\nOur coastline here has been at the centre of national and international press coverage, thanks to the tireless work of volunteers who have given up so much of their time to highlight the issue – and hold Southern Water to account over all of their plans and proposals to improve the situation. There have been some positive moves: all combined sewer overflows in England now being monitored at least gives a better idea of what is happening, but the data often lags and there are questions over its reliability. And, on a fundamental level, knowing when sewage enters the water still means it is entering the water...which has to end.\nThe division of the coastline into “bathing beaches” and “all the rest” is also unhelpful, as there are many reasons why people might want to enjoy the sea away from the formal bathing areas. It also means that formal water quality testing focuses on a very small selection of areas and. as they are \"spot tests,\" only show the picture at that precise moment.\nI and others had hoped the trial of a real-time water quality monitoring buoy off Tankerton would be the starting point on allowing more precise, immediate information to be available but, for whatever reason, this development of this project from Southern Water has been painfully slow. Given our area is being used as one of the company's \"Pathfinder\" projects, to trial new methods to - ultimately - stop sewage getting into the sea, they need to be pushed into bringing about genuinely positive change.\nWhat we currently have feels as though there is a disconnect between what residents want and what Southern Water will deliver. The new \"short outfall\" pipe being constructed off the waste water treatment works at Swalecliffe perhaps highlights that well. To quote the third paragraph of the company's project page:\n\"This will mean any releases of stormwater from this outfall – which only happen rarely, during and after heavy rainfall as a last resort when the storm tanks are full, so nearby homes and businesses are not flooded – are further out to sea and further from local beaches and bathing waters.\"\nThe focus needs to switch - and water quality is too important to waste time on ideological arguments, frankly whatever solves the problem is the right solution - so that we are no longer talking about sewage being dumped \"further out to sea\" but rather \"being treated properly and not polluting our precious environment\". If it wasn't so serious, it would be comedic to hear about millions of pounds being spent on sewage flowing that little bit further into the sea. But this is no joke.\nThe ultimate goal has to be stopping sewage getting into the water. A detailed, achievable, realistic timetable is needed to show how we are going to reach\nthat point – with targets along the way to ensure progress is made. Until we get to that point, much more information needs to be provided so we can all make informed choices about whether we want to enter the water or not.",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_cookies/content_22.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news_category_Local-News/content_8.html": "Policing: fostering a safer, stronger community 16th June 2024 When I served as a councillor, one of the most pressing concerns raised by local residents was the apparent lack of community or neighbourhood policing. In my... Local News\nMy stance on gender issues 12th June 2024 Since the start of my campaign, discussions on gender issues are raised the most on social media. Given the recent launch of the Conservative manifesto and... Local News\nFrom social housing to home ownership 12th June 2024 Throughout my campaign, I often find people are surprised when they hear about my life story. As a political campaigner, there's a common presumption that I... Local News\nThe importance of the NHS: a personal perspective 12th June 2024 Across the country we are incredibly proud of our National Health Service. It stands as a beacon of hope and care for millions. However, there is no denying... Local News\nEnding the sewage scandal: cleaning up our rivers and sea 9th June 2024 In 2024, it's nothing short of outrageous that we have a sewage system in place that is designed to discharge waste into our rivers and seas when there is... Local News\nRemembering the Deal bombing - a personal reflection 8th June 2024 On the morning of September 22 1989, at 8:22, the IRA detonated a bomb at the Royal Marines School of Music in Deal. My father, one of the many musicians on... Local News\nLouise looks ahead to tomorrow's Pride Canterbury 7th June 2024 I’m looking forward to being part of Pride Canterbury tomorrow (Saturday, June 8), celebrating love, acceptance and empowerment in our wonderful city. For many... Local News\nLove, loss, and legacy: the story of the Harvey-Quirke name 6th June 2024 Growing up, my sister Nicola and I were the only two daughters my parents had together. After their separation, our mother remarried and had more children... Local News\nA home is much more than just a house 6th June 2024 Many residents tell me they are fed up with being called NIMBYs when they make well-reasoned arguments about development proposals in their area. Like much in... Local News",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news_louise-cannot-support-canterbury-draft-local-plan/content_14.html": "I have submitted a formal response to the Labour and Lib Dem-led Canterbury City Council's Draft Local Plan consultation. While I support some aspects of the Plan - which, if adopted, will shape how the district changes during the next few years and decades - too many questions remain due to the lack of transport modelling data, the impact on the environment and lack of infrastructure planning. I cannot support this draft plan as I believe it fails to give framework that will deliver a positive future for future generations locally.\nMy response in full:\nAs a local resident and the Conservative Parliamentary Candidate for Canterbury, I cannot support the proposals made in the Draft Local Plan, and the following is my response to the consultation.\nThe main objection to the Council’s plan is that the Jacob’s transport modelling has not been made available, as outlined in my earlier communication to Peter Davies, Director of Strategy and Improvement. It is impossible for us as residents to form a reasoned opinion on the feasibility of the proposed bus-first strategy, and the impact of this on travel within the district.\nIn addition to transport matters, I urge the Council to contest the housing numbers and argue for exceptional circumstances under the National Planning Policy Framework. The housing calculations are based on outdated ONS2014 data. More current data should be considered to ensure the Council is building affordable homes that encourages community development, cohesion, and meets local needs. The overdevelopment of the district is leading to large-scale\ndevelopments with insufficient infrastructure and increased congestion.\nAs a former Canterbury City Councillor, I acknowledge that the Local Plan is one of the most significant policies that any council can implement. It shapes future housing development and vital infrastructure, reflecting residents' views on their community's development for prosperity. However, I don’t agree that the Council has explored all options, particularly in relation to the brownfield site in Wincheap, where the proposal could have been more ambitious, in-turn lowering the proposed housing numbers in areas such as Blean.\nI am pleased to see that the current administration has retained many policies from the previous Conservative administration, which focused on housing density, climate change mitigation, biodiversity, and heritage. However, I would have preferred to see more emphasis on the delivery of energy-efficient heating and mandatory solar panel provision on new builds.\nAreas of significant concern:\n- A transport plan that is based on speculation rather than accurate modelling, which does not reflect how people wish to travel.\n- Lack of energy provision – mandatory solar panels and energy efficiency for all new builds, particularly in the rural areas, as this has been overlooked in the plan.\n- Significant overdevelopment of rural communities, where the priority needs to be in preserving farmland for future food production.\n- No clarity on investment for areas outside of the city – particularly in relation to heritage.\n- Lack of protection of open spaces in newer housing developments.\n- No focus on the provision of local jobs, suggesting the new developments will be aimed at commuters and not local people.\n- Compromised Biodiversity targets by insufficient wildlife corridor planning and an overemphasis on large house building.\n- Lack of infrastructure planning for sewerage, electricity, and water. Also, a lack of health provision.\n- Too much focus on larger house developments, that have inadequate infrastructure\nGiven the demographics of the district, the housing targets are excessive. It is my belief that Canterbury City Council should challenge those numbers and advocate for decisions based on the current population and housing demand. I would like to see smaller homes with one and two-bedrooms, and homes for younger families.\nDespite the constraints of the National Planning Policy Framework, I believe the Council should argue exceptional circumstances; particularly regarding the AONB, Wantsum Valley and protected landscapes of Blean, heritage assets, medieval Canterbury and the coastal areas – all of which make the district unique.\nIn relation to the proposed development in Blean, Tyler Hill and Rough Common, which will see 2000 homes being delivered in this tranquil, rural setting, I believe the plans pose a risk to existing plans to establish wildlife corridors and re-wild Blean. It is also my belief that additional pressure will be placed on existing sewerage infrastructure, road networks, and the Sarre Penn River, increasing the potential of flooding. It is worth noting that the previous\nConservative administration rejected this development in the 2022 draft Local Plan, deeming it unsustainable with severe transport implications.\nI have been unable to properly assess the ‘bus-first’ strategy as the transport modelling has not been provided. Without the forecast on potential volume of traffic or transport movements, it is impossible for me to make an informed decision. However, I have concerns that the only way for the strategy to be successfully implemented is to completely close\nCanterbury to traffic, removing city centre car parks, and forcing modal shift. In doing so, of course, the plan is not considering the impact on local businesses, and how they would survive should people visit Westwood Cross as an alternative.\nI would advise the Council to err on the side of caution when making decisions that will significantly impact the livelihood of those working or owning businesses in Canterbury.\nWhile the proposal to increase bus use can be applauded, it should be in addition to other modes of transportation. The proposed infrastructure interventions such as bus gates, changes to junctions, and additional signalling appears to be ‘Zoning’ under a different name - a proposal that was deeply unpopular in the previous consultation and subsequently removed.\nMoreover, the proposed parking levy is just another way to punish those who own businesses or work in Canterbury. And, while I take note that this may not be implemented for many years, the suggestion the people could pay an additional tax simply for going to work is inexcusable.\nFor these reasons and others mentioned, I cannot support the draft Local Plan as it currently stands.",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news/content_3.html": "Policing: fostering a safer, stronger community Sunday, 16 June, 2024 When I served as a councillor, one of the most pressing concerns raised by local residents was the apparent lack of community or neighbourhood policing. In my childhood, we all knew the local Bobby, a familiar and reassuring presence in our daily lives. Unfortunately, that familiarity has disappeared over the years, leaving many residents feeling disconnected and less secure. Having worked closely... Local News\nMy stance on gender issues 12th June 2024 Since the start of my campaign, discussions on gender issues are raised the most on social media. Given the recent launch of the Conservative manifesto and... Local News\nFrom social housing to home ownership 12th June 2024 Throughout my campaign, I often find people are surprised when they hear about my life story. As a political campaigner, there's a common presumption that I... Local News\nThe importance of the NHS: a personal perspective 12th June 2024 Across the country we are incredibly proud of our National Health Service. It stands as a beacon of hope and care for millions. However, there is no denying... Local News\nEnding the sewage scandal: cleaning up our rivers and sea 9th June 2024 In 2024, it's nothing short of outrageous that we have a sewage system in place that is designed to discharge waste into our rivers and seas when there is... Local News\nRemembering the Deal bombing - a personal reflection 8th June 2024 On the morning of September 22 1989, at 8:22, the IRA detonated a bomb at the Royal Marines School of Music in Deal. My father, one of the many musicians on... Local News\nLouise looks ahead to tomorrow's Pride Canterbury 7th June 2024 I’m looking forward to being part of Pride Canterbury tomorrow (Saturday, June 8), celebrating love, acceptance and empowerment in our wonderful city. For many... Local News\nLove, loss, and legacy: the story of the Harvey-Quirke name 6th June 2024 Growing up, my sister Nicola and I were the only two daughters my parents had together. After their separation, our mother remarried and had more children... Local News\nA home is much more than just a house 6th June 2024 Many residents tell me they are fed up with being called NIMBYs when they make well-reasoned arguments about development proposals in their area. Like much in... Local News\nLouise cannot support the Canterbury Draft Local Plan 3rd June 2024 I have submitted a formal response to the Labour and Lib Dem-led Canterbury City Council's Draft Local Plan consultation. While I support some aspects of the... Local News",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_about-rss/content_10.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_privacy/content_7.html": "This document outlines how Louise Harvey-Quirke for Kent County Council processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Louise Harvey-Quirke for Kent County Council\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Louise Harvey-Quirke for Kent County Council.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Louise Harvey-Quirke for Kent County Council, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Louise Harvey-Quirke for Kent County Council via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_cdn-cgi_l_email-protection/content_23.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news_social-housing-home-ownership/content_18.html": "Throughout my campaign, I often find people are surprised when they hear about my life story. As a political campaigner, there's a common presumption that I must live in a large house with a substantial bank balance. However, that is far from my reality.\nMy father was raised in social housing and moved to Deal to join the Royal Marines. It was there that he met my mother, who also came from a modest upbringing. I do not come from wealth; my background is one of hard work and perseverance.\nAs an adult, I raised my daughters alone in social housing. There were times when I had no alternative but to claim benefits to make ends meet. Despite these challenges, I have worked incredibly hard to provide a better life for my daughters and to support them financially in ways I couldn't when they were younger. I am very fortunate to have a good employer and to work for an organisation where I have thrived professionally. This opportunity has been pivotal for me. If it wasn't for this, I wouldn't be in a position to buy my home. That's right - at the age of 45, after challenges and hardship, I am now able to buy my home. To me, there is nothing more Conservative than that.\nHome ownership represents a significant milestone and a symbol of stability and achievement. It embodies the Conservative values of hard work, self-reliance, and the pursuit of personal success. My journey reflects these principles, showing that with determination and opportunity, anyone can overcome their circumstances and achieve their dreams.\nIn sharing my story, I hope to inspire others who may be facing similar struggles. It is possible to rise above adversity and build a better future. My life experience is not just a testament to my resilience, but also a reminder of the importance of creating opportunities for everyone, regardless of their background.",
  "https_www_louiseharveyquirke_uk/https_www_louiseharveyquirke_uk_news_importance-nhs-personal-perspective/content_5.html": "Across the country we are incredibly proud of our National Health Service. It stands as a beacon of hope and care for millions. However, there is no denying that the NHS is currently facing significant challenges. With a substantial demand on resources and the devastating impact of Covid-19, the system has struggled to recover fully.\nIt's easy, especially when you're unwell and in need of treatment, to criticise the NHS and those who work tirelessly within it. As someone who has spent considerable time in doctors' offices and hospital waiting rooms, I want to share my experiences and weigh in on this discussion.\nAt the age of 17, I was diagnosed with epilepsy. Having already endured migraines throughout my adolescence, I was not prepared for another challenge that would drastically alter my life and wellbeing. For months, I underwent numerous tests, tried various medications, and attended countless doctors' appointments. For two years, I experienced sporadic seizures that completely changed my life. During this challenging period, the support I received from my GP and neurologist was nothing short of amazing.\nAt such a young age, I did not fully grasp the implications of having a lifelong illness and the necessity of life-saving medication indefinitely. However, the dedicated care and support from NHS professionals helped me navigate this daunting journey. They provided not only medical assistance but also the emotional support necessary to cope with my new reality.\nMany years later, I find myself in a different stage of life. Now in my mid-40s, I am experiencing changes in women's health that have impacted my epilepsy. Once again, the NHS has been there for me. I have undergone a series of tests, consulted with my new neurologist, and adjusted my medication dosage to better manage my condition.\nLiving with a disability like epilepsy, coupled with health anxiety, means that any change in my health can cause significant distress. However, the support network provided by the NHS has been a crucial lifeline. Whether it's a quick consultation or a comprehensive treatment plan, the NHS staff consistently offer the care and reassurance I need.\nWhile there is always scope to improve things - and I think we need to make it easier for people to access medical care, of all sorts, in a timely manner and will continue the fight to return maternity and emergency services to the Kent & Canterbury Hospital - I won't lose sight of the positives in what we have.\nIn these times of intense pressure and scrutiny, it's important to remember the dedication and hard work of NHS professionals. They continue to provide exceptional care despite the immense challenges they face. My personal journey with epilepsy has shown me the unwavering commitment of the NHS to patient well-being, and for that, I am profoundly grateful. As we navigate these difficult times, let's not forget the value of the NHS and the incredible people who make it what it is. They are the backbone of our healthcare system, and their dedication deserves our respect and support."
}