{
  "http_versallion_com_Mark_MARK_htm/http_versallion_com_Mark_Academy%20of%20Social%20Work%20pic_Academy%20of%20Social%20Work%20pic_htm/content_2.html": "Mark Versallion launching Bedfordshire's Academy of Social Work and Early Intervention Putteridge Bury Mansion, University of Bedfordshire 2 June 2014\nLGA magazine First 6 December 2014",
  "http_versallion_com_Mark_MARK_htm/http_versallion_com_Mark_Contact_Contact_htm/content_3.html": "Mark lives in Heath and Reach, Bedfordshire.\nAll correspondence via Central Bedfordshire Council Priory House Shefford Bedfordshire SG17 5TQ\nTel. 01525 234000\nmark.versallion@centralbedfordshire.gov.uk",
  "http_versallion_com_Mark_MARK_htm/http_versallion_com_Mark_Schools_Schools_htm/content_4.html": "Mark Versallion opening the newly built Greenleas Lower School, Kestral Way, Leighton-Linslade part of Central Bedfordshire Council's £100m investment in local schools 9 July 2013",
  "http_versallion_com_Mark_MARK_htm/http_versallion_com_Mark_Email%20Sign%20Up_Email%20Sign%20Up_htm/content_10.html": "_\nEMAIL SIGN UP\nTo sign-up to Mark's campaign send an email to mark@versallion.com with 'join' in the subject line.",
  "http_versallion_com_Mark_MARK_htm/http_versallion_com_Mark_News_EU%20Referendum%20Promise%20(04Sep07)_htm/content_9.html": "04Sep07\nEU REFERENDUM PROMISE BROKEN\nConservative Parliamentary Spokesman for Stretford and Urmston, Mark Versallion, is calling upon residents to write to their Labour MP and Government Minister, Bev Hughes, to honour the Labour manifesto pledge to hold a referendum on the new European Union treaty.\nStretford and Urmston's Conservative Parliamentary Candidate said \"in today's YouGov poll almost two thirds of voters want a referendum on the EU reform treaty yet are being denied one.\" Mark Versallion said \"Gordon Brown is facing increasing pressure and several unions have already embarrassed him over the issue as they too want a referendum.\"\nGordon Brown has so far rejected calls for a national vote on the grounds that the new treaty is much less far-reaching than the original constitutional treaty abandoned in 2005 after Dutch and French voters rejected it. But the YouGov poll discloses that only five per cent of voters agree, with 63 per cent wanting a national vote on the issue. With more than 22 per cent also uncertain, the number could rise further.\n\"There is a real danger that the treaty, which implements the Charter of Fundamental Rights, could allow convicted killers to walk free. The Charter insists that punishments must not be \"disproportionate\" to crimes. Conservatives are holding the Government to account on this point as European courts could intervene to impose early release of prisoners in the UK\" said Councillor Versallion.\nProposed text of a letter to your MP can be found here:\nEuropean Union Treaty Referendum\nMs B. Hughes\nMP\nHouse of Commons\nLondon\nSW1A 0AA\nDear Ms Hughes,\nLabour MPs were elected on a manifesto promise that a Labour Government would hold a referendum on the European constitution. That promise could not have been clearer. It said: \"We will put it to the British people in a referendum.\" Gordon Brown said: \"We've got to honour that manifesto. That is an issue of trust with me and the electorate.\"\nAs one of your constituents, I am calling on you to ensure your Party honours its pledge, and gives the electorate a right to vote on this crucial issue.\nYours sincerely,\n(Your Name)",
  "http_versallion_com_Mark_MARK_htm/http_versallion_com_Mark_MARK_htm/content_1.html": "The\nward of Heath and Reach first elected Mark\nin 2011 to represent Hockliffe, Eggington, Stanbridge, Tilsworth, Tebworth,\nWingfield and Heath & Reach. Map...\nPARLIAMENTARY\nCANDIDATE\nIn 2007 Mark was selected Parliamentary Candidate for the constituency of Stretford and Urmston in the 2010 General Election.\nLONDON\nCOUNCILLOR\nFrom 1996 to 2011 Mark served in Harrow's politics, first as the MP's aide and then as a Councillor from 2002-11.\nThank you for visiting. I am honoured to have been elected to serve as your Councillor, sent to Central Bedfordshire Council to represent and defend our rural communities of Hockliffe, Eggington, Stanbridge, Tilsworth, Tebworth, Wingfield and Heath & Reach.\nIf you have any queries with the Council or your community you can contact me at www.centralbedfordshire.gov.uk/markversallion and follow Facebook Twitter\nMark Versallion\nAfter a number of years working in the private sector in London, Mark created a new company and a dozen new jobs in 2001 and led the business for ten years. In 2004 he settled in Heath and Reach, Bedfordshire to raise his family and upon his election to Council in 2011, gave up a full-time business career to dedicate himself to public service.\nMark has served on the boards of charity and voluntary organisations, NHS hospitals and schools as well as serving his country as a naval officer for 14 years in the reserves.\nTo find details of Mark's surgeries, Council responsibilities, attendance and other Central Bedfordshire Council information click here.",
  "http_versallion_com_Mark_MARK_htm/http_versallion_com_MARK_htm/content_7.html": "NEWS & CAMPAIGNS\n|\nSince Mark's selection in July 2007 he has been working for local people on numerous local issues. These include leading the fight to stop the closure of Trafford General's maternity unit, lobbying Labour MPs to not vote for Post Office closures, campaigning for a fairer grant from this Government to Trafford Council, campaigning against over-development and central Government interference, and fighting Labour's introduction of congestion charging. If you elect Mark as your MP he will fight for the interests of local people. Voting Conservative will also: ~ Stop hospital closures ~ Give back teachers control of their classrooms ~ See teenagers in a national citizen service ~ Increase prison places and stop Labour's early release scheme ~ Put an annual limit on immigration and improve racial integration ~ Cut Inheritance Tax and cut Stamp Duty\nOn Immigration On the\nNHS On the\nPolice On Family On Unemployment On Pensions On Schools On the\nEU Treaty On the\nEnvironment\nVote for change... vote for Mark Versallion.\n|\n|\nThank you for visiting my web site. After two and half years as the Conservative Parliamentary Candidate for Stretford and Urmston I have decided to step down in October 2009. \"Much has changed in the last two and a half years since I was selected. The need to spend more time on my business in London due to the recession means I am not able to commit the time in Manchester that I believe a Conservative candidate needs to in order to win this seat.\" \"I am grateful to everyone in the Association who has supported me over these past two and a half years and I look forward to supporting the new candidate in whatever way I can in the future.\" Paul Lally, Association Chairman, said \"The recession has affected all our lives and we respect Mark's integrity in taking this course of action. We thank Mark for the time and effort that he has have given to Stretford and Urmston over the last two and a half years.\" \"Over this time we have seen first hand how he has balanced his family, his business, and his local government duties, along with his time spent with us in our community. Be assured that if he were to stand again elsewhere in the future as a PPC we, as an association, would not hesitate to fully endorse him as a candidate and give him our full support. We wish him all the best for the future.\" |",
  "http_versallion_com_Mark_MARK_htm/http_versallion_com_Mark_About_About_htm/content_5.html": "Contents\nEarly Life\nBusiness Career\nMilitary Career\nPolitical Career\nPersonal Life\nEarly Life\nBorn in Cornwall, Mark became a self-made businessman at an early age, founding his first business in 1988, a music promotions and equipment company. He was educated at the University of Westminster with a bachelor's honours degree in Business and Economics and then the University of Reading where he was awarded a master's degree in Politics under Professors John Cottingham and Barry Jones and was elected Post-Graduate Student Chairman. He continued with a joint doctorate at Reading and St Antony's College, Oxford. He was admitted to the Royal Institute of International Affairs (Chatham House) and became a member of the Carlton Club before going up to Oxford.\nTravel and Writing\nA published author and poet, in 1992 Mark spent three months in the USA writing and teaching and after another writing vacation in Rome in 1994, he completed many of his early essays and poems which were published shortly after. He was awarded the UK's Poetry Guild 'Editor's Choice Award' of 1995 and his first book on socio-political philosophy, A Conquest of Thoughts, was published later that year.\nAfter the fall of the Soviet Union, Mark travelled to Eastern Europe and while in Warsaw joined the Polish-Lithuanian team that discovered plundered Christian burial vaults in Vilnius. Seeing first hand the communists' destruction of the Church had a lasting effect on Mark's commitment to political life and to spiritual life. He completed his travels in Poland in 1996.\nBusiness Career\nMark founded his first business in 1988 and it continued to run alongside his working in the House of Commons from 1996 as Parliamentary Aide to Cabinet Office minister Robert Hughes MP. Mark then joined blue chip companies BAE Systems plc and later Capgemini plc in high profile marketing roles. During this time he was Deputy-Chairman of the Harrow West Constituency and Ward Chairman of Harrow on the Hill in London.\nAfter working for Senator Rod Grams in the 2000 USA elections Mark returned to the UK and founded the London marketing agency VML, creating a dozen jobs in its first year and winning business from overseas as well as at home. He was its Managing Director for ten years. In 2011 he handed over operational control and gave up his full-time business career to dedicate himself to public service in Bedfordshire. Mark has advised the boards of other private companies and has been a Non-Executive Director of NHS Hospitals for over a decade, first in NW London from 2008-13 and then on the board of the Luton and Dunstable from 2013-2020.\nMilitary Service\nMark was recruited by the Royal Navy Reserve in 1996 assigned to Joint Headquarters, PJHQ Northwood. Due to family and business commitments he resigned in 2000 but rejoined in 2003 at the start of the Iraq War and the Taliban resurgence in Afghanistan. He won the 2005 Best Shot trophy for his marksmanship with the SA80. In 2009 he was part of Operation Pearl, a counter-piracy mission off the Horn of Africa. In 2010 he was awarded the VRS medal.\nHe served in several joint force commands and with NATO and EU forces, overseas, at sea, and in various headquarter commands. He is a graduate of the Joint Services Command and Staff College, Shrivenham and of the NATO School at Oberammergau, Germany. After 14 years active duty he left the Navy in 2015.\nPolitical Career\nWith over a decade's\npast experience in various community roles -\nchairman\nof a conservation committee,\ndirector of a residents' association,\ntrustee of a heritage charity, and a school\ngovernor - Mark first stood for public office in 1998 and was\neventually elected a London Borough Councillor in 2002, for Harrow on the\nHill.\nHe was quickly promoted, being made Chief Whip three months into his first term, a role he served in for three years, and then in 2005 was appointed Chairman of the Scrutiny Committee on Children and Young People. In 2006 he was re-elected by the people of Harrow with an increased majority and in May 2007 was promoted Chairman of the influential Performance and Finance Scrutiny Committee, which oversaw the Council's £620 million budget.\nIn July 2007 he was selected in an open primary as the Conservative Parliamentary Candidate for the Manchester constituency of Stretford and Urmston. Mark fought various campaigns such as saving Trafford General's maternity unit and having David Cameron visit the hospital in January 2008, stopping the Manchester congestion charge, and helping to win medication funding for local residents in a high profile case in 2007. After almost three years as candidate and changing business commitments in London at the height of the recession, the distance to Manchester became an issue and Mark announced he would step down in October 2009.\nIn December 2009 Mark became Chairman of the Foreign Affairs Forum of the Conservative Party. His first official overseas engagement was in Macedonia in January 2010 representing the Conservative Party, with Lord Foulkes representing the Labour Party, in meetings with the country's President and Parliament.\nThe Foreign Affairs Forum is a Peers, MPs, and Parliamentary Candidate only group that facilitates relationship building with individuals in foreign governments and parliaments, providing a media free environment where foreign affairs can be discussed among politicians from different countries.\nCentral Bedfordshire Council\nIn May 2011 Mark was elected to Central Bedfordshire Council representing the ward of Heath and Reach, where he lives with his wife and children. Simultaneously in May 2011 he resigned his seat on Harrow Council and also resigned as Managing Director of VML, to dedicate himself to his new role in Bedfordshire. Two weeks after his election he was appointed Executive Member for Children's Services and Schools, a role his served in for five years, after which he became chairman of the overview and scrutiny committee. He is also Central Bedfordshire's Military Covenant Champion.\nPersonal Life\nIn 2000 Versallion married Kent-born, convent-educated, artist and fashion designer Caroline Marques, only daughter of London lawyer A.M.A. Marques, a member of the minor aristocratic Catholic family from Goa, India. They moved their home to Bedfordshire in 2004 and have four children:\nFor several years\nMark was involved in a national race relations charity with Caroline and they\nhave been\nschool governors since the 1990s. A\nqualified musician from the Guildhall School of Music and Drama, outside politics\nMark spends time with his family, music and the garden.",
  "http_versallion_com_Mark_MARK_htm/http_versallion_com_Mark_Navy_Navy_htm/content_8.html": null,
  "http_versallion_com_Mark_MARK_htm/http_versallion_com_Mark_Ward%20Map_Ward%20Map_htm/content_6.html": null
}