{
  "https_www_aaronjacob_co_uk_/https_www_aaronjacob_co_uk/content_1.html": "Aaron Jacob Aaron on Twitter Latest news We need to talk more about home ownership Home ownership.Two simple words, but which conjure so many images in so many… We need to think much more carefully about assisted suicide The ever-so-powerful and noble campaign led by Dame Esther Rantzen has resulted… We must take the fight to Labour on ideas, not just the day-to-day realities of government There is no hiding it. The British people delivered a whopping rejection of the…\nWe need to talk more about home ownership Home ownership.Two simple words, but which conjure so many images in so many…\nWe need to think much more carefully about assisted suicide The ever-so-powerful and noble campaign led by Dame Esther Rantzen has resulted…\nWe must take the fight to Labour on ideas, not just the day-to-day realities of government There is no hiding it. The British people delivered a whopping rejection of the…",
  "https_www_aaronjacob_co_uk_/https_www_aaronjacob_co_uk_news_we-need-think-much-more-carefully-about-assisted-suicide/content_2.html": "The ever-so-powerful and noble campaign led by Dame Esther Rantzen has resulted in Parliament looking again at assisted dying. This issue deserves the time and space to be debated at length.\nLet us be clear about definitions. Kim Leadbeater MP said her proposals would give eligible adults nearing the end of their lives the right to choose to shorten their deaths if they wish.\nThe details have not been finalised, but reports suggest that the bill is likely to be similar to a proposal in the House of Lords, which would allow terminally ill adults with six months or fewer to live to get medical assistance to end their own lives. Though I am always open to evidence-based policymaking, it is far from clear that this is an idea whose time has come. I present to you seven cogent reasons for really thinking about this issue, three philosophical and four practical.\nFirstly, perhaps the most obvious flaw in the proponents’ case is the paradox at the heart of their argument: that this is about ‘rights’ or ‘freedom’. The Economist argues that: “The case for assisted dying is, at its core, one of individual freedom”.\n‘Rights’ and ‘freedom’ can be both a means and an end.\nBroadly speaking, however, we think of rights and freedom as consequential for the practical effect that they have. It is hard to sustain the argument that a ‘right’ or ‘freedom’ to die is any such thing, as the consequence is the very embodiment of the absence of freedom. But even if you disagree with that, if we extrapolate from the logic of the argument that this is about autonomy and choice, then why should there be any restrictions on who can choose to end their life?\nSecondly, at its simplest: life is worth living. To love and to be loved; to care and to be cared for – these are the quintessence of the human species. We seek to emphasise ‘quality of life’ at our peril. The logical consequence of the ‘quality of life’ argument is the elevation in the worth of one group of people’s lives over another. Once it is conceded that the ‘quality of life’ should be our lodestar in this debate, the result is the inevitable but inexorable debate over whose quality of life should prevail. This raises two important questions: what is the yardstick by which we measure ‘quality of life’? And who gets to decide what that yardstick is? Not only is this a recipe for division, but the practical consequence of this is too grave to consider.\nThirdly, the story of humanity is one of progress. Medical advancement and technological change have meant that human beings, on average, live far longer (and healthier) lives than we did just two centuries ago. This is progress. Indeed, the basis of all public policy and medicine must be rooted in the assumption that it is better for human beings to live as long as possible. Legalising assisted suicide is the precise inversion of everything that medicine and public policy ought to do. To legislate in this way would be a profound regression in the story of humanity.\nFourthly, the proponents argue that their concern is to end pain and suffering. But look at the international evidence. In the US State of Oregon, often held as the model for assisted suicide, pain does not feature in the top five end-of-life concerns.\nThe evidence from Washington is similar. In fact, people’s concerns centre on fear: the loss of dignity, autonomy and enjoyment of life’s activities. This argument also brings into focus the arbitrariness of a six-month threshold. If it is supposed that alleviation from suffering and pain is our lodestar, then six months to live is random. And, most obviously, as Lord Neuberger, former president of the Supreme Court, articulated: “There seems to me to be more justification in assisting people to die if they have the prospect of living many years a life that they regarded as valueless, miserable and often painful, than if they have only a few months to live.”\nFifthly, even if it is supposed that assisted suicide is the means to escape prolonged pain and suffering, then that is a greater argument for improved palliative care. Some argue that assisted suicide and improved palliative care are not mutually exclusive. Ideally, I would agree with this, but this is questionable for two reasons. If palliative care was the best it could possibly be, then the argument in favour assisted suicide would surely fall away. Moreover, in crudely economic terms, legalising assisted suicide may ultimately reduce the scope for improvement in palliative care. This is because a reduced demand for palliative care may mean that the state and the market would have reduced incentive to invest and innovate to improve methods of pain relief and the like.\nSixthly, it is no longer necessary to theorise about the risks of the ‘slippery slope’. Again, look at the international evidence. Where legal, the numbers of people seeking assisted deaths is increasing: they now make up 4% of all deaths in Canada and 5% in the Netherlands.[6] The categories of eligibility are expanding, too. In 2021, Canada loosened its euthanasia laws to no longer require that a patient’s condition be terminally ill, allowing people whose condition is serious and incurable to request it. Canada has since delayed its verdict on allowing mental-health patients to be considered for assisted suicide. But in the Netherlands, Belgium and Switzerland, assisted suicide is available for those with severe mental health problems. These are the thorniest of issues to resolve, particularly when our collective understanding of mental health issues remains rudimentary. Regarding mental health, it is noted that “Doctors must be able to tell between a considered, rational wish to die and a suicidal impulse, a distinction many clinicians feel unable to make”.\nLastly, this proposal is particularly worrisome for those who are vulnerable. The concern is one of coercion: those who are vulnerable, whether the elderly, disabled, or disadvantaged in some other way, may feel pressure to end their lives prematurely, whether from the state, family or some other third party. The state has grown due to it assuming a protective role for those we collectively deem to be vulnerable. As Giles Fraser has said: “human beings are at their most expensive when they are at their most vulnerable”. This change would remove a layer of protection because no matter how watertight the bill, it is questionable how any law would ever be able to fully protect the most vulnerable.\nNone of the above is borne of religious conviction: I do not have any.\nBut I do have personal experience, being there with my grandad in some of his last days as he battled cancer. Undoubtedly, he suffered unbearably and intolerably. But that did not stop those last moments of laughter and him being content in the knowledge that he had his family around him. I will treasure those moments, as I know he did. It is inconceivable that anyone in his position should ever feel any pressure or coercion. It is critical that those with disabilities and those with personal experience of terminal illness share that in this debate, and we also put the case for how to improve palliative care.\nFar from seeing this issue as one which separates us out on either side of the “right side of history”, we should debate, argue and discuss agreeably knowing how consequential this decision may be.\nThis article was first published in Conservative Home on 16.10.2024",
  "https_www_aaronjacob_co_uk_/https_www_aaronjacob_co_uk_news_challenge-levelling-over-century-old-agile-local-government-essential-if-its-be-met/content_5.html": "The idea of ‘Levelling Up’ holds such strong purchase in the popular imagination that seldom is it explicitly defined. Participants in the national debate take for granted that their audience identifies with its ineluctable economic logic. The ‘Levelling Up’ White Paper marks a good attempt to understand the causes of regional disparities, and what ought to be done to close them. Any attempt to craft solutions to such enduring problems ought to grasp the historical roots of what has happened. Those roots run deep beneath the surface. Their complexity militates against shallow analysis or placebo solutions.\nBritain’s contemporaneous debate has it that deindustrialisation is something that ‘commenced’ or ‘accelerated’ in the 1980s, mainly due to the actions of Margaret Thatcher. Just one direct quote from The Guardian will suffice:\n“The story of the past 30 years has been the relentless hollowing-out of industrial Britain, the single biggest change to the British economy in the post-war era. It is a continuing saga that was still in its early stages when Margaret Thatcher sent in the cavalry to deal with the striking colliers.”\nThis caricature, clearly, serves a covert political purpose, but the currency of such views suggests that they are strongly held in the public consciousness. This means, therefore, that they must be engaged with. The problem of regional inequality in Britain is much older than many realise. Contrary to conventional wisdom, the decline of Britain’s manufacturing base can be traced back to when Britain was in its industrial and imperial splendour in the late nineteenth century.\nBritish creations in both steam power and textile production had, by the late eighteenth century, created a paradigm of urban factory-based production. This success meant that by the 1850s, Britain had genuinely become ‘the workshop of the world’ and, by that time, British factories provided two-thirds of the world’s output of ‘new technology industries’.\nTowards the end of the nineteenth century, however, Britain began to cede market share to both a unified Germany and a United States that was developing rapidly. This was largely due to their respective financial systems, most notably in Germany, where the banking system played an active role in developing, and working with, industry. Even so, Britain entered the Great War as a pre-eminent industrial power, to the extent that the staple industries of coal mining, textiles, iron, steel, and shipbuilding constituted almost three quarters of British exports, and employed one quarter of the working population. These industries were, of course, regionally concentrated. Coal mining, for example, was concentrated in South Wales and the north-east of England.\nBritain in the interwar period was, however, a shadow of its former Victorian self. This was for a variety of reasons but principal amongst them was British industrial obsolescence compared with its competitors, an overvalued currency, declining levels of world trade due largely to reparations and growing industrial unrest at home, resulting infamously in the General Strike of 1926.\nThe 1930s are remembered as the ‘Devil’s Decade’, cultivated by images of the Jarrow Marches and George Orwell’s ‘The Road to Wigan Pier’. It is true that official unemployment between 1921 and 1938 never fell below one million people, nearly reaching three million people in the winter of 1932. However, this perspective is also liable to harden into caricature. There were severe regional disparities, what one might term ‘a north-south divide’, culminating in the Special Areas Acts. The Special Areas Acts, first of 1934 and then of 1937, were unique in that government adopted a dirigiste approach to alleviating unemployment in the industrial heartlands of South Wales, Tyneside, and Scotland. Such intervention was microeconomic in nature, but suggestive of government being used to prevent circumstances with macroeconomic implications.\nThe post-Second World War era, underpinned by its ‘Keynesian consensus’, enjoyed a track record of historically low unemployment, even if it was buffeted by bouts of inflation. The ‘stop-go’ era from 1945 until the 1970s was marked by difficult industrial relations and the rise of further international competitors, notably a revivified Western Germany and, latterly, Japan and China. By this time, the dollar had pushed sterling off its pre-eminent reserve currency status.\nOf greater significance, though, was that the pattern of economic activity was dramatically changing: services, from the financial sort to leisure, came to dominate the share of the UK’s economic output. Trade and capital liberalisation, particularly from the 1980s onwards, in conjunction with the entry of the likes of China to the global trading system, meant that industry had a vast pool of labour to choose from. This resulted in the loss of British unionised jobs, and the increased sophistication of supply chains. Difficult industrial relations initially, and then the ease of shifting production elsewhere, has meant that Britain’s economy is now highly orientated towards services. Perhaps excessively so, in light of the COVID-19 pandemic.\nIt is manifest that if public policy is to be used to address regional inequality and the issues of poverty, under- and unemployment, or low educational attainment that flows from it, there must be an appreciation that such disparities have been much longer in gestation. They will require prolonged, sustained attention. Patterns of economic activity inevitably change over time. It will take a determined central government, together with agile local government, that will enable regions, once forgotten, to reinvent themselves.\nMy article on inflation, first published in Conservative Home: https://conservativehome.com/2022/06/30/aaron-jacob-the-challange-for-l…",
  "https_www_aaronjacob_co_uk_/https_www_aaronjacob_co_uk_about-aaron-jacob/content_3.html": "My Background:\nI grew up in a family with strong Conservative values. Hard work, doing the right thing, playing by the rules – these were all values that I absorbed early on. I am one of seven children, and I firmly believe in the value of aspiration, and giving everyone the opportunity to succeed.\nMy dad's family are from Cyprus. My late grandad came to the UK from Cyprus with nothing in the 1940s, and he spoke no English. He started his own business and ended up employing over 70 people. I recall his stories of fighting to keep his business afloat in hard times under all governments.\nI previously worked in industry on the project of building full-fibre broadband right across the UK, dealing with the regulator, central and local government. I understand how critical connectivity is to our daily lives.\nMy dad has also built a successful business. When he fell ill, I left my secure job in industry to join my family legal business. I am now a solicitor, fighting for my clients every single day.\nI am a long-standing Conservative campaigner. I have have been a local Councillor, fighting hard for residents on issues such as speeding, anti-social behaviour, local crime and protecting green spaces. I was previously a Trustee of a local museum, working with business to promote the local area.\nComing from a small business background, I am particularly passionate about helping small businesses to grow, employ more people and succeed.",
  "https_www_aaronjacob_co_uk_/https_www_aaronjacob_co_uk_contact/content_7.html": "Skip to main content\nMain navigation\nHome\nAbout Aaron Jacob\nNews\nContact\nContact\nLeave this field blank\n[email protected]\nOn Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_aaronjacob_co_uk_/https_www_aaronjacob_co_uk_news_aaron-jacob-selected-conservative-party-candidate-sheffield-brightside-and-hillsborough/content_8.html": "Aaron Jacob has been selected as the Conservative Party Candidate in Sheffield Brightside and Hillsborough. Aaron can't wait to meet residents and businesses, hear about their concerns and issues, and try to help them.\nAaron Jacob has been selected as the Conservative Party Candidate in Sheffield Brightside and Hillsborough. Aaron can't wait to meet residents and businesses, hear about their concerns and issues, and try to help them.",
  "https_www_aaronjacob_co_uk_/https_www_aaronjacob_co_uk_cdn-cgi_l_email-protection/content_11.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_aaronjacob_co_uk_/https_www_aaronjacob_co_uk_accessibility/content_9.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_aaronjacob_co_uk_/https_www_aaronjacob_co_uk_news_category_Local-News/content_4.html": "Aaron Jacob selected as Conservative Party Candidate in Sheffield Brightside and Hillsborough 7th June 2024 Aaron Jacob has been selected as the Conservative Party Candidate in Sheffield Brightside and Hillsborough. Aaron can't wait to meet residents and businesses... Local News\nThe challenge for levelling up is over a century old. Agile local government is essential if it’s to be met. 30th June 2022 The idea of ‘Levelling Up’ holds such strong purchase in the popular imagination that seldom is it explicitly defined. Participants in the national debate take... Local News",
  "https_www_aaronjacob_co_uk_/https_www_aaronjacob_co_uk_news_we-must-take-fight-labour-ideas-not-just-day-day-realities-government/content_10.html": "There is no hiding it. The British people delivered a whopping rejection of the Conservative Party; worse than 1997, even pipping the 1906 general election result.\nAs a Parliamentary candidate knocking on doors, speaking to voters and generally living and breathing politics during the campaign, this was difficult to take. It was the most sobering of verdicts.\nAnd let me tell you now: the facts are as stark as the verdict. Between 1900 and 2000, the Conservative party was in office, either alone or in coalition governments which it dominated, for 68 years. That dominance restricted the Liberals and then Labour to only bursts of power.\nIn 14 of the 26 general elections held over the century, the Conservatives secured sizeable majorities. Throughout the twentieth century, the Conservative party consistently won at least 40 per cent of the popular vote. The 20th Century was undoubtedly, as Anthony Seldon and Stuart Ball dubbed it, the “Conservative century”.\nThe contrast between 2019 and 2024 is equally stark. We all know the seat tally, but look at the raw numbers. In 2019, the Conservative party secured almost 14 million votes and a 43 per cent vote share. In 2024, the Conservative party secured under seven million votes and 23 per cent of the vote.\n“Okay, so what?” You might legitimately ask. We already know the scale of the defeat. But that is the point. Before we can ask ‘why’, we must appreciate the scale of the ‘what’.\nThe scale of the defeat means that the scale of the challenge is nothing short of seismic – and quite the reality check against any complacency or simplistic analysis.\nIt is not about engaging in a post hoc debate that seeks to impose a binary choice on us: the party either needs to tack right to court Reform voters, or tack left to court Lib Dem waverers; the ever-changing preferences of the electorate militate against that approach.\nBut cannot bury our heads in the sand. If we are to regain office, the task ahead of our Party is enormous – and our starting point must be to re-engage in the battle of ideas.\nI feel energised by that challenge. The world around us has changed dramatically, even in just the last Parliament. We have lived through a once-in-a-century pandemic, war in continental Europe with a revanchist Russia, and a mounting stand-off against an increasingly authoritarian China.\nLooking ahead, the scale of change to come is no less dramatic: rapidly ageing societies, a declining birth rate, and virtually exponential technological change, all amidst the shifting tectonic plates of geopolitics. Change is the new normal.\nThere are no simplistic solutions. Just as the party forged its thinking anew in the teeth of socialism and economic decline in the 1970s, after belatedly recognising its previous failure to confront the flaws in the post-war settlement, the time is nigh for the party to think afresh about its fundamental beliefs.\nHistorical parallels, of course, are imperfect; the policy solutions of one era will almost always be different to those of another. Policy by resurrection will not work. However, that does not stop us from learning from history, understanding its patterns and seeing what was successful at any given point in time.\nThe role of the state and its size, defence and foreign policy, the structure of our economy, how public services are delivered in a digital age – these are just some of the many challenges that we should grapple with at the intellectual level, something we have avoided doing for too long.\nI see no new ideas from the Labour Party. Fundamentally, it’s a creature of the 20th Century, its basis for existence having historically been the trade union movement; it is difficult to discern any real ideas that Labour wishes to pursue other than a reversion to the mean: tax and spend.\nSir Keir Starmer has, for now, a mandate to govern. We accept that, and we accept defeat. But the obstacles before us are not insurmountable. With a new leader, we have the opportunity to redefine Conservative policy and ideas whilst holding true to our core principles.\nLosing is never easy. Defeat is always hard to take. But with defeat comes opportunity. The party is rightly taking its time over choosing a new leader. That time affords us the space to consider why we lost – and what we could have done differently.\nThe new leader can spearhead the challenge to the Labour government – but only if they can articulate a coherent and compelling Conservative case to the country. We can win over the trust of the British people again in future, just as we have done so many times in the past. But we have to try.\nThis article was first published in Conservative Home on 10.09.2024: https://conservativehome.com/2024/09/10/aaron-jacob-we-must-take-the-fi…",
  "https_www_aaronjacob_co_uk_/https_www_aaronjacob_co_uk_about-rss/content_6.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour."
}