{
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery_andrew-mitchell-mp-visits-birmingham-hospice/content_37.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nfield_gallery_image\nandrew_mitchell_birmingham_hospice.jpg",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_parliament_andrew-mitchell-warns-against-development-cuts-and-urges-integrated-defence-and/content_44.html": "Andrew Mitchell backs increased defence spending but emphasises the correlation between development, defence, and diplomacy. He urges the Government to reverse its decision to cut development funding to 0.3% of GDP, warning that the shortfall will be exploited by China, Russia, and terrorist groups.\nMr Andrew Mitchell (Sutton Coldfield) (Con)\nIt is a pleasure to follow the brave and principled speech of the Chair of the International Development Committee.\nThe Government are absolutely right to increase defence expenditure, and President Trump is right, too, in saying that Europe must shoulder the burden against Russian imperial expansion. But development should be part of that strategy. Development, defence and diplomacy are intertwined. I remind everyone that the development budget tackles conflict, helps build better societies and builds prosperity. It helps tackle migration, disease, medicines, education, vaccinations, growth, jobs, British International Investment—I do not entirely agree with the hon. Lady on this, because BII is an outstanding example of British success in development—transparency, accountability, and anti-corruption. All are independently verified by the Independent Commission for Aid Impact, which is the taxpayers’ friend. That is what development does and it ought to be unanswerable that this is of vital importance.\nThe cut from 0.7% to 0.5% was terrible, but we did manage to find a number of ingenious ways of augmenting that money through guarantees, co-financing, insurance, and the use of special drawing rights, but the reduction to 0.3% will destroy any incipient recovery. And, as the hon. Lady said, who will fill the gap? It will be China and Russia. It will be music to the ears of the many terrorist organisations that exist across sub-Saharan Africa. The failure to do some of the things that the hon. Lady set out so clearly will result in the clarion call of the terrorist being heard.\nFurthermore, the stopping and starting of development is very bad value for money for taxpayers. I know that Foreign Office Ministers will have fought against this terrible decision and it gives me a chance to pay tribute once again to the Foreign, Commonwealth and Development Office and the civil servants and diplomats who work there. It is the finest diplomatic corps in the world. I also want to pay tribute to the right hon. Member for Oxford East (Anneliese Dodds) whose principled and brave resignation letter will serve her very well.\nWe all know that this is an example of the iron fist of No. 10 cynically conquering the extremely good arguments put up by the Foreign Office, to take the low-hanging fruit. In my view, that is entirely wrong. Many are horrified to see a Labour Government behaving in this way, bludgeoning development, which was already badly damaged by the abolition of the Department for International Development and the previous cuts in the last Parliament.\nI ask colleagues on the Labour Benches to make a principled decision and ensure that their voices are heard in government. They should imagine those Prime Ministers who really drove forward international development and the cause of development, turning Britain into a development superpower: Prime Minister Blair, Prime Minister Brown, Prime Minister Cameron and Prime Minister May. Those four Premiers drove the cause and did so much good, saving so many lives. I very much hope that Labour Members will exert influence and explain to the Government why this is the wrong decision at the wrong time and that it must be reversed.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news_plucky-fundraisers-sleep-out-ymca/content_38.html": "Last Friday night in the Gracechurch Centre, our much-respected YMCA organised a sleep out to draw attention to homelessness.\nLocal MP Andrew Mitchell visited the YMCA’s brave group of hardy folk last Friday - which included Board member and local Wylde Green councillor Alex Yip - late in the evening to encourage them and thank those sleeping out for focusing on such an important cause.\nThe Sleep Easy event was attended by 30 people, 20 of whom braved the cold and stayed out all night. Charity representatives, business owners and fundraisers were among those who ditched their beds for the night in solidarity with our Town’s most vulnerable.\nAnd as one of the oldest charities in Sutton Coldfield, the YMCA received support and donations from local businesses, food suppliers and even musical duo Carrick, who performed songs including a rendition of YMCA!\nThe charity works with around 800 young people each year, including those facing the ever-growing issue of youth homelessness. So far, the sleep out has raised £7,500, much of which was donated by kind citizens.\nAll funds raised will go directly back into the charity’s supported housing service, which provides accommodation for 39 young people every night.\nIf anyone would like to help YMCA Sutton Coldfield reach their £10,000 target, you can donate at the link below:\nhttps://www.justgiving.com/campaign/ymcascsleepeasy25?utm_medium=CA&utm_source=CL",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news_sir-andrew-visits-atos-uk-academy/content_11.html": "Last week Sir Andrew visited a remarkable success story right here in our community – the ATOS UK Brazilian Jiu Jitsu Academy in Mere Green.\nThis excellent organisation is now home to nearly 1,000 members, including more than 600 local children actively training and developing life-changing skills.\nLed by Head Professor Tom, one of the most decorated British-born BJJ athletes – a multiple-time World Championship medalist and European and British Champion – ATOS UK is backed by a team of six world-class coaches: Tom, Danny, Paul, Lucy, Sareena, and Evie.\nTogether, they bring not only elite-level expertise but also a deep commitment to nurturing every student, from beginners to advanced athletes.\nAmong them is the remarkable Lucy, ranked World No. 1, a two-time European Champion and World Championship silver medallist, exemplifying the academy’s standard of excellence.\nATOS UK has grown from humble beginnings at the local community centre in Mere Green to becoming one of the top Brazilian Jiu Jitsu facilities in the UK – and the world.\nThis incredible journey is a testament to the power of sport in building opportunity, discipline, and unity.\nNow, the team is working to integrate educational programs into the Academy and expand their outreach into local schools and community projects. It’s inspiring to see this kind of commitment to empowering our youth and creating lasting, positive change.\nThis is a great local success story impacting the lives of over a thousand local people, and without doubt one of Sutton’s finest sporting institutions.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news_weekly-message-constituents-261-plucky-fundraisers-sleep-out-ymca/content_42.html": "This week in Parliament, I raised concerns about government funding for mental health provisions towards primary and secondary school pupils and 18-25 year olds. I asked the Secretary of State for Education whether the Department plans to provide funding for these vital initiatives.\nParliamentary Under-Secretary for the Department of Education, Stephen Morgan MP, responded:\nThis government is committed to improving mental health support for all children and young people. This is critical to high and rising standards in schools and breaking down barriers to opportunity, helping pupils to achieve and thrive in education.\nThat is why the government has committed to expand Mental Health Support Teams (MHSTs), so every young person has access to early support to address problems before they escalate. NHS-funded MHSTs are expected to cover at least 50% of pupils in schools and learners in further education in England by the end of March 2025.\nThe department will also recruit an additional 8,500 new mental health staff to treat children and adults and open new Young Futures hubs with access to mental health support workers.\nIn addition, to support education staff, the department provides a range of guidance and practical resources on promoting and supporting pupils’ mental health and wellbeing. For example, a resources hub for mental health leads, and a toolkit to help choose evidence-based early support for pupils.\nThe department continues to work closely with the further education sector to promote and support providers to develop and implement a whole college approach to mental health and wellbeing. This includes supporting the Association of Colleges (AoC) in their goal for all colleges to sign up to the AoC Mental Health Charter and to align it with the University Mental Health Charter in higher education (HE). AoC’s framework aims to integrate mental health and well-being into every aspect of college life.\nDepartmental officials also continue to work closely with students, parents, mental health experts and the HE sector to drive meaningful change in mental health practice through the HE Mental Health Implementation Taskforce, which recently published its second stage report.\nTo raise standards in the sector, the Office for Students has also provided £400,000 of funding to the student mental health charity, Student Minds. This has enabled significant expansion of the University Mental Health Charter Programme, with 113 universities now signed up. The programme helps universities to adopt a whole-institution approach to mental health, bringing universities together to drive forward continuous improvement in mental health support for students.",
  "https_www_andrew-mitchell-mp_co_uk_about/http_www_andrew-mitchell-mp_co_uk_help/content_35.html": "This section is designed to answer any questions you may have about the role of MPs and how they can help you.\nAs the Member of Parliament for Sutton Coldfield, Andrew’s role is to represent his constituents at Westminster, regardless of whether or not they voted for him.\nIt is important to note that Members of Parliament can only deal with issues raised by their own constituents, so make sure you check you are contacting the MP who represents your constituency.\nWhat can my MP do to help me?\nAndrew can help you with all matters for which Parliament or central government is responsible, such as:\n- Tax problems involving the HM Revenue and Customs Department.\n- Problems dealt with by the Department for Work and Pensions such as benefits, pensions and National Insurance.\n- Problems dealt with by the Home Office, such as immigration.\n- Problems dealt with by the Department of Health, such as hospitals and the National Health Service.\n- Problems dealt with by the Department for Education, such as school closures and grants.\nHow does my MP deal with my problem?\nAndrew can deal with constituents’ problems in a number of ways, some of which include:\n- A letter to the relevant organisation.\n- A letter to the relevant Government Minister.\n- Seek clarification of the reason for decisions taken.\n- Support appeals by individuals or communities.\nMany problems (but not all) can be resolved in this way. Whilst an MP cannot always obtain the answer you would like he can ascertain that correct procedures have been followed.\nIf you feel there has been unnecessary delay or maladministration Andrew may be able to take your case to the Parliamentary Ombudsman. Individuals cannot take their case direct to the Ombudsman but must do so through an MP.\nWhen should I contact someone else?\nSome issues are not the direct responsibility of Parliament or government. In these instances, you should first contact either your local council or your nearest Citizens Advice Bureau before considering contacting your MP.\nThese are issues such as:\n- Council tax.\n- Private problems with neighbours, landlords, employers, family; or companies who’ve sold you faulty goods.\n- Decisions made by the courts.\n- Issues that are the responsibility of your Local Authority, ie dustbins or street repairs.\nIf your problem concerns the Local Authority you should contact your local Councillor. Details on all of Sutton Coldfield’s Councillors and how to contact them are available on Birmingham City Council's website.\nFor details of all your elected representatives visit www.writetothem.com.\nProtecting Your Data\nIn line with data protection regulations, my Office processes constituents’ data for casework and policy query purposes under the lawful basis of public interest. In instances where this lawful basis is not sufficient and explicit consent is required, a member of my office will contact you to establish your consent.\nMy Office holds all data indefinitely until it is no longer relevant or necessary for us to do so. However, data will be processed only to the extent to which it is necessary to achieve the stated purposes of assisting with casework and policy matters.\nPlease note that you hold rights in relation to our data controlling and data processing activities which is detailed on the Information Commissioner’s Office website. You can access this by clicking here.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery_visiting-war-graves-sutton-coldfield-cemetery/content_10.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nfield_gallery_image\nandrew_mitchell_war_graves.jpg",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_parliament_andrew-mitchell-urges-reversal-ps120m-cut-uk-integrated-security-fund/content_48.html": "Former Deputy Foreign Secretary Andrew Mitchell calls on the Government to overturn the decision to cut the UK Integrated Security Fund by £120million.\nMr Andrew Mitchell (Sutton Coldfield) (Con)\nT2. The Minister for Intergovernmental Relations is an extremely experienced Minister, so will he cause to be reviewed the quite extraordinary decision to cut the integrated security fund by £120 million? Is that fund not a classic example of how development complements defence demonstrably and effectively? Will he listen to the great concerns that Members on his own side of the House feel at the terrible decision to axe crucial development spending? (903051)\nThe Chancellor of the Duchy of Lancaster (Pat McFadden)\nThe right hon. Gentleman has great experience in this area, and I respect his judgment very much. He will also have seen the world rapidly change before our eyes in recent weeks. The leadership task when the world is changing so fast is to understand the change, respond to it and explain it. I believe that in the decisions the Prime Minister has taken in this area in recent weeks he has fulfilled those obligations in full and in a way that this House is proud of.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news_sir-andrew-meets-suttons-cadbury-team/content_26.html": "Sir Andrew visited Cadbury’s giant warehouse in Minworth with all varieties of their world famous brands stored floor to ceiling.\nSir Andrew said:\n“I do a lot of interesting and exciting visits around our Royal Town and I meet a lot of amazing people all the time.\n“But you’ll understand what fun it is to visit Cadbury’s giant warehouse in Minworth with all varieties of their world famous brands stored floor to ceiling.\n“Standing among all this chocolate, you can’t help but feel a little like Charlie Bucket in Roald Dahl’s famous novel about a chocolate factory, which was actually inspired by Cadbury’s.\n“Since I last visited some years ago, the business has gone from strength to strength under the leadership of local General Manager Andrew Railton, and employs around 200 people - many of them local. I was shown round by one of their most recent employees, Callum and met the longest serving member of staff, Spike.\n“Sometimes when I make a visit, I leave with some of the produce… and so thank you, Andrew and the team, for the delicious mix of Cadbury’s produce which is destined for my hardworking staff in Parliament and here in my office in the Town!”",
  "https_www_andrew-mitchell-mp_co_uk_about/http_www_andrew-mitchell-mp_co_uk_privacy/content_40.html": "This privacy notice relates to the personal data processed by the Office of The Rt Hon Andrew Mitchell, Member of Parliament for Sutton Coldfield, in relation to casework and policy queries.\nWho is the Data Controller?\nThe Data Controller is The Rt Hon Andrew Mitchell, Member of Parliament for Sutton Coldfield\nWhat does the office do?\nThe office discharges the duties and functions of an elected Member of Parliament. As part of this work, we conduct constituency casework and respond to policy queries, for which we must process personal data of our constituents. We also manage a small, non-political mailing list for the purpose of sending Andrew’s newsletter and information about upcoming advice surgeries.\nHow do we process data?\nThis office processes constituents’ data under the lawful basis of public task. In instances where this lawful basis is not sufficient and explicit consent is required, a member of the office will contact you to establish your consent.\nWe are committed to ensuring that the information we collect and use is appropriate for this purpose, and does not constitute an invasion of your privacy.\nWill we share your data with anyone else?\nIf you have contacted Andrew about a personal or policy issue, we may pass your personal data on to a third-party in the course of dealing with you such as local authorities, government agencies, public bodies, health trusts, regulators and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended. When they no longer need your data to fulfil this service, they will dispose of the details in line with our procedures.\nWe will not share the personal information of members of Andrew’s mailing list or those in receipt of our newsletters.\nIn any case, we will not use your data in a way that goes beyond your reasonable expectations in contacting us.\nFor how long will you keep my personal data?\nCasework and policy queries are often revisited to provide the best service and representation for constituents, from whom we may continue to receive correspondence. Unless specifically requested by you, we feel it is reasonable that our office will hold your personal data for the duration of Andrew’s time as representative for the Sutton Coldfield Constituency. Following an election, if unsuccessful, all records will be destroyed within one calendar month of the election.\nWhat rights do I have to my personal data?\nAt any point while we are in possession of or processing your personal data, you, the data subject, have the following rights:\n• Right of access – you have the right to request a copy of the information that we hold about you.\n• Right of rectification – you have a right to correct data that we hold about you that is inaccurate or incomplete\n• Right to be forgotten – in certain circumstances you can ask for the data we hold about you to be erased from our records.\n• Right to restriction of processing – where certain conditions apply to have a right to restrict the processing.\n• Right of portability – you have the right to have the data we hold about you transferred to another organisation.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\nHow can I contact somebody about my privacy?\nYou can get in touch with our office by letter, email or telephone using the details at the foot of this page.\nPlease note that we will ask for identification (passport, driving license, utility bill from the last 3 months) should you choose to exercise any of the above rights in relation to personal data we hold.\nComplaints\nIn the event that you wish to make a complaint about how your personal data is being processed by this office, or how your complaint has been handled, you have the right to lodge a complaint directly with the Information Commissioner’s Office www.ico.org.uk\nThe Rt Hon Andrew Mitchell MP\nMember of Parliament for Sutton Coldfield\nHouse of Commons\nLondon\nSW1A 0AA\nTel: 0121 354 2229\nemail: andrew.mitchell.mp@parliament.uk\nDownload Data Protection Policy",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news_meeting-our-chief-constable/content_47.html": "Last week Andrew Mitchell MP held one of his regular meetings with the West Midlands Chief Constable, Craig Guildford, at the Force Headquarters in Birmingham.\nItem one on Andrew’s agenda was the inadequacy of our new “cottage police station” and the decisions taken by the Police and Crime Commissioner without proper consultation with the Royal Town.\nAndrew said:\n“I also explored the adequacy of planned levels of manning, and discussed the use of CCTV in our Town Centre which the police would support, even piping the feed straight into the control room.\n“I shall be asking the Police and Crime Commissioner to provide funds for this - which is also strongly supported by the BID - from Community Safety money.\n“More widely under this Chief Constable we are seeing the number of arrests double - a sharp increase in clear-up rates - up by a factor of 4 times on his watch. Across the West Midlands overall crime is down by 15%, burglary by 30% and knife crime and attacks by 18% - all of which is excellent news.”",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news_weekly-message-constituents-262-wishing-you-happy-easter/content_34.html": "Residents have been concerned about the fate of Coleshill Road Nursery, which closed suddenly last year. It has now been confirmed that the nursery is yet another valued local site being sold off by bankrupt Birmingham City Council.\nThe Council’s abrupt decision to close the nursery was made without consulting the public, leaving locals and staff confused and shocked. Now, their questions have at last been answered.\nReddicap Cllr Richard Parkin writes:\n“I was yesterday informed by Birmingham City Council (BCC) that the former garden nursery site located on Coleshill Road will soon go live with marketing. The bids deadline will be set at 5th June.\nThe site is just one of many Council assets being sold off by bankrupt Labour BCC to help pay down its colossal debts. The Council has to sell off £750m assets over two financial years, with a further £250m of asset sales recently earmarked for disposal to make the total sell-off target a staggering £1billion.\nFurther local asset sales and building closures (such as libraries) are coming down the track.\nColeshill Road Nursery closed just over 12 months ago without any prior warning from Birmingham. Staff working at the site were left completely in the dark when the City Council suddenly decided to close the gates without any warning or explanation.\nI was then told by Officers that a review of the council’s nursery provision across the city would take place with the council’s intention to permanently close two of its three nurseries (Coleshill Road Nursery, Kings Heath Garden Centre or Cofton Nursery), leaving just one site open.\nHowever, Coleshill Road Nursery is the only site to have remained closed over the past 12 months - before the review had even been started. The other two sites still remain open.\nWhat’s more, the decision to close Coleshill Road Nursery and now sell it off has been made before the promised review has been completed. As far as I am aware the review hasn’t even started yet, as I have never been formally consulted on the Council’s proposals.\nThe demise of Coleshill Road Nursery is a sad loss to the town. It has been much loved and widely used by Reddicap and Sutton Coldfield residents for many years.\nMeanwhile, the sites at Cofton and Kings Heath still remain open. It feels like Sutton Coldfield and its taxpaying residents have – once again – been unfairly targeted for reduced services by Birmingham.\nNot only is it a tragedy that the Coleshill Road site is being flogged off to help pay down BCC’s self-inflicted debts, but the Council has shamefully failed to actively or meaningfully engage with myself or local residents throughout the process.\nI am utterly appalled by the whole way the Council has gone about this. It gives you an insight into how shambolically run BCC is and why it became bankrupt in the first place.”",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news_weekly-message-constituents-264-looking-forward-community-games/content_30.html": "Above: with staff members at ATOS Academy.\nLast week I visited a remarkable success story right here in our community – the ATOS UK Brazilian Jiu Jitsu Academy in Mere Green.\nThis excellent organisation is now home to nearly 1,000 members, including more than 600 local children actively training and developing life-changing skills.\nLed by Head Professor Tom, one of the most decorated British-born BJJ athletes – a multiple-time World Championship medalist and European and British Champion – ATOS UK is backed by a team of six world-class coaches: Tom, Danny, Paul, Lucy, Sareena, and Evie.\nTogether, they bring not only elite-level expertise but also a deep commitment to nurturing every student, from beginners to advanced athletes.\nAmong them is the remarkable Lucy, ranked World No. 1, a two-time European Champion and World Championship silver medallist, exemplifying the academy’s standard of excellence.\nATOS UK has grown from humble beginnings at the local community centre in Mere Green to becoming one of the top Brazilian Jiu Jitsu facilities in the UK – and the world.\nThis incredible journey is a testament to the power of sport in building opportunity, discipline, and unity.\nNow, the team is working to integrate educational programs into the Academy and expand their outreach into local schools and community projects. It’s inspiring to see this kind of commitment to empowering our youth and creating lasting, positive change.\nThis is a great local success story impacting the lives of over a thousand local people, and without doubt one of Sutton’s finest sporting institutions.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_royal-sutton-coldfield/content_19.html": "The Royal Town of Sutton Coldfield is located about 8 miles from central Birmingham, in the north east of the city and has a population of about 105,000 as recorded in the 2001 census.\nSutton Coldfield is the largest and most northerly Parliamentary constituency in Birmingham, bordering Staffordshire and Warwickshire countryside to the north and east.\nIn 1528, a charter of King Henry VIII gave the town the right to be known for ever as \"The Royal Town of Sutton Coldfield\" and to be governed by a warden and society. The charter was secured by Bishop John Vesey. This unreformed corporation survived until 1885, when it was replaced by a municipal borough.\nThe town is well known for its 2,400 acres of natural parkland with seven lakes, originally the property of Bishop Vesey after it was given to him by Henry VIII. Old Moor Hall, the fifteenth century home of the Bishop still stands. He also founded the Grammar School which is named after him.\nIn addition to Sutton Coldfield’s vast green space there are many public and privately owned historic buildings throughout the town; some are covered by the conservation areas of Four Oaks and the Town Centre.\nSutton Coldfield makes up a number of districts including Wylde Green and Boldmere to the south of the town centre, Mere Green and Four Oaks to the north and Walmley to the south east.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news_britain-has-lost-its-once-great-development-prowess/content_33.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\n9 December 2024\nBritain has lost its once great development prowess\nFormer Deputy Foreign Secretary Andrew Mitchell writes for\nThe House Magazine\n.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery_sir-andy-street-and-andrew-mitchell-mp-open-folklore-cafe/content_24.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nfield_gallery_image\nandrew_mitchell_folklore.jpg",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery_andrew-mitchell-attends-royal-sutton-coldfield-town-hall-agm/content_7.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nfield_gallery_image\nandrew_mitchell_town_hall.jpg",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_about/content_1.html": "Sir Andrew was born in 1956 and is married with two daughters. He was educated at Rugby School and Cambridge University, where he studied history and was elected as President of the Cambridge Union in 1978. Andrew served in the Army (Royal Tank Regiment) before joining Lazard where he worked with British companies seeking large-scale overseas contracts.\nHe was the Member of Parliament for Gedling from 1987 to 1997. During this period he held office as a Government Whip and as Minister for Social Security. He also served as a Vice-Chairman of the Conservative Party from 1992 to 1993.\nIn 2001 he was re-elected to Parliament as MP for Sutton Coldfield. In November 2003, he was appointed Shadow Minister for Economic Affairs. From September 2004 until the end of the Parliamentary term, he was Shadow Minister for Home Affairs. Following the General Election in May 2005 Andrew joined the Shadow Cabinet and was appointed Shadow Secretary of State for International Development. Andrew Mitchell was Secretary of State for International Development from May 2010 until September 2012 and Government Chief Whip from September – October 2012.\nAndrew returned to the Government serving as Minister of State in the Foreign, Commonwealth & Development Office from October 2022 to July 2024. In April 2024 he was given the title of Deputy Foreign Secretary. Andrew served as Shadow Foreign Secretary from July to November 2024.\nAn experienced and highly effective MP, Andrew is committed to serving the people of Sutton Coldfield.\nAndrew is currently campaigning on a number of important local issues in Sutton Coldfield including issues affecting our local environment and the general well-being of the Sutton Coldfield community. He is very active in addressing issues of local development where he feels they adversely affect the Town. He actively supports a number of local charities including Breastfriends, Sutton Coldfield Branch of the RNLI, Parkinson’s Disease Society, Sutton Coldfield Sea Cadets, Greenacres, and Sutton Coldfield Guiding. Andrew is also a Parliamentary Disabled Children’s Champion for the Disabled Children’s Partnership.\nSince becoming Sutton Coldfield’s MP he is particularly pleased to have achieved the reinstatement of the Sutton Coldfield Civic Service and established the Sutton Coldfield Inter-Schools Debating Competition.\nAs Sutton Coldfield’s MP, Andrew deals with hundreds of letters and emails from constituents every week. He has a dedicated staff of 5 people to assist him with this work. The issues raised are wide ranging and can fall within the responsibility of Government Departments or Birmingham City Council as well as a number of the agencies that now administer specific matters such as immigration, benefits and the environment. In addition he holds regular Advice Sessions where constituents can see him to discuss political issues or matters of personal concern.\nAndrew has a home in Sutton Coldfield and spends as much time as possible regularly visiting local schools, businesses and voluntary organisations.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_privacy/content_27.html": "This privacy notice relates to the personal data processed by the Office of The Rt Hon Andrew Mitchell, Member of Parliament for Sutton Coldfield, in relation to casework and policy queries.\nWho is the Data Controller?\nThe Data Controller is The Rt Hon Andrew Mitchell, Member of Parliament for Sutton Coldfield\nWhat does the office do?\nThe office discharges the duties and functions of an elected Member of Parliament. As part of this work, we conduct constituency casework and respond to policy queries, for which we must process personal data of our constituents. We also manage a small, non-political mailing list for the purpose of sending Andrew’s newsletter and information about upcoming advice surgeries.\nHow do we process data?\nThis office processes constituents’ data under the lawful basis of public task. In instances where this lawful basis is not sufficient and explicit consent is required, a member of the office will contact you to establish your consent.\nWe are committed to ensuring that the information we collect and use is appropriate for this purpose, and does not constitute an invasion of your privacy.\nWill we share your data with anyone else?\nIf you have contacted Andrew about a personal or policy issue, we may pass your personal data on to a third-party in the course of dealing with you such as local authorities, government agencies, public bodies, health trusts, regulators and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended. When they no longer need your data to fulfil this service, they will dispose of the details in line with our procedures.\nWe will not share the personal information of members of Andrew’s mailing list or those in receipt of our newsletters.\nIn any case, we will not use your data in a way that goes beyond your reasonable expectations in contacting us.\nFor how long will you keep my personal data?\nCasework and policy queries are often revisited to provide the best service and representation for constituents, from whom we may continue to receive correspondence. Unless specifically requested by you, we feel it is reasonable that our office will hold your personal data for the duration of Andrew’s time as representative for the Sutton Coldfield Constituency. Following an election, if unsuccessful, all records will be destroyed within one calendar month of the election.\nWhat rights do I have to my personal data?\nAt any point while we are in possession of or processing your personal data, you, the data subject, have the following rights:\n• Right of access – you have the right to request a copy of the information that we hold about you.\n• Right of rectification – you have a right to correct data that we hold about you that is inaccurate or incomplete\n• Right to be forgotten – in certain circumstances you can ask for the data we hold about you to be erased from our records.\n• Right to restriction of processing – where certain conditions apply to have a right to restrict the processing.\n• Right of portability – you have the right to have the data we hold about you transferred to another organisation.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\nHow can I contact somebody about my privacy?\nYou can get in touch with our office by letter, email or telephone using the details at the foot of this page.\nPlease note that we will ask for identification (passport, driving license, utility bill from the last 3 months) should you choose to exercise any of the above rights in relation to personal data we hold.\nComplaints\nIn the event that you wish to make a complaint about how your personal data is being processed by this office, or how your complaint has been handled, you have the right to lodge a complaint directly with the Information Commissioner’s Office www.ico.org.uk\nThe Rt Hon Andrew Mitchell MP\nMember of Parliament for Sutton Coldfield\nHouse of Commons\nLondon\nSW1A 0AA\nTel: 0121 354 2229\nemail: andrew.mitchell.mp@parliament.uk\nDownload Data Protection Policy",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_help/content_12.html": "This section is designed to answer any questions you may have about the role of MPs and how they can help you.\nAs the Member of Parliament for Sutton Coldfield, Andrew’s role is to represent his constituents at Westminster, regardless of whether or not they voted for him.\nIt is important to note that Members of Parliament can only deal with issues raised by their own constituents, so make sure you check you are contacting the MP who represents your constituency.\nWhat can my MP do to help me?\nAndrew can help you with all matters for which Parliament or central government is responsible, such as:\n- Tax problems involving the HM Revenue and Customs Department.\n- Problems dealt with by the Department for Work and Pensions such as benefits, pensions and National Insurance.\n- Problems dealt with by the Home Office, such as immigration.\n- Problems dealt with by the Department of Health, such as hospitals and the National Health Service.\n- Problems dealt with by the Department for Education, such as school closures and grants.\nHow does my MP deal with my problem?\nAndrew can deal with constituents’ problems in a number of ways, some of which include:\n- A letter to the relevant organisation.\n- A letter to the relevant Government Minister.\n- Seek clarification of the reason for decisions taken.\n- Support appeals by individuals or communities.\nMany problems (but not all) can be resolved in this way. Whilst an MP cannot always obtain the answer you would like he can ascertain that correct procedures have been followed.\nIf you feel there has been unnecessary delay or maladministration Andrew may be able to take your case to the Parliamentary Ombudsman. Individuals cannot take their case direct to the Ombudsman but must do so through an MP.\nWhen should I contact someone else?\nSome issues are not the direct responsibility of Parliament or government. In these instances, you should first contact either your local council or your nearest Citizens Advice Bureau before considering contacting your MP.\nThese are issues such as:\n- Council tax.\n- Private problems with neighbours, landlords, employers, family; or companies who’ve sold you faulty goods.\n- Decisions made by the courts.\n- Issues that are the responsibility of your Local Authority, ie dustbins or street repairs.\nIf your problem concerns the Local Authority you should contact your local Councillor. Details on all of Sutton Coldfield’s Councillors and how to contact them are available on Birmingham City Council's website.\nFor details of all your elected representatives visit www.writetothem.com.\nProtecting Your Data\nIn line with data protection regulations, my Office processes constituents’ data for casework and policy query purposes under the lawful basis of public interest. In instances where this lawful basis is not sufficient and explicit consent is required, a member of my office will contact you to establish your consent.\nMy Office holds all data indefinitely until it is no longer relevant or necessary for us to do so. However, data will be processed only to the extent to which it is necessary to achieve the stated purposes of assisting with casework and policy matters.\nPlease note that you hold rights in relation to our data controlling and data processing activities which is detailed on the Information Commissioner’s Office website. You can access this by clicking here.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news_well-be-letting-ourselves-down-not-just-ukraine-if-we-waver-anything-total-support/content_21.html": "Shadow Foreign Secretary and former Deputy Foreign Secretary, Rt Hon Andrew Mitchell MP writes for ConservativeHome.\nI’ve been around a while. Long enough to have served alongside politicians from the wartime generation, whose battlefield stories my rookie mind lapped up as a young MP in the 1980s. Hard truths were learned and imparted by the people who lived through and fought in the Second World War. These were also simple truths. Appeasement must never be an option. Red lines must never be crossed.\nBullies must always be faced down.\nThe west has been tested several times since 1945. The second half of the 20th century may not have been as bloody as the first, but the Cold War upped the ante in terrifying ways. In 1962 The Cuban Missile Crisis brought the world to the brink of nuclear confrontation, after the US discovered the Soviet Union was installing nuclear tipped missiles on the island of Cuba, eye-wateringly close to Florida.\nPresident John F Kennedy was clear that this was unacceptable and ordered a naval blockade of Soviet arms shipments that were heading America’s way. It was a huge gamble. The standoff that followed could have escalated to the point of no return. But this was Kennedy’s red line. And while the world held its breath, the US held its nerve. Sure enough, Soviet ships retreated. The bully was faced down.\nThe world has changed since then, but the simple truths still apply. Russia’s monstrous invasion of Ukraine is a sobering reminder that when tyrants are given an inch, they will grab whatever they can.\nOne of the single most important things the Conservative Party did during our time in office was to side unequivocally with Ukraine. Under Boris Johnson and Rishi Sunak, we were often the first mover on vital military aid and pushed our allies to go further. We were at the vanguard of the sanctions response, delivered vital humanitarian support and were constantly looking at new ways of constraining Putin’s war machine.\nIn opposition our support must remain unwavering. Ukraine’s fight is our fight. Freedom and democracy are at stake. These are not abstract principles but the principles that underpin the open international order, the rock upon which the world’s – and our – security and prosperity rests.\nWe have seen what happens when resolve is weakened. Parallels are often drawn with the appeasement of Nazi Germany through the Munich agreement but there are echoes closer to home today. The west’s failure to act after President Assad used chemical weapons in Syria in 2011, the allies’ timorous response to Russia’s annexation of Crimea in 2014 and the US’ chaotic withdrawal from Afghanistan in 2021, were watched and exploited by Putin. We display weakness and disunity at our peril.\nNo more. Victory for the bully would deliver a hammer blow to the most fundamental international rule – that countries must not seize land from others, that the world cannot be remodelled by force. And make no mistake: Ukraine’s fight is existential. It would be no less naïve to believe that Putin will stop in Ukraine than believing Hitler was staying put in the Sudetenland.\nThe UK must therefore provide further military aid to Ukraine to defend the frontline and protect critical infrastructure. We must supply the weaponry and authorise the use of it in any way that contributes to Ukraine’s defence against aggression, and which complies with international law and the rules-based system. And let us not lose sight of the fact that this is Europe’s war: the UK has a duty to corral our friends on the continent to stay the course.\nWe must not allow Putin’s bluster to scare us off. He repeatedly threatens war but the truth is we have already suffered a variety of low-level incursions, with espionage, malign cyber activity and even a suspected arson attack. President Zelensky is right to warn that backing down now would only embolden the enemy.\nThe Ukrainians have shown remarkable courage and tenacity. David is beating back Goliath in ways we never would have imagined when the war began. Now is the time for the world to step up, not step back. As Thatcher reflected after the Falklands: ‘you cannot allow the difficulties to dominate your thinking. You have to set out an iron will to overcome them’. Ukraine can and will win this war if we and our allies give it the necessary support, at speed, and for as long as it takes.\nThe American diplomat George Kennan famously warned of Soviet expansionism and observed that the Soviet Union was ‘impervious to the logic of reason, but highly sensitive to the logic of force.’ This simple truth remains as relevant today as it was back then.\nUkraine is our test. Our Munich. Our Cuba. Our Falklands. It is a fight for the rules-based international order. We must stand shoulder to shoulder with Ukraine until victory is assured.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_cookies/content_2.html": "We want to make this website as easy to use and helpful as possible. This sometimes involves placing small amounts of information on your computer. These are called 'cookies'.\nThese cookies cannot be used to identify you personally and are only used to improve the service offered to users of this website.\nYou can manage or disable these small files yourself in your web browser, but some features of the website may not function as a result. To learn more about cookies visit AllAboutCookies.org.\nThe cookies we use\nThe open source platform and content management system on which this website is built uses the following cookies:\n|\nDrupal |\nSESS |\nLogs the current session, Expires 21 days from the session date. |\n|\n|\n|\nhas_js |\nLogs whether or not you have javascript enabled. Expires at end of session. |\n|\n|\n|\nDrupal.tableDrag.showWeight |\nThis cookie determines whether a numeric weight is shown when a table is dragged. Expires 1 year from the session date. |\n|\n|\nGoogle Analytics |\n_gat _ga _gid |\nThese cookies are used to collect information about how visitors use this website. We use the information to compile reports and to help us improve the website. The cookies collect information in an anonymous form, including the number of visitors to the website, where visitors have come to the site from and the pages they visited |\n|\n|\nCookie control |\nCookiecontrol |\nThis cookie is set when you accept cookies from this site. Expires 2 months from the session date. |\nThird Party cookies\nSome third-party services used on this website also use cookies. These are not controlled by us, but are controlled by the service provider:\nGoogleMaps",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_visiting-parliament/content_5.html": "Visiting Parliament\nIf you, your school or organisation are from the Sutton Coldfield constituency and would like to arrange a visit to the House of Commons, please contact Andrew by post, email or telephone.\nPlease note that tours of the Houses of Parliament are very popular and places are limited so generally have to be booked about six months in advance.\nFor further information on visiting Parliament click here for details.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news_sir-andrew-meets-visit-royal-sutton-coldfield-bid/content_8.html": "Sir Andrew met with the Chairman of the Visit Royal Sutton Coldfield BID, Mark Wilkinson, this week to discuss a range of issues of interest to our local businesses, who are the lifeblood of the Town.\nSutton’s BID (Business Improvement District) stretches from Maney Corner through the town centre and up to Sutton Coldfield College. Through it, hundreds of local businesses in the town centre pay a levy, which funds town centre initiatives and events.\nAll of these events aim to inject new life into Sutton Coldfield, encouraging people to come along, enjoy the free entertainment and support our local traders.\nSir Andrew said:\n“I congratulated Mark and the BID on another totally brilliant Food Festival in the Town Centre and thanked them for their work promoting business in the Town.”",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_parliament/content_31.html": "Speaking in the House of Commons, Andrew Mitchell condemns the paralysis and incompetence at Birmingham City Council and calls for a judge-led inquiry into the cause of the equal pay crisis, Birmingham’s bankruptcy and the ongoing bin strike.\nFollowing the Government statement on the devastating earthquake in Myanmar and Thailand, Andrew Mitchell raises concerns about the 6.3 million children in Myanmar who are dependent on assistance and asks what discussions have been held with the Americans to ensure continued UK and US joint spending and to ensure we get greater value for money.\nAndrew Mitchell backs increased defence spending but emphasises the correlation between development, defence, and diplomacy. He urges the Government to reverse its decision to cut development funding to 0.3% of GDP, warning that the shortfall will be exploited by China, Russia, and terrorist groups.\nFollowing the Government statement on its plan for neighbourhoods, Sutton Coldfield MP Andrew Mitchell welcomes the commitment to honour the towns fund commitment and invites the Minister to visit the Royal Town to see how the money is being spent.\nFormer Deputy Foreign Secretary Andrew Mitchell congratulates the Prime Minister on his efforts over the past week on securing a lasting peace in Ukraine. He further points out that with the combined GDP of six key European members of NATO being over seven times that of Russia, this should add to the effectiveness of deterrence and cooperation between European allies.\nFollowing the Prime Minister’s statement to the House of Commons on the international situation and the need for increased defence spending, Andrew Mitchell supports the strategic direction but warns against funding it by cutting overseas aid, which harms the world’s poorest people.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery_andrew-mitchell-cuts-ribbon-renaming-royal-sutton-coldfield-school/content_15.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nfield_gallery_image\nandrew_mitchell_royal_sc_school.jpg",
  "https_www_andrew-mitchell-mp_co_uk_about/http_www_andrew-mitchell-mp_co_uk_cookies/content_43.html": "We want to make this website as easy to use and helpful as possible. This sometimes involves placing small amounts of information on your computer. These are called 'cookies'.\nThese cookies cannot be used to identify you personally and are only used to improve the service offered to users of this website.\nYou can manage or disable these small files yourself in your web browser, but some features of the website may not function as a result. To learn more about cookies visit AllAboutCookies.org.\nThe cookies we use\nThe open source platform and content management system on which this website is built uses the following cookies:\n|\nDrupal |\nSESS |\nLogs the current session, Expires 21 days from the session date. |\n|\n|\n|\nhas_js |\nLogs whether or not you have javascript enabled. Expires at end of session. |\n|\n|\n|\nDrupal.tableDrag.showWeight |\nThis cookie determines whether a numeric weight is shown when a table is dragged. Expires 1 year from the session date. |\n|\n|\nGoogle Analytics |\n_gat _ga _gid |\nThese cookies are used to collect information about how visitors use this website. We use the information to compile reports and to help us improve the website. The cookies collect information in an anonymous form, including the number of visitors to the website, where visitors have come to the site from and the pages they visited |\n|\n|\nCookie control |\nCookiecontrol |\nThis cookie is set when you accept cookies from this site. Expires 2 months from the session date. |\nThird Party cookies\nSome third-party services used on this website also use cookies. These are not controlled by us, but are controlled by the service provider:\nGoogleMaps",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery_andrew-mitchell-local-scout-leader-david-thebridge/content_18.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nfield_gallery_image\nandrew_mitchell_david_thebridge.jpg",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_parliament_andrew-mitchell-backs-defence-boost-warns-against-cuts-overseas-aid/content_41.html": "Following the Prime Minister’s statement to the House of Commons on the international situation and the need for increased defence spending, Andrew Mitchell supports the strategic direction but warns against funding it by cutting overseas aid, which harms the world’s poorest people.\nMr Andrew Mitchell (Sutton Coldfield) (Con)\nI agree entirely with the strategic direction that the Prime Minister has set out. Defence and security must come first, but he does have choices about how he funds that important uplift. In the last Parliament, he and I voted together against balancing the books on the backs of the poorest people in the world. Does he still think that vote was right?\nThe Prime Minister (Keir Starmer)\nI am proud of that vote at the time, and proud of the work that our country has done on development. This is not a decision that I want to make, and I absolutely want us to get back to more funding on overseas development and increasing those capabilities. Some of that will be helped if, as we are doing, we get the asylum backlog down and stop using that money to pay for hotels, which is not what it is intended for. This has been a difficult decision. The right hon. Gentleman knows how much I value overseas development and how important it is, but I thought, and think, that the most important thing today is to be clear about the commitment we are making on defence, to spell out the reasons that we are making those decisions, and to set out penny and pound exactly how it will be funded. I would not come to the House with a plan that was not credible and not costed, because that would be far worse for our country, but I accept the tenor of what he says about the importance of the issue.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery_andrew-mitchell-meets-commonwealth-war-graves-commission-and-volunteer-paul-vinals-sutton/content_9.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nfield_gallery_image\nandrew_mitchell_war_graves.jpg",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_parliament_andrew-mitchell-presses-foreign-secretary-uk-support-moroccos-western-sahara-plan/content_13.html": "1 April 2025\nAndrew Mitchell presses Foreign Secretary on UK support for Morocco’s Western Sahara plan\nAndrew Mitchell asks the Foreign Secretary if the UK Government will support Morocco’s autonomy plan for Western Sahara.\nMr Andrew Mitchell (Sutton Coldfield) (Con)\nAre the British Government going to act, as the French and American Governments have done, to support Morocco’s autonomy plan for Western Sahara?\nThe Secretary of State for Foreign, Commonwealth and Development Affairs (Mr David Lammy)\nWe continue to have discussions with our Moroccan friends. This is a complex issue. The position remains the position we had under the last Government. Of course, we keep that under review as we continue to discuss these issues in the region.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_parliament_andrew-mitchell-welcomes-towns-fund-commitment-and-invites-minister-visit/content_45.html": "Following the Government statement on its plan for neighbourhoods, Sutton Coldfield MP Andrew Mitchell welcomes the commitment to honour the towns fund commitment and invites the Minister to visit the Royal Town to see how the money is being spent.\nMr Andrew Mitchell (Sutton Coldfield) (Con)\nThe Minister will understand that in the royal town of Sutton Coldfield, we were delighted to receive the towns fund money from the last Government, and we are grateful to him for—in his words—honouring that commitment from the Dispatch Box. May I also thank him for the courtesy he has shown in the discussions that he and I have had about this? As I have said to him before, I hope that he will pay a state visit to the royal town of Sutton Coldfield, where we can show him not only the delights of the town, but how well we will ensure that this taxpayers’ money is spent.\nThe Parliamentary Under-Secretary of State for Housing, Communities and Local Government (Alex Norris)\nI am grateful for that, and for the conversations that I have had with the right hon. Gentleman. The difference between his area and the other 74 is that in his case, the connection is with a town council, rather than a local authority. As he knows, I am a great proponent of town and parish councils. He bears a heavy weight as a result, but we want to demonstrate that this is a model that works and could be used again in the future. I look forward to working with him, and I will of course pay that visit.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_parliament_andrew-mitchell-urges-continued-focus-syria-amid-global-crises/content_46.html": "Following the Government statement on recent events in Syria, Andrew Mitchell urges the Minister to ensure that efforts remain focused in this area and not get distracted by all the other preoccupying crises around the world.\nMr Andrew Mitchell (Sutton Coldfield) (Con)\nThe Minister is to be commended for bringing this statement to the House. He will be aware that Britain has been heavily involved, since we helped to set up the Zaatari camp, in supporting the 5 million people in the surrounding countries who we know wish to go home as soon as the situation allows. My plea to him is to ensure that, given all the other preoccupying crises around the world, the full force of the Foreign Office, with its long history of engagement in Syria, does not get distracted elsewhere but is brought to bear at this time.\nThe Parliamentary Under-Secretary of State for Foreign, Commonwealth and Development Affairs (Mr Hamish Falconer)\nI pay tribute to the right hon. Gentleman’s many years of work on Syria as the Secretary of State for International Development and in many other capacities. I confirm that I and we will remain focused on events in Syria, which are of vital importance to the region and to the UK. We will continue to give them the focus that they deserve.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_contact/content_25.html": "MPs are only permitted to offer advice and handle correspondence from their own constituents, please therefore include your full address and postcode in all correspondence.\nFor the fastest response please email andrew.mitchell.mp@parliament.uk with your full name and address, a contact telephone number and a brief outline of your query.\nPost:\nRt Hon Sir Andrew Mitchell MP\nHouse of Commons\nLondon SW1A 0AA\nTelephone:\nWestminster Office: 020 7219 8516\nConstituency Office: 0121 354 2229\nEmail:\nandrew.mitchell.mp@parliament.uk\nFacebook:\nhttps://www.facebook.com/andrewmitchellmp/\nProtecting Your Data:\nMy office will not use your personal data in any way that goes beyond your reasonable expectations in contacting me. Please see my Privacy Notice.\nAdvice Surgeries:\nIf you are a constituent and would like to arrange an advice session appointment, please email andrew.mitchell.mp@parliament.uk with ‘advice session request’ as the subject line. You will need to provide your full name, postal address and a brief summary of what you wish to discuss.\nShould email not be possible, please call 0207 219 1689 instead.\nFor all other matters please email andrew.mitchell.mp@parliament.uk or call 020 7219 8516.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery_andrew-mitchell-mp-visits-birmingham-hospice-0/content_23.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nfield_gallery_image\nandrew_mitchell_birmingham_hospice2.jpg",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_parliament_andrew-mitchell-calls-judge-led-inquiry-birmingham-council-crisis/content_14.html": "Speaking in the House of Commons, Andrew Mitchell condemns the paralysis and incompetence at Birmingham City Council and calls for a judge-led inquiry into the cause of the equal pay crisis, Birmingham’s bankruptcy and the ongoing bin strike.\nMr Andrew Mitchell (Sutton Coldfield) (Con)\nThe Minister really cannot get away with blaming the last Conservative Government for this situation. Labour’s own campaign improvement board said:\n“Budget cuts and the size of the City are used as reasons to explain the situation however, this does not hold up to scrutiny”.\nMy constituents in the Royal town of Sutton Coldfield, which is part of Birmingham if only for local government purposes, are absolutely furious at this latest evidence of paralysis and incompetence under Labour. It follows Labour bankrupting the city, rocketing our council tax, seeking to close our libraries and trying to charge us for parking in our own park. Does the Minister not think that we now need a judge-led inquiry into the cause of the equal pay crisis, Birmingham’s bankruptcy and this dreadful bin strike? Surely the people of Birmingham, Britain’s second city, deserve better from the Labour party.\nThe Minister for Local Government and English Devolution (Jim McMahon)\nI am afraid that the picture that the right hon. Member paints of increased charges at a local level—whether for car parking or other types of charges, or the council tax going up in a way that some households will find difficult—is the story of English local government for the last decade, and Birmingham does not sit in isolation. In many ways, the size of the local authority—the fact that it is the largest local authority in Europe, not just in this country—goes some way to explaining how a ripple in one council of a much smaller size in Birmingham has a much bigger implication.\nThe right hon. Member talked about a judge-led process. This situation does not need a judge; it needs judgment. The judgment is that, after so much progress has been made on equal pay, now is the time to resolve the dispute, settle it and allow the workforce to move on with fair pay for men and women in equivalent roles across the local authority. I am sure he agrees with me that that is the way forward.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news/content_29.html": "News\nWeekly Message to Constituents 261 - Plucky fundraisers sleep out for YMCA\n11 April 2025\nLast Friday night in the Gracechurch Centre, our much-respected YMCA organised a sleep out to draw attention to homelessness - a subject which I have always followed closely both here in our area and down at Westminster.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news_weekly-message-constituents-263-busy-week/content_4.html": "Aston Villa fans from Sutton will be heading to Wembley Stadium for the FA Cup semi-final tomorrow – and I wish the team well as they bid to reach the final.\nHowever, fans are facing major travel disruption, as rail services from Birmingham and across the West Midlands are severely limited due to engineering works and capacity issues.\nTransport falls under the remit of the region’s Mayor, who has been too silent on an issue that is impacting thousands of local football fans, threatening to tarnish a great day out.\nPut it this way, when Andy Street was Mayor, similar problems hit Coventry City fans when they headed to Wembley in 2023. Andy made sure lessons were learnt, and as a result 18 additional trains were running when they made it to Wembley again in 2024.\nChiltern Railways has confirmed that there will be no trains running from Birmingham Moor Street, Solihull, Dorridge, Lapworth, Hatton or Warwick to London. Instead, Chiltern will operate, what they describe as, an \"enhanced service\" from Warwick Parkway to Wembley Stadium to help manage the increased demand from fans.\nHowever, fans travelling from Birmingham itself are set to struggle: Warwick Parkway is not easily accessible from Birmingham, and parking is limited. Even worse, Chiltern has admitted it \"does not have the capacity\" to get fans back out of London from Wembley after the match, and has even advised supporters to consider staying overnight in London!",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_parliament_mitchell-backs-pm-ukraine-and-highlights-natos-economic-strength-over-russia/content_36.html": "Former Deputy Foreign Secretary Andrew Mitchell congratulates the Prime Minister on his efforts over the past week on securing a lasting peace in Ukraine. He further points out that with the combined GDP of six key European members of NATO being over seven times that of Russia, this should add to the effectiveness of deterrence and cooperation between European allies.\nMr Andrew Mitchell (Sutton Coldfield) (Con)\nThe Prime Minister should surely be commended both for the meetings that he held in the White House last week and for the effective leadership that he showed over the weekend. Will he bear in mind, as he seeks to forge this coalition of the willing with urgency and vigour, that the GDP of Russia is some $2 trillion, while the GDP of the six European members of NATO that are the most committed is more than seven times that, at $15 trillion? That should surely add to the effectiveness of the deterrent and the work that he is now doing with European allies.\nThe Prime Minister (Keir Starmer)\nI thank the right hon. Gentleman for raising that point. We must not lose sight of the fact that the Russian economy is being damaged by the measures that we are taking collectively, particularly on sanctions, and we should have self-confidence in the ability of Europe to pull together, whether that is on military or financial issues, for the collective security of the defence of Europe. We have said many times that Europe needs to step up. Now is the time to step up; now is the time to lead. That is why I was pleased that in the last few days we moved things on a little in that regard.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_news_case-bringing-shamima-begum-back-now-irrefutable/content_20.html": "Andrew Mitchell writes for The Telegraph\nThe latest revelations about security service collusion in respect of Ms Shamima Begum make alarming reading. It has been obvious from the outset that she and her foolish young friends were groomed. Now we discover that ministers knew she was a trafficking victim, transported by a terrorist group, but chose to strip her of her British citizenship regardless.\nWhatever your view of the bad teenage choices she made and the circumstances in which she made them, it is unconscionable to abandon her in the desert. She was born in Britain and trafficked, effectively for sex, at the age of 15 — below the lawful age of consent. And my goodness she has paid a price: three children dead, four years in a prison camp. There is a case for letting her come back on compassionate grounds alone.\nIn the four years since she was discovered in a Kurdish-controlled detention camp in North-East Syria, pregnant, brainwashed by IS propaganda, traumatised by the deaths of her two small children and still only 19 years old, the Government has portrayed Ms Begum as an unrepentant terrorist and a threat to national security. Rather than bring her home, it has sought to cut her off from British justice and prevent her repatriation.\nThis abdication of responsibility projects weakness, not strength. The legal, moral and security arguments for repatriating Ms Begum and the handful of other British women in her position are unanswerable. Ministers can only be persisting with this manifestly failed policy because they think it is good politics.\nHuman trafficking was a cornerstone of the ISIS state-building project. Vulnerable young women and girls were targeted and coerced or deceived into travelling. On arrival, they were locked in “women’s houses” then forced into marriage, domestic servitude and sexual slavery.\nDuring the inquiry of the APPG on Trafficked Britons in Syria, which I chair alongside the former head of Britain’s diplomatic service, Lord Jay, we learned that UK institutions systematically failed to prevent this vile trade. Public authorities failed to identify at-risk individuals, failed to notify the families of girls being groomed, and failed to prevent them leaving the country.\nThe Government is justifiably proud of its efforts to combat trafficking, underpinned by the Modern Slavery Act 2015- but there is a blind spot when it comes to ISIS. Steve Harvey, who led anti-trafficking units at the Met and Europol, told our inquiry “it is the state’s responsibility to identify victims of trafficking”. Despite being presented with volumes of evidence that British women and children were trafficked to Syria, the Home Office has refused even to assess which of the British women in NES may be victims.\nThe Government should now change course. Its do-nothing policy is badly out of step with our allies who, following the USA’s lead, are repatriating their nationals from the region In March, Germany brought 37 women and children home. In July, France repatriated 51. The US has called the UK’s position a “dereliction of responsibility” and our Kurdish allies in the fight against ISIS view it as a betrayal.\nSome of the women will have cases to answer, but that is a determination for the Crown Prosecution Service to make and for British courts to adjudicate. As the former Director of Global Counter Terrorism Operations at MI6, Richard Barrett, wrote in this newspaper: “the only way to reduce the potential threat from British nationals in these detention facilities is to repatriate them and either prosecute them or reintegrate them into society, working within a rule of law framework.”\nThis is the growing consensus of security officials, at home and abroad. It is also morally the right thing to do. There is still time for our government to remedy its mistakes.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery_andrew-mitchell-presents-greener-globe-funeral-standards-platinum-award-ian-hazel-funerals/content_39.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nfield_gallery_image\nandrew_mitchell_ian_hazel_funerals.jpg",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery_andrew-mitchell-mp-visits-langley-school/content_22.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nfield_gallery_image\nandrew_mitchell_langley.jpg",
  "https_www_andrew-mitchell-mp_co_uk_about/http_www_andrew-mitchell-mp_co_uk_about/content_32.html": "Sir Andrew was born in 1956 and is married with two daughters. He was educated at Rugby School and Cambridge University, where he studied history and was elected as President of the Cambridge Union in 1978. Andrew served in the Army (Royal Tank Regiment) before joining Lazard where he worked with British companies seeking large-scale overseas contracts.\nHe was the Member of Parliament for Gedling from 1987 to 1997. During this period he held office as a Government Whip and as Minister for Social Security. He also served as a Vice-Chairman of the Conservative Party from 1992 to 1993.\nIn 2001 he was re-elected to Parliament as MP for Sutton Coldfield. In November 2003, he was appointed Shadow Minister for Economic Affairs. From September 2004 until the end of the Parliamentary term, he was Shadow Minister for Home Affairs. Following the General Election in May 2005 Andrew joined the Shadow Cabinet and was appointed Shadow Secretary of State for International Development. Andrew Mitchell was Secretary of State for International Development from May 2010 until September 2012 and Government Chief Whip from September – October 2012.\nAndrew returned to the Government serving as Minister of State in the Foreign, Commonwealth & Development Office from October 2022 to July 2024. In April 2024 he was given the title of Deputy Foreign Secretary. Andrew served as Shadow Foreign Secretary from July to November 2024.\nAn experienced and highly effective MP, Andrew is committed to serving the people of Sutton Coldfield.\nAndrew is currently campaigning on a number of important local issues in Sutton Coldfield including issues affecting our local environment and the general well-being of the Sutton Coldfield community. He is very active in addressing issues of local development where he feels they adversely affect the Town. He actively supports a number of local charities including Breastfriends, Sutton Coldfield Branch of the RNLI, Parkinson’s Disease Society, Sutton Coldfield Sea Cadets, Greenacres, and Sutton Coldfield Guiding. Andrew is also a Parliamentary Disabled Children’s Champion for the Disabled Children’s Partnership.\nSince becoming Sutton Coldfield’s MP he is particularly pleased to have achieved the reinstatement of the Sutton Coldfield Civic Service and established the Sutton Coldfield Inter-Schools Debating Competition.\nAs Sutton Coldfield’s MP, Andrew deals with hundreds of letters and emails from constituents every week. He has a dedicated staff of 5 people to assist him with this work. The issues raised are wide ranging and can fall within the responsibility of Government Departments or Birmingham City Council as well as a number of the agencies that now administer specific matters such as immigration, benefits and the environment. In addition he holds regular Advice Sessions where constituents can see him to discuss political issues or matters of personal concern.\nAndrew has a home in Sutton Coldfield and spends as much time as possible regularly visiting local schools, businesses and voluntary organisations.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery_andrew-mitchell-visits-mums-and-babies-tinytalk-sutton-coldfield-and-lichfield/content_17.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nfield_gallery_image\nandrew_mitchell_tinytalk.jpg",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk/content_3.html": "It is my pleasure and privilege to serve the people of Royal Sutton Coldfield. I always work hard to help local residents and to champion the issues of importance to our town.\nI hope that this website provides you with a useful insight into some of the work I do on behalf of my constituents – both in Sutton Coldfield and in the House of Commons.\nOver the year thousands of local residents contact me by letter, email and in person. If I can be of any help to you, please do not hesitate to get in touch.\nYou can also follow me over on my Facebook page here.\nSpeaking in the House of Commons, Andrew Mitchell condemns the paralysis and incompetence at Birmingham City Council and calls for a judge-led inquiry into the cause of the equal pay crisis, Birmingham’s bankruptcy and the ongoing bin strike.\nFollowing the Government statement on the devastating earthquake in Myanmar and Thailand, Andrew Mitchell raises concerns about the 6.3 million children in Myanmar who are dependent on assistance and asks what discussions have been held with the Americans to ensure continued UK and US joint spending and to ensure we get greater value for money.\nAndrew has a keen interest in international development and in 2007 founded Project Umubano, the Conservative Party’s ten-year social action project in Rwanda. The project culminated with the Kigali Declaration against Genocide and Identity-based Violence.\nThe latest revelations about security service collusion in respect of Ms Shamima Begum make alarming reading. It has been obvious from the outset that she and her foolish young friends were groomed. Now we discover that ministers knew she was a trafficking victim, transported by a terrorist group, but chose to strip her of her British citizenship regardless.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery_andrew-mitchell-catches-cherished-team/content_28.html": "Skip to main content\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nVisiting Parliament\nWhat your MP can do for you\nToggle navigation\nMain navigation\nHome\nAbout Andrew\nNews\nIn Parliament\nRoyal Sutton Coldfield\nGallery\nContact\nfield_gallery_image\nandrew_mitchell_cherished.jpg",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_parliament_andrew-mitchell-calls-uk-us-cooperation-aid-myanmars-vulnerable-children/content_16.html": "Following the Government statement on the devastating earthquake in Myanmar and Thailand, Andrew Mitchell raises concerns about the 6.3 million children in Myanmar who are dependent on assistance and asks what discussions have been held with the Americans to ensure continued UK and US joint spending and to ensure we get greater value for money.\nMr Andrew Mitchell (Sutton Coldfield) (Con)\nI thank the hon. Lady for her statement to the House. For those of us who have been closely involved on issues to do with Burma/Myanmar for decades now, the severity of the disaster is shown by the fact that, unusually, the regime has called for international support. However, it is a mark of the barbarity of that illegal and corrupt junta that it conducted 11 airstrikes against its own people after the earthquake took place, which is undoubtedly a war crime. We have a long history of engagement with Burma. Some 6.3 million children are absolutely dependent on assistance. It will be very difficult to sustain the necessary level of support in future following Labour’s dreadful cuts to the international development programme. What discussions has the Minister had with her American counterparts to ensure that we drive the UK and US joint spending and get greater value for money?\nThe Parliamentary Under-Secretary of State for Foreign, Commonwealth and Development Affairs (Catherine West)\nI thank the right hon. Gentleman for his contribution and for his knowledge of Myanmar/Burma and of the situation. I could not agree more with him in his description of the Tatmadaw and its approach over the years—absolutely ruthless and brutal to its own people. He talks about the children who are affected. He will be aware that between 4 million and 5 million children were out of school even before the earthquake, so there is a strong sense that this could not have happened to a more vulnerable country. He asked about the role of the USA. As he is aware, US aid has been paused internationally, but I was delighted to see at the weekend that the US Government have said that they will contribute $2 million immediately. We will seek to work with US partners, who know the area as well, so that we can join up our efforts.",
  "https_www_andrew-mitchell-mp_co_uk_about/https_www_andrew-mitchell-mp_co_uk_gallery/content_6.html": "Gallery Andrew Mitchell meets with Commonwealth War Graves Commission and volunteer Paul Vinals at Sutton Coldfield Cemetery Andrew Mitchell cuts the ribbon at the renaming of Royal Sutton Coldfield School Andrew Mitchell presents the Greener Globe Funeral Standards Platinum Award to Ian Hazel Funerals Andrew Mitchell visits mums and babies at TinyTalk - Sutton Coldfield and Lichfield. Andrew Mitchell MP visits Birmingham Hospice Andrew Mitchell MP visits Birmingham Hospice Andrew Mitchell attends Royal Sutton Coldfield Town Hall AGM Andrew Mitchell catches up with the Cherished team Andrew Mitchell MP visits Langley School Sir Andy Street and Andrew Mitchell MP open Folklore cafe Andrew Mitchell with local scout leader David Thebridge Visiting war graves in Sutton Coldfield Cemetery. Pagination Current page 1 Page 2 Page 3 Page 4 Page 5 Page 6 Page 7 Page 8 Page 9 … Next page Next › Last page Last »"
}