{
  "https_www_katebelmonte_org_uk_/https_www_katebelmonte_org_uk/content_1.html": "THANK YOU TO EVERYONE WHO VOTED FOR A GREENER, HEALTHIER & HAPPIER FUTURE IN 2024 - THE FIGHT HAS ONLY JUST BEGUN!\nFor the first time in Medway Green Party's history we not only beat the Lib Dem's but we also secured our General Election deposit.\nI just want to say a huge thank you to everyone who contributed to the campaign, especially those who gave up their precious time to support us across all of Medway's 3 constituencies.\nSince the election I have been supper busy growing the non-profit, which I co-founded in 2020. I have also been working on a number of campaigns with Rainham Eco Hub, Rochester Eco Hub, Medway Foodbank and Carers First.\nMy non-political role gives me a unique perspective of how the Medway Towns are changing and what communities really want and desperately need.\nIf you would like to work with me in the future, be it political or community based then please do get in touch, using the contact form at the bottom of this page.\nIf you would like to work with me in the future, be it political or community based then please do get in touch, using the contact form at the bottom of this page.\nTogether we are stronger!\nKate\nKate BelmonteFighting for Gillingham & Rainham\nYour Green Party Parliamentary Candidate for Gillingham & Rainham\nFed up of politics? Me too!\nHi I'm Kate and I am standing as your Green Party candidate for Gillingham and Rainham.\nI have lived in Gillingham since the age of 5. As well as bringing up 2 children with my husband, Daniel, I also run an award winning local non-profit social enterprise, tasked with fighting loneliness and isolation across our towns.\nI am a keen environmentalist and have campaigned to protect our green spaces and agricultural land in Rainham, Twydall and on the Hoo Peninsula.\nI was instrumental in saving 126 acres of prime agricultural land in Rainham and I continue to work within Gillingham & Rainham's diverse communities to help prepare us for the many challenges that the climate and biodiversity crisis is bringing.\nI am passionate about improving our communities and getting the infrastructure we need to thrive. I want to bring focus to the provision of homes, health and education for all.\nWhen the time comes, I want my children to be able to fly the nest, and be able to afford a decent, clean, warm and energy efficient home.\"\nI'm absolutely delighted to have been chosen to represent a party, which not only reflects my personal political beliefs, but also a party that can think creatively about the issues that face our community and find solutions that help the majority of people\nI have lived in Gillingham since the age of 5. As well as bringing up 2 children with my husband, Daniel, I also run an award winning local non-profit social enterprise, tasked with fighting loneliness and isolation across our towns.\nI am a keen environmentalist and have campaigned to protect our green spaces and agricultural land in Rainham, Twydall and on the Hoo Peninsula.\nI was instrumental in saving 126 acres of prime agricultural land in Rainham and I continue to work within Gillingham & Rainham's diverse communities to help prepare us for the many challenges that the climate and biodiversity crisis is bringing.\nI am passionate about improving our communities and getting the infrastructure we need to thrive. I want to bring focus to the provision of homes, health and education for all.\nWhen the time comes, I want my children to be able to fly the nest, and be able to afford a decent, clean, warm and energy efficient home.\"\nI'm absolutely delighted to have been chosen to represent a party, which not only reflects my personal political beliefs, but also a party that can think creatively about the issues that face our community and find solutions that help the majority of people\nLet's bring integrity and honesty back into politics, and choose real change and real hope together!\nProtecting the Environment\nSave the NHS\nBuild genuinely affordable homes for locals\nFighting anti social behaviour through community empowerment\nProtecting the most vulnerable\nLeading a Green Business Revolution\nwhy vote green?\nThe only party fighting for the future!\n- Protecting the Environment\n- Save the NHS\n- Build genuinely affordable homes for locals\n- Fighting Anti-Social Behaviour through Community Empowerment\n- Protecting the most vulnerable\n- Leading a Green Business Revolution\nKate Belmonte fighting for Gillingham & Rainham\nI've been active in local politics since standing in the 2019 local elections for Twydall. I'm not in politics because I love it, it's actually the complete opposite, after working on local campaigns to save farm land I realised how inaccessible politics is for local residents and how difficult it was to understand the system, a failing system, a system built to prevent real democracy.",
  "https_www_katebelmonte_org_uk_/https_www_katebelmonte_org_uk_pledges/content_2.html": "Pledges\nWater\nI will continue fighting to protect our rivers and seas, and bring water back in to public hands, where profits are not placed above service and long term sustainability. We are seeing a water crisis across the whole country not just in terms of dealing with waste but also in terms of storing fresh water.In 2023 there were 241 sewage spills in Gillingham and Rainham and the is no justification for these incidents the entire time they are rewarding shareholders and higher management including CEOs with funds which should be reinvested into the system. The amount of asset stripping we have seen is criminal and I will fight to put an end to it!\nDisability Medway Network CIC\nI am very proud to be a member of this group and having physical disabilities myself I understand and empathise with all of the communities members. Through my work I am trying to provide more community sessions for those with a whole host of disabilities including those with learning disabilities. As per your requests I agree to be a champion for the rights of all people with learning disabilities, including people from minority ethnic communities and with high support needs. I agree to fighting to reform social care so it meets the rights of people with learning disabilities and their families and provides fair pay for social care workers.\nI will work to provide effective, reasonably adjusted health services that contribute to better health and raising life expectancy for people with learning disabilities\nI will help people with learning disabilities get the jobs they want, supported by a system that recognises contributions not forcing poverty.\nI will campaign to make sure people with learning disabilities have the same access to housing options as their nondisabled peers.\nI am running a campaign which I hope will be as inclusive as possible, my disabilities make evening events very difficult and I have so far agreed to attend 3 hustings; I will be at St Margaret's Church in Rainham tomorrow evening, on Monday I will be at the KMTV hustings at the Gillingham Greenwich University Campus and next Thursday I will be at St Mark's Church in Gillingham.\nRSPCA Farm Pledge\nI completely agree with all you have said and will fight passionately to protect all animals from bad farming practices.\nI completely agree with all you have said and will fight passionately to protect all animals from bad farming practices.\nDisability Rights\nDisability rights are literally my life. I developed Psoriatic Arthritis at the age of 13 and have since 'collected' numerous other autoimmune conditions, which have resulted in being an ambulatory wheelchair user, for mobilising outside of my home.\nIn my non-profit we are ensuring our activities are open to all and we have a large cohort of volunteers whom like myself have a whole host of conditions, conditions which we work around to ensure everyone is able to volunteer with us.\nI pledge to work with you to make the lives of people with disabilities just as easy as for non-disabled citizens. Making infrastructure accessible for all benefits the whole of society, and I literally have a front row seat in seeing how much further we have to go.\nRenters Rights\nI agree with the following demands:\nNo unfair evictions - Give renters the confidence to put down roots and complain if there are problems in our homes\nNo unaffordable rent increases - Help renters plan our finances and shield us from soaring rents\nBetter quality homes - Raise standards to make private rented homes warmer and more comfortable\nAn easier way to fix problems - Make it easier for tenants to exercise our rights and hold bad landlords to account\nAccess to more affordable homes - Make private rents more affordable while and give us the option to access social housing if we need it or home ownership if we want it.\nThe Green Party believe that ceasing the right to buy whilst simultaneously exclusively building social housing will bring down rents and prevent houses from being seen as pure financial assets. We also want to introduce rent controls to ensure that renters are not being exploited. Running alongside the removal of zero hour contracts and increases to minimum wage to £15ph will also help to reduce poverty and increase security for citizens.\nNo unfair evictions - Give renters the confidence to put down roots and complain if there are problems in our homes\nNo unaffordable rent increases - Help renters plan our finances and shield us from soaring rents\nBetter quality homes - Raise standards to make private rented homes warmer and more comfortable\nAn easier way to fix problems - Make it easier for tenants to exercise our rights and hold bad landlords to account\nAccess to more affordable homes - Make private rents more affordable while and give us the option to access social housing if we need it or home ownership if we want it.\nThe Green Party believe that ceasing the right to buy whilst simultaneously exclusively building social housing will bring down rents and prevent houses from being seen as pure financial assets. We also want to introduce rent controls to ensure that renters are not being exploited. Running alongside the removal of zero hour contracts and increases to minimum wage to £15ph will also help to reduce poverty and increase security for citizens.\nLoneliness & Isolation\nI have signed the Age UK pledge to become an Age Champion.\nIf elected as your MP, I am committed to speaking up on behalf of older people in Parliament and working to change their lives for the better.\nI will also ensure that constituents can reach me in a range of ways, not just online.\nI run a local non-profit tasked with fighting loneliness and isolation across the Medway Towns and work with older generations daily. If you would like to find out how you can support your community we are always on the hunt for more volunteers.\nPoverty\nOne of the reasons I joined the Green Party is because of their policies for social justice and wealth redistribution, I believe that we are the only party truly fighting to reduce the poverty that is engulfing our country. It is no surprise that a govt and opposition who refuse to stand for the people are letting people fall through the gaps created by wealth extraction.\nThe Green Party believe in reimagining the economy so that GDP is not its only measure, that people and their lives tell us more about how prosperous our country is or, in this case is not.\nWe believe in a £15 minimum wage, we want a 1% tax on assets worth over £10m and a 2% tax on assets over £1b. We are also proposing that shares/assets gained are taxed at the same rate as income tax. Our manifesto is being launched today and I encourage you to look at the other ways in which we are proposing to tackle poverty.\nWe clearly see that poverty and class division is pulling our country apart. By fighting poverty we will help everyone and reducing that gap between the 'haves and the have nots' is critical for our country.\nPersonally I run a non-profit which is tasked with fighting loneliness and isolation across the Medway Towns. Towards the end of last year we started to see hunger in our beneficiaries eyes and we made the decision to raise funds to feed all those who attended our community outreach sessions, we also delivered food parcels during the pandemic and I personal donated my food parcel (I was a shielder) to One Big Family for redistribution.\nThe Green Party believe in reimagining the economy so that GDP is not its only measure, that people and their lives tell us more about how prosperous our country is or, in this case is not.\nWe believe in a £15 minimum wage, we want a 1% tax on assets worth over £10m and a 2% tax on assets over £1b. We are also proposing that shares/assets gained are taxed at the same rate as income tax. Our manifesto is being launched today and I encourage you to look at the other ways in which we are proposing to tackle poverty.\nWe clearly see that poverty and class division is pulling our country apart. By fighting poverty we will help everyone and reducing that gap between the 'haves and the have nots' is critical for our country.\nPersonally I run a non-profit which is tasked with fighting loneliness and isolation across the Medway Towns. Towards the end of last year we started to see hunger in our beneficiaries eyes and we made the decision to raise funds to feed all those who attended our community outreach sessions, we also delivered food parcels during the pandemic and I personal donated my food parcel (I was a shielder) to One Big Family for redistribution.\nThe rise of Food Bank use\nThe rise of food bank use, in all honesty makes me ashamed to be British, the fact that as country we are now at this point speaks volumes to how the current economic model works; putting profits above the health and safety of our population.\nIt is with no effort that I state - If elected, I pledge to use my voice as your MP to advocate for changes which would help ensure our social security system protects people from needing a food bank to survive.\nIt is with no effort that I state - If elected, I pledge to use my voice as your MP to advocate for changes which would help ensure our social security system protects people from needing a food bank to survive.\nFurther more I will continue my work across The Medway Towns to not only feed vulnerable adults through the work I do with Mutual Aid Road Reps CIC but to continue campaigning for changes to our endemic systems.\nAbortion & Woman's Rights\nFirstly thank you for taking the time to reach out on such an important and indeed divisive subject. I agree that sex based abortion is ethically wrong and that we must act to prevent the needless abortion of female foetus based solely on their sex, I am however not confident that this is possible without removing the right, that I believe every woman has, to choose how their body is used. I would propose an extensive research programme to first identify the reasons for this discrimination (which I believe begins with all women's rights including the right to autonomy over their bodies) and then use this data to inform and educate citizens.\nI fully respect your beliefs, but I am afraid, as stated above that I believe that a woman should always have the choice in how their body is used. I believe that the science continues to show that the cut-off point of 23 weeks and 6 days is not only sufficient but provides legal protection for the foetus.\nIn the UK a women needs the signature of 2 doctors prior to any abortion taken place, and I trust that those doctors will ensure that the decision is in the best interest of the woman and does not cause pain or distress to the foetus.\nI have 2 children both of which were desperately wanted, unfortunately due to a whole variety of reasons, which must stay between the patient and doctor, some woman are unable to or do not want to become a mother. I refuse to judge a woman on a decision which will always be in her best interest.\nPersonally I am on a medication which has been shown to cause severe birth defects, my husband and I take every precaution to not become pregnant but the fact remains that were I to fall pregnant, whilst on this medication, I would have to in all likelihood undergo an abortion, it would devastate us both but the reality of taking that child to term could be life altering, life limiting or simply cruel to that child.\nI do agree about preventing work place discrimination and will work to ensure that women are not discriminated against when they choose to become mothers.\nI understand that my position is not exactly where you are and I thank you for allowing me to express my feelings and believes on this subject.\nI fully respect your beliefs, but I am afraid, as stated above that I believe that a woman should always have the choice in how their body is used. I believe that the science continues to show that the cut-off point of 23 weeks and 6 days is not only sufficient but provides legal protection for the foetus.\nIn the UK a women needs the signature of 2 doctors prior to any abortion taken place, and I trust that those doctors will ensure that the decision is in the best interest of the woman and does not cause pain or distress to the foetus.\nI have 2 children both of which were desperately wanted, unfortunately due to a whole variety of reasons, which must stay between the patient and doctor, some woman are unable to or do not want to become a mother. I refuse to judge a woman on a decision which will always be in her best interest.\nPersonally I am on a medication which has been shown to cause severe birth defects, my husband and I take every precaution to not become pregnant but the fact remains that were I to fall pregnant, whilst on this medication, I would have to in all likelihood undergo an abortion, it would devastate us both but the reality of taking that child to term could be life altering, life limiting or simply cruel to that child.\nI do agree about preventing work place discrimination and will work to ensure that women are not discriminated against when they choose to become mothers.\nI understand that my position is not exactly where you are and I thank you for allowing me to express my feelings and believes on this subject.",
  "https_www_katebelmonte_org_uk_/https_www_katebelmonte_org_uk_index_php/content_5.html": "THANK YOU TO EVERYONE WHO VOTED FOR A GREENER, HEALTHIER & HAPPIER FUTURE IN 2024 - THE FIGHT HAS ONLY JUST BEGUN!\nFor the first time in Medway Green Party's history we not only beat the Lib Dem's but we also secured our General Election deposit.\nI just want to say a huge thank you to everyone who contributed to the campaign, especially those who gave up their precious time to support us across all of Medway's 3 constituencies.\nSince the election I have been supper busy growing the non-profit, which I co-founded in 2020. I have also been working on a number of campaigns with Rainham Eco Hub, Rochester Eco Hub, Medway Foodbank and Carers First.\nMy non-political role gives me a unique perspective of how the Medway Towns are changing and what communities really want and desperately need.\nIf you would like to work with me in the future, be it political or community based then please do get in touch, using the contact form at the bottom of this page.\nIf you would like to work with me in the future, be it political or community based then please do get in touch, using the contact form at the bottom of this page.\nTogether we are stronger!\nKate\nKate BelmonteFighting for Gillingham & Rainham\nYour Green Party Parliamentary Candidate for Gillingham & Rainham\nFed up of politics? Me too!\nHi I'm Kate and I am standing as your Green Party candidate for Gillingham and Rainham.\nI have lived in Gillingham since the age of 5. As well as bringing up 2 children with my husband, Daniel, I also run an award winning local non-profit social enterprise, tasked with fighting loneliness and isolation across our towns.\nI am a keen environmentalist and have campaigned to protect our green spaces and agricultural land in Rainham, Twydall and on the Hoo Peninsula.\nI was instrumental in saving 126 acres of prime agricultural land in Rainham and I continue to work within Gillingham & Rainham's diverse communities to help prepare us for the many challenges that the climate and biodiversity crisis is bringing.\nI am passionate about improving our communities and getting the infrastructure we need to thrive. I want to bring focus to the provision of homes, health and education for all.\nWhen the time comes, I want my children to be able to fly the nest, and be able to afford a decent, clean, warm and energy efficient home.\"\nI'm absolutely delighted to have been chosen to represent a party, which not only reflects my personal political beliefs, but also a party that can think creatively about the issues that face our community and find solutions that help the majority of people\nI have lived in Gillingham since the age of 5. As well as bringing up 2 children with my husband, Daniel, I also run an award winning local non-profit social enterprise, tasked with fighting loneliness and isolation across our towns.\nI am a keen environmentalist and have campaigned to protect our green spaces and agricultural land in Rainham, Twydall and on the Hoo Peninsula.\nI was instrumental in saving 126 acres of prime agricultural land in Rainham and I continue to work within Gillingham & Rainham's diverse communities to help prepare us for the many challenges that the climate and biodiversity crisis is bringing.\nI am passionate about improving our communities and getting the infrastructure we need to thrive. I want to bring focus to the provision of homes, health and education for all.\nWhen the time comes, I want my children to be able to fly the nest, and be able to afford a decent, clean, warm and energy efficient home.\"\nI'm absolutely delighted to have been chosen to represent a party, which not only reflects my personal political beliefs, but also a party that can think creatively about the issues that face our community and find solutions that help the majority of people\nLet's bring integrity and honesty back into politics, and choose real change and real hope together!\nProtecting the Environment\nSave the NHS\nBuild genuinely affordable homes for locals\nFighting anti social behaviour through community empowerment\nProtecting the most vulnerable\nLeading a Green Business Revolution\nwhy vote green?\nThe only party fighting for the future!\n- Protecting the Environment\n- Save the NHS\n- Build genuinely affordable homes for locals\n- Fighting Anti-Social Behaviour through Community Empowerment\n- Protecting the most vulnerable\n- Leading a Green Business Revolution\nKate Belmonte fighting for Gillingham & Rainham\nI've been active in local politics since standing in the 2019 local elections for Twydall. I'm not in politics because I love it, it's actually the complete opposite, after working on local campaigns to save farm land I realised how inaccessible politics is for local residents and how difficult it was to understand the system, a failing system, a system built to prevent real democracy.",
  "https_www_katebelmonte_org_uk_/https_www_katebelmonte_org_uk_press/content_3.html": "Press\nWhat Kate's been up to:\n2024\nLocal Authority Gillingham & Rainham Hustings took place in Thursday 13th June at St Margaret's Church in Rainham.\nTo watch the recording from the hustings CLICK HERE\nKMTV live streamed their Gillingham & Rainham Hustings on Monday 17th June.\nTo watch the debate please CLICK HERE\nTo read the transcript please CLICK HERE\nKate will be attending St Mark's Hustings in Gillingham on Thursday 20th June from 7pm.\nMay\nGeneral Election 2024: Kate Belmonte to contest Gillingham and Rainham constituency for The Green Party VISIT\nMarch\nTo watch the recording from the hustings CLICK HERE\nKMTV live streamed their Gillingham & Rainham Hustings on Monday 17th June.\nTo watch the debate please CLICK HERE\nTo read the transcript please CLICK HERE\nKate will be attending St Mark's Hustings in Gillingham on Thursday 20th June from 7pm.\nMay\nGeneral Election 2024: Kate Belmonte to contest Gillingham and Rainham constituency for The Green Party VISIT\nMarch\nKate joins Stuart Jeffrey at MidKent College in Madistone to discuss politics with students VISIT\n2023\nJanuary\nJanuary\nKate Belmonte appears on The Kent Politics Show VISIT\n2022\nJune\n2022\nJune\nKate Belmonte discusses the risks of air pollution to her youngest son VISIT\nMarch\nKate Belmonte joined Jadzia Samuel on The Kent Climate Show VISIT\n2021\nNovember\nNovember\nAC Goatham’s appeal dismissed VISIT\nCampaigners stop housing development in Rainham VISIT\nKate Belmonte delighted as major development plans thrown out by Planning Inspectorate VISIT\nAppeal to build 1,250 homes in Rainham rejected VISIT\nAugust\nFight continues to stop building on Eastcourt Green, Twydall VISIT\nJuly\nRainham MP apologises after breaching MP’s Code of Conduct VISIT\nMarch\nDevelopers consider more orchards in Rainham for development, between Lower Rainham Road and Otterham Quay Lane\nVISIT\nVISIT\nPolice called after protest banner goes missing opposing orchards scheme off Pump Lane, Rainham\nVISIT\nVISIT\nFebruary\nPublic inquiry to be held into plans by AC Goatham & Son to build 1,250 homes in orchard off Pump Lane in Rainham\nVISIT\n2020\nNovember\nRainham residents reignite campaign to save orchards from housing appeal VISIT\nVISIT\n2020\nNovember\nRainham residents reignite campaign to save orchards from housing appeal VISIT\nRainham residents forced to restart fight to save popular orchard from development\nVISIT\nVISIT\nRainham housing appeal by AC Goatham and Son sees opponents step up campaign\nVISIT\nJune\nProtestors fear appeal over rejected plans for orchards off Pump Lane VISIT\nOctober\nDon't let this be the last harvest VISIT\nJanuary\nMedway Council eyes green spaces in Twydall for new developments VISIT\n2009\nKate Belmonte - Finalist in the Natwest Everywoman Business Awards VISIT\nVISIT\nJune\nProtestors fear appeal over rejected plans for orchards off Pump Lane VISIT\nOctober\nDon't let this be the last harvest VISIT\nJanuary\nMedway Council eyes green spaces in Twydall for new developments VISIT\n2009\nKate Belmonte - Finalist in the Natwest Everywoman Business Awards VISIT",
  "https_www_katebelmonte_org_uk_/https_www_katebelmonte_org_uk_hustings-debates/content_4.html": "Hustings / Debates\nKate has so far attended 2 husting debates you can see her in action below:\nLocal Authority Gillingham & Rainham Hustings took place in Thursday 13th June at St Margaret's Church in Rainham.\nTo watch the recording from the hustings CLICK HERE\nKMTV live streamed their Gillingham & Rainham Hustings on Monday 17th June.\nTo read the transcript please CLICK HERE\nKate also attended St Mark's Hustings in Gillingham on Thursday 20th June, unfortunately the debate was not recorded."
}