{
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_07_16_local-elections-2024-analysis/content_10.html": "16th July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Results_2024_LE_analysis-1.pdf",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_04_03_constitution/content_39.html": "Skip to content\nSkip to footer\nWolverhampton\nMenu\nNews\nAbout Us\nWGP People\nElections\nConstitution\nContact Us\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nUncategorised\nConstitution\nConstitution\n3rd April 2024\nby\ndongwinnett\nConstitution2017-2\nDownload\nTo top",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_07_18_digital-media-report-agm-2024/content_16.html": "WEBPAGE: The webpage has been rewritten with up-to-date information and some new pages for documents, reports and information needed for meetings. Before the beginning of the current year, the last entry was in 2017, so the page was seriously dated! The visuals now feature current members, and there’s are brief details about officers. The webpage is the only facility that permits attachments and hyperlinks, which is why it is important that members and supporters bookmark the site and refer regularly to it.\nACTION NETWORK: Th emailing facility is used regularly, although it is disappointingly limited through a failure to allow attachments. It is now used to identify new members, although, to date, we don’t have a Membership Secretary to contact new members or prepare a Welcome Pack.\nFACEBOOK: There are now regular posts that draw attention to local, regional and national campaigns. The design of the page doesn’t allow members to post on the main page. Instead they have to post on the ‘messages’ page. Because this is not readily visible it is seriously underused by members and supporters.\nWHATSAPP: There are a regular exchanges on this page, but this is limited to around 15 members. Those wishing to participate in day-to-day discussion should send Paul Darke their mobile number and ask to be admitted (paul@digital-disability.com, 07908 263166).\nOTHER SOCIAL MEDIA: In order to restrict the number of platforms that members should refer to, there is irregular use of other platforms, such as Twitter, Instagram and Tik Tok. We are aware that older members particularly don’t use a wide range of platforms.\nDon Gwinnett\nJuly 2024",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_05_07_monthly-meeting/content_31.html": "The next meeting is next week on Tuesday. Here is the agenda\nWolverhampton Green Party Meeting Tuesday 14th May 2024. 7-9pm Tettenhall Wood Institute (TWI) http://tettenhallwoodinstitute.org/\nOpen Session to Non-members 7-8pm\nIn the absence of any agreed programme members meeting will start at 7pm. Close of open meeting.\nMembers meeting\n1. Apologies: Paul Darke,\n2. Appointment of chair for the meeting\n3. Minutes of the last meeting\n4. Coordinator’s report.\n5. Treasurer’s report\n6. 2024 Local Election: Review of results – Lessons to learn – pointers for next time 7. General Election: Campaign timetable – Tactics if snap election called\n8. 2024 AGM: Possible dates – Call for candidates for (re)election as officers\n9. AOB\nCompiled by Mike Jenkins",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_05_14_tonights-meeting-is-cancelled/content_27.html": "14th May 2024 by dongwinnett\nUnfortunately too few can attend. We will discuss whether it is better to hold more online meetings.",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_author_dongwinnett/content_13.html": "6th November 2024 / 6th November 2024 by dongwinnett\nWolverhampton Green PartyTime: Oct 28, 2024 07:00 PM London Agenda: Apologies: Don, Isabel, Jenny, Hardev, Mia, Mohammad In Attendance: Mike, Paul, Andrea, Cade Stephen Minutes: Agreed ODicer Reports (by those in attendance): Coordinator:Discussed Bilston North Campaign (See below). Treasurer:Bank Account Discussed: Treasurer will work on this over the next few months. Accounts Presented. We have £675.34 in account […]\nRead more »\nWolverhampton Green Party Meeting Monday 16th September 2024 – 7PM Tettenhall Wood Institute 5. Treasurer’s report:Limited Funds / Pay for One Leaflet for Bilston North / Seeking New Bank Account. GE Candidates – where relevant – refunded. Amendment at Oct 28 Meet.- Don – said issues using Action Network (not getting through). Needed to individual […]\n14th October 2024 / 14th October 2024 by dongwinnett\nA message from Stephen Petter: Everyone please support Hardev. I have been doorknocking for him and in my many decades i have not encountered such support for a gp cadidate. We reslly have an opportunity to secure Wolverhampton’s first Green councillor. Every vote counts. Every show on a doorstep or a leaflet can persuade a […]\n28th August 2024 / 28th August 2024 by dongwinnett\nOur thanks to Mike Jenkins who has prepared this analysis of election results, which will be used in a forthcoming meeting to plan future directions. https://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/08/GE_2024_Results_Analysis.pdf\n23rd July 2024 / 23rd July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/WGP-AGM-22-July-2024-MINUTES-1.pdf\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Q2-2024_Balance-1.pdf\n23rd July 2024 by dongwinnett\nThe accounts for last year can be found on The WGP website:https://wolverhampton.greenparty.org.uk/Our finances are simple, with only a few different income and expenditure streams. The onlyincome was from one-off and regular donations from members. The major expenditure during theperiod was in connection with the 2023 Local Election in Heathtown. At the end of the year […]\n18th July 2024 / 18th July 2024 by dongwinnett\nWEBPAGE: The webpage has been rewritten with up-to-date information and some new pages for documents, reports and information needed for meetings. Before the beginning of the current year, the last entry was in 2017, so the page was seriously dated! The visuals now feature current members, and there’s are brief details about officers. The webpage […]\n16th July 2024 / 16th July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Accounts-23.pdf\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/AGM-MINUTES-2023.pdf",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_07_16_accounts-2023-2024/content_20.html": "16th July 2024 / 16th July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Accounts-23.pdf",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_contact/content_6.html": "Skip to content\nSkip to footer\nWolverhampton\nMenu\nNews\nAbout Us\nWGP People\nElections\nConstitution\nContact Us\nJoin\nDonate\nJoin\nDonate\nMenu\nContact us\nHome\nContact us\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_07_23_accounts-balance-q2-2024/content_5.html": "23rd July 2024 / 23rd July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Q2-2024_Balance-1.pdf",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_author_dongwinnett_page_2/content_25.html": "16th July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Results_2024_LE_analysis-1.pdf\nRead more »\n16th July 2024 / 16th July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Green-Party-2024-General-Election-Manifesto-Long-version.pdf\n15th July 2024 / 16th July 2024 by dongwinnett\nZoom: https://us02web.zoom.us/j/86700502998?pwd=jZyOjmbKAz1MaOaGrgpnhaJ6jtfw05.1 Meeting ID: 867 0050 2998 Passcode: 4mNQFj AGENDA AGENDA: Apologies, 2023 Minutes, Coordinator Report, Officer Reports, Election of Officers, AOB\n10th July 2024 / 10th July 2024 by dongwinnett\nAGM 2024, 1900-2100, Monday 22nd July, Zoom log on details and agenda to follow The annual AGM will be held online. The following posts are open for election. Current post-holders, with names in brackets, are all available for re-election, but are very happy should others wish to put themselves forward: Coordinator (Paul Darke), Nominating Officer […]\n14th May 2024 by dongwinnett\nUnfortunately too few can attend. We will discuss whether it is better to hold more online meetings.\n7th May 2024 / 8th May 2024 by dongwinnett\nThe next meeting is next week on Tuesday. Here is the agenda Wolverhampton Green Party Meeting Tuesday 14th May 2024. 7-9pm Tettenhall Wood Institute (TWI) http://tettenhallwoodinstitute.org/ Open Session to Non-members 7-8pm In the absence of any agreed programme members meeting will start at 7pm. Close of open meeting.Members meeting 1. Apologies: Paul Darke,2. Appointment of chair […]\n7th April 2024 by dongwinnett\n5th April 2024 by dongwinnett\nDue to the local elections, the next monthly meeting, scheduled for Monday 29th April, has been cancelled. This creates further time for campaigning.\n3rd April 2024 by dongwinnett\n16th March 2024 / 16th March 2024 by dongwinnett\nhttps://www.theguardian.com/commentisfree/2024/mar/14/the-zone-of-interest-auschwitz-gaza-genocide?s=09 ……. To discuss this article with other Wolves Green members please join our WhatsApp page… send your mobile number to Paul Darke on paul@digital-disability.com",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_elections-2024/content_17.html": "Local Elections Analysis 2024\nPlease refer to the following websites for guidance on local elections:\nhttps://members.greenparty.org.uk/LE24\nINFORMATION ON LOCAL ELECTIONS 2024\nELECTIONS – WHAT’S NEW AND WHERE TO GET HELP\nLocal Council Elections May 2024\nIn 2024 we are going to make big strides towards our 2025 goals of getting to 900 councillors. We know that we can elect a significant number of new Greens. We want to make sure we stand candidates in every council this year so pleasejoin us in Mission Full Slate also find out about our advice on the new photographic ID requirements.\n2024 legal deadlines\nRegulated period begins on the 26th March 2024\n(the day after the latest permissible date for a council to publish the notice of election)\n| Event | Working Days before poll | Date |\n| Deadline for delivery of nominations papers | 19 days (4 pm) | 05/04/2024 |\n| Deadline for withdrawal of nomination papers | 19 days (4 pm) | 05/04/2024 |\n| Deadline for the notification of a appointment of election agent | 19 days (4 pm) | 05/04/2024 |\n| Publication of first interim election notice of alteration | 19 days (4 pm) | 05/04/2024 |\n| Publication of statement of persons nominated | Not later than 18 days (4pm) | 08/04/2024 |\n| Deadline for receiving applications for registration | 12 days | 16/04/2024 |\n| Deadline for receiving new postal vote and postal proxy applications, and for changes to existing postal or proxy votes | 11 days (5 pm) | 17/04/2024 |\n| Deadline for receiving new applications to vote by proxy (not postal proxy or emergency proxies) | 6 days (5pm) | 24/04/2024 |\n| Deadline for notification of appointment of polling and counting agents | 5 days | 25/04/2024 |\n| First date that electors can apply for a replacement for lost postal votes | 4 days | 26/04/2024 |\n| Polling day | 0 ( 7am to 10 pm) | 02/05/2024 |\n| Last time for re-issue of spoilt or lost postal votes | 0 (5 pm) | 02/05/2024 |\n| Deadline for emergency proxy vote applications | 0 (5 pm) | 02/05/2024 |\n| Deadline of return as election expenses (excluding parish councils) | No later than 35 calendar days after the date the election results is declared |\nTuesday 26th March 2024 is the earliest date (and usually the standard date) any candidate’s election expenses period can begin, i.e. the day after the earliest date anyone is legally considered a candidate (although you can call yourself a candidate sooner.\nElectoral Commission Guidance for candidates and agents:\nGuidance for Candidates and Agents at local government elections in England | Electoral Commission\nWhen do the candidate spending and donation rules apply?\nWe call the time when the spending and donation rules apply the ‘regulated period’. The regulated period for the 2024 local government elections in England begins on the day after the date you officially become a candidate and ends on polling day, 2 May 2024.\nWhen does a person officially become a candidate?\nThe earliest date you can officially become a candidate is the last date for publication of the notice of election, which will be Tuesday 26th March 2024. You will become a candidate on this date if you or others have already announced your intention to stand. For example, your party may have issued a press release when you were selected, or you might have mentioned your intention at a residents’ meeting. If your intention to stand has not been announced by 26 March 2024, you will officially become a candidate on the earlier of:\n• the date your intention to stand is announced\n• the date when you submit your nomination papers This must be prior to the close of nominations, which is 4pm on Friday 5 April 2024\nNon-Target Candidates May 2024\nThere will be many seats up for election in England. This year we are asking local parties to field a full slate of candidates. Starting earlier than usual to fill the thousands of seats in this bumper year of elections. The BIG NEWS is that the law has changed and you will only need to collect 2 signatories rather than the usual 10 for nominations. Take a look at our full briefing on non-target candidate recruitment\nIf we stand in every ward, it means more Green votes, which means more media coverage, which means more members, resources and stronger campaigns in the future.\nWhile we are not able to actively contest a seat to try to win, we still seek to give the chance for voters to vote Green. This means we need many Green members to have their name on the ballot paper; the likelihood to get elected when a seat is not actively contested is very close to zero.\nWe have some dedicated resources for you to use in your local party to help you to recruit non target candidates.\nCould you volunteer to be a non-target candidate? If so please speak to your local party officers or contact your field organiser.\nPhotographic ID and Voter ID introduced in May 2023 for England\nFrom May 2023, voters across England will be required to bring photo ID to vote in person at a polling station. A new form of identification, the Voter Authority Certificate, will be introduced as a form of ID for those who do not have another form of eligible ID.\nFind our advice here on how to ensure your Green voters know about this change.\nWe have also updated the polling day and some eve of poll templates in the literature and templates section of the website.\nSupport for your Election campaigns – Professional staff here to help\nThere is a range of very useful and extremely comprehensive guidance on running an election campaign in the ‘How to Win Local Elections’ manual and on the Elections pages of this members website.\nEach year, the Party runs Campaign School, a year-long programme to train budding campaign managers in how to run a professional election-winning campaign. Campaign School begins with a four-day residential followed by monthly coaching circles and mentoring. Campaign School has been transformational in helping secure new council seats across the country.\nThe number one resource is your regional or Wales Field Organiser, a team of professional campaign experts who can assist you to build your local party and help you put together and deliver a winning campaign plan. If you do nothing else, get in touch with your Field Organiser to plan your campaign.",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_people/content_15.html": "Skip to content\nSkip to footer\nWolverhampton\nMenu\nNews\nAbout Us\nWGP People\nElections\nConstitution\nContact Us\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nWGP People\nWGP People\nPaul Darke\n: Co-ordinator, Nominating Officer, Elections officer.\nMike Jenkins:\nTreasurer\nDon Gwinnett\n: Data and Social Media,\nTo top",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_04_05_april-meeting-cancelled/content_37.html": "Due to the local elections, the next monthly meeting, scheduled for Monday 29th April, has been cancelled. This creates further time for campaigning.\nDue to the local elections, the next monthly meeting, scheduled for Monday 29th April, has been cancelled. This creates further time for campaigning.",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_04_07_green-party-candidates-2024/content_38.html": "Skip to content\nSkip to footer\nWolverhampton\nMenu\nNews\nAbout Us\nWGP People\nElections\nConstitution\nContact Us\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nUncategorised\nGreen Party Candidates 2024\nGreen Party Candidates 2024\n7th April 2024\nby\ndongwinnett\nGreen-Party-Candidates-May-2024\nDownload\nTo top",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_03_02_next-monthly-meeting/content_29.html": "2nd March 2024 by dongwinnett\nMonday 25th March, 7:00pm, Tettenhall Wood Institute. Open meetings for all-comers,",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_category_uncategorised/content_22.html": "6th November 2024 / 6th November 2024 by dongwinnett\nWolverhampton Green PartyTime: Oct 28, 2024 07:00 PM London Agenda: Apologies: Don, Isabel, Jenny, Hardev, Mia, Mohammad In Attendance: Mike, Paul, Andrea, Cade Stephen Minutes: Agreed ODicer Reports (by those in attendance): Coordinator:Discussed Bilston North Campaign (See below). Treasurer:Bank Account Discussed: Treasurer will work on this over the next few months. Accounts Presented. We have £675.34 in account […]\nRead more »\nWolverhampton Green Party Meeting Monday 16th September 2024 – 7PM Tettenhall Wood Institute 5. Treasurer’s report:Limited Funds / Pay for One Leaflet for Bilston North / Seeking New Bank Account. GE Candidates – where relevant – refunded. Amendment at Oct 28 Meet.- Don – said issues using Action Network (not getting through). Needed to individual […]\n14th October 2024 / 14th October 2024 by dongwinnett\nA message from Stephen Petter: Everyone please support Hardev. I have been doorknocking for him and in my many decades i have not encountered such support for a gp cadidate. We reslly have an opportunity to secure Wolverhampton’s first Green councillor. Every vote counts. Every show on a doorstep or a leaflet can persuade a […]\n28th August 2024 / 28th August 2024 by dongwinnett\nOur thanks to Mike Jenkins who has prepared this analysis of election results, which will be used in a forthcoming meeting to plan future directions. https://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/08/GE_2024_Results_Analysis.pdf\n23rd July 2024 / 23rd July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/WGP-AGM-22-July-2024-MINUTES-1.pdf\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Q2-2024_Balance-1.pdf\n23rd July 2024 by dongwinnett\nThe accounts for last year can be found on The WGP website:https://wolverhampton.greenparty.org.uk/Our finances are simple, with only a few different income and expenditure streams. The onlyincome was from one-off and regular donations from members. The major expenditure during theperiod was in connection with the 2023 Local Election in Heathtown. At the end of the year […]\n18th July 2024 / 18th July 2024 by dongwinnett\nWEBPAGE: The webpage has been rewritten with up-to-date information and some new pages for documents, reports and information needed for meetings. Before the beginning of the current year, the last entry was in 2017, so the page was seriously dated! The visuals now feature current members, and there’s are brief details about officers. The webpage […]\n16th July 2024 / 16th July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Accounts-23.pdf\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/AGM-MINUTES-2023.pdf",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_07_23_treasurers-report-for-2024-agm/content_12.html": "The accounts for last year can be found on The WGP website:\nhttps://wolverhampton.greenparty.org.uk/\nOur finances are simple, with only a few different income and expenditure streams. The only\nincome was from one-off and regular donations from members. The major expenditure during the\nperiod was in connection with the 2023 Local Election in Heathtown. At the end of the year our\ntotal assets were £1574.11.\nThe most recent balance, at the end of June 2024 is £1670.24. Out of this we need to reimburse\npeople for the lost General Election deposits in Wolverhampton N.E and Wolverhampton S.E.\nwhich will leave us with about £700 once donations for July are taken into account.\nIn order to make the most of this for future campaigning it would be a good idea to capitalise on\nwhatever in currently in the media (eg Climate Change during COP29 at the end of November).\nWe still hold our money in a building society account. This is far from ideal as it requires two\nsignatories to go into branch to make withdrawals, and we can only do so in cash. Candidates or\nothers incurring expense on behalf of the party have to do so personally then be reimbursed in cash\nafterwards.\nWe applied to open a Metrobank Community account but were turned down in the end without a\nclear reason being given.\nEnquiries have been made to many other local Green Parties, some use Co-op bank. The account\ntype that they use is no longer open to new customers; its replacement requires the sort of\nregistration with an external body that charities or CIC’s have but we do not. (One did open a\nbusiness account with Co-op but would not recommend this as a way forward)",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_07_16_agm-minutes-2023/content_8.html": "16th July 2024 / 16th July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/AGM-MINUTES-2023.pdf",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_02_20_please-donate-to-wolves-green-party/content_33.html": "Dear Supporter – if you would like to make a one off donation or a recurring monthly donation please email our treasurer on: treasurer@wolverhampton.greenparty.org.uk\nThis will help us in the Local and General elections.\nDear Supporter – if you would like to make a one off donation or a recurring monthly donation please email our treasurer on: treasurer@wolverhampton.greenparty.org.uk\nThis will help us in the Local and General elections.",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_03_02_gaza-conflict/content_23.html": "Unlike other major parties, the Green Party wants an immediate ceasefire and a diplomatic solution that results in a two state solution.\nThe refusal to call for an immediate ceasefire in order to cadge more votes is immoral and has resulted in many thousands of deaths, including a majority of women and children. The Green Party will ALWAYS adopt an ethical stance that protects life above politically expedient hedging of bets.",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_07_10_agm-2024/content_36.html": "AGM 2024, 1900-2100, Monday 22nd July, Zoom log on details and agenda to follow\nThe annual AGM will be held online. The following posts are open for election. Current post-holders, with names in brackets, are all available for re-election, but are very happy should others wish to put themselves forward:\nCoordinator (Paul Darke), Nominating Officer (Paul Darke), Election Officer (Paul Darke, Treasurer (Mike Jenkins), Secretary (Hardev Singh), PPERA2 (Jenny Hibell), Digital Media (Don Gwinnett)\nNon-statutory unfilled posts include: Membership Secretary (keeping in touch with new members and developing a Welcome Pack), Newsletter (issuing a monthly or quarterly round up of news and events), Campaigns Manager (keeping members abreast of local, regional and national campaigns and leading on elections organisation).\nPlease check your spam folder if notifications don’t seem to be getting to you. This announcement will also go out via the WhatsApp group. If you aren’t a member of the WhatsApp group, please text your mobile number to Paul Darke (07908 263166).",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_11_06_28-october-minutes/content_9.html": "Wolverhampton Green Party\nTime: Oct 28, 2024 07:00 PM London\nAgenda:\nApologies: Don, Isabel, Jenny, Hardev, Mia, Mohammad\nIn Attendance: Mike, Paul, Andrea, Cade Stephen\nMinutes: Agreed\nODicer Reports (by those in attendance):\nCoordinator:\nDiscussed Bilston North Campaign (See below).\nTreasurer:\nBank Account Discussed: Treasurer will work on this over the next few months. Accounts Presented. We have £675.34 in account after lost deposits paid to candidates.\nBilston By Election Up-Date:\nHardev was congratulated on his exception work: leafleting, door knocking and Street Events (with additional thanks to Jenny and Stephen for their support.\nNote of Result (after Meeting): Green Party 3rd just behind Labour. Reform won the seat.\nResignations: Stephen Petter has resigned as Fundraiser\n3 Motions Proposed by Stephen Petter:\nAll 3 motions 2nded by members in attendance.\nMotion amendments were Proposed by Cade which were all 2nded and passed.\nMotion 1 (Text of Motion Added Below)\nAmendments Proposed by Cade were:\nAmendment One\nMotion One Section – The Plan\n1. RunalongandshortcampaignwithsupportandguidanceofourFieldteamsta]inlinewith their guidance and the guidance in “how to win local elections”.\nRenumber the following points.\nReasoning – Without reference to the Field team, or the short/long campaign structure of the wider region, we will not be able to utilise things like: national action days, regional action days, regional support (especially relevant as how close Ellie is!) and more.\nAmendment Two\nMotion One\n8 b. Get at least one leaflet to each home quarter\nC. Get at least one leaflet per week to each home in the six weeks leading up to the election, also called the short campaign.\nReasoning – With the current proposed numbers of leaflets, we will not achieve our short term goals. I spoke to Doug Rouxel, the regional elections o]icer elected this summer. He proposed the numbers in this amendment.\nMotion 2 (Text of Motion Added Below) Motion 3 ( Text of Motion Added Below)\nAll Motions, with the amendments, accepted.\nThe motions, and amendments, were passed as aspirational subject to budgetary realities (each motion would need to be fully costed and budgets made available or exist) and no appeal to members would be made until middle / late in 2025 after a fully functioning new Bank Account is up and running.\nAny Other Business:\nCade said, via email, that they would like to o]er their services for leaflets having made at least one before and happy to continue designing stu] if that would be helpful.\nDate of Next Meeting: Monday 27th January 2025 Where: ONLINE – ZOOM – Info sent out prior to meeting.\nMOTION 1 – Campaigning\nThat WGP accepts the following strategy and outline plan as a basis for campaigning:\nStrategy in the short term: to get one GP Councillor, in the medium term to get at least three GP councillors;\nThe long-term strategy is to have the Council dominated by the GP and to have three GP MPs.\nThe method should be first to get human and financial resources and to target a ward then later more than one ward.\nWhether to target one of our constituencies would be a decision of the national GP.\nThe Plan (not necessarily in chronological order)\n1. Persuade all members to donate additional funds an Elections Fighting Fund;\n2. Persuade all members to o]er at least a small amount of time to election campaigning;\n3. Recruit Supporters (?Associate members?) to pledge time to WGP.\n4. Seek funds from other sources\n5. Select one target ward, then concentrate maximum resources to it.\n6. Have paper candidates in all other wards\n7. Accept that the national GP wants us to have a candidate in every constituency at each general election or bye-election. This implies depositing £500 per constituency.\n8. In the Target Ward:\na. Canvass every home at least once each year, and also in the 3 months prior to a local election. The aim of canvassing is 1. to ask people what are their concerns, 2. to ascertain and record who may vote for us, 3 to recruit members and supporters, 4 to identify who will display posters at election time.\nb. Get at least one leaflet to each home each year\nc. Get at least two leaflets to each home during a local election campaign. (An “election campaign” is usually the six weeks prior to an election.)\nd. Get as many posters as possible displayed during each election campaign.\ne. On election days have tellers at each polling station, initially only to be a friendly, helpful presence, eventually to support “knocking up”.\nf. To support this plan with social media and general advertising, social events, fund-raising events, and regular monthly members’ meetings.\n9. General Elections\nSelect a target constituency. Select candidate for each constituency\nDevote resources to the target constituency (including the required deposit) but not to endanger resources needed for local elections.\nMake use of the free postage to get a leaflet to every home in each constituency.\nOtherwise devote minimal resources for the non-target constituencies.\nMOTION 2 – WGP Motion re Election Fighting Fund\nWe agree:\n1. we need an elections fighting fund (EFF) 2. its income shall be:\n(I) donations from members and others,\n(ii) returned general election deposits including the recent one, and (iii) if necessary from WGP general funds;\n3. members and others should be encouraged to use monthly bankers’ standing orders\n4. the EFF shall be used only for election expenses including general election deposits;\n5. its income, out payments and current balance shall be included in our Treasurer’s regular reports.\n6. We agree that our Fundraising o]icer drafts and issues an appeal message to: (i) all members\n(ii) all known supporters;\n7. We ask our Communications O]icer together with our Membership O]icer to distribute the appeal. 8. We ask our Treasurer to provide a suitable Standing Order form to the above o]icers.\n9. We agree that our current Building Society account be used by the EFF until a better facility is available.\nDRAFT APPEAL MESSAGE\nTo members and supporters of Wolverhampton Green Party.\nTo win elections we need a Fighting Fund.\nThe Tory Party rely on big business and the Wealthy Few, while the Labour Party rely on the Trades Unions. We in the Green Party can rely only on ourselves.\nI appeal to everyone who is in work to donate an hour’s pay every month.\nI appeal to all others to donate £3 to £5 a month. Or consider donating 1% of your income.\nTo make donations to Wolverhampton Green Party contact our Treasurer, Mike Jenkins (treasurer@wolverhampton.greenparty.org.uk) who will be able to make the necessary arrangements. It will be helpful if you could let him know:\nl Is this a one-o] or recurring donation?\nl How you would like to pay?(eg Bank Transfer, Standing Order, Cheque etc) l Is the donation from you as an individual or a business?\nl For legal reasons please do not donate anonymously\nl The most convenient payment method is by Banker’s Standing Order.\nMOTION 3 – WGP Constitution\n1. NotingthatthecurrentConstitutionofWGPisinadequate,duetoinconsistenciesandambiguities (I) we agree to adopt the model constitution for local Green Parties which is recommended by the national Green Party.\n(ii) We direct that the model be amended as little as possible.\n(iii) We ask [member name]\nto customise the model constitution and to submit the amended version to to a future Extraordinary General Meeting for acceptance.\n2. Noting the model constitution prescribes appointment of an Executive Committee\nEITHER\n(i) we agree that we do not want to have an executive committee OR\n(ii) we agree that the Executive Committee should consist of the Co-ordinator and the Treasurer ex o]icio and (?two?) other other members OR\n(iii) we agree that the Executive Committee should consist of all WGP’ s elected o]icers.",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_constitution/content_19.html": "Skip to content\nSkip to footer\nWolverhampton\nMenu\nNews\nAbout Us\nWGP People\nElections\nConstitution\nContact Us\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nConstitution\nConstitution\nConstitution2017-1\nDownload\nTo top",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_03_16_1194/content_35.html": "…….\nTo discuss this article with other Wolves Green members please join our WhatsApp page… send your mobile number to Paul Darke on paul@digital-disability.com\n…….\nTo discuss this article with other Wolves Green members please join our WhatsApp page… send your mobile number to Paul Darke on paul@digital-disability.com",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_08_28_general-election-2024-results-analysis/content_7.html": "Our thanks to Mike Jenkins who has prepared this analysis of election results, which will be used in a forthcoming meeting to plan future directions.\nOur thanks to Mike Jenkins who has prepared this analysis of election results, which will be used in a forthcoming meeting to plan future directions.",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_07_15_agm-22nd-july-1900/content_34.html": "Zoom: https://us02web.zoom.us/j/86700502998?pwd=jZyOjmbKAz1MaOaGrgpnhaJ6jtfw05.1\nMeeting ID: 867 0050 2998\nPasscode: 4mNQFj\nAGENDA\nAGENDA: Apologies, 2023 Minutes, Coordinator Report, Officer Reports, Election of Officers, AOB\nZoom: https://us02web.zoom.us/j/86700502998?pwd=jZyOjmbKAz1MaOaGrgpnhaJ6jtfw05.1\nMeeting ID: 867 0050 2998\nPasscode: 4mNQFj\nAGENDA\nAGENDA: Apologies, 2023 Minutes, Coordinator Report, Officer Reports, Election of Officers, AOB",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_about-us/content_11.html": "Hello!\nWelcome to Wolverhampton Green Party. We are currently working to elect our first Green Councillors to add that much-needed voice to the Council chamber to address the critical issues that the other parties are not prioritising.\nWe work on local issues; to improve the lives of all people in the City, and to improve our local environment. As part of the Green Party of England & Wales, we share a deep concern for social and environmental justice, expressed through our national policies. We believe fair is worth fighting for.\nWe rely on people power rather than corporate finance to get things done. Get involved with us today so that we can achieve so much more for Wolverhampton.\nWe’re ordinary Wolverhampton people just like you.\nYou can join the Green Party – go to join.greenparty.org.uk – or you can be a Wolverhampton Green Party Supporter. Supporters pay no membership fees. They simply offer to help the GP very occasionally, for only an hour or two.\nIf interested in being a Supporter, please contact our Co-ordinator, Paul Darke, (paul@digital-disability.com).\nThe Green Party Political Programme sets out what Greens are in politics to do: to end the system that keeps hurting the environment and all of us who rely on it – and to build a better alternative.\nThis Programme isn’t like other parties’ manifestos, it has not been squeezed through focus groups and stripped down according to the latest polling. Instead it has been built from policies proposed and voted on by our members, looking to secure the long term future of the places and people they love.\nIt’s a vision of a better world, and together we can deliver it.",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_news_page_3/content_21.html": "Agenda and Minutes Download 7th March 2024 / 7th March 2024 by dongwinnett To read or download recent agenda, minutes or reports, please click the documents tab and select the file you want. Read more »\nGAZA CONFLICT 2nd March 2024 by dongwinnett Unlike other major parties, the Green Party wants an immediate ceasefire and a diplomatic solution that results in a two state solution. The refusal to call for an immediate ceasefire in order to cadge more votes is immoral and has resulted in many thousands of deaths, including a majority of women and children. The Green […] Read more »\nNEXT MONTHLY MEETING 2nd March 2024 by dongwinnett Monday 25th March, 7:00pm, Tettenhall Wood Institute. Open meetings for all-comers, Read more »\nPlease donate to Wolves Green Party 20th February 2024 / 20th February 2024 by dongwinnett Dear Supporter – if you would like to make a one off donation or a recurring monthly donation please email our treasurer on: treasurer@wolverhampton.greenparty.org.uk This will help us in the Local and General elections. Read more »",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_11_06_minutes-16-september-2024/content_3.html": "Wolverhampton Green Party Meeting Monday 16th September 2024 – 7PM Tettenhall Wood Institute\n- 1 Apologies: Mia / Andrea / Jenny / Andrea / Don / Mohammad / Stephen\n- 2 In Attendance:\nPaul Darke / Hardev / Naveen / Kquqoo /Joy Peti-Gittos / Mike Karl – Regional OPicer – On-line - 3 The last meeting was inquorate, so there are no minutes.\n- 4 Coordinator’s report: Brief Discussion on Bilston By-Election Process: Election Date is 31st October 2024.\n5. Treasurer’s report:\nLimited Funds / Pay for One Leaflet for Bilston North / Seeking New Bank Account. GE Candidates – where relevant – refunded.\nAmendment at Oct 28 Meet.- Don – said issues using Action Network (not getting through). Needed to individual emails. Issue aPecting ‘appeals’ – referred back to one physical mailout. Please look in Spam Folder – request. Asked Don – Pending.\n- 6 2024 Local Election: Analysis of results – Mike Jenkins (See website).\n- 7 Bilston North by-election planning – Hardev Singh – Leaflets and Dorr Knocking Training Days – Paid for by Party for HS & MN.\n8. Digital Media report: No Report due to Illness. Agreed need to Crack Facebook Ads Procedure.\n- Fundraising and Membership: No OPicer in Attendance – No Report Agreed that Stephen Petter request to send letter to all Members was not feasible now as we have no Bank Account. We need a Fundraiser (Since Meeting Stephen Petter has resigned as Fundraiser)\n- Format of future meetings: Winter Meetings On-line as more attend (hopefully)\n- AOB: Joy Peti-Gittos on Winter Fuel Allowance and how it is wrong (all agreed). Felt should use Tax Code on those pensioners on 40% Tax Band. Agreed\n- Date of next meeting: Monday 28th October – On-line (Zoom Link Sent)\nCompiled by Paul Darke",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_03_07_agenda-and-minutes/content_30.html": "7th March 2024 / 7th March 2024 by dongwinnett\nTo read or download recent agenda, minutes or reports, please click the documents tab and select the file you want.",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk/content_1.html": "Wolverhampton Green PartyTime: Oct 28, 2024 07:00 PM London Agenda: Apologies: Don, Isabel, Jenny, Hardev, Mia, Mohammad In Attendance: Mike, Paul, Andrea, Cade Stephen Minutes: Agreed ODicer Reports (by those in attendance): Coordinator:Discussed Bilston North Campaign (See below). Treasurer:Bank Account Discussed: Treasurer will work on this over the next few months. Accounts Presented. We have £675.34 in account… Read more: 28 October Minutes\nWolverhampton Green Party Meeting Monday 16th September 2024 – 7PM Tettenhall Wood Institute 5. Treasurer’s report:Limited Funds / Pay for One Leaflet for Bilston North / Seeking New Bank Account. GE Candidates – where relevant – refunded. Amendment at Oct 28 Meet.- Don – said issues using Action Network (not getting through). Needed to individual… Read more: Minutes 16 September 2024\nA message from Stephen Petter: Everyone please support Hardev. I have been doorknocking for him and in my many decades i have not encountered such support for a gp cadidate. We reslly have an opportunity to secure Wolverhampton’s first Green councillor. Every vote counts. Every show on a doorstep or a leaflet can persuade a… Read more: Please support Hardev:\nOur thanks to Mike Jenkins who has prepared this analysis of election results, which will be used in a forthcoming meeting to plan future directions. https://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/08/GE_2024_Results_Analysis.pdf\nIf you care about the city and its communities, if you care about the climate crisis, if you care about the future, then the Green Party is for you.\nIn the recent elections, we have been increasing our number of votes and our vote share.\nThe Green Party has always dared to be different – and we’ve always known the power of good ideas.\nWe know that our planet has environmental limits, we understand that quality of life matters to everyone, that inequality is not just unfair, but damaging to all. And we have the bold solutions which allow us to offer inspiration in this age of uncertainty",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_07_23_agm-minutes-july-22nd-2024/content_2.html": "23rd July 2024 / 23rd July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/WGP-AGM-22-July-2024-MINUTES-1.pdf",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_author_dongwinnett_page_3/content_32.html": "7th March 2024 / 7th March 2024 by dongwinnett\nTo read or download recent agenda, minutes or reports, please click the documents tab and select the file you want.\nRead more »\n2nd March 2024 by dongwinnett\nUnlike other major parties, the Green Party wants an immediate ceasefire and a diplomatic solution that results in a two state solution. The refusal to call for an immediate ceasefire in order to cadge more votes is immoral and has resulted in many thousands of deaths, including a majority of women and children. The Green […]\nMonday 25th March, 7:00pm, Tettenhall Wood Institute. Open meetings for all-comers,\n20th February 2024 / 20th February 2024 by dongwinnett\nDear Supporter – if you would like to make a one off donation or a recurring monthly donation please email our treasurer on: treasurer@wolverhampton.greenparty.org.uk This will help us in the Local and General elections.",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_news_page_2/content_24.html": "Local Elections 2024 Analysis 16th July 2024 by dongwinnett https://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Results_2024_LE_analysis-1.pdf Read more »\nGreen Party Manifesto 16th July 2024 / 16th July 2024 by dongwinnett https://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Green-Party-2024-General-Election-Manifesto-Long-version.pdf Read more »\nAGM 22nd JULY, 1900. 15th July 2024 / 16th July 2024 by dongwinnett Zoom: https://us02web.zoom.us/j/86700502998?pwd=jZyOjmbKAz1MaOaGrgpnhaJ6jtfw05.1 Meeting ID: 867 0050 2998 Passcode: 4mNQFj AGENDA AGENDA: Apologies, 2023 Minutes, Coordinator Report, Officer Reports, Election of Officers, AOB Read more »\nAGM 2024 10th July 2024 / 10th July 2024 by dongwinnett AGM 2024, 1900-2100, Monday 22nd July, Zoom log on details and agenda to follow The annual AGM will be held online. The following posts are open for election. Current post-holders, with names in brackets, are all available for re-election, but are very happy should others wish to put themselves forward: Coordinator (Paul Darke), Nominating Officer […] Read more »\nTonight’s Meeting is cancelled 14th May 2024 by dongwinnett Unfortunately too few can attend. We will discuss whether it is better to hold more online meetings. Read more »\nMonthly Meeting 7th May 2024 / 8th May 2024 by dongwinnett The next meeting is next week on Tuesday. Here is the agenda Wolverhampton Green Party Meeting Tuesday 14th May 2024. 7-9pm Tettenhall Wood Institute (TWI) http://tettenhallwoodinstitute.org/ Open Session to Non-members 7-8pm In the absence of any agreed programme members meeting will start at 7pm. Close of open meeting.Members meeting 1. Apologies: Paul Darke,2. Appointment of chair […] Read more »\nApril Meeting cancelled 5th April 2024 by dongwinnett Due to the local elections, the next monthly meeting, scheduled for Monday 29th April, has been cancelled. This creates further time for campaigning. Read more »\nImportant article 16th March 2024 / 16th March 2024 by dongwinnett https://www.theguardian.com/commentisfree/2024/mar/14/the-zone-of-interest-auschwitz-gaza-genocide?s=09 ……. To discuss this article with other Wolves Green members please join our WhatsApp page… send your mobile number to Paul Darke on paul@digital-disability.com Read more »",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_category_uncategorised_page_2/content_26.html": "16th July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Results_2024_LE_analysis-1.pdf\nRead more »\n16th July 2024 / 16th July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Green-Party-2024-General-Election-Manifesto-Long-version.pdf\n15th July 2024 / 16th July 2024 by dongwinnett\nZoom: https://us02web.zoom.us/j/86700502998?pwd=jZyOjmbKAz1MaOaGrgpnhaJ6jtfw05.1 Meeting ID: 867 0050 2998 Passcode: 4mNQFj AGENDA AGENDA: Apologies, 2023 Minutes, Coordinator Report, Officer Reports, Election of Officers, AOB\n10th July 2024 / 10th July 2024 by dongwinnett\nAGM 2024, 1900-2100, Monday 22nd July, Zoom log on details and agenda to follow The annual AGM will be held online. The following posts are open for election. Current post-holders, with names in brackets, are all available for re-election, but are very happy should others wish to put themselves forward: Coordinator (Paul Darke), Nominating Officer […]\n14th May 2024 by dongwinnett\nUnfortunately too few can attend. We will discuss whether it is better to hold more online meetings.\n7th May 2024 / 8th May 2024 by dongwinnett\nThe next meeting is next week on Tuesday. Here is the agenda Wolverhampton Green Party Meeting Tuesday 14th May 2024. 7-9pm Tettenhall Wood Institute (TWI) http://tettenhallwoodinstitute.org/ Open Session to Non-members 7-8pm In the absence of any agreed programme members meeting will start at 7pm. Close of open meeting.Members meeting 1. Apologies: Paul Darke,2. Appointment of chair […]\n7th April 2024 by dongwinnett\n5th April 2024 by dongwinnett\nDue to the local elections, the next monthly meeting, scheduled for Monday 29th April, has been cancelled. This creates further time for campaigning.\n3rd April 2024 by dongwinnett\n16th March 2024 / 16th March 2024 by dongwinnett\nhttps://www.theguardian.com/commentisfree/2024/mar/14/the-zone-of-interest-auschwitz-gaza-genocide?s=09 ……. To discuss this article with other Wolves Green members please join our WhatsApp page… send your mobile number to Paul Darke on paul@digital-disability.com",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_news/content_4.html": "28 October Minutes 6th November 2024 / 6th November 2024 by dongwinnett Wolverhampton Green PartyTime: Oct 28, 2024 07:00 PM London Agenda: Apologies: Don, Isabel, Jenny, Hardev, Mia, Mohammad In Attendance: Mike, Paul, Andrea, Cade Stephen Minutes: Agreed ODicer Reports (by those in attendance): Coordinator:Discussed Bilston North Campaign (See below). Treasurer:Bank Account Discussed: Treasurer will work on this over the next few months. Accounts Presented. We have £675.34 in account […] Read more »\nMinutes 16 September 2024 6th November 2024 / 6th November 2024 by dongwinnett Wolverhampton Green Party Meeting Monday 16th September 2024 – 7PM Tettenhall Wood Institute 5. Treasurer’s report:Limited Funds / Pay for One Leaflet for Bilston North / Seeking New Bank Account. GE Candidates – where relevant – refunded. Amendment at Oct 28 Meet.- Don – said issues using Action Network (not getting through). Needed to individual […] Read more »\nPlease support Hardev: 14th October 2024 / 14th October 2024 by dongwinnett A message from Stephen Petter: Everyone please support Hardev. I have been doorknocking for him and in my many decades i have not encountered such support for a gp cadidate. We reslly have an opportunity to secure Wolverhampton’s first Green councillor. Every vote counts. Every show on a doorstep or a leaflet can persuade a […] Read more »\nGeneral Election 2024 Results Analysis 28th August 2024 / 28th August 2024 by dongwinnett Our thanks to Mike Jenkins who has prepared this analysis of election results, which will be used in a forthcoming meeting to plan future directions. https://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/08/GE_2024_Results_Analysis.pdf Read more »\nAGM Minutes, July 22nd 2024 23rd July 2024 / 23rd July 2024 by dongwinnett https://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/WGP-AGM-22-July-2024-MINUTES-1.pdf Read more »\nAccounts: Balance Q2 2024 23rd July 2024 / 23rd July 2024 by dongwinnett https://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Q2-2024_Balance-1.pdf Read more »\nTreasurer’s Report for 2024 AGM 23rd July 2024 by dongwinnett The accounts for last year can be found on The WGP website:https://wolverhampton.greenparty.org.uk/Our finances are simple, with only a few different income and expenditure streams. The onlyincome was from one-off and regular donations from members. The major expenditure during theperiod was in connection with the 2023 Local Election in Heathtown. At the end of the year […] Read more »\nDIGITAL MEDIA REPORT, AGM 2024 18th July 2024 / 18th July 2024 by dongwinnett WEBPAGE: The webpage has been rewritten with up-to-date information and some new pages for documents, reports and information needed for meetings. Before the beginning of the current year, the last entry was in 2017, so the page was seriously dated! The visuals now feature current members, and there’s are brief details about officers. The webpage […] Read more »\nACCOUNTS 2023-2024 16th July 2024 / 16th July 2024 by dongwinnett https://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Accounts-23.pdf Read more »\nAGM Minutes 2023 16th July 2024 / 16th July 2024 by dongwinnett https://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/AGM-MINUTES-2023.pdf Read more »",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_10_14_please-support-hardev/content_18.html": "A message from Stephen Petter: Everyone please support Hardev. I have been doorknocking for him and in my many decades i have not encountered such support for a gp cadidate. We reslly have an opportunity to secure Wolverhampton’s first Green councillor. Every vote counts. Every show on a doorstep or a leaflet can persuade a voter to vote Green. “NOW is the time for all good greens to come to the aid of the Party”.",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_2024_07_16_green-party-manifesto-2/content_14.html": "16th July 2024 / 16th July 2024 by dongwinnett\nhttps://wolverhampton.greenparty.org.uk/wp-content/uploads/sites/50/2024/07/Green-Party-2024-General-Election-Manifesto-Long-version.pdf",
  "https_wolverhampton_greenparty_org_uk_/https_wolverhampton_greenparty_org_uk_category_uncategorised_page_3/content_28.html": "7th March 2024 / 7th March 2024 by dongwinnett\nTo read or download recent agenda, minutes or reports, please click the documents tab and select the file you want.\nRead more »\n2nd March 2024 by dongwinnett\nUnlike other major parties, the Green Party wants an immediate ceasefire and a diplomatic solution that results in a two state solution. The refusal to call for an immediate ceasefire in order to cadge more votes is immoral and has resulted in many thousands of deaths, including a majority of women and children. The Green […]\nMonday 25th March, 7:00pm, Tettenhall Wood Institute. Open meetings for all-comers,\n20th February 2024 / 20th February 2024 by dongwinnett\nDear Supporter – if you would like to make a one off donation or a recurring monthly donation please email our treasurer on: treasurer@wolverhampton.greenparty.org.uk This will help us in the Local and General elections."
}