{
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_tag_schoolcuts/content_59.html": "Anthony Slaughter – School Cuts, High Streets and Coastal Communities 27th April 2019 / 19th March 2024 by harrietking Read more » anthonyslaughter climate crisis coastal community highstreet schoolcuts",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2024_03_26_general-elections-candidates-selected/content_29.html": "In this election everyone in North West Wales will be given a chance to vote Green.\nWe are standing candidates across all our constituencies including Ynys Mon, Dwyfor Meirionnydd and Bangor Aberconwy and Clwyd North.\nYou will have an opportunity to hear more about the General Election candidate and be able to ask them questions over the coming months. In the meantime, you can read more about them online here.\nWe’d like to congratulate all our candidates, Martin Schwaller, Petra Haig, Karl Drinkwater and Martyn Hogg and thank everyone involved in the Election Campaign so far.\nNow we need to ensure that the people and communities across Wales get the chance to hear the difference a Green can make across our magnificent land.\nIf you would like to help get Greens elected in North West Wales then please email us on contact@northwest.greenparty.wales\nOur next meeting is on the 2nd of April if you want to discuss anything with the committee.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_10_08_were-back-from-conference/content_24.html": "This year’s England and Wales Conference was in Newport and 3 members from our group attended over the weekend. Conference is a great opportunity to be involved in policy making where you support or oppose motions and really define how you want your political party to be.\nAs well plenary you can talk part in discussion groups and workshops such as the Disability Group, Drug Policy and Reform, Greens of Colour, Green Women, Green Councillors Association, LGBTIQA, Young Greens and Wildlife and Habitats working group to name a few.\nOr spend your time listening to talks on items such as Citizens Basic Income, Well Being of The Future of Wales Act, The Vegan Society and Greens for Animal Rights.\nYou get to meet other Greens from around the country and meet likeminded people.\nWales Green Party also hold a conference and this is will be on the 2nd and 3rd of November at the YMCA in Swansea.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2023_07_28_wales-green-party-leader-visits-dyffryn-arduwdy/content_60.html": "We’d like to say a big ‘diolch o galon’ to Anthony Slaughter – Wales Green Party Leader for coming to northwest Wales this weekend. We had such an inspiring day of activism yesterday, including a beach clean, tree planting and meeting with local residents in Dyffryn Arduwdy and Llanbedr.\nWe visited a community land project where people are tackling both the cost of living crisis and the loneliness crisis by creating a food production hub which works in harmony with nature.\nMartin Schwaller, our general election candidate for Ynys Môn, joined us for our beach clean to discuss the importance of the marine environment to islanders, and how the Green Party would lead on delivering green jobs.\nWe then spoke to residents in Llanbedr to hear about how they’re being let down by both the Welsh Government and Gwynedd Council on traffic issues. It’s clear that the Welsh Government needs to follow its Roads Review by providing better public transport and walking and cycling infrastructure.\nToday, we’re heading to Barmouth to discuss what sustainable tourism could look like in North Wales. Thank you to everyone who’s joined us.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_04_27_agm-photos/content_37.html": "Our AGM on 7th of April was a great day with plenty to watch and take part in discussion.\nHarriet gave a presentation on local politics and the differences between Town and County Councillors, AM’s and MP’s as well as devolved issues that a governed by Wales.\nWe also had videos from Alex Harris Town Councillor in the Seven Valleys, as well as Sian Berry, Rosie and Maggie from the Solihull Green Party\nDawn gave a very interesting talk at the AGM about the Hidden Carers in Wales.\nEach day 600 people give up work to become a full-time carer often these carers often go unnoticed, unsupported and unpaid.\nThese unpaid heroes are saving the NHS in Wales 8.1 billion pounds per year\nIf you are a carer or if you know of someone who is a carer please pass on the link. As Carers Wales would like to hear from you.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_08_11_bryn-cocyn-organic-farm-visit/content_36.html": "We’ve had a great day visiting Bryn Cocyn Organic Farm just outside Denbigh. We met in the garden where the smell of Lavender filled the air and the sound and sights of honey bees, bumble bees and various butterflies around us.\nWe explored the polytunnel, vegetable plots and Orchard, Saw the apple press where they make delicious apple juice as well as paying a visit to the 2 different breeds of sheep and their Welsh Black cattle.\nThey have there own wind turbine and solar panels on the farm too reducing their carbon footprint. We also disucssed how climate change is affecting how they grow the vegetables in a shorter growing period.\nPlease enjoy the photos taken below and thank you to Joyce and Patrick for taking the time to show us around your farm.\nYou can read about the Green Partys farming policies here\nYou can read more about the farm on the link below",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2023_12_21_elections-officer-needed/content_73.html": "A vacancy has arisen for an Elections Officer just as we are about to start our General Election campaign next year which is a great time to get involved. Support for the Green Party is getting stronger each year and with your help, we can help make a stronger presence here in North Wales.\nThe main responsibility of an Elections Officer is to\n* Help candidates navigate electoral requirements.\n* Take the lead in screening candidates.\n* Responsible for internal elections.\nThe role requires a person dedicated to the progress of the party and prepared to devote some time towards supporting the ambitions of other people. It is a selfless role and requires tenacity, attention to detail and knowledge of relevant legislation.\nIf you like the sound of this role and would like more information please let us know",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_07_02_denbighshire-county-council-declare-a-climate-emergency/content_70.html": "Today Denbighshire County Council has declared a Climate Emergency – exciting news for the future of the county and a critical step forward to securing a sustainable Wales.\nHaving now adopted a policy of being carbon neutral by 2030 – hopefully sooner – the Council can now work extensively towards this target. From using weed killers to implementing planning policies, this declaration will affect every decision the council makes going forward.\nOur new Green Town Councillor Rachael Ayres, who represents the Upper ward in Denbigh said, This is fantastic news for Denbigh and the county. She is really looking forward being involved and helping to make any positive changes.\nHaving campaigned for the declaration of a climate emergency in a succesful protest organised by Extinction Rebellion at Saturday’s Ruthin Festival the North West Wales Green Party will continue to pressure Denbighshire County Council and make sure it acts upon today’s declaration. If you would like to join us at this exciting time – and maybe even volunteer or stand as a Councillor in Denbighshire – please contact us at northwestwales@walesgreenparty.com.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2022_10_25_new-committee-following-agm/content_43.html": "It’s been nearly a week since the AGM and we are still in awe of Dani Robertson’s talk on Dark Skies in Snowdonia! It really was a fascinating talk full of facts such as only 2% of the UK is classed as a Dark Sky Area, what we can do to improve lighting, how artificial lights affect our health and finally how we as a political party can make a difference.\nMore information can be found on https://www.discoveryinthedark.wales/project-nos\nWe were joined by Anthony Slaughter Leader of the Wales Green Party where he expressed his happiness of the North Wales candidates who won in the local elections and questions were put to him with regards to the Plaid Green alliance and how this would affect Nuclear Power on Ynys Mon.\nTo confirm the Green Party does not support Nuclear Power.\nFollowing on from the talks we elected a new committee with the following rolesChair – Harriet King\nSecretary – Iain Moore\nTreasurer – James Woodcock\nElections Officer – Iain Moore\nMedia Officer – Adam Turner & Harriet King\nCongratulations to those elected!",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2024_02_05_menai-bridge-agm-with-sian-sykes-sas-anthony-slaughter-wgp-leader/content_78.html": "The AGM in Menai Bridge was a great success even if we say so ourselves.\nIt was also the launch of our General Election candidate for Ynys Mon – Martin Schwaller. Both Martin & Anthony took questions from the attendees on various topics from Agriculture Policies to Child poverty rates on the Island and of course, what can be done to help the Palestinian people.\nOur second guest speaker was Sian Skyes who paddled around the UK in 2018 highlighting the plight of litter on our water ways.\nSian talked us through her adventure, and shared stories, videos and pictures of her trip. We were shocked by how much litter Sian was collecting and the impact it was having on the eco systems.\nHer gear was made as environmentally friendly as possible even down to the food she ate!\nWe all thoroughly enjoyed Sians talk and would highly recommend going to see one and hopefully, we’ll have her back in the future.\nWho knows even a Greenparty Paddleboarding Litterpick could be arranged!\nExcerpt from Anthony Speach “The Welsh writer and thinker Raymond William famously Said,\n‘To be truly radical is to make hope possible rather than despair convincing’\nAnd that is what we do as Greens. Our radical vision of a better future offers real hope to communities at a time when other major parties are most comfortable tinkering around the edges of a broken status quo”\nIndependence was also a key part of the meeting. The Green Party believes in an indepedenant wales however as Anthony said in his speech\n“Independence is meaningless if people can’t afford safe, secure and warm homes\nIndependence is meaningless without radical reform of institutionally racist public bodies\nIndependence is meaningless if society continues to tolerate transphobia. homophobia and all forms of bigotry.\nAs Greens, we know that independence is meaningless without climate justice, social justice, economic justice and racial justice”\nThe Local Party Chair Report stated that we have 172 members in North West Wales currently and thanked the current committee for all their hard work they have put in over the last year.\nHarriet went onto say\n“I am sure that the new committee elected today and the volunteers we have will help continue in making these small but necessary steps to a Greener, independent Wales!”\nShe also stressed the need for more volunteers to help run the local party, fresh people and energy are needed. If anyone would like to volunteer than please get in contact via email contact@northwest.greenparty.wales\nThere is a record of the AGM available online if anyone couldn’t attend on the day",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_tag_community/content_35.html": "Anthony Slaughter – School Cuts, High Streets and Coastal Communities 27th April 2019 / 19th March 2024 by harrietking Read more » anthonyslaughter climate crisis coastal community highstreet schoolcuts",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_brexit/content_48.html": "Brexit\n9th September 2019 / 19th March 2024 by harrietking\nThs Sunday Harriet spoke at the DenbighshireForEurope rally in Ruthin, along with other party representaves from the Lib Dems, Plaid and Labour. She spoke about how Citizens Assembleys can bring a local voice to Westminster so that views from all parts the local community can be heard and belives these are the way forward to […]\nRead more »\n26th June 2019 / 19th March 2024 by harrietking\nThe North West Wales Green Party will be taking part in the launch for Denbighshire For Europe a grass roots cross-party and no-party campaign organisation supporting Wales to remain in Europe. The launch is in Denbigh in the Eiranfa Centre starting at 7pm on the 5th of July. The Green Party have campaiged for a […]",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_news_page_5/content_42.html": "Community Shed Llanfairfechan 27th April 2019 / 19th March 2024 by harrietking Space to get away from it all, to create, to socialize, to learn new skills, to pass on crafts. These are the objectives of the Llanfairfechan community shed, a new group in the village aiming to bring people together over practical projects. At the heart of our ambition is acting in kind; that is, sharing […] Read more »\nHello world! 14th March 2019 by Green Party Admin Welcome to Green Party WordPress Sites. This is your first post. Edit or delete it, then start blogging! Read more »",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_anglesey/content_93.html": "6th February 2024 / 29th March 2024 by harrietking\nThe day following our AGM in Menai Bridge a large group of us were pleased to be hosted by Menter Môn. In particular we were there to see the Anglesey Morlais Tidal Energy project that Menter Môn are bringing to fruition. The project, near Ynys Lawd (South Stack) is a fine example of a very […]\nRead more »",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_local-elections/content_85.html": "14th April 2022 / 29th March 2024 by harrietking\nThis May 5th you can vote for the largest amount of Green candidates in North West Wales! We are standing all across from Ruthin to Anglesey. If you would like to get involved in our campaign, contact us now! ————————————————————————- Ar y 5ed o Fai yma gallwch bleidleisio dros y nifer fwyaf o ymgeiswyr Gwyrdd […]\nRead more »",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_conwy/content_71.html": "13th October 2019 / 19th March 2024 by harrietking\nThis Saturday we along with volunteers cleaned 150kg of waste from the Dingle in Colwyn Bay. This beautiful little stream which runs through the centre of Colwyn Bay was full of plastic as well as a shopping trolley and sadly syringes. By cleaning the Dingle we have saved waste from entering the Bay and then […]\nRead more »\n21st September 2019 / 19th March 2024 by harrietking\nYesterday on the 20th of September we joined the school children of Colwyn Bay and Bangor at the Global Climate Strike. In Colwyn Bay Adam our Campaigns Officer gave a rabel rousing speech about the change needed to protect our planet and humanity. It was such an inspiration watching the Children defend their future, and […]\n9th September 2019 / 19th March 2024 by harrietking\nOn the 31st of August Denbighshire For Europe organised a Stand Up For Democracy Protest in Colwyn Bay where Chris Hemming of our committee members discussed how what Boris Johnson attempting to prolouge parliament was a disgrace to democracy. Here are some photos from the day.\n6th July 2019 / 19th March 2024 by harrietking\nLlanfairfechan now has 6 water re-fill stations thanks to Iolo Jones their Town Councillor. Iolo has been asking business in the area to allow people to refill their water bottles for free to help reduce plastic waste in the community. Each business has a sign on display in the window to let you know they […]\n11th May 2019 / 19th March 2024 by harrietking\nExtinction Rebellion March Conwy We joined Extinction Rebellion North Wales in Conwy to show support for Conwy Council to declare a climate emergency. Here are the some photos from the march",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_petra-haig-aberconwy/content_1.html": "Cwrdd â Petra – Ymgeisydd Seneddol dros Aberconwy\nRwyf wedi byw a bod yn gysylltiedig â fy nghymuned leol yn Neganwy, Conwy, ers dros 15 mlynedd, gan weithio ym Mae Colwyn am ddegawd olaf gyrfa nyrsio 35 mlynedd. Ar ôl i mi ymddeol yn 2017, ymunais â fy ngŵr yn rhedeg ein hysgol hwylio ein hunain yn seiliedig ar Afon Conwy. Teimlaf ei bod yn hollbwysig i ddemocratiaeth fod ymgeisydd y Blaid Werdd ar y papur pleidleisio, er mwyn i bawb allu mynegi eu cefnogaeth i warchod ein hamgylchedd a’n cymdeithas. Drwy bleidleisio Gwyrdd mae gennych gyfle i herio’r prif bleidiau, herio strwythur economaidd ffug a methiadol ein system brynwriaethol bresennol a herio y toriadau cyson i gyllid lleol.\nMae’r Blaid Werdd yn gosod pobl, nid elw, wrth galon ein strategaeth economaidd, yn sefyll dros ddyfodol ein pobl ifanc ac yn creu cymunedau lleol gofalgar. Teimlaf y dylai gwleidyddiaeth fod yn gyfranogol, yn berthnasol, ac yn berthnasol i bob un ohonom ac am y rheswm hwn, rwyf bob amser wedi bod yn gefnogwr o’r Blaid Werdd, gan sefyll mewn etholiadau lleol mor bell yn ôl â’r 1990au a thros y Senedd a’r Senedd yn 2015 a 2016.\nMae’r Blaid Werdd yn cydnabod nad yw’r amgylchedd ar wahân i economeg a chymdeithas ond ei fod yn rhyng-gysylltiedig ac yn hanfodol i iechyd, lles a safon byw pawb. Mae polisïau’r Blaid Werdd yn darparu, nid yn unig, weledigaeth amgen ond strategaeth fanwl a chynllun ariannol ar sut i wella cyfleusterau a gwasanaethau lleol a rhoi’r galon yn ôl i wleidyddiaeth.\nMeet Petra – Parliamentary Candidate for Aberconwy\nI have lived and been involved in my local community in Deganwy, Conwy, for over 15 years, working in Colwyn Bay for the final decade of a 35-year nursing career. After I retired in 2017, I joined my husband running our own sailing school based on the River Conwy. I feel it is crucial for democracy that there is a Green Party candidate on the ballot paper, so that everyone can express their support for protecting our environment and society. By voting Green you have an opportunity to challenge the main parties, challenge the false and failing economic structure of our current consumerist system and challenge the constant cuts to local funding.\nThe Green Party places people, not profit, at the heart of our economic strategy, stands up for the future of our young people and creates caring local communities. I feel that politics should be participatory, relevant, and relatable to all of us and for this reason, I have always been a supporter of the Green Party, standing for local elections as far back as 1990’s and for Parliament and the Senedd in 2015 and 2016.\nThe Green Party recognises that the environment is not separate from economics and society but is interlinked and vital to everyone’ s health, wellbeing and standard of living. Green Party policies provide, not only, an alternative vision but a detailed strategy and financial plan on how to improve local facilities and services and put the heart back into politics.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_09_09_stand-up-for-democracy-colwyn-bay/content_58.html": "On the 31st of August Denbighshire For Europe organised a Stand Up For Democracy Protest in Colwyn Bay where Chris Hemming of our committee members discussed how what Boris Johnson attempting to prolouge parliament was a disgrace to democracy.\nHere are some photos from the day.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_elected-greens/content_3.html": "These are the elected greens making a difference in North West Wales.\nHave you ever wanted to vote green and not had the opportunity? Have you thought about standing in your local area for the Green Party?\nGele and llandulas\n“My name is Ros Griffiths-Williams and I’d like to say thank you for putting your trust in me. It’s an honour to be elected to the county council and represent Gele & Llanddulas. I’m looking forward to providing a strong, proud voice for our community.\nLlanfairfechan\nAlun Jones was elected to Llanfairfechan Town Council in May 2022 after Iolo stood down continuing Iolo’s brilliant work in building a greener, fairer, community",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_general-election-2019/content_46.html": "8th November 2019 / 19th March 2024 by harrietking\nAs part of the Unite To Remain agreement as a local party we made the decision to step aside for Plaid Cymru on Anglesey. This was a difficult decision to make as the climate and environment is of paramount in important to us. Before making a decision we reached out to Aled Ap Dafydd Plaid’s […]\nRead more »",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_11_08_electorial-agreements/content_22.html": "As part of the Unite To Remain agreement as a local party we made the decision to step aside for Plaid Cymru on Anglesey. This was a difficult decision to make as the climate and environment is of paramount in important to us. Before making a decision we reached out to Aled Ap Dafydd Plaid’s candidate and recieved a statement regarding their commitment not to vote for nuclear on Angelsey.\nThe decisions on Wylfa B are made in Westminster by our MP’s so with the Unite To Remain agreement could possibly lead to many more elected Greens in Westminster voting against nuclear and ensuring clean green energy for Anglesey.\nWe understand the frustrations involved with having to vote for party which you may not normally vote for, however we hope this will ensure we have more green voices across the UK.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_plastic/content_74.html": "13th October 2019 / 19th March 2024 by harrietking\nThis Saturday we along with volunteers cleaned 150kg of waste from the Dingle in Colwyn Bay. This beautiful little stream which runs through the centre of Colwyn Bay was full of plastic as well as a shopping trolley and sadly syringes. By cleaning the Dingle we have saved waste from entering the Bay and then […]\nRead more »\n26th June 2019 / 19th March 2024 by harrietking\nOn Saturday the 29th of June at 1pm in Ruthin Extinction Rebellion will be holding a protest requesting that Denbighshire County Council declare a Climate Emergency. We are in full support of this request and will be at the protest to show our continued solidarity. North Wales has great opportunity to use this to revolutionise […]\n20th June 2019 / 19th March 2024 by harrietking\nAre you up for the #Trashtag Challenge? Join us on 13th July at 1pm for a clean up of the Civic Centre in Eirias Park!\n27th April 2019 / 19th March 2024 by harrietking\nWe joined up with the North West Green Party Group, here is our joint letter to Denbighshire County Council after it had been made aware to us that Public Bins in Denbighshire are not sorted for recycling.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2020_06_23_second-call-for-nominations-welsh-parliament-elections-2021/content_47.html": "Selection of the North Wales Green Party Regional List Candidates for the Welsh Parliament Elections 2021\nSecond Call for Nominations\nAs you may well be aware, the Welsh Parliament election allows for constituency candidates and a “regional list” from which members may be selected if the Green Party vote overall in the North Wales region passes certain criteria.\nWe are now calling for further nominations from members who would like to stand as prospective regional candidates for the North Wales region, as the initial response did not reflect the required level of diversity\nBeing an election candidate is vitally important as you will give every voter in your constituency or region the chance to vote Green. As a candidate you will also be uniquely placed to publicise our green message and shape the terms of the election debate. It is also possible that you could be elected as a member of the Welsh Parliament, giving you the chance to hold the Welsh Government to account and to promote Green Party policies in the Senedd.\nNominations will be considered by a selection meeting convened by the party election returning officer.\nCandidates will be selected by party members using the STV method of proportional representation, with an option to reject all candidates and reopen nominations.\nThis nomination form is in three parts:\n- About me– who you are, what you are standing for. This is for your local Green Party Electoral Returning Officer (ERO) to use in organising the selection process.\n- Candidate Declaration– a requirement of our Constitution and to help us manage any potential media issues. This will be kept confidential to party officials.\n- Why me– your background and experience, why you should be selected. This will be shared with members to help them decide who to vote for in the selection process.\nOnce completed, please return this nomination form to Brian Laing (the Returning Officer) at brian.laing@walesgreenparty.com by Friday 3rd July 2020.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_nuclear-free-wales/content_52.html": "17th September 2024 / 17th September 2024 by Green Party Admin\nThe nuclear reactor Construction of the Trawsfynydd Magnox Nuclear Power Station in Eryri National Park began in 1959 and was completed in 1965. It is one of 26 Magnox stations built in the 1950’s to 1970’s. They were developed as dual function reactors, able to produce plutonium for nuclear weapons as well as electricity. [1] […]\nRead more »",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2024_06_26_green-talk-and-qa-guest-speakers-llangoed-village-hall/content_32.html": "Our event on Anglesey was a great success! We had a panel of 4 speakers and a chair who asked questions of the audience. They ranged from Education, Investment into Services for Adults, Nuclear Free Anglesey and Voting Reform with Proportional representation.\nThe 4 speakers included\nBaroness Natalie Bennett – Greenparty Lord\nAnthony Slaughter – Wales Green Party Leader\nMartin Schwaller – Candidate for Ynys Ynys Môn\nHarriet King – North West Wales Green Party Chair\nBoth Natalie and Anthony bought copies of their books for us to view sign and purchase.\nWe planned this event before the election but it coincided well for the people of Anglesey to be able to ask some key figures in the Green Party the questions that matter to them.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_people/content_7.html": "The Committee\nThis team of volunteers run your local Green Party – you can join the team in an officer role in one of our vacant positions – Find out more\n- Elections Officer\n- Secretary\n- Membership Officer\n- Media Officer\n- Social Secretary\nThis team of volunteers run your local Green Party – you can join the team in an officer role in one of our vacant positions – Find out more",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_06_20_trashtag-colwyn-bay/content_28.html": "20th June 2019 / 19th March 2024 by harrietking\nAre you up for the #Trashtag Challenge? Join us on 13th July at 1pm for a clean up of the Civic Centre in Eirias Park!",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_karl-drinkwater-dwyfor-meirionnydd/content_5.html": "Cwrdd â Karl – Ymgeisydd Seneddol dros Dwyfor Meirionnydd\nFel awdur, mae Karl yn breuddwydio am fydoedd gwell. Yn ei waith cymunedol – ymgyrchydd amgylcheddol, codwr sbwriel, athro ysgrifennu creadigol ysbrydoledig, a chynghorydd cymuned – mae’n rhoi ei werthoedd ar waith.\nYsgrifennodd ei nofel gyntaf ar Ynys Enlli, ac yn ystod ei yrfa ugain mlynedd fel llyfrgellydd ym Mhrifysgol Aberystwyth byddai’n mwynhau dyddiau haf yn beicio Llwybr Mawddach neu grwydro’r Bermo a Harlech.\nMae gan Karl galon Celt ac mae’n breuddwydio am Gymru gwbl annibynnol, yr Alban ac Iwerddon unedig, a chynghrair dilynol o wledydd Celtaidd. Yn olaf, yn rhydd o gynhesu, gwladychu a dwyn adnoddau Lloegr, gallai’r gennin pedr, ysgallen a’r shamrock ffynnu eto.\nMae angen newid ar frys. Cael gwared ar wleidyddion sy’n dinistrio gwasanaethau cyhoeddus, cynyddu anghydraddoldeb, hyrwyddo trais mewn polisi tramor, mygu gwrthwynebiad, galluogi hil-laddiad, cefnogi apartheid, cynyddu dyled, dinistrio’r amgylchedd, a dweud celwydd i ni. Gwleidyddion gyrfa yn ceisio mwy o rym a manteision i’w hunain a’r rhai sy’n eu prynu.\nMae angen i ni amddiffyn yr hyn sy’n dda ac ailddarganfod yr hyn a gollwyd. Nid ydym ar wahân i natur, rydym yn rhan ohono. Rhaid inni ddychmygu byd sy’n ein hailgysylltu â’r tir, sy’n deg ac yn gyfartal, lle gallwn brofi bywydau bodlon a chynaliadwy mewn cymunedau cyfeillgar.\nGallwch ddarllen mwy am Karl ar ei flog a’i Facebook\nMeet Karl – Parliamentary Candidate for Dwyfor Meirionnydd\nAs an author, Karl dreams of better worlds. In his community work – environmental campaigner, litter picker, inspiring creative writing teacher, and community councillor – he puts his values into practice.\nHe wrote his first novel on Ynys Enlli, and during his twenty-year librarian career at Aberystwyth University, he would enjoy summer days cycling the Mawddach Trail or exploring Barmouth and Harlech.\nKarl has the heart of a Celt and dreams of a fully independent Wales, Scotland and united Ireland, and a subsequent alliance of Celtic countries. Finally free of England’s warmongering, colonialisation and resource theft, the daffodil, thistle and shamrock could thrive again.\nThere’s an urgent need for change. To get rid of politicians who destroy public services, increase inequality, promote violence in foreign policy, stifle opposition, enable genocide, support apartheid, increase debt, destroy the environment, and lie to us. Career politicians just seeking more power and perks for themselves and those who buy them.\nWe need to protect what’s good and rediscover what has been lost. We are not separate from nature, we are a part of it. We must imagine a world that reconnects us to the land, that is fair and equal, where we can experience fulfilling and sustainable lives in friendly communities.\nYou can read more about Karl on his blog and his Facebook",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_events/content_82.html": "21st February 2025 / 21st February 2025 by harrietking\nCroeso Menai is a local charity that helps refugees make North Wales their home and we are proud that we can host an event to raise awareness of their wonderful work. Green Party Baroness Jenny Jones will be giving a talk where you can ask for the latest info from the House of Lords and […]\nRead more »\n11th October 2024 / 21st February 2025 by harrietking\nThe conference may be over, but we are still feeling its effects: excitement, dedication, and a renewed energy to keep campaigning for the people of North Wales. It was great seeing our colleagues in the Wales Green Party up North with us, and we look forward to the next time they’re up here as well. […]\n26th June 2024 / 21st February 2025 by harrietking\nOur event on Anglesey was a great success! We had a panel of 4 speakers and a chair who asked questions of the audience. They ranged from Education, Investment into Services for Adults, Nuclear Free Anglesey and Voting Reform with Proportional representation. The 4 speakers included Baroness Natalie Bennett – Greenparty Lord Anthony Slaughter – […]\n6th February 2024 / 29th March 2024 by harrietking\nThe day following our AGM in Menai Bridge a large group of us were pleased to be hosted by Menter Môn. In particular we were there to see the Anglesey Morlais Tidal Energy project that Menter Môn are bringing to fruition. The project, near Ynys Lawd (South Stack) is a fine example of a very […]\n28th July 2023 / 29th March 2024 by harrietking\nWe’d like to say a big ‘diolch o galon’ to Anthony Slaughter – Wales Green Party Leader for coming to northwest Wales this weekend. We had such an inspiring day of activism yesterday, including a beach clean, tree planting and meeting with local residents in Dyffryn Arduwdy and Llanbedr. We visited a community land project […]\n16th July 2023 / 29th March 2024 by harrietking\neryone who came along to our social in Bethesda today! And special thanks to Beics Ogwen for providing the amazing electric bikes. We’re supporting the proposal to build a cycleway between Bethesda and Bangor, so everyone can enjoy this fun, easy and sustainable way of getting around. We really enjoyed meeting everyone who attended and […]",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2024_07_05_general-election-results/content_76.html": "6 weeks of campaigning is over, the ballots have been counted and a new government is in power!\nOver the 6 weeks, Greens from North West have been busy at hustings, sharing online content and spreading the Green message.\nHarriet the Chair of the North West Wales Green Party expressed “How proud she was of all the candidates who stood for the Greens and allowed the people of North Wales to choose Green if they wanted too. In doing so we received a total of 4804 votes. A great result for our area as in the 2019 Election there were no Greens on the Ballot.\nI want to thank everyone who voted for us and made all of the time and effort we spent worth it“.\nIf you were happy you had a Green Choice this time, please become a member and help us keep Green on future ballots.\nPetra Haig – Bangor Aberconwy\nPetra received 1361 Votes in her constituency obtaining 3.3% of the total vote.\nMartyn Hogg – Clwyd North\nThis is Councillor Martyn Hogg first time standing in a General Election and he achieved 1391 votes with a total vote share of 3.3%!\nKarl Drinkwater – Dwyfor Meirionnydd\nKarl received 1448 votes the highest in our area! Da Iawn Karl! With a vote share of 3.6% of the total vote\nMartin Schwaller – Ynys Môn\nThis was Martins’s first time Standing on Ynys Môn and if my knowledge is correct the first time we have stood a candidate in North Wales. Ynys Môn is an interesting constituency as it is a 3 way marginal. Martin received 604 votes with 1.9% of total votes",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_extinction-rebellion/content_92.html": "26th June 2019 / 19th March 2024 by harrietking\nOn Saturday the 29th of June at 1pm in Ruthin Extinction Rebellion will be holding a protest requesting that Denbighshire County Council declare a Climate Emergency. We are in full support of this request and will be at the protest to show our continued solidarity. North Wales has great opportunity to use this to revolutionise […]\nRead more »\n11th May 2019 / 19th March 2024 by harrietking\nExtinction Rebellion March Conwy We joined Extinction Rebellion North Wales in Conwy to show support for Conwy Council to declare a climate emergency. Here are the some photos from the march",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_volunteer/content_75.html": "Volunteer with us!\nVacancies are indicated next to each role where the position is available. If you would like to be on the committee you can join one of our meetings or contact us via the online form.\nIf you don’t want to take on a committee role, you can help us by doing ad-hoc volunteering in many ways from calling members, social media, website, graphics, press, articles and research so please do get involved.\nLocal Party Chair\nThe Chair has the key role of providing leadership, and chairing monthly meetings of members. They will also prepare agendas, draft papers and strategies. This is the person who drives the party forwards by ensuring activities are delivered, addressing arising problems, ensuring appropriate conduct, ensuring devised strategies are followed and generally accepting high level responsibility for the party.\n- Chairs meetings.\n- Chief arbitrator.\n- Ensures equal opportunity.\n- Access to membership lists.\n- Sits on Wales Green Party Council as a local party representative.\nThe role suits a hardworking and energetic person who is a capable public speaker, able to impartially resolve conflict and understand others, maintain a business-like approach at meetings and develop an ‘overview’ understanding of the big issues faced by the area. This role is demanding and requires a person able to dedicate sufficient time and emotional energy.\nTreasurer\nThe treasurer manages the party bank account and finances (usually with at least one other signatory) and this involves administrating all party spending and overseeing any deposits made into the bank account. They would normally present a short financial report at party meetings and produce an annual set of accounts to be presented at the AGM. Other duties of the treasurer include budget planning, overseeing election spending, provision of financial guidance to other officers, facilitating donations to the party creating mechanisms through which this can happen such as paypal, standing orders and crowd funding. The treasurer also has an important role in monitoring and reporting on all election expenditure, keeping financial records for all expenditure over £20 during an election period, and completing election expenditure returns to be sent to national office.\nThey will also usually work closely with the Election Agent and candidates to ensure that election spending and donation rules are followed, For example, undertaking permissibility checks on all donations over £500 to campaign funds, and over £50 donations to all individual candidates’ campaigns. The membership officer also chairs meetings when necessary.\n- Acts as vice-chair.\n- Chief financial responsibility.\n- Takes the lead on planning budgets.\n- Responsible for election expenses.\nThe position of treasurer is very important and a competent treasurer can have a transformative effect on the achievements of the local party. This role requires an organised person who pays attention to detail and who thinks creatively about resource related issues. Basic mathematical and spreadsheet management skills are essential. Some accounting background can be useful, but is not necessary.\nCo-Ordinator / Secretary\nThe main responsibility of the co-ordinator is to take minutes of meetings and make them available for members. They need to be someone who attends meetings regularly, is reliable in getting messages out on time, and is able to be concise and clear in putting down the actions that are required. The co-ordinator also takes a lead on responding to public and external enquiries.\n- Prepares minutes.\n- Responsible for external communications.\nThis role requires an organised person with good writing and interpretation skills, able to identify key issues, then make accurate and clear written records.\nNominating Officer / Elections Officer\nThe nominating officer is the person who acts as a candidate’s agent during an election providing the candidate with advice regarding legal conduct during an election and registering the candidate to compete. Their rights and responsibilities are defined in law and in practice they have to be appointed by the candidate or, at some PR elections, by the list of candidates. They certify candidates so that they can use an official Green Party description on the ballot paper, and request that a party emblem appears on it. The election agent is also entitled to have copies of the electoral register and updates on a year-round basis. Another important aspect of this role is organizing internal elections, for example for officer posts at the AGM or when selecting a candidate for an election.\n* Help candidates navigate electoral requirements.\n* Take the lead in screening candidates.\n* Responsible for internal elections.\nThe role requires a person dedicated to the progress of the party and prepared to devote some time towards supporting the ambitions of other people. It is a selfless role and require requiring tenacity, attention to detail and knowledge of relevant legislation.\nArea Campaign Manager\nCampaigning is the ‘bread and butter’ of local party activity and is the primary means of achieving desirable change. It brings together many of the activities conducted by local parties such as working with local media, exploiting digital media opportunities, producing leaflets and other\nprinted material, lobbying local organisations and most importantly, working alongside your electorate. Area campaign managers work alongside issue campaigners to develop a strategy and set of policy priorities for local election campaigns, but focus on electoral strategy rather than individual campaigns. They’re responsible for the year-round work required to win elections, including developing a Target-to-Win strategy, organizing volunteers, designing election leaflets and maintaining canvassing databases.\n- Co-ordinates election strategy.\n- Organizes and motivates volunteers.\n- Produces election material and maintains canvassing database.\n- Tie in events and issue campaigns to broader strategy.\nCampaigners need a wide range of skills and capabilities. They need to be good planners and assertive organisers and motivators, and they need to be passionate but caring and dedicated to making positive change. Campaigners also need good written and verbal communications skills as they will\nhave to produce campaign literature and vocalise concerns to a wide range of audiences – some hostile. They need to have excellent listening skills to pick up on local issues, and they need to integrate information and evidence from a range of different sources and formulate practical solutions\nMembership Officer\nThe primary function of this post is to administrate the membership records, taking a lead in welcoming new members and chasing up lapsing members. They’re responsible for communicating news and events to members, and ensuring good contacts between members and the committee.\n- Engages members.\n- Access to membership lists.\n- Responsible for internal communications.\nThe Membership Secretary needs to be organised with good attention to detail, and able to exercise good judgement with regards communications released by the party. They require good interpersonal skills as they will be the first contact for many new members. In addition, some affinity with databases or contact management systems would be helpful.\nMedia Officer\nThis role includes producing press releases following events or during campaigns, acting as the local party contact for the media. Managing social media content for consistency and to advertise events is a constant role, although social media will never form the main thrust of a campaign. The media officer will also work with the campaign managers to produce materials such as leaflets, and are advised to check any letters or other publicity that is put out on behalf of the local party by any other member for messaging consistency.\n- Produce press releases.\n- Manage social media.\n- Aid in designing campaign literature.\nThe media officer role is best suited to someone with direct experience of producing press releases or working within a communications role. It requires a person with good written and spoken communication skills who is able to think and communicate often under pressure. Technical skills in website administration and publishing software are very useful, as is the ability to create written content for both digital and printed media.\nSocial Secretary\nParties are frequently involved in events such as such as stalls, demos, social events, debates and film nights, where members and the public can meet in a more relaxed manner and enjoy themselves. These events can often be useful ways of raising funds essential to the effective running of the local party. Fundraising can also include setting up standing orders and crowd-funding pages. The social secretary therefore plays a crucial role both in increasing the engagement of members and securing funding for future events and campaigning. They need to work closely with the chair, membership officer and campaign managers to ensure that events contribute to the strategic direction of the party.\n- Organizes social events.\n- Takes a lead in fundraising.\n- Tie in events to broader strategy.\nSocial secretaries need to be organised, good networkers and have a reasonable knowledge of the issues and activities associated with different sorts of events. Depending on the scale and type of event, it may involve booking facilities, consideration of Health and Safety, consideration of inclusion, stewarding and working alongside other agencies. They need to be persuasive in order to present a convincing argument to potential donors for why money should be given to the local party; many candidates build their funding case around the issue based campaigns they are delivering. In addition, social secretaries need to be creative especially when organising fund raising events which might include concerts, jumble sales, auctions etc.\nIssue Campaign Manager\nCampaigning is the ‘bread and butter’ of local party activity and is the primary means of achieving desirable change. It brings together many of the activities conducted by local parties such as working with local media, exploiting digital media opportunities, producing leaflets and other printed material, lobbying local organisations and most importantly, working alongside your electorate. Issue campaigners work alongside area managers to develop a strategy and set of policy priorities for local election campaigns, but focus on specific issue campaigns rather than electoral strategy. The Green Party of England and Wales has a campaigns committee which organises campaigns for all members to get involved in, and the campaigns lead can act as a link with this team. In addition, your local party will almost certainly get asked to become involved in campaigns by local pressure groups, and you will need to be able to respond to these.\n- Pick up on and develop local campaigns.\n- Organize national issue campaigns locally.\n- Tie in issue campaigns to broader strategy.\nCampaigners need a wide range of skills and capabilities. They need to be good planners and assertive organisers and motivators, and they need to be passionate but caring and dedicated to making positive change. Campaigners also need good written and verbal communication skills as they will have to produce campaign literature and vocalise concerns to a wide range of audiences – some hostile. They need to have excellent listening skills to pick up on local issues, and they need to integrate information and evidence from a range of different sources and formulate practical solutions",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_02_06_welcome-to-our-new-website/content_67.html": "Skip to content\nSkip to footer\nNorth West Wales\nMenu\nNews\nAGM Event\nGeneral Election\nElected Greens\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nUncategorised\nWelcome to our new website\nWelcome to our new website\n6th February 2019\nby\nGreen Party Admin\nTo top",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_author_harrietking/content_14.html": "Credwn Yn Annibyniaeth Cymru // We Believe In Welsh independence\nCroeso i dudalen swyddogol Plaid Werdd Gogledd Orllewin Cymru! Mae’r Blaid Werdd yn wahanol – ry’n ni’n fudiad llawr gwlad sydd eisiau gwanhau polisïau llymder ac effaith andwyol cyllid ar wleidyddiaeth.\nCredwn ni bod polisïau lles cymdeithasol cryf yn angenrheidiol i gynnal cymdeithas rydyn ni eisiau byw ynddi, a bod addysg dda, amgylchedd iach ac arweinyddiaeth ag uniondeb yn ddigon bosibl i’w gyflawni gydag ewyllys wleidyddol gadarn.\nMae Cymru yn haeddu gwell a byddwn yn ymgyrchu dros Gymru annibynnol. Dyma’r unig ddyfodol a fydd yn caniatáu inni adeiladu’r gymdeithas decach sydd ei hangen arnom, heb gael ein cyfyngu gan yr hyn y mae San Steffan ei eisiau.\nOs ydych chi’n byw yn Ynys Môn, Arfon, Aberconwy neu Dwyfor Meirionnydd (Tip y Llyn i Sir Ddinbych) ymunwch a ni ar gyfer un o’n digwyddiadau – i rannu syniadau, holi cwestiynau ac ymuno a’r drafodaeth.\nWelcome to the official page of the North West Wales Green Party! The Green Party is different – we are a genuine grass-roots movement of individuals who believe that there are alternatives to austerity and to the toxic influence of finance on our political system.\nWe believe that social welfare should provide a real and valuable safety net, and that education, clean air, publicly-owned healthcare and leadership with integrity are achievable aims and should be at the heart of political debate.\nWales deserves better and we will campaign for an independent Wales. It’s the only future that will allow us to build the fairer society we need, without being restricted by what Westminster wants.\nIf you live in Anglesey, Arfon, Aberconwy or Dwyfor Meirionnydd constituencies (Tip of the Llyn to Denbighshire) join us at one of our upcoming events – to share ideas, ask questions and join the discussion.\nWe are the only party dedicated to fighting for our environment and ensuring we live in a fair and just society\nJoin us at one of our next events – You don’t have to be a member either",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_11_15_rhiw-ward-town-council-election/content_63.html": "The ballot boxes are empty and the results are in!\nThank you to all candidates taking part to enable this election.\nCongratulations to Debra Jones the next Rhiw Ward Town Councillor.\nWell Done Brian for an excellent campaign. 💚\nTotal votes cast: 983\nTurnout: 20%\nCON: 514, 52%\nGRN: 189, 19%\nLAB: 176, 18%\nIND: 100, 10%",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2025_02_21_a-short-term-dash-for-growth-comes-with-a-long-term-price-tag/content_19.html": "The only words that seem to matter in Whitehall are Economics and Growth. All else must be sidelined until growth is secured and, so party managers hope, the next general election can be won with an expanding economy. Such is politics, as they like to say: ‘it’s the Economy stupid.’\nBut this view, and the government’s obsession with economic growth, is flawed and in the medium term at least it is bound to fail, making future economic crises even worse. This is because the economy rests on the foundation of nature and nature in the UK and globally is under the cosh of ‘grow baby grow’. The foundations of the economy are weakening.\nIn his 2021 report, ‘The Economics of Biodiversity’, Professor Sir Paval Dasgupta showed that nature is an integral part of the economy and that economic policy had to account for and mitigate its impact on nature. Policies and actions that damaged nature beyond nature’s capacity to recover were counterproductive and would lead to economic decline. He concludes, ‘Our economy, livelihoods and wellbeing all depend on our most precious asset: Nature.’\nThis conclusion has been further developed by the Institute and Faculty of Actuaries in a report published in January 2025 titled ‘Planetary Solvency, Finding our Balance with Nature’. Lead author Sandy Trust stated the situation very clearly: “You can’t have an economy without a society, and a society needs somewhere to live. Nature is our foundation, providing food, water and air, as well as the raw materials and energy that power our economy. Threats to the stability of this foundation are risks to future human prosperity which we must take action to avoid.”\nActuaries assess risk advising business and Governments about the probabilities of success or failure of policies and projects. They see an increasing swarm of risk facing us in the near future as a consequence of our failure to halt the decline of nature which is amplifying the effects of climate change. Risks include fire, floods, decline in food production, water stress and the spread of pests and diseases. They will lead to conflicts and mass migrations of people, leading to political instability. All this will affect global supply chains disrupting the global economy. They foresee a decline in global GDP of between 50% and 70% by the last quarter of the century.\nIn 2024 the Green Finance Institute calculated the cost to the UK economy of the degradation of nature. Their report: ‘Assessing the Materiality of Nature-Related Financial Risks for the UK’ concluded that the deterioration of the UK’s natural environment could lead to an estimated 12% loss to GDP by the mid 2030’s. This would be a greater hit to the economy than either the 2008 financial crisis or the Covid pandemic. This ‘hit’ would come during what Mr Starmer and Ms Reeves hope will be their second term of office. They should take careful note of these risks.\nThe losses are not just related to impacts on the UK environment such as soil loss, flooding and storm damage but also come from disruptions to essential supply chains that feed into the UK economy. Problems in supplier countries of either environmental disasters or of consequential civil and political disruptions will impact on the operation of UK business and therefore UK GDP.\nThe vitally important Food & Agriculture sector is particularly at risk through unpredictable climate, water shortage, flooding & drought, disease, pollution & loss of soil quality. Sectors dependent on predictable water flow such as energy may experience disruption and loss. Problems in supplier countries will affect businesses as much as domestic problems. Difficulties and increased costs for business feed through to the financial sector creating inflationary pressure with the growing risk of defaults and bad debt.\nThis study adds further evidence to support the conclusion from the Dasgupta Review and others that an early orderly transition toward a nature-positive economy brings significant benefits for UK prosperity and financial stability, through reducing both transition and physical risks, as well as for people and planet. Economies that have navigated the transition to a more resilient and sustainable economy and productive base will have a major competitive advantage over those countries that have doggedly pursued ‘business as usual’ policies.\nThe UK lacks progress in meeting targets to reverse biodiversity decline. It failed to meet the targets it had agreed to in 2011 under the UN Convention of Biological Diversity and is not on track to meet the agreements made in Montreal in 2022 under the Global Biodiversity Framework as the State of Nature report 2023 makes clear. Nature continues to decline in all the countries of the UK. The drivers of decline are not being addressed by Governments.\nThis failure to properly address the decline of nature is putting our economic prosperity at risk, as these reports make very clear. Pushing for developments to boost growth of GDP and riding roughshod over concerns for biodiversity are putting our future prosperity at risk.\nThe Institute of Actuaries states clearly that risk also comes from actions of economic actors who inhibit, contradict or block actions designed to protect and restore nature. A Prime Minister who calls this concern for nature as NIMBYism is risking our future prosperity. Lobbyists and media who try to block the transition to a zero carbon energy system are putting our future prosperity at risk. Landowners who try to block the transition to nature friendly farming are putting our future prosperity at risk.\nWales will have to make the transition to a sustainable economy. Faced with harsh economic pressures, its transition is in danger of stalling. As a small economy the needed change could be simpler and quicker than for the whole UK although the lack of finance will cause difficulties. A bigger problem though is the lack of cooperation and goodwill among the economic players. Resistance to change is notable among landowners and some farmers. Some of this is down to poor communication and also to a long history of distrust of government. The stakes are high and Wales now has an opportunity to be a pioneer in developing a sustainable economy with the new products and skills that will be needed. The conservative mind set sees only the risk of making the transition and fails to see the opportunities. But the greatest risk lies with a delayed and chaotic transformation in the face of mounting crises.\nMike Shipley",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2024_02_06_morlais-tidal-energy-project-visit/content_87.html": "The day following our AGM in Menai Bridge a large group of us were pleased to be hosted by Menter Môn. In particular we were there to see the Anglesey Morlais Tidal Energy project that Menter Môn are bringing to fruition.\nThe project, near Ynys Lawd (South Stack) is a fine example of a very significant renewable energy project being delivered on time, in budget and genuinely creating long lasting, local, high value jobs and stimulating career opportunities as well as the Welsh language.\nThe Morlais project is near complettion and will have the capacity to produce 240MW of carbon free electricity. This project is not just putting turbines in the water but also all the infastructure to deliver the energy from the tides right into the Grid.\nWe are impressed by the attention to the environmental impact of the scheme and the sesisitivity with which the project is managed. It is a centre of excellence for tidal energy production and an example of how we can secure our energy future without the need for combustion of fossil fuels or of developing nuclear.\nMenter Môn runs a number of innovative projects across Anglesey and Gwyndd. It is run as a social enterprise and as such is an interesting model for delivering projects on a non profit making basis.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_tag_anthonyslaughter/content_27.html": "Anthony Slaughter – School Cuts, High Streets and Coastal Communities 27th April 2019 / 19th March 2024 by harrietking Read more » anthonyslaughter climate crisis coastal community highstreet schoolcuts",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_03_14_hello-world/content_91.html": "14th March 2019 by Green Party Admin\nWelcome to Green Party WordPress Sites. This is your first post. Edit or delete it, then start blogging!",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_climate/content_49.html": "21st February 2025 / 21st February 2025 by harrietking\nThe only words that seem to matter in Whitehall are Economics and Growth. All else must be sidelined until growth is secured and, so party managers hope, the next general election can be won with an expanding economy. Such is politics, as they like to say: ‘it’s the Economy stupid.’ But this view, and the […]\nRead more »\n6th February 2025 / 21st February 2025 by harrietking\nThe Welsh Government has been heavily criticised by a key Senedd Committee over its responses to the Nature Emergency in Wales that was declared by the Senedd in 2021. The Climate Change, Environment and Infrastructure Committee’s report published in January 2025 said that commitments made by the Government to nature restoration in Wales must be […]\n21st September 2019 / 19th March 2024 by harrietking\nYesterday on the 20th of September we joined the school children of Colwyn Bay and Bangor at the Global Climate Strike. In Colwyn Bay Adam our Campaigns Officer gave a rabel rousing speech about the change needed to protect our planet and humanity. It was such an inspiration watching the Children defend their future, and […]\n2nd July 2019 / 19th March 2024 by harrietking\nToday Denbighshire County Council has declared a Climate Emergency – exciting news for the future of the county and a critical step forward to securing a sustainable Wales. Having now adopted a policy of being carbon neutral by 2030 – hopefully sooner – the Council can now work extensively towards this target. From using weed […]\n11th May 2019 / 19th March 2024 by harrietking\nExtinction Rebellion March Conwy We joined Extinction Rebellion North Wales in Conwy to show support for Conwy Council to declare a climate emergency. Here are the some photos from the march\n27th April 2019 / 19th March 2024 by harrietking",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2023_07_16_bike-ride-from-bethesda-to-llyn-ogwen/content_79.html": "eryone who came along to our social in Bethesda today! And special thanks to Beics Ogwen for providing the amazing electric bikes.\nWe’re supporting the proposal to build a cycleway between Bethesda and Bangor, so everyone can enjoy this fun, easy and sustainable way of getting around.\nWe really enjoyed meeting everyone who attended and look forward to more cycling events in the future.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2024_02_06_local-party-chair-agm-report-2024/content_89.html": "172 Activists in total across North West Wales around 20-30 more than we had last year.\nChanges to the area over the last year took on Dwyfor Meirionnydd but lost part of Denbighshire.\nWe now cover from the Llyn, across to Conwy and including Ynys Mon constituency-wise that’s Dwyfor Meirionnydd, Aber Conwy, Afron and Ynys Mon.\nYnys Mon is also an important area of our campaign as we today are announcing our Candidate for General Elecrion Martin Schwaller.\n2 more areas for General Election candidates to come forward for Dwyfor Meirionnydd and Bangor Aberconwy if anyone does want to stand and not forget the vital role that community and town council play in the political landscape. After all local grassroots politics is what drives the Green Party.\nImportant time for our small local party with hard hard-working dedicated team of 3 who would with the help of volunteers and members who come to monthly meetings help us run the party, we’ve seen some new faces recently and some long-standing members too however we are always on the look out for fresh people and the energy that brings.\nThanks existing committee for all the hard work they have done this year, including Iain elections officer.\nThere is an opportunity to stand on the committee and hear about more volunteering opportunities with us. Any time someone can give us from liking a post on social media to leaflet dropping in our target areas to becoming a member of the committee or standing for election.\nAs we all know there are pressing issues in the world, the horrific genocide of Palestinian people, the plight of refugees, and more local issues homelessness across Wales, Education and supporting farmers in a changing climate. Although these challenges seem humongous to chance they can’t be changed without people taking action in any way they can.\nAnd I am sure that the new committee elected today and the volunteers we have will help continue in making these small but necessary steps to a Greener, independent Wales!",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_martyn-hogg-clwyd-north/content_12.html": "Cwrdd â Martyn – Ymgeisydd Seneddol Gogledd Clwyd\nSwydd Efrog syth ei siarad sydd wedi dod o hyd i’w gartref yma yng Ngogledd Cymru. Daeth cariad at yr awyr agored a chwaraeon eithafol â mi i Ogledd Cymru yn 2000 a syrthiais mewn cariad â’r traethau a’r mynyddoedd anhygoel y gallwn gael mynediad iddynt wrth weithio fel peiriannydd yn y diwydiant gweithgynhyrchu.\nCymerais sylw o wleidyddiaeth ar ôl Brexit, nid oherwydd ei bod yn ddiddorol, ond oherwydd fel peiriannydd cefais sioc ar ansawdd gwael y wybodaeth yr oedd y cyhoedd yn ei bwydo gan wleidyddion a’r cyfryngau wrth wynebu penderfyniad mor bwysig. Mae’r Blaid Werdd yn un o ddim ond 3 phrif blaid i gytuno i ymrwymo i’r safonau a nodir gan www.fullfact.org ar gyfer ymgyrchu gonest. Mae’r Blaid Werdd hefyd wedi ymrwymo i god ymddygiad ar gyfer hysbysebu gwleidyddol a nodir gan www.reformpoliticaladvertising.org\nGadewch i hynny suddo i mewn… Rydym wedi ymrwymo i ddweud y gwir wrthych ac os byddwn yn gwneud camgymeriad, byddwn yn cywiro’r cofnod! Pam fyddech chi’n pleidleisio dros rywun sydd heb wneud yr addewid hwnnw?\nCymerwch funud i ddarllen beth yw safbwynt y Blaid Werdd a dychmygwch hynny yng Ngogledd Clwyd. https://greenparty.org.uk/political-programme.html\nGallwn feithrin diwydiant inswleiddio cartrefi i greu swyddi, lleihau biliau ynni cartref ac allyriadau carbon a chadw pobl yn gynhesach yn y gaeaf.\nDylem fod yn adeiladu cartrefi newydd, fforddiadwy i’r safonau ynni uchaf, a chreu cymunedau rhwydweithiol lle nad oes yn rhaid ichi yrru ym mhobman.\nMae cynaliadwyedd wrth wraidd ein holl bolisïau.\nMae gan drigolion Cymru gysylltiad dwfn â’r amgylchedd naturiol, a chredaf fod hyn wedi eu helpu i hawlio’n falch mai nhw yw’r 3 uchaf yn y byd am ailgylchu. Ond Cymru yw un o’r gwledydd sydd wedi’i disbyddu fwyaf o ran byd natur ar y Ddaear, mae ein hafonydd a’n dyfroedd arfordirol mewn iechyd gwael ac mae mannau gwyrdd sy’n hygyrch i’r cyhoedd yn dameidiog ac yn anghymesur o waeth mewn cymdogaethau tlotach. Mae angen mwy o ASau Gwyrdd i frwydro i drawsnewid y stori hon. Mae angen inni gefnogi ein ffermwyr fel y gallant ffermio’n gynaliadwy ac yn broffidiol. Mae angen inni wneud yn siŵr bod Dŵr Cymru yn targedu eu hadnoddau at ddileu ffynonellau llygredd ac mae angen inni wneud popeth o fewn ein gallu i sicrhau bod ein hecosystemau’n ffynnu, a bod gan bobl fynediad at amgylchedd iach, naturiol.\nRydym i gyd yn elwa o amgylchedd iach a bydd hynny’n arwain at ddiwydiant twristiaeth cynaliadwy, ffyniannus, yn denu’r dalent orau i weithio yn ein hysbytai a’n mannau addysg ac yn dod â buddsoddiad busnes newydd mewn economi Werdd.\nMae Cymru’n genedl anhygoel, gyda’i hiaith ei hun, ei diwylliant cyfoethog, ei thirweddau anhygoel a gall ddal ei rhai ei hun ar lwyfan byd. Gall Cymru arwain y byd ar gymunedau tecach, gwyrddach, cynaliadwy ond dim ond os pleidleisiwch yn Wyrdd!\nMeet martyn – Parliamentary Candidate Clwyd North\nA straight-talking Yorkshireman who has found his home here in North Wales. A love of the outdoors and extreme sports brought me to North Wales in 2000 and I fell in love with the incredible beach and mountain landscapes that I could access while working as an engineer in the manufacturing industry.\nI took notice of politics after Brexit, not because it was interesting, but because as an engineer I was shocked at the poor quality of information the public were fed by politicians and the media when faced with such an important decision. The Green Party are one of only 3 main parties to agree to commit to the standards set out by www.fullfact.org for honest campaigning. The Green party have also signed up to a code of conduct for political advertising set out by www.reformpoliticaladvertising.org\nLet that sink in… We are committed to telling you the truth and if we make a mistake, we will correct the record! Why would you vote for someone that hasn’t made that pledge?\nPlease take a minute to read what the Green Party stand for and imagine that in Clwyd North. https://greenparty.org.uk/political-programme.html\nWe can nurture a home insulation industry to create jobs, reduce home energy bills and carbon emissions and keep people warmer in winter.\nWe should be building new, affordable homes to the highest energy standards, and creating networked communities where you don’t have to drive everywhere.\nSustainability is at the heart of all our policies.\nResidents of Wales have a deep connection to the natural environment, and I believe this has helped them proudly claim to be top 3 in the world at recycling. But Wales is one of the most nature depleted countries on Earth, our rivers and coastal waters are in poor health and publicly accessible green space is fragmented and disproportionately worse in poorer neighbourhoods. We need more Green MPs to fight to turn this story around. We need to support our farmers so they can farm sustainably and profitably. We need to make sure Welsh Water are targeting their resources at eliminating sources of pollution and we need to do everything we can to make sure our ecosystems thrive, and people have access to a healthy, natural environment.\nWe all benefit from a healthy environment and that will lead to a sustainable, booming tourist industry, attract the best talent to work in our hospitals and places of education and bring new business investment in a Green economy.\nWales is an incredible nation, with its own language, rich culture, incredible landscapes and can hold its own on a world stage. Wales can lead the world on fairer, greener, sustainable communities but only if you vote Green!",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_06_26_denbighshire-county-council-climate-emergency/content_77.html": "On Saturday the 29th of June at 1pm in Ruthin Extinction Rebellion will be holding a protest requesting that Denbighshire County Council declare a Climate Emergency. We are in full support of this request and will be at the protest to show our continued solidarity.\nNorth Wales has great opportunity to use this to revolutionise our economy and industries creating new jobs and fresh investment in North Wales. By declaring a climate emergency, we can ensure that we make substantial progress to a carbon free future from housing, transport and farming to energy.\nFor a long time, the Green Party have been shouting about the advances of a Green New Deal and the benefits of protecting the climate not just the next 10 years but our descendants we are yet to even think of.\nAnthony Slaughter Green Party Leader at the AGM in Scarborough this year said “Wales deserves better. As a nation with unrivalled natural resources and a long history of tackling social injustice, Wales could and should be leading the way in creating a greener and fairer future. Greens are the change that Wales needs. Greens promoting a Green New Deal. Greens introducing a Citizen’s Income. Greens standing up to the rise of the far right. Greens fighting to keep our place in Europe.”\nConwy Council have already declared a Climate Emergency and we hope that Denbighshire will follow soon",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_colwyn-bay/content_20.html": "13th October 2019 / 19th March 2024 by harrietking\nThis Saturday we along with volunteers cleaned 150kg of waste from the Dingle in Colwyn Bay. This beautiful little stream which runs through the centre of Colwyn Bay was full of plastic as well as a shopping trolley and sadly syringes. By cleaning the Dingle we have saved waste from entering the Bay and then […]\nRead more »\n21st September 2019 / 19th March 2024 by harrietking\nYesterday on the 20th of September we joined the school children of Colwyn Bay and Bangor at the Global Climate Strike. In Colwyn Bay Adam our Campaigns Officer gave a rabel rousing speech about the change needed to protect our planet and humanity. It was such an inspiration watching the Children defend their future, and […]\n20th June 2019 / 19th March 2024 by harrietking\nAre you up for the #Trashtag Challenge? Join us on 13th July at 1pm for a clean up of the Civic Centre in Eirias Park!",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_04_27_anthony-slaughter-school-cuts-high-streets-and-coastal-communities/content_72.html": "Skip to content\nSkip to footer\nNorth West Wales\nMenu\nNews\nAGM Event\nGeneral Election\nElected Greens\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nAnthony Slaughter\nClimate\nCommunities\nAnthony Slaughter – School Cuts, High Streets and Coastal Communities\nAnthony Slaughter – School Cuts, High Streets and Coastal Communities\n27th April 2019\n/\n19th March 2024\nby\nharrietking\nTo top",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_contact/content_4.html": "Skip to content\nSkip to footer\nNorth West Wales\nMenu\nNews\nAGM Event\nGeneral Election\nElected Greens\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nGet in touch\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_05_11_758/content_69.html": "Extinction Rebellion March Conwy\nWe joined Extinction Rebellion North Wales in Conwy to show support for Conwy Council to declare a climate emergency.\nHere are the some photos from the march\nWe joined Extinction Rebellion North Wales in Conwy to show support for Conwy Council to declare a climate emergency.\nHere are the some photos from the march",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_europe/content_56.html": "9th September 2019 / 19th March 2024 by harrietking\nThs Sunday Harriet spoke at the DenbighshireForEurope rally in Ruthin, along with other party representaves from the Lib Dems, Plaid and Labour. She spoke about how Citizens Assembleys can bring a local voice to Westminster so that views from all parts the local community can be heard and belives these are the way forward to […]\nRead more »\nOn the 31st of August Denbighshire For Europe organised a Stand Up For Democracy Protest in Colwyn Bay where Chris Hemming of our committee members discussed how what Boris Johnson attempting to prolouge parliament was a disgrace to democracy. Here are some photos from the day.\n26th June 2019 / 19th March 2024 by harrietking\nThe North West Wales Green Party will be taking part in the launch for Denbighshire For Europe a grass roots cross-party and no-party campaign organisation supporting Wales to remain in Europe. The launch is in Denbigh in the Eiranfa Centre starting at 7pm on the 5th of July. The Green Party have campaiged for a […]",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_community-shed/content_84.html": "27th April 2019 / 19th March 2024 by harrietking\nSpace to get away from it all, to create, to socialize, to learn new skills, to pass on crafts. These are the objectives of the Llanfairfechan community shed, a new group in the village aiming to bring people together over practical projects. At the heart of our ambition is acting in kind; that is, sharing […]\nRead more »",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2025_03_17_agm-2025-new-comittee-info-photos/content_62.html": "The weather was gorgeous this Saturday our AGM attendees had the opportunity to explore the beautiful Treborth Gardens where the event was being held.\nThe day started with the election of the committee and I am pleased to say that we have filled the below roles however we do still have committee roles to fill which can be found here Volunteer\nChair – Harriet King\nCo – Ordinator – Tomos Barlow\nTreasurer – James Woodcock\nThe first guest speakers were Croeso Menai who gave a wonderful talk in 3 parts, about how they started, and who they support and Kherta gave a presentation on life under the Taliban regime for young girls and women. This looked into the effects of a lack of education and rights have, rights these women once had.\nIt was a very stark and humbling experience and Harriet the chair commented on how she takes for granted her ability to speak about injustices without fear or persecution.\nCroeso Menai is now looking for their third family to support in the local area after being contacted by a local landlord who had an available house. Houses are always from private landlords and not council houses.\nFollowing Croeso Menai Jenny Jones gave a talk & Q&A based on her experiences as a Baroness in the House of Lords, where she explained the processes of bills, select committees and a lot of scrutiny. We were surprised to find out that there is no upper limit to the number of Lords that can be given at one time. Jenny along with Baroness Bennett have both called for reform of the Lords to limit sitting members to a management number of around 350 compared to the existing 832 sitting members in the House of Lords.\nThanks to everyone who attended",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2020_03_21_our-agm-and-new-commitee/content_68.html": "Our AGM was last weekend, and sadly will be our last face to face meeting until it is safe to do so.\nWe had a really good day with our guest speakers including Anthony Slaughter, Green Party of Wales Leader and Nia Jones a PHD Student in Bangor who gave a fantastic talk about plastic pollution including about how microplastics and what science is being used to identify the amount of plastic in the food chain as well as the environment.\nAnthony spoke the GreenParty call for solidarity with regards to Coronavirus and asked that we all help in our communities. The Coronavirus update can be found here\nWe also elected our new committee, some old faces, and some new faces. A big warm welcome to James as our Treasurer and Brian as the Elections Co-ordinator. The full committee can be found here\nA big thank you to all those involved in helping keep our local party going.\nFrom now on our meetings will be conducted virtually online, we will let you know about this nearer the time.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_agm/content_53.html": "17th March 2025 / 17th March 2025 by harrietking\nThe weather was gorgeous this Saturday our AGM attendees had the opportunity to explore the beautiful Treborth Gardens where the event was being held. The day started with the election of the committee and I am pleased to say that we have filled the below roles however we do still have committee roles to fill […]\nRead more »\n6th February 2024 / 29th March 2024 by harrietking\n172 Activists in total across North West Wales around 20-30 more than we had last year. Changes to the area over the last year took on Dwyfor Meirionnydd but lost part of Denbighshire. We now cover from the Llyn, across to Conwy and including Ynys Mon constituency-wise that’s Dwyfor Meirionnydd, Aber Conwy, Afron and Ynys […]\n5th February 2024 / 29th March 2024 by harrietking\nThe AGM in Menai Bridge was a great success even if we say so ourselves. It was also the launch of our General Election candidate for Ynys Mon – Martin Schwaller. Both Martin & Anthony took questions from the attendees on various topics from Agriculture Policies to Child poverty rates on the Island and of […]\n25th October 2022 / 29th March 2024 by harrietking\nIt’s been nearly a week since the AGM and we are still in awe of Dani Robertson’s talk on Dark Skies in Snowdonia! It really was a fascinating talk full of facts such as only 2% of the UK is classed as a Dark Sky Area, what we can do to improve lighting, how artificial […]\n27th April 2019 / 19th March 2024 by harrietking\nOur AGM on 7th of April was a great day with plenty to watch and take part in discussion. Harriet gave a presentation on local politics and the differences between Town and County Councillors, AM’s and MP’s as well as devolved issues that a governed by Wales. We also had videos from Alex Harris Town […]",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2022_03_14_1068/content_51.html": "Following a vote at a meeting of North West Wales Green Party, the party would like to publish the below statement in unequivocal support of trans rights.\nMotion: That North West Wales Green Party adopts and publicises the following statement, and undertakes the actions described within it.\nSocial justice is of paramount importance to North West Wales Green Party (“NWWGP”/”we”). We, therefore, reject bigotry in all its forms, including prejudice on the basis of sex, gender identity or any other intrinsic characteristic. We defend the right of all people to freely define their gender in accordance with their lived experience and to have this respected by others.\nThis accords with Policy RR530 of the Green Party of England and Wales (“GPEW”/”the Party”), which states:\n“The Green Party recognises that trans men are men, trans women are women, and that non-binary identities exist and are valid. We shall respect transgender and non-binary\npeople’s identities as real. The Green Party shall include, and push for further acceptance of, transgender and non-binary people within all areas of society.”\nContrary to this policy, it is clear that some members of GPEW do not want to push for the further acceptance of transgender and non-binary people; indeed, the spring conference of March 2022 exposed that some Party members would prefer transgender and non-binary people to undergo conversion therapy. This transphobic hatred is championed by high-profile members and goes unchallenged by others. Members of NWWGP consider these attitudes to be damaging to the Party and its members’ wellbeing. We, therefore, commit to tackling them, recognising that this comes too late for the many members of the LGBTIQA+ community who have already left the Party due to its inaction.\nNWWGP further recognises that tackling transphobia within GPEW will entail the expulsion of members who espouse transphobic prejudice. To ensure that these expulsions can be carried out promptly and effectively, we call on the Green Party Regional Council to pass clear internal guidance on queerphobia, and we call for the Party’s Code of Conduct and complaints procedures to be reformed as a matter of urgency.\nIn calling for GPEW to become a space free of bigotry, NWWGP hopes that the Party can become a welcoming place for members regardless of their sex, gender identity or any other intrinsic characteristic. In accordance with this ambition, NWWGP hereby commits to providing its members with LGBTIQA+ inclusivity training.\nNWWGP reaffirms its belief that the liberation of transgender and non-binary people-their freedom to define their gender in accordance with their lived experience-does not pose a threat to others. Specifically, we do not consider it reasonable or just for trans women to be punished for crimes committed by cisgender men. We instead acknowledge that trans women are more likely to be victims of violence than its perpetrators. We consider that directing energy away from tackling male violence, and instead towards fighting trans women, undermines the feminist movement.\nAccordingly, NWWGP also commits energy to campaigning against: sexual harassment; domestic violence; female genital mutilation; trafficking; the gender pay gap; institutional misogyny; period poverty; and cuts to public services, which disproportionately impact women.\nFinally, NWWGP affirms the right of trans and non-binary people, as with other marginalised groups, to choose the language with which they identify oppressors. We require that all members of NWWGP accept the gender determined by each individual. We regard refusal to do so as transphobia, and affirm that transphobes should not be welcome in the Green Party of England and Wales.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_uncategorised/content_66.html": "17th March 2025 by harrietking\nIt seems this year is the year of the Lords, with both Green Party Baronesses having now been for a visit to the wonderful place we call home. North Wales. North Wales was also the home of the Wales Green Party conference this year, which was great to attend, and a thank you to everyone […]\nRead more »\n6th February 2024 / 29th March 2024 by harrietking\nThe day following our AGM in Menai Bridge a large group of us were pleased to be hosted by Menter Môn. In particular we were there to see the Anglesey Morlais Tidal Energy project that Menter Môn are bringing to fruition. The project, near Ynys Lawd (South Stack) is a fine example of a very […]\n14th March 2022 / 19th March 2024 by harrietking\nFollowing a vote at a meeting of North West Wales Green Party, the party would like to publish the below statement in unequivocal support of trans rights. Motion: That North West Wales Green Party adopts and publicises the following statement, and undertakes the actions described within it. Social justice is of paramount importance to North […]\n23rd June 2020 / 19th March 2024 by harrietking\nSelection of the North Wales Green Party Regional List Candidates for the Welsh Parliament Elections 2021 Second Call for Nominations As you may well be aware, the Welsh Parliament election allows for constituency candidates and a “regional list” from which members may be selected if the Green Party vote overall in the North Wales region […]\n21st March 2020 / 19th March 2024 by harrietking\nOur AGM was last weekend, and sadly will be our last face to face meeting until it is safe to do so. We had a really good day with our guest speakers including Anthony Slaughter, Green Party of Wales Leader and Nia Jones a PHD Student in Bangor who gave a fantastic talk about plastic […]\n15th November 2019 / 19th March 2024 by harrietking\nThe ballot boxes are empty and the results are in! Thank you to all candidates taking part to enable this election. Congratulations to Debra Jones the next Rhiw Ward Town Councillor. Well Done Brian for an excellent campaign. 💚 Total votes cast: 983 Turnout: 20% CON: 514, 52% GRN: 189, 19% LAB: 176, 18% IND: 100, […]\n8th October 2019 / 19th March 2024 by harrietking\nThis year’s England and Wales Conference was in Newport and 3 members from our group attended over the weekend. Conference is a great opportunity to be involved in policy making where you support or oppose motions and really define how you want your political party to be. As well plenary you can talk part in […]\n14th March 2019 by Green Party Admin\nWelcome to Green Party WordPress Sites. This is your first post. Edit or delete it, then start blogging!\n6th February 2019 by Green Party Admin",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_climateemergency/content_16.html": "21st February 2025 / 21st February 2025 by harrietking\nThe only words that seem to matter in Whitehall are Economics and Growth. All else must be sidelined until growth is secured and, so party managers hope, the next general election can be won with an expanding economy. Such is politics, as they like to say: ‘it’s the Economy stupid.’ But this view, and the […]\nRead more »\n21st September 2019 / 19th March 2024 by harrietking\nYesterday on the 20th of September we joined the school children of Colwyn Bay and Bangor at the Global Climate Strike. In Colwyn Bay Adam our Campaigns Officer gave a rabel rousing speech about the change needed to protect our planet and humanity. It was such an inspiration watching the Children defend their future, and […]\n2nd July 2019 / 19th March 2024 by harrietking\nToday Denbighshire County Council has declared a Climate Emergency – exciting news for the future of the county and a critical step forward to securing a sustainable Wales. Having now adopted a policy of being carbon neutral by 2030 – hopefully sooner – the Council can now work extensively towards this target. From using weed […]\n26th June 2019 / 19th March 2024 by harrietking\nOn Saturday the 29th of June at 1pm in Ruthin Extinction Rebellion will be holding a protest requesting that Denbighshire County Council declare a Climate Emergency. We are in full support of this request and will be at the protest to show our continued solidarity. North Wales has great opportunity to use this to revolutionise […]\n11th May 2019 / 19th March 2024 by harrietking\nExtinction Rebellion March Conwy We joined Extinction Rebellion North Wales in Conwy to show support for Conwy Council to declare a climate emergency. Here are the some photos from the march",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_04_27_community-shed-llanfairfechan/content_45.html": "Space to get away from it all, to create, to socialize, to learn new skills, to pass on crafts.\nThese are the objectives of the Llanfairfechan community shed, a new group in the village aiming to bring people together over practical projects. At the heart of our ambition is acting in kind; that is, sharing resources and experience rather than expecting things for free.\nWe welcome and are working with groups such as the Men’s Sheds and Youth Shedderz, but you don’t have to fit into one of these groups in order to be part of the community shed. Our aim is to build an environment where everybody feels valued and there is safe space for those who need it. To us the community aspect of the project is more important than the physical workspace.\nAfter an encouraging first meeting, we’d like you to get involved! What do you want to see us do? Can you bring a skill to the table? We’re hoping to run a launch day soon with taster sessions in some of the activities the shed could provide – that could be anything from digital design to woodwork.\nWatch this space!",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_07_06_refilling-llanfairfechan-one-bottle-at-a-time/content_25.html": "Llanfairfechan now has 6 water re-fill stations thanks to Iolo Jones their Town Councillor.\nIolo has been asking business in the area to allow people to refill their water bottles for free to help reduce plastic waste in the community. Each business has a sign on display in the window to let you know they are a refill station.\nIf you’re a business interested in signing up for the volunteer refill scheme you can contact Iolo on iolojones@walesgreenparty.com.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_communities/content_81.html": "13th October 2019 / 19th March 2024 by harrietking\nThis Saturday we along with volunteers cleaned 150kg of waste from the Dingle in Colwyn Bay. This beautiful little stream which runs through the centre of Colwyn Bay was full of plastic as well as a shopping trolley and sadly syringes. By cleaning the Dingle we have saved waste from entering the Bay and then […]\nRead more »\n11th August 2019 / 19th March 2024 by harrietking\nWe’ve had a great day visiting Bryn Cocyn Organic Farm just outside Denbigh. We met in the garden where the smell of Lavender filled the air and the sound and sights of honey bees, bumble bees and various butterflies around us. We explored the polytunnel, vegetable plots and Orchard, Saw the apple press where they […]\n6th July 2019 / 19th March 2024 by harrietking\nLlanfairfechan now has 6 water re-fill stations thanks to Iolo Jones their Town Councillor. Iolo has been asking business in the area to allow people to refill their water bottles for free to help reduce plastic waste in the community. Each business has a sign on display in the window to let you know they […]\n27th April 2019 / 19th March 2024 by harrietking",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_donate/content_6.html": "Skip to content\nSkip to footer\nNorth West Wales\nMenu\nNews\nAGM Event\nGeneral Election\nElected Greens\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nDonate\nDonate\nTo top",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2024_10_11_wales-green-party-conference-in-llandudno/content_30.html": "The conference may be over, but we are still feeling its effects: excitement, dedication, and a renewed energy to keep campaigning for the people of North Wales.\nIt was great seeing our colleagues in the Wales Green Party up North with us, and we look forward to the next time they’re up here as well.\nThe weekend was filled with talks, plenary sessions and passionate speeches.\nHarriet our Chair and Martyn Hogg Denbighshire County Councillor did a session on our campaigning in North Wales, What worked, what didn’t and what our plans are over the next few months.\nLots of discussion was around the Senedd Elections in 2026 and the plans and run-up to it. Hopefully, we will get our first Green Party Assembly Members – Fingers Crossed!\nThere were plenty of training sessions to be involved with such as fighting the rise of the populist right, People Against Wylfa B – An Anti Nuclear Discussion as well a discussion by Anthony Slaughter on his new book the Future of Wales.\nPolicies were passed such as helping farmers in Wales to grow more grain for human consumption with a desire for smaller farms in Wales and less amalgamation of existing farms.\nOverall the weekend was a great success and we hope that everyone who attended enjoyed it as much as we do.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_tag_climate-crisis/content_54.html": "Anthony Slaughter – School Cuts, High Streets and Coastal Communities 27th April 2019 / 19th March 2024 by harrietking Read more » anthonyslaughter climate crisis coastal community highstreet schoolcuts",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_09_09_denbighshire-for-europe-rally-ruthin/content_39.html": "Ths Sunday Harriet spoke at the DenbighshireForEurope rally in Ruthin, along with other party representaves from the Lib Dems, Plaid and Labour. She spoke about how Citizens Assembleys can bring a local voice to Westminster so that views from all parts the local community can be heard and belives these are the way forward to ensure a local view is given high up the political chain.\nShe went on to say, that in 200 years towns in Denbighshire would disappear due to rising sea levels and how we had to act now. The EU is our closest neighbour, do we really want to cut our ties when our children to come after us may need it most?\nFinally she expressed frustration at the lack of democracy shown by Boris by removing the voice of our MP’s at this crucial time. And went on to thank the collobaration of the political parties involved in the For Europe events and working together when we are unified in an area.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_tag_highstreet/content_18.html": "Anthony Slaughter – School Cuts, High Streets and Coastal Communities 27th April 2019 / 19th March 2024 by harrietking Read more » anthonyslaughter climate crisis coastal community highstreet schoolcuts",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_news_page_4/content_15.html": "Refilling Llanfairfechan One Bottle At A Time 6th July 2019 / 19th March 2024 by harrietking Llanfairfechan now has 6 water re-fill stations thanks to Iolo Jones their Town Councillor. Iolo has been asking business in the area to allow people to refill their water bottles for free to help reduce plastic waste in the community. Each business has a sign on display in the window to let you know they […] Read more »\nDenbighshire County Council Declare A Climate Emergency 2nd July 2019 / 19th March 2024 by harrietking Today Denbighshire County Council has declared a Climate Emergency – exciting news for the future of the county and a critical step forward to securing a sustainable Wales. Having now adopted a policy of being carbon neutral by 2030 – hopefully sooner – the Council can now work extensively towards this target. From using weed […] Read more »\nNWW Green Party Update 2nd July 2019 / 19th March 2024 by harrietking Tom Maclean has currently resigned from the position of our Chairperson in our North West Wales Green Party Committee. We would like to thank him for all he has done and wish him well. Rachael Ayres who was the joint chairperson has now stepped in and taken over the day to day running of the […] Read more »\nDenbighshire For Europe 26th June 2019 / 19th March 2024 by harrietking The North West Wales Green Party will be taking part in the launch for Denbighshire For Europe a grass roots cross-party and no-party campaign organisation supporting Wales to remain in Europe. The launch is in Denbigh in the Eiranfa Centre starting at 7pm on the 5th of July. The Green Party have campaiged for a […] Read more »\nDenbighshire County Council Climate Emergency 26th June 2019 / 19th March 2024 by harrietking On Saturday the 29th of June at 1pm in Ruthin Extinction Rebellion will be holding a protest requesting that Denbighshire County Council declare a Climate Emergency. We are in full support of this request and will be at the protest to show our continued solidarity. North Wales has great opportunity to use this to revolutionise […] Read more »\nTrashTag Colwyn Bay 20th June 2019 / 19th March 2024 by harrietking Are you up for the #Trashtag Challenge? Join us on 13th July at 1pm for a clean up of the Civic Centre in Eirias Park! Read more »\nExtinction Rebellion North Wales March in Conwy 11th May 2019 / 19th March 2024 by harrietking Extinction Rebellion March Conwy We joined Extinction Rebellion North Wales in Conwy to show support for Conwy Council to declare a climate emergency. Here are the some photos from the march Read more »\nPublic Bin Recycling Denbighshire 27th April 2019 / 19th March 2024 by harrietking We joined up with the North West Green Party Group, here is our joint letter to Denbighshire County Council after it had been made aware to us that Public Bins in Denbighshire are not sorted for recycling. Read more »\nAnthony Slaughter – School Cuts, High Streets and Coastal Communities 27th April 2019 / 19th March 2024 by harrietking Read more » anthonyslaughter climate crisis coastal community highstreet schoolcuts\nOpen Day in Colwyn Bay 27th April 2019 / 19th March 2024 by harrietking Our AGM on 7th of April was a great day with plenty to watch and take part in discussion. Harriet gave a presentation on local politics and the differences between Town and County Councillors, AM’s and MP’s as well as devolved issues that a governed by Wales. We also had videos from Alex Harris Town […] Read more »",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_author_green-party-admin/content_26.html": "Credwn Yn Annibyniaeth Cymru // We Believe In Welsh independence\nCroeso i dudalen swyddogol Plaid Werdd Gogledd Orllewin Cymru! Mae’r Blaid Werdd yn wahanol – ry’n ni’n fudiad llawr gwlad sydd eisiau gwanhau polisïau llymder ac effaith andwyol cyllid ar wleidyddiaeth.\nCredwn ni bod polisïau lles cymdeithasol cryf yn angenrheidiol i gynnal cymdeithas rydyn ni eisiau byw ynddi, a bod addysg dda, amgylchedd iach ac arweinyddiaeth ag uniondeb yn ddigon bosibl i’w gyflawni gydag ewyllys wleidyddol gadarn.\nMae Cymru yn haeddu gwell a byddwn yn ymgyrchu dros Gymru annibynnol. Dyma’r unig ddyfodol a fydd yn caniatáu inni adeiladu’r gymdeithas decach sydd ei hangen arnom, heb gael ein cyfyngu gan yr hyn y mae San Steffan ei eisiau.\nOs ydych chi’n byw yn Ynys Môn, Arfon, Aberconwy neu Dwyfor Meirionnydd (Tip y Llyn i Sir Ddinbych) ymunwch a ni ar gyfer un o’n digwyddiadau – i rannu syniadau, holi cwestiynau ac ymuno a’r drafodaeth.\nWelcome to the official page of the North West Wales Green Party! The Green Party is different – we are a genuine grass-roots movement of individuals who believe that there are alternatives to austerity and to the toxic influence of finance on our political system.\nWe believe that social welfare should provide a real and valuable safety net, and that education, clean air, publicly-owned healthcare and leadership with integrity are achievable aims and should be at the heart of political debate.\nWales deserves better and we will campaign for an independent Wales. It’s the only future that will allow us to build the fairer society we need, without being restricted by what Westminster wants.\nIf you live in Anglesey, Arfon, Aberconwy or Dwyfor Meirionnydd constituencies (Tip of the Llyn to Denbighshire) join us at one of our upcoming events – to share ideas, ask questions and join the discussion.\nWe are the only party dedicated to fighting for our environment and ensuring we live in a fair and just society\nJoin us at one of our next events – You don’t have to be a member either",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2025_02_06_the-welsh-government-must-up-its-game-for-nature-restoration/content_9.html": "The Welsh Government has been heavily criticised by a key Senedd Committee over its responses to the Nature Emergency in Wales that was declared by the Senedd in 2021.\nThe Climate Change, Environment and Infrastructure Committee’s report published in January 2025 said that commitments made by the Government to nature restoration in Wales must be supported by a clear plan for action and delivery backed by the necessary resources. The Committee, made up of representatives of all parties in the Senedd, found a lack of urgency saying: ‘If the Welsh Government is to deliver on its commitments for nature it needs to up its game, because nature can’t wait for it to catch up.’\nTo remind ourselves of the importance of nature: it is our life support system. Without nature, we humans could not survive. Nature is a complex system made up of all living things together with the chemical and physical structure of the Earth. As far as we know, Earth is the only planet we could freely live on. Anywhere else we would have to carry our life support with us.\nToo many people in high and powerful positions prefer to ignore this. They take nature for granted and dismiss concerns for its welfare as a luxury matter that can be dealt with when the ‘economy is fixed’. The economy though is heavily dependent on nature. Nature provides a stable environment for the economy to operate in, it provides the conditions for growing the food economic actors need, it supplies the water they need, the oxygen they need. It supplies the materials the economy needs to function. Without nature there is no economy.\nNature is the bedrock on which the economy is built and nature is under great stress and in places is breaking down. Symptoms of this breakdown are the changing climate caused in part by a buildup of carbon dioxide beyond the capacity of nature to absorb, and the pollution that overwhelms nature’s self cleaning capacity. Also the decline and extinction of species due to the activities of the economy that robs them of their own support system.\nIf this breakdown continues, and current national and international policies will ensure that it does continue, human beings will pay a very heavy price. Adequate food production will become more difficult, clean water will become scarcer, air will become damaging to health, pests and disease will spread and threaten health. The psychological impact of degrading wildlife will take its toll on mental health.\nMuch of this has been recognised by the UK and Welsh governments and both have made commitments, but words are cheap. What is urgently needed now, as the Senedd Committee spells out, is action backed by resources. Restoring nature is not a luxury that can wait. We all have a role to play, landowners and farmers, business, government and the general public. We need to find the good will to work together to address the Nature Emergency for our own sakes and that of future generations. Delaying action as the government is doing, is unacceptable.\nMike Shipley January 2025",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_tag_coastal/content_21.html": "Anthony Slaughter – School Cuts, High Streets and Coastal Communities 27th April 2019 / 19th March 2024 by harrietking Read more » anthonyslaughter climate crisis coastal community highstreet schoolcuts",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_local-group-update/content_80.html": "17th March 2025 / 17th March 2025 by harrietking\nThe weather was gorgeous this Saturday our AGM attendees had the opportunity to explore the beautiful Treborth Gardens where the event was being held. The day started with the election of the committee and I am pleased to say that we have filled the below roles however we do still have committee roles to fill […]\nRead more »\n21st December 2023 / 29th March 2024 by harrietking\nA vacancy has arisen for an Elections Officer just as we are about to start our General Election campaign next year which is a great time to get involved. Support for the Green Party is getting stronger each year and with your help, we can help make a stronger presence here in North Wales. The […]\n25th April 2023 / 29th March 2024 by harrietking\nIn 2023 the new boundary changes are being finalised where Wales will loose 8 seats in total, which means that your local MP when elected will represent a larger area in some parts of North Wales. In the Green Party we believe in local politics for local areas where your representative in any form of […]\n14th April 2022 / 29th March 2024 by harrietking\nThis May 5th you can vote for the largest amount of Green candidates in North West Wales! We are standing all across from Ruthin to Anglesey. If you would like to get involved in our campaign, contact us now! ————————————————————————- Ar y 5ed o Fai yma gallwch bleidleisio dros y nifer fwyaf o ymgeiswyr Gwyrdd […]\n2nd July 2019 / 19th March 2024 by harrietking\nTom Maclean has currently resigned from the position of our Chairperson in our North West Wales Green Party Committee. We would like to thank him for all he has done and wish him well. Rachael Ayres who was the joint chairperson has now stepped in and taken over the day to day running of the […]",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_denbighshire/content_50.html": "9th September 2019 / 19th March 2024 by harrietking\nThs Sunday Harriet spoke at the DenbighshireForEurope rally in Ruthin, along with other party representaves from the Lib Dems, Plaid and Labour. She spoke about how Citizens Assembleys can bring a local voice to Westminster so that views from all parts the local community can be heard and belives these are the way forward to […]\nRead more »\n11th August 2019 / 19th March 2024 by harrietking\nWe’ve had a great day visiting Bryn Cocyn Organic Farm just outside Denbigh. We met in the garden where the smell of Lavender filled the air and the sound and sights of honey bees, bumble bees and various butterflies around us. We explored the polytunnel, vegetable plots and Orchard, Saw the apple press where they […]\n2nd July 2019 / 19th March 2024 by harrietking\nToday Denbighshire County Council has declared a Climate Emergency – exciting news for the future of the county and a critical step forward to securing a sustainable Wales. Having now adopted a policy of being carbon neutral by 2030 – hopefully sooner – the Council can now work extensively towards this target. From using weed […]\n26th June 2019 / 19th March 2024 by harrietking\nThe North West Wales Green Party will be taking part in the launch for Denbighshire For Europe a grass roots cross-party and no-party campaign organisation supporting Wales to remain in Europe. The launch is in Denbigh in the Eiranfa Centre starting at 7pm on the 5th of July. The Green Party have campaiged for a […]\nOn Saturday the 29th of June at 1pm in Ruthin Extinction Rebellion will be holding a protest requesting that Denbighshire County Council declare a Climate Emergency. We are in full support of this request and will be at the protest to show our continued solidarity. North Wales has great opportunity to use this to revolutionise […]",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_06_26_denbighshire-for-europe/content_17.html": "The North West Wales Green Party will be taking part in the launch for Denbighshire For Europe a grass roots cross-party and no-party campaign organisation supporting Wales to remain in Europe. The launch is in Denbigh in the Eiranfa Centre starting at 7pm on the 5th of July.\nThe Green Party have campaiged for a Peoples Vote after the referendum result giving the public a final say on the proposed deal.\nJonathan Bartley Co Leader of the Green Party visited Holyhead and gave a speech about the effects Brexit would have on Wales.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_04_27_692/content_65.html": "We joined up with the North West Green Party Group, here is our joint letter to Denbighshire County Council after it had been made aware to us that Public Bins in Denbighshire are not sorted for recycling.\nWe joined up with the North West Green Party Group, here is our joint letter to Denbighshire County Council after it had been made aware to us that Public Bins in Denbighshire are not sorted for recycling.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_ros-griffith-williams-county-councillor/content_61.html": "Skip to content\nSkip to footer\nNorth West Wales\nMenu\nNews\nAGM Event\nGeneral Election\nElected Greens\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nRos Griffith-Williams County Councillor\nRos Griffith-Williams County Councillor\nRos Griffiths-Williams – Conwy County Councillor\nContact\nTwitter\nFacebook\nTo top",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_10_13_trashtag-cleaning-the-dingle-in-colwyn-bay/content_38.html": "This Saturday we along with volunteers cleaned 150kg of waste from the Dingle in Colwyn Bay. This beautiful little stream which runs through the centre of Colwyn Bay was full of plastic as well as a shopping trolley and sadly syringes.\nBy cleaning the Dingle we have saved waste from entering the Bay and then into the Sea.\nAmong the volunteers was Brian Laing who is our candidate in the upcoming Rhiw Town Council by Election, he wants to improve the area by the Dingle by placing more litter bins along the route.\nYou can see what he had to say in the video below.\nA massive thank you to all volunteers who helped this Saturday",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2022_04_14_local-election-candidates-in-north-west-wales-announced/content_44.html": "This May 5th you can vote for the largest amount of Green candidates in North West Wales!\nWe are standing all across from Ruthin to Anglesey.\nIf you would like to get involved in our campaign, contact us now!\n————————————————————————-\nAr y 5ed o Fai yma gallwch bleidleisio dros y nifer fwyaf o ymgeiswyr Gwyrdd yng Ngogledd Orllewin Cymru!\nRydym yn sefyll ar draws o Rhuthun i Ynys Môn.\nOs hoffech chi gymryd rhan yn ein hymgyrch, anfonwch neges atom nawr!",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_general-election/content_86.html": "5th July 2024 / 21st February 2025 by harrietking\n6 weeks of campaigning is over, the ballots have been counted and a new government is in power! Over the 6 weeks, Greens from North West have been busy at hustings, sharing online content and spreading the Green message. Harriet the Chair of the North West Wales Green Party expressed “How proud she was of […]\nRead more »\n26th March 2024 / 29th March 2024 by harrietking\nIn this election everyone in North West Wales will be given a chance to vote Green. We are standing candidates across all our constituencies including Ynys Mon, Dwyfor Meirionnydd and Bangor Aberconwy and Clwyd North. You will have an opportunity to hear more about the General Election candidate and be able to ask them questions […]",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_07_02_nww-green-party-update/content_40.html": "Tom Maclean has currently resigned from the position of our Chairperson in our North West Wales Green Party Committee.\nWe would like to thank him for all he has done and wish him well.\nRachael Ayres who was the joint chairperson has now stepped in and taken over the day to day running of the group and after a Special Committee Meeting Rod Armstrong was elected to become her Co-Chair.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_anthony-slaughter/content_41.html": "5th February 2024 / 29th March 2024 by harrietking\nThe AGM in Menai Bridge was a great success even if we say so ourselves. It was also the launch of our General Election candidate for Ynys Mon – Martin Schwaller. Both Martin & Anthony took questions from the attendees on various topics from Agriculture Policies to Child poverty rates on the Island and of […]\nRead more »\n28th July 2023 / 29th March 2024 by harrietking\nWe’d like to say a big ‘diolch o galon’ to Anthony Slaughter – Wales Green Party Leader for coming to northwest Wales this weekend. We had such an inspiring day of activism yesterday, including a beach clean, tree planting and meeting with local residents in Dyffryn Arduwdy and Llanbedr. We visited a community land project […]\n27th April 2019 / 19th March 2024 by harrietking\nOur AGM on 7th of April was a great day with plenty to watch and take part in discussion. Harriet gave a presentation on local politics and the differences between Town and County Councillors, AM’s and MP’s as well as devolved issues that a governed by Wales. We also had videos from Alex Harris Town […]",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2025_03_17_chairs-report-agm-2025/content_55.html": "It seems this year is the year of the Lords, with both Green Party Baronesses having now been for a visit to the wonderful place we call home. North Wales.\nNorth Wales was also the home of the Wales Green Party conference this year, which was great to attend, and a thank you to everyone who did.\nNatalie Bennett and Anthony Slaughter visited, arranged by Martin Schwaller, for a Talk & Q&A, which went down to a great success in Llangoed village hall.\nAt the heart of North Wales in Snowdonia in the village of Llanberis is where we have targetted our campaigns this year with Dewi our candidate standing in the council elections and achieving a very respectable 2nd place which we were all very pleased with. It was an excellent campaign helped by Wales Green Party Volunteers and not forgetting the fantastic community support also.\nI am proud of all the dedication our volunteers and committee have put in the last year and how well we are working closer with North East Wales since the general election campaign.\nWe have a lot to plan for the future, such as our Senedd Election in 2026, where we are fundraising currently to help us stand candidates and the next Council Elections in 2027.\nWe know people want the change, and I see that one of the biggest challenges this next year is raising awareness of the potential loss of public services such as housing, dentists, libraries and public toilets if we don’t start to get the money funding from Senedd and beyond.\nWe need to spread the knowledge that we need better wealth equality, which affects all layers of politics and everyone’s pockets.\nMost importantly, to need to ensure that minority groups such as the refugees that Croeso Menai our Guest Speakers at the AGM support are not laid to blame for the lack of investment we have as a country.\nSome aspects we have improved on this year are fundraising, having created this ticketed event, and we will soon be launching a crowdfunder for the Senedd Elections. For the next term, I feel we need to ensure we speak to our members more on the phone for maximum engagement.\nTo do this, we rely on volunteers, so if you can spare a couple of hours a month to ensure we can run our local party, we would greatly appreciate it.\nFinally, I’d like to note what an honour it is to chair and be part of the North West Wales Green Party and thanks once again for everyone’s dedication, time and commitment. Diolch Yn Fawr Pawb.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_denbighshire-county-council/content_90.html": "26th June 2019 / 19th March 2024 by harrietking\nOn Saturday the 29th of June at 1pm in Ruthin Extinction Rebellion will be holding a protest requesting that Denbighshire County Council declare a Climate Emergency. We are in full support of this request and will be at the protest to show our continued solidarity. North Wales has great opportunity to use this to revolutionise […]\nRead more »\n27th April 2019 / 19th March 2024 by harrietking\nWe joined up with the North West Green Party Group, here is our joint letter to Denbighshire County Council after it had been made aware to us that Public Bins in Denbighshire are not sorted for recycling.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2023_04_25_1167/content_64.html": "In 2023 the new boundary changes are being finalised where Wales will loose 8 seats in total, which means that your local MP when elected will represent a larger area in some parts of North Wales.\nIn the Green Party we believe in local politics for local areas where your representative in any form of government really gets to know the local community which we think is harder to achieve with covering such a large area.\nDue to this change, we have had to adjust the areas covered by our group.\nWe have had to say goodbye to the members and supporters in North Wales who reside in the county area of Denbighshire who will be transferred to the North East Wales Group.\nIf you live the area which North West Wales now cover you are still welcome to choose to receive updates from us and attend our meetings either online or in person.\nWe may be loosing Denbighshire but we are gaining Dwyfor Meirionnydd, meaning that we now cover the current constituency areas of Aberconwy, Ynys Mon, Dwyfor Meirionydd and Arfon.\nWe are having a social gathering in May in Pen Y Bont Pub in Abergele, if you have any questions you can pop down or send us a message on the contact us page\nYou can read more about the changes on the links belowUK Parliament Boundary Changes\nBoundary Commission for Wales\nYn 2023 mae’r newidiadau ffiniau newydd yn cael eu cwblhau lle bydd Cymru yn colli cyfanswm o 8 sedd, sy’n golygu y bydd eich AS lleol pan gaiff ei ethol yn cynrychioli ardal fwy mewn rhai rhannau o Ogledd Cymru.\nYn y Blaid Werdd rydym yn credu mewn gwleidyddiaeth leol ar gyfer ardaloedd lleol lle mae eich cynrychiolydd mewn unrhyw fath o lywodraeth wir yn dod i adnabod y gymuned leol sydd, yn ein barn ni, yn anoddach ei chyflawni gydag ardal mor fawr.\nOherwydd y newid hwn, rydym wedi gorfod addasu’r meysydd a gwmpesir gan ein grŵp.\nRydym wedi gorfod ffarwelio ag aelodau a chefnogwyr Gogledd Cymru sy’n byw yn ardal sir Ddinbych a fydd yn cael eu trosglwyddo i Grŵp Gogledd Ddwyrain Cymru.\nOs ydych yn byw yn yr ardal y mae Gogledd Orllewin Cymru bellach yn ei chwmpasu mae croeso o hyd i chi ddewis derbyn diweddariadau gennym ni a mynychu ein cyfarfodydd naill ai ar-lein neu wyneb yn wyneb.\nEfallai ein bod yn colli Sir Ddinbych ond rydym yn ennill Dwyfor Meirionnydd, sy’n golygu ein bod bellach yn cwmpasu ardaloedd etholaethol bresennol Aberconwy, Ynys Môn, Dwyfor Meirionydd ac Arfon.\nRydym yn cynnal cyfarfod cymdeithasol ym mis Mai yn Nhafarn Pen Y Bont yn Abergele, os oes gennych unrhyw gwestiynau gallwch bicio lawr neu anfon neges ar y dudalen cysylltu â ni\nGallwch ddarllen mwy am y newidiadau ar y dolenni isodNewidiadau i Ffiniau Senedd y DU\nComisiwn Ffiniau i Gymru",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_iolo-jones-llanfairfechan/content_83.html": "6th July 2019 / 19th March 2024 by harrietking\nLlanfairfechan now has 6 water re-fill stations thanks to Iolo Jones their Town Councillor. Iolo has been asking business in the area to allow people to refill their water bottles for free to help reduce plastic waste in the community. Each business has a sign on display in the window to let you know they […]\nRead more »\n27th April 2019 / 19th March 2024 by harrietking\nSpace to get away from it all, to create, to socialize, to learn new skills, to pass on crafts. These are the objectives of the Llanfairfechan community shed, a new group in the village aiming to bring people together over practical projects. At the heart of our ambition is acting in kind; that is, sharing […]",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2019_09_21_climate-strike-colwyn-bay/content_11.html": "Yesterday on the 20th of September we joined the school children of Colwyn Bay and Bangor at the Global Climate Strike. In Colwyn Bay Adam our Campaigns Officer gave a rabel rousing speech about the change needed to protect our planet and humanity.\nIt was such an inspiration watching the Children defend their future, and heart-warming to know that all around the world Children just like them were united all around the world.\nIn Bangor, the strikers were joined by Iolo Jones Green Party Town Councillor in Llanfairfechan, where the passionate children did all the talking and they were fantastic.\nIolo Jones Town Councillor Llanfairfechan at the Global Climate Strike in Bagor",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_carers/content_88.html": "27th April 2019 / 19th March 2024 by harrietking\nOur AGM on 7th of April was a great day with plenty to watch and take part in discussion. Harriet gave a presentation on local politics and the differences between Town and County Councillors, AM’s and MP’s as well as devolved issues that a governed by Wales. We also had videos from Alex Harris Town […]\nRead more »",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_news_page_2/content_31.html": "Local Party Chair – AGM Report 2024 6th February 2024 / 29th March 2024 by harrietking 172 Activists in total across North West Wales around 20-30 more than we had last year. Changes to the area over the last year took on Dwyfor Meirionnydd but lost part of Denbighshire. We now cover from the Llyn, across to Conwy and including Ynys Mon constituency-wise that’s Dwyfor Meirionnydd, Aber Conwy, Afron and Ynys […] Read more »\nMorlais Tidal Energy Project Visit 6th February 2024 / 29th March 2024 by harrietking The day following our AGM in Menai Bridge a large group of us were pleased to be hosted by Menter Môn. In particular we were there to see the Anglesey Morlais Tidal Energy project that Menter Môn are bringing to fruition. The project, near Ynys Lawd (South Stack) is a fine example of a very […] Read more »\nMenai Bridge AGM with Sian Sykes SAS & Anthony Slaughter WGP Leader 5th February 2024 / 29th March 2024 by harrietking The AGM in Menai Bridge was a great success even if we say so ourselves. It was also the launch of our General Election candidate for Ynys Mon – Martin Schwaller. Both Martin & Anthony took questions from the attendees on various topics from Agriculture Policies to Child poverty rates on the Island and of […] Read more »\nVolunteer Opportunity – Elections Officer Vacancy 21st December 2023 / 29th March 2024 by harrietking A vacancy has arisen for an Elections Officer just as we are about to start our General Election campaign next year which is a great time to get involved. Support for the Green Party is getting stronger each year and with your help, we can help make a stronger presence here in North Wales. The […] Read more »\nWales Green Party Leader Visits Dyffryn Arduwdy 28th July 2023 / 29th March 2024 by harrietking We’d like to say a big ‘diolch o galon’ to Anthony Slaughter – Wales Green Party Leader for coming to northwest Wales this weekend. We had such an inspiring day of activism yesterday, including a beach clean, tree planting and meeting with local residents in Dyffryn Arduwdy and Llanbedr. We visited a community land project […] Read more »\nBike Ride From Bethesda to Llyn Ogwen 16th July 2023 / 29th March 2024 by harrietking eryone who came along to our social in Bethesda today! And special thanks to Beics Ogwen for providing the amazing electric bikes. We’re supporting the proposal to build a cycleway between Bethesda and Bangor, so everyone can enjoy this fun, easy and sustainable way of getting around. We really enjoyed meeting everyone who attended and […] Read more »\nChanges to our constituency areas 25th April 2023 / 29th March 2024 by harrietking In 2023 the new boundary changes are being finalised where Wales will loose 8 seats in total, which means that your local MP when elected will represent a larger area in some parts of North Wales. In the Green Party we believe in local politics for local areas where your representative in any form of […] Read more »\nAGM Follow Up & New Committee Announced 25th October 2022 / 29th March 2024 by harrietking It’s been nearly a week since the AGM and we are still in awe of Dani Robertson’s talk on Dark Skies in Snowdonia! It really was a fascinating talk full of facts such as only 2% of the UK is classed as a Dark Sky Area, what we can do to improve lighting, how artificial […] Read more »\nLocal Election Candidates in North West Wales Announced 14th April 2022 / 29th March 2024 by harrietking This May 5th you can vote for the largest amount of Green candidates in North West Wales! We are standing all across from Ruthin to Anglesey. If you would like to get involved in our campaign, contact us now! ————————————————————————- Ar y 5ed o Fai yma gallwch bleidleisio dros y nifer fwyaf o ymgeiswyr Gwyrdd […] Read more »\nRejecting prejudice to create a trans-inclusive Green Party 14th March 2022 / 19th March 2024 by harrietking Following a vote at a meeting of North West Wales Green Party, the party would like to publish the below statement in unequivocal support of trans rights. Motion: That North West Wales Green Party adopts and publicises the following statement, and undertakes the actions described within it. Social justice is of paramount importance to North […] Read more »",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2024_09_17_trawsfynydds-legacy/content_33.html": "The nuclear reactor\nConstruction of the Trawsfynydd Magnox Nuclear Power Station in Eryri National Park began in 1959 and was completed in 1965. It is one of 26 Magnox stations built in the 1950’s to 1970’s. They were developed as dual function reactors, able to produce plutonium for nuclear weapons as well as electricity. [1]\nTo date,Trawsfynydd is the only inland nuclear powerstation in the UK, using Llyn Trawsfynydd as its source of cooling water. This reservoir was originally built in 1926 to supply water to the Maentwrog hydroelectric plant that remains in operation. [2]\nThe Trawsfynydd site, including the lake and the hydroelectric plant, is owned by Magnox Ltd, rebranded as Nuclear Restoration Services, a subsidiary of the UK Nuclear Decommissioning Authority, [NDA]. [3]\nDecommissioning\nGeneration at Trawsfynydd stopped in 1991 after 26 years and decommissioning the plant commenced in 1993, defueling was completed by 1997 with fuel elements removed from the site and transported to Sellafield for reprocessing. [4]\nThe original plan for the nuclear station was to allow the radioactivity of the core to naturally decay and cool, making it cheaper and easier to finally demolish the reactor buildings and return the site to its original state. The Care and Maintenance phase was to last around 60 or more years from closure. This timetable was abandoned in 2019 when it was found that the Trawsfynydd reactor buildings were deteriorating and could not be relied on to remain safe for this length of time. The decommissioning programme has had to be considerably accelerated with currently unknown impacts of the full costs of the clean-up. [5]\nIt is not possible to get any realistic estimate of the full cost of making safe and restoring any given nuclear site. The NDA acknowledges that it still does not have full understanding of the condition of the 17 sites across its estate, including the 10 former Magnox power stations. The Parliamentary Public Accounts Committee have described this inability to put a figure on the cost to the public purse for decommissioning as a ‘Sorry Saga’. Safely dismantling the current nuclear stations will cost generations of UK taxpayers an unknown sum likely to stretch to well over £100 billion. [6]\nThe Trawsfynydd site is described as the ‘lead and learn’ site for decommissioning the Magnox reactors and lessons learned and costs will be applied to all 26 Magnox reactors in the UK. [5] It is important that the learning process and clean up techniques includes the whole site and is not just limited to the perimeter of the reactor buildings. For this to happen it is necessary for the Nuclear Decommissioning Authority and all involved to both understand and acknowledge the extent of contamination of the whole Trawsfynydd site including the lake.\nRadioactive Contamination\nDuring its operational phase Trawsfynydd was licensed to vent gaseous radioactive waste, mostly carbon dioxide, to the atmosphere and also liquid radioactive waste to the lake, including water from the cooling ponds. [7]\nThe site contains known areas of radioactive and non-radioactive contaminated land and groundwater, resulting primarily from the generation phase of the station’s life. [8]\nIn addition to this historic contamination of the site, Nuclear Restoration Services are proposing dumping contaminated rubble from the urgent demolition work on the reactor building into the now redundant cooling ponds. The Nuclear Free Local Authorities of Wales have expressed their concern over this plan and are demanding that this rubble be contained within purpose built and properly shielded containment fearing that the old cooling ponds would leak further contamination into the ground and lake. [9]\nMaentwrog Community Council expressed concerns many years ago about contamination of the Trawsfynydd site and about the cooling ponds that have been leaking since the 1970’s. They were told in 2006 that there would be borehole analysis to determine the extent of groundwater contamination, to date no such report has been published. [10]\nThe fact that the cooling ponds leak has been confirmed by Magnox itself in a Strategic Environmental Assessment in 2014. Their report states: ‘The radioactive land and groundwater contamination is associated with leakage from the ponds during the 1970s/80s, due to a joint weakness in the pond structure. Extensive (9500m3 ) sub-surface low level radioactive land contamination has resulted.’ [8]\nMaentwrog Community Council in their written evidence to the Wales Parliamentary Committee in 2016 also expressed their concern that plutonium particles had been documented as present in the lake sediment. [10] It has not been possible to confirm the presence of plutonium through a literature search. Monitoring for radiation at the site has used gamma ray detectors, but plutonium is a very weak emitter of gamma rays so would not be detected in lake sediments using geiger counters on the surface. [7, page 7]\nHealth Risks\nThe presence of plutonium in the lake sediments adds to the concern that emissions from the nuclear plant, even though they were properly permitted, could be building up in the local environment, including food chains. Health effects of low level doses of radiation have long been a controversial subject. Canadian-American scientist Dr Rosalie Bertell researched the incidents and possible long term effects of radiation from nuclear weapons testing and the civil nuclear programme in the 1970’s publishing a book ‘No Immediate Danger’ in 1985 which documented the risks. [11] Her work was largely ignored and many nuclear physicists tried to debunk her work and her qualifications to question their assurances that there was no risk. There were even attempts on her life that caused her to move from the USA to Canada. [12]\nIn 2006, walking in Dr Bertell’s footsteps, Dr Chris Busby and others published a paper claiming to find a cluster of cancer cases associated with the Trawsfynydd reactor. [13 ] After this work was aired on a television programme in Wales in 2006 it was heavily criticised by the Welsh Cancer Intelligence and Surveillance Unit and other nuclear scientists who claimed that his work was flawed. Others thought differently including Michael Meacher, a former Environment minister in the Blair Government. He called on Health specialists to take the statistics seriously and called for a full public enquiry on the issue of long term nuclear safety and the impacts of low level radiation before any further nuclear plants were built. [14]\nNorth Wales Live reported Dr Busby’s findings and questioned the relevant health officials, who were reluctant to comment, just saying that the matter would be considered elsewhere. Public Health Wales responded that they could consult with expert bodies if concerns were raised but at that time there were no ‘no ongoing investigations into cancer clusters in the Trawsfynydd area.’\n[15]\nThe Western Mail called on the Health Authorities to publish its own study of all the available data rather than simply dismissing Busby’s work. Dr Busby had been unable to review all of the relevant data. [14]\nPlaid Cymru councillor and cancer patient Linda Ann Jones is a councillor for Tegil ward, Llan Festiniog, north of Trawsfynydd. She has listened to concerns of local people about emissions from the nuclear station over many years, well before Busby’s report. Jones has urged the UK government to consider the survey’s results seriously and to launch an investigation into the risks posed to local communities by nuclear power plants before allowing new plants to be built. [14]\nConclusion.\nThe Green Party does not support further use of nuclear power for the generation of electricity. If honest and open accounting was used, nuclear power would be seen as a very expensive option for generating energy and it leaves a very costly legacy of waste and contamination. The culture of secrecy and misinformation, driven by the military nuclear programme, must end for the civil use of nuclear technology. The long term health effects of low level radiation and the robustness of current safety standards needs to be properly researched by independent scientists rather than those dependent on the nuclear industry for their livelihood. While Dr Busby’s work may be questioned, due in part to the withholding of relevant data from his research, the concerns that he and Councillor Jones have raised must be taken seriously by the relevant Health Authorities and the governments of Wales and the UK. To casually state that ‘no ongoing studies…’ are being carried out is unacceptable.\nReferences\n- https://en.wikipedia.org/wiki/Magnox#Reactors_built\n- https://en.wikipedia.org/wiki/Maentwrog_power_station\n- Major nuclear company rebrands as ‘Nuclear Restoration Services’ – GOV.UK\n- Trawsfynydd | Office for Nuclear Regulation.\n- The Nuclear Decommissioning Authority’s Annual Report 2022/3\n- “Sorry saga” of disused nuclear sites will cost generations of UK taxpayer – Committees\n- Radiological Habits Survey: Trawsfynydd, 2018\n- Trawsfynydd Site Strategic Environmental Assessment Site Specific Baseline\n- Too short, ill-timed and clumsy: Welsh NFLAs critical of Trawsfynydd consultation\n- https://committees.parliament.uk/writtenevidence/65314/html/\n- No Immediate Danger, Rosalie Bwertewll, Thue Women’s Press ISBN 0-7043-2846-1\n- https://en.wikipedia.org/wiki/RosalieBertell\n- https://www.llrc.org/llrc/epidemiology/subtopic/trawsrept.pdf\n- https://www.wiseinternational.org/book/export/html/3267\n- Trawsfynydd Nuclear Power Station ‘responsible for elevated risk of cancer,’ claims academic – North Wales Live",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_2025_02_21_agm-event-with-baroness-jenny-jones-croeso-menai/content_34.html": "Croeso Menai is a local charity that helps refugees make North Wales their home and we are proud that we can host an event to raise awareness of their wonderful work.\nGreen Party Baroness Jenny Jones will be giving a talk where you can ask for the latest info from the House of Lords and the impacts Green Voices in the movement are making\nThe AGM is also an opportunity for you to elect your local Green Party committee who run your local party – the roles available are Local Party Chair / Co-ordinator, Treasurer, Secretary, Elections Officer and Social Media.\nThe event starts at 12:30 pm, light refreshments will also be available.\nPrice – The event is free however please feel free to make a donation\nHow to get here\nBus – X4, 4A, 57 62 run from Bangor Rail Station\nTrain – Bangor Station\nCar – Treborth Botanical Gardens LL57 2RQ\nOnline – The event will be available online via Zoom\nAgenda\nWelcome & Apologies\nTreasurer’s Report\nChairs Report – Members\nCroeso Menai – Guest Speaker\nBaroness Jenny Jones – Guest Speaker\nVacancies/Election of Officers\nQ&A\nIf you have any questions please email contact@northwest.greenparty.wales\nElusen leol yw Croeso Menai sy’n helpu ffoaduriaid i wneud Gogledd Cymru yn gartref iddynt ac rydym yn falch y gallwn gynnal digwyddiad i godi ymwybyddiaeth o’u gwaith gwych.\nBydd Barwnes y Blaid Werdd Jenny Jones yn rhoi sgwrs lle gallwch ofyn am y wybodaeth ddiweddaraf gan Dŷ’r Arglwyddi a’r effeithiau y mae Lleisiau Gwyrdd yn y mudiad yn eu cael\nMae’r Cyfarfod Cyffredinol Blynyddol hefyd yn gyfle i chi ethol eich pwyllgor Plaid Werdd lleol sy’n rhedeg eich plaid leol – y rolau sydd ar gael yw Cadeirydd/Cydlynydd Plaid Leol, Trysorydd, Ysgrifennydd, Swyddog Etholiadau a Chyfryngau Cymdeithasol.\nMae’r digwyddiad yn dechrau am 12:30pm, bydd lluniaeth ysgafn ar gael hefyd.\nPris – Mae’r digwyddiad am ddim ond mae croeso i chi wneud cyfraniad\nSut i gyrraedd yma\nBws – X4, 4A, 57 62 yn rhedeg o Orsaf Reilffordd Bangor\nTrên – Gorsaf Bangor\nCar – Gerddi Botaneg Treborth LL57 2RQ\nAr-lein – Bydd y digwyddiad ar gael ar-lein trwy Zoom\nAgenda\nCroeso ac Ymddiheuriadau\nAdroddiad y Trysorydd\nAdroddiad y Cadeirydd – Aelodau\nCroeso Menai – Siaradwr Gwadd\nY Farwnes Jenny Jones – Siaradwr Gwadd\nSwyddi Gwag / Ethol Swyddogion\nHoli ac Ateb\nOs oes gennych unrhyw gwestiynau e-bostiwch contact@northwest.greenparty.wales",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_category_conference/content_57.html": "8th October 2019 / 19th March 2024 by harrietking\nThis year’s England and Wales Conference was in Newport and 3 members from our group attended over the weekend. Conference is a great opportunity to be involved in policy making where you support or oppose motions and really define how you want your political party to be. As well plenary you can talk part in […]\nRead more »",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk/content_23.html": "Credwn Yn Annibyniaeth Cymru // We Believe In Welsh independence\nCroeso i dudalen swyddogol Plaid Werdd Gogledd Orllewin Cymru! Mae’r Blaid Werdd yn wahanol – ry’n ni’n fudiad llawr gwlad sydd eisiau gwanhau polisïau llymder ac effaith andwyol cyllid ar wleidyddiaeth.\nCredwn ni bod polisïau lles cymdeithasol cryf yn angenrheidiol i gynnal cymdeithas rydyn ni eisiau byw ynddi, a bod addysg dda, amgylchedd iach ac arweinyddiaeth ag uniondeb yn ddigon bosibl i’w gyflawni gydag ewyllys wleidyddol gadarn.\nMae Cymru yn haeddu gwell a byddwn yn ymgyrchu dros Gymru annibynnol. Dyma’r unig ddyfodol a fydd yn caniatáu inni adeiladu’r gymdeithas decach sydd ei hangen arnom, heb gael ein cyfyngu gan yr hyn y mae San Steffan ei eisiau.\nOs ydych chi’n byw yn Ynys Môn, Arfon, Aberconwy neu Dwyfor Meirionnydd (Tip y Llyn i Sir Ddinbych) ymunwch a ni ar gyfer un o’n digwyddiadau – i rannu syniadau, holi cwestiynau ac ymuno a’r drafodaeth.\nWelcome to the official page of the North West Wales Green Party! The Green Party is different – we are a genuine grass-roots movement of individuals who believe that there are alternatives to austerity and to the toxic influence of finance on our political system.\nWe believe that social welfare should provide a real and valuable safety net, and that education, clean air, publicly-owned healthcare and leadership with integrity are achievable aims and should be at the heart of political debate.\nWales deserves better and we will campaign for an independent Wales. It’s the only future that will allow us to build the fairer society we need, without being restricted by what Westminster wants.\nIf you live in Anglesey, Arfon, Aberconwy or Dwyfor Meirionnydd constituencies (Tip of the Llyn to Denbighshire) join us at one of our upcoming events – to share ideas, ask questions and join the discussion.\nWe are the only party dedicated to fighting for our environment and ensuring we live in a fair and just society\nJoin us at one of our next events – You don’t have to be a member either",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_martin-schwaller-candidate-for-ynys-mon/content_13.html": "Cwrdd â Martin – Ymgeisydd Seneddol Ynys Môn\nSwydd Efrog o’r Swistir sydd wedi dod o hyd i’w gartref ar Ynys Môn!\nGyrfa wedi’i seilio ar fusnes bwyty teuluol sy’n arwain at reolaeth aml-safle tafarndai, bwytai a gwestai gyda bragdai mawr ac yna i rôl rheolwr cynaliadwyedd ac ynni ar gyfer y cwmnïau lletygarwch mwyaf. Yn ddiweddarach yn y tîm sy’n gweithio ar ddatblygu polisi ynni yn Nhŷ’r Arglwyddi. Drwyddi draw gyda’r ddealltwriaeth mai pobl yw craidd popeth a wnawn.\nGwnaeth cred mewn cymdeithas wirioneddol deg hi’n glir i mi mai dim ond y Blaid Werdd sydd â’r syniadau i’n symud ymlaen yn y ffordd iawn i bawb.\nEfallai eich bod yn meddwl bod y Blaid Werdd i gyd yn ymwneud â newid hinsawdd a thrychineb, ac ydy, mae ein Bargen Newydd Werdd wrth galon ein gweledigaeth, ond mae’n mynd ymhell y tu hwnt i ddim ond “mynd yn wyrdd”. Mae gennym gynllun ar gyfer datgloi addysg, adfer mynediad i’r GIG, mynd i’r afael â gwahaniaethu. Rydym am sicrhau incwm sicr a chartrefi diogel i bobl yr ynys hon. Brwydro am well bargen i Gymru. Rydym hefyd yn gwerthfawrogi byd natur a’r amgylchedd, felly rydym am warchod Ynys Môn ynghyd â’i statws GeoParc Byd-eang gwerthfawr UNESCO.\nNid fi yn unig yw eich ymgeisydd seneddol Gwyrdd ond fi fydd eich cynghreiriad, eich llais a’ch eiriolwr. Busnes ac adeiladu cymunedol yw fy nghefndir, felly deallaf bwysigrwydd busnes a sut y gall wasanaethu cymunedau orau. Ond yn bennaf oll rwyf am wrando ar eich pryderon, eich dyheadau, a’ch syniadau, i gynrychioli eich anghenion a chreu Ynys Môn gwell.\nGyda’n gilydd gallwn greu Ynys Môn wyrddach a thecach, lle mae cyfleoedd i’w holl bobl.\nMeet Martin – Parliamentary Candidate Ynys Môn\nA Swiss Yorkshireman who has found his home on Ynys Mon!\nA career founded on the family restaurant business leading to pub, restaurant, and hotel multi-site management with major breweries and thence to the sustainability and energy manager role for the biggest hospitality companies. Latterly in the team working on energy policy development in the House of Lords. Throughout always with the understanding that people are the core of all we do.\nBelief in a truly fair society made it clear to me that only the Green Party has the ideas to move us forward in the right way for all.\nYou might think that the Green Party is all about climate change and catastrophe, and yes, our Green New Deal is at the heart of our vision, but it goes far beyond just “going green”. We have a plan for unlocking education, restoring NHS access, tackling discrimination. We want to deliver secure incomes and secure homes for the people on this island. Fight for a better deal for Wales. We also value nature and the environment, so want to protect Ynys Mon along with it’s valuable UNESCO Global GeoPark status.\nI am not just your Green parliamentary candidate but will be your ally, your voice and your advocate. My background is in business and in community building, so I understand the importance of business and how it can best serve communities. But most of all I want to listen to your concerns, your aspirations, and your ideas, to represent your needs and bring about a better Ynys Môn,\nTogether we can create a greener and fairer Ynys Môn, where opportunities exist for all its people.",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_news_page_3/content_10.html": "Second Call For Nominations – Welsh Parliament Elections 2021 23rd June 2020 / 19th March 2024 by harrietking Selection of the North Wales Green Party Regional List Candidates for the Welsh Parliament Elections 2021 Second Call for Nominations As you may well be aware, the Welsh Parliament election allows for constituency candidates and a “regional list” from which members may be selected if the Green Party vote overall in the North Wales region […] Read more »\nOur AGM and New Committee 21st March 2020 / 19th March 2024 by harrietking Our AGM was last weekend, and sadly will be our last face to face meeting until it is safe to do so. We had a really good day with our guest speakers including Anthony Slaughter, Green Party of Wales Leader and Nia Jones a PHD Student in Bangor who gave a fantastic talk about plastic […] Read more »\nRhiw Ward Town Council Election 15th November 2019 / 19th March 2024 by harrietking The ballot boxes are empty and the results are in! Thank you to all candidates taking part to enable this election. Congratulations to Debra Jones the next Rhiw Ward Town Councillor. Well Done Brian for an excellent campaign. 💚 Total votes cast: 983 Turnout: 20% CON: 514, 52% GRN: 189, 19% LAB: 176, 18% IND: 100, […] Read more »\nElectorial Agreements 8th November 2019 / 19th March 2024 by harrietking As part of the Unite To Remain agreement as a local party we made the decision to step aside for Plaid Cymru on Anglesey. This was a difficult decision to make as the climate and environment is of paramount in important to us. Before making a decision we reached out to Aled Ap Dafydd Plaid’s […] Read more »\n#TrashTag – Cleaning the Dingle In Colwyn Bay 13th October 2019 / 19th March 2024 by harrietking This Saturday we along with volunteers cleaned 150kg of waste from the Dingle in Colwyn Bay. This beautiful little stream which runs through the centre of Colwyn Bay was full of plastic as well as a shopping trolley and sadly syringes. By cleaning the Dingle we have saved waste from entering the Bay and then […] Read more »\nWere Back From Conference! 8th October 2019 / 19th March 2024 by harrietking This year’s England and Wales Conference was in Newport and 3 members from our group attended over the weekend. Conference is a great opportunity to be involved in policy making where you support or oppose motions and really define how you want your political party to be. As well plenary you can talk part in […] Read more »\nGlobal Climate Strike – Colwyn Bay & Bangor 21st September 2019 / 19th March 2024 by harrietking Yesterday on the 20th of September we joined the school children of Colwyn Bay and Bangor at the Global Climate Strike. In Colwyn Bay Adam our Campaigns Officer gave a rabel rousing speech about the change needed to protect our planet and humanity. It was such an inspiration watching the Children defend their future, and […] Read more »\nDenbighshire For Europe Rally – Ruthin 9th September 2019 / 19th March 2024 by harrietking Ths Sunday Harriet spoke at the DenbighshireForEurope rally in Ruthin, along with other party representaves from the Lib Dems, Plaid and Labour. She spoke about how Citizens Assembleys can bring a local voice to Westminster so that views from all parts the local community can be heard and belives these are the way forward to […] Read more »\nStand Up For Democracy Colwyn Bay 9th September 2019 / 19th March 2024 by harrietking On the 31st of August Denbighshire For Europe organised a Stand Up For Democracy Protest in Colwyn Bay where Chris Hemming of our committee members discussed how what Boris Johnson attempting to prolouge parliament was a disgrace to democracy. Here are some photos from the day. Read more »\nBryn Cocyn Organic Farm Visit 11th August 2019 / 19th March 2024 by harrietking We’ve had a great day visiting Bryn Cocyn Organic Farm just outside Denbigh. We met in the garden where the smell of Lavender filled the air and the sound and sights of honey bees, bumble bees and various butterflies around us. We explored the polytunnel, vegetable plots and Orchard, Saw the apple press where they […] Read more »",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_general-election/content_2.html": "You can vote green all across North West Wales this general election. We are standing a candidate in every constituency giving the people of North Wales the option to vote green if they want to.\nDid you know? Election candidates are people like you who want to make a difference and volunteer their time. You can be one of them!",
  "https_northwestwales_greenparty_org_uk_petra-haig-aberconwy_/https_northwestwales_greenparty_org_uk_news/content_8.html": "AGM 2025 – Refugees & The House of Lords – Photos 17th March 2025 / 17th March 2025 by harrietking The weather was gorgeous this Saturday our AGM attendees had the opportunity to explore the beautiful Treborth Gardens where the event was being held. The day started with the election of the committee and I am pleased to say that we have filled the below roles however we do still have committee roles to fill […] Read more »\nChairs Report AGM 2025 17th March 2025 by harrietking It seems this year is the year of the Lords, with both Green Party Baronesses having now been for a visit to the wonderful place we call home. North Wales. North Wales was also the home of the Wales Green Party conference this year, which was great to attend, and a thank you to everyone […] Read more »\nAGM Event with baroness Jenny Jones & Croeso Menai 21st February 2025 / 21st February 2025 by harrietking Croeso Menai is a local charity that helps refugees make North Wales their home and we are proud that we can host an event to raise awareness of their wonderful work. Green Party Baroness Jenny Jones will be giving a talk where you can ask for the latest info from the House of Lords and […] Read more »\nA Short term dash for growth comes with a long term price tag 21st February 2025 / 21st February 2025 by harrietking The only words that seem to matter in Whitehall are Economics and Growth. All else must be sidelined until growth is secured and, so party managers hope, the next general election can be won with an expanding economy. Such is politics, as they like to say: ‘it’s the Economy stupid.’ But this view, and the […] Read more »\nThe Welsh Government must up its game for Nature Restoration 6th February 2025 / 21st February 2025 by harrietking The Welsh Government has been heavily criticised by a key Senedd Committee over its responses to the Nature Emergency in Wales that was declared by the Senedd in 2021. The Climate Change, Environment and Infrastructure Committee’s report published in January 2025 said that commitments made by the Government to nature restoration in Wales must be […] Read more »\nWales Green Party Conference In Llandudno 11th October 2024 / 21st February 2025 by harrietking The conference may be over, but we are still feeling its effects: excitement, dedication, and a renewed energy to keep campaigning for the people of North Wales. It was great seeing our colleagues in the Wales Green Party up North with us, and we look forward to the next time they’re up here as well. […] Read more »\nTrawsfynydd’s Legacy 17th September 2024 / 17th September 2024 by Green Party Admin The nuclear reactor Construction of the Trawsfynydd Magnox Nuclear Power Station in Eryri National Park began in 1959 and was completed in 1965. It is one of 26 Magnox stations built in the 1950’s to 1970’s. They were developed as dual function reactors, able to produce plutonium for nuclear weapons as well as electricity. [1] […] Read more »\nGeneral Election Results 5th July 2024 / 21st February 2025 by harrietking 6 weeks of campaigning is over, the ballots have been counted and a new government is in power! Over the 6 weeks, Greens from North West have been busy at hustings, sharing online content and spreading the Green message. Harriet the Chair of the North West Wales Green Party expressed “How proud she was of […] Read more »\nGreen Talk and Q&A – Guest SPeakers – Llangoed Village Hall 26th June 2024 / 21st February 2025 by harrietking Our event on Anglesey was a great success! We had a panel of 4 speakers and a chair who asked questions of the audience. They ranged from Education, Investment into Services for Adults, Nuclear Free Anglesey and Voting Reform with Proportional representation. The 4 speakers included Baroness Natalie Bennett – Greenparty Lord Anthony Slaughter – […] Read more »\nGeneral Elections Candidates Selected 26th March 2024 / 29th March 2024 by harrietking In this election everyone in North West Wales will be given a chance to vote Green. We are standing candidates across all our constituencies including Ynys Mon, Dwyfor Meirionnydd and Bangor Aberconwy and Clwyd North. You will have an opportunity to hear more about the General Election candidate and be able to ask them questions […] Read more »"
}