{
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_news_north-west-leicestershire-community-day-blog-4th-march-2025/content_12.html": "North West Leicestershire Community Day Blog 4th March 2025\nIt was a wonderfully sunny day to start my Community Day in North West Leicestershire, although there was still a chill hanging in the air. Spring and the warmer weather will be upon us soon thankfully.\nMy first stop of the day was in Ellistown to meet with North West Leicestershire and County Councillor Cllr Keith Merrie and Chair of the Hugglescote resident Aimee Garner. Together we discussed the issues affecting the local area, with off-road bikes being raised as an issue in Ellistown. It was good to hear of the positive effect that CCTV is having in the local area, with Cllr Merrie reporting that anti-social behaviour is falling as a result of CCTV installation. In fact, over the last year crime in down across the whole of North West Leicestershire by 12.5%, which is testament to the hard work being done by Leicestershire Police.\nI then travelled to Ashby de la Zouch where I met with Town Councillors Damilola Ojuri, Tom Stanley, Avril Wilson and Town Clerk Jack Fargher. Cllrs shared with me their concerns regarding e-scooters and e-bikes, especially near schools at drop off and pick up time. The Money Hill housing development and the impact that 1000’s more people will have on community safety in the area was also raised. I will be speaking to the local NPA Commander regarding the area and plans for policing the area moving forward. It was also good to hear about the successful patrols of the Holywell area by Rangers being paid for by the Ashby Business Improvement District (BID).\nFollowing my meeting in Ashby de la Zouch, I headed over to Appleby Magna to speak to residents. The general consensus was that it is a lovely place to live with low crime levels. What was interesting to hear from multiple people however was the presence of a group of young men who have been trying car doors and front doors since Christmas. Residents are understandably worried, and I will be writing to the local NPA Commander to make the local team aware of their concerns.\nMeasham was my next destination, where I met with Tom Rooney. Tom runs Measham Events voluntary group, who organise the village fete among other local events. Tom shared with me concerns from residents regarding suspicious vehicles that have been spotted in the area, driving slowly in residential areas. As ever, I shall pass these concerns to the local NPA Commander.\nI then made a brief stop in Donisthorpe to speak to local residents. As a border village, understandably there were concerns about police response times in case of emergencies. There were also concerns regarding speeding vehicles, though mainly the feedback was very positive where residents are clearly very proud to live in such a lovely village.\nMy final meeting of the day was with the North West Leicestershire Community Safety Partnership (CSP) at Belvoir Shopping Centre to meet with partners and discuss the good partnership work taking place at the centre. The area has benefited from ASB Hotspot patrols by Leicestershire Police, and CCTV provision increased from funding from my Office for the CSP for 12 weeks from October 2023 was so successful that North West Leicestershire District Council continued the funding until 31st March 2025.\nWorking alongside Knowledge is Power (KisP) and Security Rangers, the partnership have been successful in driving down anti-social behaviour. I am glad that my office were able to pay a small part in this, and I will certainly be looking to meet with the team again to see their continued good work.",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_cdn-cgi_l_email-protection/content_22.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_campaigns_protecting-our-high-streets/content_3.html": "To Protect our High Streets vote for Rupert Matthews on Thursday 2nd May\nMuch neighbourhood crime and anti-social behaviour centres around our high streets, retail outlets parks and gardens. I will invest in crime prevention measures to target these public spaces..\nI will\n- Work with Community Safety Partnerships [CSPs], to fund a range of measures including CCTV, better lighting, mirrors to view around alley corners and emergency help points.\n- Encourage the installation of the “DISC” system, Business Crime Reduction Areas and similar schemes to combat shoplifting, assaults on staff and other retail crime to our market towns. I will seek to offer inducements to shops to join – such as funding the first year’s fee for rural shops in our villages.\n- Call on the Chief Constable to expand the delegation of certain police powers to individuals from third party organisations – such council officials – who are involved in the delivery of community safety.\n- Encourage shared training with council staff and PCSOs.\n- Expand the system of project funding to embrace projects with a direct link to the Police and Crime Plan from organisations such as NHW[MCH1] , BIDs, Crimestoppers, Police Beat teams, NFU.\n- Call for review of the time consuming online reporting system for business crime.\n- Advocate to upgrade the system for uploading CCTV from shop systems, making it easier to use.\n- Introduce a dedicated Business Crime Strategy.\nWork collaboratively to identify the best solution for sharing case management data, including the use of E-CINS.",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk/content_1.html": "I'm Rupert Matthews, the Conservative Police and Crime Commissioner [PCC] for Leicester, Leicestershire and Rutland, covering Leicester, North West Leicestershire, Loughborough, Charnwood, Melton, Rutland, Blaby, Hinckley, Harborough and Oadby & Wigston. My aim is to make our city, towns and villages safer.\nThis site is not monitored 24/7. If you want to contact phone 999 in an emergency or go to https://www.leics.police.uk/ in a non-emergency.\nPromoted by Rupert Matthews, of 18 Pinfold Gate Loughborough LE11 1BE",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_news_door-knocking-cemetery-vandalism-spar-patchwalk-co-op-my-community-day-wigston/content_18.html": "I arrived in Wigston Harcourt early, so I went for a bit of a walkabout to knock on doors in a suburban street to find out what people were thinking about local policing and crime. Interestingly, one lady raised with me vandalism at the nearby cemetery – which was the very reason I was in Wigston Harcourt in the first place.\nArriving at the cemetery I met Cllr Kevin Loydall, Chair of the local Community Safety Partnership, and council official Mark Smith as well as the Sexton John. The vandalism in the cemetery had been increasing over recent months. Vases have been smashed, flowers thrown about and small tokens of affection stolen.\nUsing money from the “Safer Streets Fund” that I won from the government, the Community Safety Partnership are putting up a pole and CCTV to overlook the areas worst affected.\n“I’m pretty sure we know who is doing this,” said John. We just need the evidence so that we can take action.” I hope that they succeed. Vandalising graves is a despicable crime.\nMy next stop was at the Spar shop just off Aylestone Lane in Wigston itself. I was there to meet Sunita, the store manager, and Edward from the national Association of Convenience Stores. The main message was that shoplifting and assaults on staff have been rising – and that drives up costs.\n“We used to have two staff in this store,” Sunita told me, “now we have three so that there is always one person walking the shopfloor to deter theft.” Edward explained that these increased costs can make some stores unviable, so they close down. And once shops start to close and remain empty the entire area goes downhill.\nI was able to reassure them that the Leicestershire Police now have a business crime lead and Single Point of Contact [SPOC] who is in the process of drawing up a refined strategy to deal with retail theft, assaults on staff and business crime.\nA patchwalk around the Leicester Road shops and nearby residential streets followed in the company of PC Collington and PCSO Haq. I was most impressed by the way the pair knew so many local residents and the friendly way that they interacted.\nMy final stop in Wigston was at the Co-op in Launceston Road where I met the store manager and the regional head of security, Nicola. The Co-op was also suffering a sharp increase in thefts – up by around 50% on this time last year – as well as abuse directed at staff.\n“People blame the cost of living crisis,” Nicola told me, “but its not as simple as people short of cash stealing food to feed their families. It is that people short of cash can’t resist a bargain and so are more prone to buy stolen goods and knock down prices without thinking where they come from. It is career criminals doing the stealing, like it always is.” she made a plea for these repeat offenders to be deal with more harshly. I agreed, but sentencing is down to the judiciary who always guard their independence jealously.\nI had to leave at that point to get off to a meeting in Leicester to talk about the issue of homelessness in the city.",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_about-rupert/content_11.html": "Rupert Matthews is the Police and Crime Commissioner in Leicestershire and Rutland.\nYou can read his latest Annual Report, approved by the Police and Crime Panel HERE.\nRupert brings to the role considerable experience in public service. He has spent 8 years as a unitary authority councillor, 2 years as a Member of the European Parliament and is currently a Parish Councillor in the Leicestershire village where he lives.\nPrior to his election, Rupert worked in publishing writing a wide variety of children's and history books, including one on The Battle of Lincoln and food and drink in Leicestershire.\nRupert says:\n\"The police in Leicester, Leicestershire and Rutland are among the best in the country. But even the best can be made better with determination and a willingness to learn. I want to see our police build on the successes of Neighbourhood Policing, rural crime units and other recent innovations.\n\"By communicating and co-operating with the public, both directly and through bodies such as parish councils or neighbourhood watch groups, policing can be made more effective and more responsive to the public.\n\"The new police officers and funds now coming on stream enable the Leicestershire & Rutland police to tackle rural crime, burglary, knife crime, ASB, domestic abuse, and drug gangs even more effectively than they do now. And as PCC I will commission effective services to support and care for victims of crime, while taking proactive steps to prevent crime from happening in the first place.\nMaking our communities safer is the reason that I became PCC, and I am now delivering on that ambition.\"\nRupert's Five Point Plan for Policing:\n- Visible Policing - Make the police more visible to deter crime, improve security and make it easier to report problems.\n- Community Policing - Work with schools, parish councils, neighbourhood watch and the public.\n- Hi-Tech Policing - Ensure that our front line police have the training and equipment that they need - including tasers, drones, body cams and more.\n- Rural Policing - Specialist teams with training and equipment needed to tackle crime in villages and rural areas.\n- City Policing - A no-nonense approach to tackling knife-crime, drugs and ASB.",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_privacy/content_9.html": "This document outlines how Rupert Matthews processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Rupert Matthews\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Rupert Matthews.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Rupert Matthews, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Rupert Matthews via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_campaigns_my-community-days/content_2.html": "Once a week I go out into the Community to meet the public and those working on the frontline to find out what is going on in the real world.\nThis time with the public is an invaluable part of my public engagement. It is vital that, as your Police and Crime Commissioner, I understand the issues that affect you and your neighbours. If you want me to visit your community to view a problem or issue for myself, please get in touch.\nSee you soon.",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_news_category_Westminster-News/content_14.html": "Disrupting the County Lines Drug Gangs 12th February 2020 An important job for the various arms of government is to target criminal activity and to disrupt it. That way we can prevent crime before it happens. That is... Westminster News\nThe Domestic Abuse Bill 2nd October 2019 Today the Domestic Abuse Bill is having its second reading in the House of Commons. Given that domestic abuse is one of the most pernicious of crimes, and... Westminster News\nLymn Bank Cheese in Westminster 7th February 2019 On Monday 28 January I hosted an event in Westminster to promote local food and drink producers from across the East Midlands. Since I became the MEP back in... Westminster News\nLincolnshire Tea and Coffee Company in Westminster 7th February 2019 On Monday 28 January I hosted an event in Westminster to promote local food and drink producers from across the East Midlands. Since I became the MEP back in... Westminster News\nStatement on resignation of David Davis 9th July 2018 I am sorry to hear the news that David Davis has resigned as Brexit Secretary. I know that he has the best interests of our country at heart and the decision he... Westminster News",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_cookies/content_10.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_campaigns/content_21.html": "My Community Days Once a week I go out into the Community to meet the public and those working on the frontline to find out what is going on in the real world. This time with the...\nFighting Violence Against Women and Girls [VAWG] Violence against women and girls includes harassment, stalking, rape, sexual assault, murder, honour-based abuse, coercive control, but is not limited to those...\nProtecting our High Streets To Protect our High Streets vote for Rupert Matthews on Thursday 2nd May Much neighbourhood crime and anti-social behaviour centres around our high streets...\nTackling Heritage Crime Heritage Crime can have a devastating effect on communities. Whether it is stealing lead from church roofs, plundering archaeological sites of irreplaceable...\nImproved Road Safety Road safety, speeding and dangerous driving blight far too many of our rural villages and urban neighbourhoods. In 2022, a total of 28 people were killed on the...\nImproving Policing and Road Safety in Rural Areas When I took over as Police and Crime Commissioner, I found that our rural communities had been shamefully neglected under Labour. That has changed. We now have...\nCombat knife crime and illegal drugs. Knife crime and violence on our streets is unacceptable. Law-abiding citizens should be free to go about their business without fear of attack. Violent crime is...\nMaintaining Order on our Streets Britain is a democracy in which the vast majority of people accept that the way to effect political change is through peaceful debate, discussion and elections...\nMore Visible Policing High visibility policing is key to effective neighbourhood policing. I intend to make sure that police officers and staff will be more visible to actively deter...\nImproving Neighbourhood Policing and Tackling ASB Neighbourhood Policing is the bedrock of British Policing. The skills, dedication and courage of our neighbourhood officers are key to keeping our streets safe...\nPolice and Crime Commissioner Election 2024 Launch Police and Crime Commissioner Rupert Matthews has pledged to boost neighbourhood policing with greater police visibility, more police stations and a clear focus...\nLeicester Action Plan Rupert Matthews has unveiled his Action Plan to Reduce Crime in the city of Leicester. It can be downloaded as a PDF below. Rupert's Ten Point Plan for Safer...",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_principles-policing/content_16.html": "When Sir Robert Peel (above) founded the Metropolitan Police in 1829 there was a great deal of concern that the new force would be an instrument of government oppression. It was not an idle worry. On the continent of Europe, police forces were frequently armed and were used by the autocratic rulers to target opponents and suppress them - often brutally.\nIn the UK, by contrast, law and order was enforced by the people themselves. Some parishes hired constables or watchmen, but largely detecting crime and apprehending criminals was down to individuals. The system had worked reasonably well while the UK was a largely agricultural society in which people rarely moved far from home. But the growth of large inducstrial cities in the 19th century meant society was no longer made up of interlocking families who all knew each other - and where a stranger would stand out like a sore thumb.\nThe big cities allowed for anonymity and movement of peoples in a way that had not been previously known. And criminals could move as easily as law abiding folk. After a good deal of debate, it was decided to introduce a force of 1,000 constables to the metropolis of London. Within ten years all cities had similar police forces, and the counties followed - with Leicestershire Police being founded in 1839.\nAware of the public unease about the formation of this body of men, Sir Robert Peel went out of his way to explain that the police were there to serve the public, not the government. The police officers were regarded as citizens in uniform. They exercised their powers to police their fellow citizens with the implicit consent of those fellow citizens. \"Policing by consent\" indicates that the legitimacty of polciing in the eyes of the public is based upon a general consensus of support that follows from transparency about their powers, their integrity in exercising those powers and their accountability for doing so.\nIn time Peel's principles became codified as nine \"Peelian Principles of Policing\" as follows:\n- To prevent crime and disorder, as an alternative to their repression by military force and severity of legal punishment.\n- To recognise always that the power of the police to fulfill their functions and duties is dependent on public approval of their existence, actions and behaviour, and on their ability to secure and maintain public respect.\n- To recognise always that to secure and maintain the respect and approval of the public means also the securing of the willing co-operation of the public in the task of securing observance of laws.\n- To recognise always that the extent to which the co-operation of the public can be secured diminishes proportionately the necessity of the use of physical force and compulsion for achieving police objectives.\n- To seek and preserve public favour, not by pandering to public opinion, but by constantly demonstrating absolutely impartial service to law, in complete independence of policy, and without regard to the justice or injustice of the substance of individual laws, by ready offering of individual service and friendship to all members of the public without regard to their wealth or social standing, by ready exercise of courtesy and friendly good humour, and by ready offering of individual sacrifice in protecting and preserving life.\n- To use physical force only when the exercise of persuasion, advice and warning is found to be insufficient to obtain public co-operation to an extent necessary to secure observance of law or to restore order, and to use only the minimum degree of physical force which is necessary on any particular occasion for achieving a police objective.\n- To maintain at all times a relationship with the public that gives reality to the historic tradition that the police are the public and that the public are the police, the police being only members of the public who are paid to give full-time attention to duties which are incumbent on every citizen in the interests of community welfare and existence.\n- To recognise always the need for strict adherence to police-executive functions, and to refrain from even seeming to usurp the powers of the judiciary of avenging individuals or the State, and of authoritatively judging guilt and punishing the guilty.\n- To recognise always that the test of police efficiency is the absence of crime and disorder, and not the visible evidence of police action in dealing with them.",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_news_pcc-introduced-new-crime-fighting-tool-helping-keep-retailers-safe-hinckley/content_17.html": "Police and Crime Commissioner Rupert Matthews has met the officers involved in rolling out an innovative app in the fight against retail crime and anti-social behaviour in Hinckley.\nDuring a ‘Community Day' in the town, the Leicester, Leicestershire and Rutland PCC dropped into Hinckley Police Station where he was shown the DISC information system by PCSO Phil Wayne.\nDISC is an information sharing app which empowers business owners to share information about incidents and offenders between themselves so they can better protect themselves against crime and keep their property, employees and customers safe.\nThe app enables subscribers to report incidents to the police quickly and send and receive instant messages and email alerts to one another to warn of live incidents.\nThe DISC system, which has been designed to comply with all data protection and GDPR legislation, is currently being made available to shops that are part of the Hinckley Business Improvement District (BID) but could be rolled out more widely in future.\nMr Matthews said: \"I was excited to see this system in action in Hinckley and find out more about the way it connects businesses to each other to reduce their risk of retail crime.\n\"DISC is already being used effectively in other towns and cities across the UK, enabling police to track the activities of prolific offenders and build up an intelligence picture while also arming businesses with the information they need to reduce their risk of crime. Although it's early days, there's strong support for the project and businesses have really welcomed the partnership approach.\n\"As PCSO Wayne explained, this scheme has made the world of difference elsewhere. Hinckley is already a safe place to live, work and visit but DISC will help make it even safer. I look forward to returning in September to find out more about its impact.\"\nEarlier during the patch walk, the PCC met Ruth Wright at the Pathways Centre, which is part of the Baptist Church on Baptist Walk.\nThe centre offers many vital community services from the Crisis Café, which provides support to people struggling with mental health, through to HUGS which helps residents who have recently moved to the area from the Ukraine. It is eager for more people to volunteer to support the valuable work it provides residents across the area.\nThe PCC also met Daniel Hope who is organising a packed programme of entertainment for this year's Hinckley Pride under the theme ‘Together Always, United in Diversity', and chatted to shoppers and residents in the Town Centre about their concerns in relation to crime and policing.\nPhoto: Rupert Matthews at Hinckley Police Station",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_news_my-rutland-newsletter-has-now-been-published/content_5.html": "My Rutland Newsletter has now been published:\n- Keeping an eye on Langham and Whissendine\n- Healing trauma in the aftermath of domestic abuse\n- Protecting Rutland\n- Protecting our communities from ASB and serious violence\n- Fight for fair funding\n- New face in the team\n- Keeping young people safe with VR",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_campaigns_improving-policing-and-road-safety-rural-areas-0/content_8.html": "When I took over as Police and Crime Commissioner, I found that our rural communities had been shamefully neglected under Labour.\nThat has changed. We now have:\n- A dedicated Rural Policing Unit.\n- Specialist training to call handlers.\n- Rural Crime Reduction Events.\n- Crime Prevention Measures for rural areas.\n- A reduction of over 10% in rural crime year on year.\nIn 2023 the Rural Team conducted over 1200 personal visits to farms and other rural businesses. Furthermore over £1,026,000 worth of stolen farm equipment was recovered in that year.\nI will now build on that success in keeping our rural areas safe by:\n- Establishing a comprehensive Rural Crime Strategy focusing on crime prevention as well as policing.\n- Working with the National Farmers’ Union, rural businesses, parish councils and Neighbourhood Watch groups to make our rural villages, farms and hamlets safer than ever.\n- Calling for guidelines so that local bodies understand what they can expect from the police in rural areas.\n- Advocating for a full time administrative staff member within the Rural Policing Team freeing up officer time.\n- Making the case for the Rural Policing Team to have exclusive use of a drone and quad bike. .\n- Advocate for the current police vehicle tracking process to identify villages that are not regularly visited by the police, and then use Waymarkers to ensure that they are visited on a regular basis.\n- Lobby for the maintenance of the Mounted Volunteers Scheme and develop other innovative ways to mobilise our rural communities in the fight against crime\n- Recommend the establishment of a team of Special Constables dedicated to policing rural areas, working alongside rural policing teams.\n- Call for the iimplementation of the estates strategy to increase the police footprint in rural areas of Leicestershire and Rutland.\n- Champion the various Watch schemes – such as Farm Watch, Neighbourhood Watch, Community Speed Watch and Pub Watch – that are active in our rural areas.\n- Tirelessly . lobby our national government to keep our rural areas safe. This will include calling for: tougher punishments for livestock worrying, effective implementation of current legislation on equipment theft and for additional powers targeting the theft of agricultural machinery. o-ordinating support in our area for secondary legislation in Agriculture Machinery Theft Bill and working to ensure the effective implementation of the Farm Equipment Theft Act",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_contact/content_4.html": "Skip to main content\nRupert Matthews\nPCC for Leicestershire & Rutland\nMain navigation\nAbout Rupert\nNews\nMy Plan\nCampaigns\nContact\nLatest Newsletter\nManifesto\nDonate to my Campaign\nPolice and Crime Plan 2025-29\nRupert Matthews\nPCC for Leicestershire & Rutland\nContact\nLeave this field blank\n[email protected]\nRupert on Facebook\nRupert on Twitter\nRupert on Instagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_campaigns_leicestershire-action-plan/content_13.html": "Rupert Matthews has unveiled his Action Plan to Reduce Crime across Leicestershire. It can be downloaded as a PDF via the link below.\nRupert's Ten Point Plan for Safer Communities in Leicester, Leicestershire and Rutland\n1 - Improve Neighbourhood Policing\n2 - Tackle Burglary\n3 - More high-profile visible policing in our communities\n4 - Crack down on Anti-Social Behaviour\n5 - Maintain order on our streets\n6 - Combat knife crime and violent crime\n7 - Fight the growth of drug crime\n8 - Boost Policing in Rural Areas\n9 - Tackle Speed and Road Safety\n10 - Improve Public Trust and Confidence in Policing",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_news_lymn-bank-cheese-westminster/content_20.html": "On Monday 28 January I hosted an event in Westminster to promote local food and drink producers from across the East Midlands. Since I became the MEP back in 2017 I have been working on promoting local food and drink.\nGemma is at the helm of a family run business in Lymn Bank near Skegness. I welcomed Gemma and her brother Matt to Westminster last Monday where they bought along some of their cheeses for us to try. Lymn Bank cheese is an excellent family run business with local values. Their cheese is available via their website listed below.\nLymn Bank Farm pride themselves on handcrafting quality cheeses sometimes taking 2 years’ worth of nurturing to develop a cheese. They currently have three ranges; Lymn Bank Barrels, Nibble Nose and Artisan cheeses. My personal favourite happens to be the Just Jane cheese that supports the restoration of a Lancaster Bomber. Its creamy texture comes in a Wax mould that allows for a fresh taste.\nLymn Bank cheeses were well received in Parliament with many eager to purchase some more online. A small range of Lymn Banks cheeses are also available in the Lincolnshire Co-op.",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_news_castle-donington-report-back/content_15.html": "I have been asked about crimes in the Castle Donington area, I can report back that Beat 43 [which covers Castle Donington] has seen the following reported in February:\nSince the start of February to date -\nWeek 1\n2 x Reported residential burglaries\n2 x Theft from motor vehicles - Both thefts of diesel from HGV's\nWeek 2\n1 x Burglary of a shed\n2 x Theft from motor vehicles - One a theft of diesel and the other theft of tools from a work van\nWeek 3 (To date)\n1 x Unit burglary - tools stolen.\nIn terms of reported crime overall year to date there has been a 12.3% reduction.\nBurglary offences - down from 81 to 53 - A reduction of 34.6%, (Residential burglaries are down from 42 to 25 offences - a reduction of 40.5%) Theft of motor vehicles - Increase of one offence from 43 to 44 Theft from motor vehicles - Down from 139 to112 offence - a reduction of 19.4%\nLeicestershire Police will continue to review all crime offences of this nature and will deploy resources to target offenders and reassure communities.",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_neighbourhood-watch-scheme/content_7.html": "Tweet Neighbourhood Watch Survey Current Neighbourhood Watch Your details Leave this field blank 1. How long as your group been in operation? Less than 1 year 1-4 years 5-10 years More than 10 years 2. How satisfied are you with the support given to your group by the Police? Slide to give a value 3. If you could ask the Police to do one additional thing to help your group, what would it be? 4. Would your group consider mounting a Community Speed Watch scheme? Yes No The Leicestershire scheme is explained here: https://www.communityspeedwatch.org.uk/ The Rutland scheme is explained here: https://www.rutland.gov.uk/my-community/transport/road-safety/traffic-calming-and-enforcement/ 5. Do you have regular contact with your local parish council? Yes No",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_campaigns_fighting-violence-against-women-and-girls-vawg/content_19.html": "Violence against women and girls includes harassment, stalking, rape, sexual assault, murder, honour-based abuse, coercive control, but is not limited to those crimes. It can cause immense damage to the victims, but also to families and friends who have to pick up the pieces.\nA woman is killed by a man every three days in the UK. Domestic abuse makes up 18% of all recorded crime. In the year ending March 2022, there were 194,000 sexual offences, of which 70,000 were rape, in England & Wales.\nPolicing, and society, must focus on violence against women and girls so that it can be eradicated. The long term solution lies in changes to society, but we can make a start with robust policing and effective crime prevention measures.\n- Elevate violence against women and girls to a crime type that policing leaders must treat as a national threat, ensuring victims can always access professional support. Targetted resources to tackle Domestic Abuse Plan, including funding for victim and witness support services. Implement the Tackling Violence Against Women and Girls Strategy\n- Ensure a victim-centred system for victims of rape in the long-term\n- Support the national change so that nobody can rely on a ‘rough sex gone wrong’ defence to murder and creating the new offence of non-fatal strangulation, so that the worst crimes do not go unpunished\n- Ensure that the new offences of stalking and stalking involving fear of violence or serious alarm and distress, are taken seriously and prosecuted.\n- Prosecute ‘upskirting’\n- Prosecute new offences of coercive control, strengthening protections for victims\n- Put in place technology needed to investigate ‘revenge porn’\n- Hand out effective countermeasures to drink spiking",
  "https_www_rupertmatthews_org_uk/https_www_rupertmatthews_org_uk_map-locations/content_6.html": "Skip to main content\nRupert Matthews\nPCC for Leicestershire & Rutland\nMain navigation\nAbout Rupert\nNews\nMy Plan\nCampaigns\nContact\nLatest Newsletter\nManifesto\nDonate to my Campaign\nPolice and Crime Plan 2025-29\nRupert Matthews\nPCC for Leicestershire & Rutland\nMy map"
}