{
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_contact/content_18.html": "To receive my monthly newsletter, please tick the box below before submitting.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_news_sir-ashley-fox-officially-opens-new-steak-experience-old-vicarage-hotel-bridgwater/content_19.html": "Bridgwater’s MP, Sir Ashley Fox, has officially opened Vicarage Kitchen – a bold new steak-focused dining experience at The Old Vicarage Hotel.\nThe ribbon-cutting ceremony took place on Tuesday, April 8, marking the start of an exciting new chapter for the much-loved historic venue.\nVicarage Kitchen offers a tailored approach to steak dining, allowing guests to customise their meal by selecting their preferred cut, sides, butter, and sauce. For those who enjoy sharing, generous steak boards are also a highlight.\nTo reflect the new culinary direction, the dining space of Old Vicarage Hotel has been completely redesigned by local artist and designer Nathan Slate, known for his work with the SL-ATE Concept Store in Bridgwater.\nHotel owners Pete Starling and Candida “Candy” Leaver have drawn inspiration from their own walled gardens, incorporating homegrown herbs and vegetables into the menu for a true garden-to-table experience. While the focus is now firmly on steaks, a few customer favourites from the previous menu have been kept on due to popular demand.\n📞 To reserve a table at The Old Vicarage Hotel, call: 01278 458891",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_eastoverbridgwater-roadworks/content_13.html": "I want to hear your views on the ongoing roadworks in Eastover and wider Bridgwater, and how they’re affecting you and local businesses. Your feedback will help me better understand the impact of these works and strengthen my case when raising concerns with the council and contractors.\nPlease take a moment to share your thoughts by answering the short questions below.",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_news_ashley-fox-mp-hosts-first-annual-parish-council-summit-wembdon/content_22.html": "Sir Ashley Fox MP has held the first Bridgwater Constituency Parish Council Summit, bringing together representatives from across the area to discuss key local issues and strengthen relationships between parish councils and Westminster.\nHeld at Wembdon Village Hall, the event welcomed parish councillors from across the Bridgwater constituency for a morning of questions, briefings and networking. The aim of the summit was to provide parish councils with a direct opportunity to hold their MP to account, share best practice with each other, and hear updates on topics affecting their communities.\nAshley Fox opened the summit by thanking attendees for their service, reflecting on his own eight years as a councillor, and making clear his determination to better support parish councils in the years ahead. He acknowledged that the smaller rural councils can sometimes feel overlooked and emphasised his commitment to changing that.\n“I know just how important the work of parish councils is,” Ashley told attendees. “You are the first tier of local democracy and I want to work with you. My door is open, and I’m determined that this summit becomes a useful and lasting way for us to keep in touch.”\nSpeakers at the event included representatives from the Somerset Drainage Board Consortium, who discussed current flood management and future plans, and the Campaign to Protect Rural England, who provided an update on potential changes to the National Planning Policy Framework.\nParish councils raised several key concerns during the summit, including:\n- Confusion over which agency is responsible for maintaining and managing different watercourses across the area.\n- A lack of effective planning enforcement from Somerset Council.\n- Worries that changes to national planning rules could reduce the influence of local residents and councils on decisions about future development.\nIn his closing remarks, Ashley spoke about the work he is doing to lobby government on flooding, rural broadband, public transport, planning reform and farming, as well as exploring solutions to the shortage of NHS dentists in the area. He confirmed his intention to make the Parish Council Summit an annual event, with next year’s agenda shaped by the councils themselves.",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk/content_1.html": "I'm Ashley and I'm your Conservative Member of Parliament for Bridgwater and Burnham. Here, you can find my latest news, campaigns and more about me, including what I stand for and how to contact my office. I'm here to help, so please don't hesitate to get in touch.",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_map-locations/content_6.html": "Skip to main content\nAshley Fox\nMP for Bridgwater\nMain navigation\nHome\nAbout Ashley Fox\nNews\nYour Views\nContact\nDonate\nAshley Fox\nMP for Bridgwater\nMy map",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_news_my-view-750-home-bower-lane-development/content_3.html": "I've written to Somerset Council to raise concerns about the planning application to build up to 750 homes between Bower Lane and the M5.\nI am not against development - but it has to be properly planned, sustainable, and supported by the infrastructure that local people need.\nThis is what I said to Somerset Council.\n\"I am writing to express my concerns regarding the proposed development by Edward Ware (Bridgwater) Ltd. for up to 750 homes between Bower Lane and the M5.\nWhile I am not opposed to development in principle, it must be sustainable, properly planned, and backed by the infrastructure that local residents and future homeowners will rely on. At present, this proposal falls far short of what is acceptable.\nThe developer’s viability assessment shows that it cannot deliver the required 30% affordable housing, nor meet financial contributions towards essential services such as healthcare and education. This is unacceptable. If developers overpay for land, then they should bear responsibility for that rather than expect the taxpayer to pay for the vital services that should accompany major developments. If the scheme is truly unviable with proper community investment, then it is the wrong scheme for this site.\nThe request from NHS Somerset for a £418,000 contribution to mitigate pressure on GP services must be secured in full. Similarly, the £7.8 million in education contributions identified by Somerset Council must be a non-negotiable requirement. Healthcare and education provisions are essential foundations for any community.\nTraffic is another major concern. Residents already face daily congestion entering East Bridgwater via Bath Road and Westonzoyland Road, and this development would only make matters worse. There must be a serious and deliverable plan in place — fully funded by the developer — to address the cumulative impact on local roads. This plan must also consider the combined effects of this proposal alongside the nearby Folletts Farm development.\nThe Council has already demonstrated through its recent conduct — such as scheduling roadworks at the Dunball Junction and the A39 at the same time — that it struggles to coordinate major infrastructure works. It is critical that the mistakes of the past are not repeated. I therefore seek a clear assurance from you that the cumulative traffic and disruption caused by multiple developments will be properly modelled and addressed before any approval is granted.\nIn its current form, this proposal is unacceptable and would place an intolerable burden on Bridgwater residents. I am releasing a copy of this letter to the local media.\"",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_news_ashley-fox-mp-responds-emergency-budget-mess-labours-own-making/content_14.html": "Ashley Fox MP has criticised the Chancellor’s Emergency Budget, calling it “a mess of her own making” and a failure to take the decisive action needed to undo the economic damage caused since Labour took office.\nSpeaking after the Budget was delivered, Ashley Fox said, “The OBR has confirmed what we all feared. The fallout from the Chancellor's Autumn Budget means that growth has been cut in half. Inflation, borrowing, debt, and unemployment, are all forecasted to be higher than before her disastrous economic policies. She could have reversed course today, but instead she’s doubled down on the same reckless decisions that brought us here in the first place.”\nHe pointed to the Autumn Budget as the turning point, when the Chancellor “broke her promises, introduced the Jobs Tax, piled up borrowing and destroyed growth.”\n“It’s working families and local businesses who are paying the price for Labour’s mess – through higher prices in the shops, rising mortgage rates, and fewer job opportunities. This Budget does nothing to reassure the public or restore economic confidence.”\nAshley Fox vowed to continue standing up for constituents across the Bridgwater constituency, pressing for policies that reward hard work, support small businesses, and get Britain growing again.\nHe said \"Labour is running out of people to blame for this economic mess. Eventually they have to accept that the person to blame is the Chancellor. We offer solutions, they will only ever offer excuses.\"",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_donate/content_8.html": "Tweet Donate to Ashley's campaign. Make a donation Leave this field blank First name Last name Email Amount £10 £20 £50 £100 £250 £500 Other… Enter other… I would like to be kept up-to-date by the Conservatives on future issues that matter to me: Yes There will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our Privacy Policy. bluetree_votesource_postcode Postcode Payment",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_news_winners-bridgwater-burnham-independent-shop-awards-2025-announced/content_16.html": "Ashley Fox MP has announced the winners of this year’s Independent Shop Awards – a celebration of the fantastic independent businesses in the Constituency.\nThe initiative, which Ashley Fox launched to champion local shops and services, invited residents to nominate and vote for their favourite businesses across a range of categories. Over a thousand votes poured in, highlighting just how valued our independent traders are by the communities they serve.\nThe 2025 winners are:\n- Beauty – Prim N Proper, Burnham-on-Sea\n- Butcher – Truckles Farm Shop, Burnham-on-Sea\n- Café – May's Café, Burnham-on-Sea\n- Children & Babies – G H Hurleys Toymaster, Burnham-on-Sea\n- Clothing and Accessories – Wilkins Jewellers, Bridgwater\n- Craft and Hobby – Material Needs, Burnham-on-Sea\n- Farm and Produce – North Farm CluckyMoo, Pawlett\n- Food and Drink – Maisey’s Bakery, Highbridge\n- Gifts and Stationery – Bastins, Burnham-on-Sea\n- Homeware – Prowse Antiques and Interiors @ Vintage West, Bridgwater\n- Pharmacy – Woolavington Pharmacy\n- Tourist Accommodation – The Old Vicarage, Bridgwater\n- Village Shop – Westcroft Eggs & Farm Shop, Berrow\n- Other – G H Tyres, Burnham-on-Sea\nAshley Fox MP said, “Our independent businesses are at the heart of community life. These awards are a chance to say thank you to the local traders who bring so much character, service, and quality to our towns and villages. I’m delighted to see such strong support for them. A huge well done to all the winners and nominees, and to everyone who took the time to vote.”\nAshley Fox’s Bridgwater & Burnham Independent Shop Awards will return next year.",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_news_ashley-fox-meets-veteran-taking-ve-day-challenge/content_21.html": "A Bridgwater veteran is preparing to take on an ambitious fundraising challenge this May to mark 80 years since VE Day and raise funds for Blind Veterans UK, the national charity supporting vision-impaired ex-service personnel.\nWayne, who was registered as severely sight impaired in December 2022, has been supported by Blind Veterans UK since January 2023. Diagnosed with Retinitis Pigmentosa and Retinal Dystrophy in both eyes, Wayne has received rehabilitation, training and emotional support to help him regain his independence and adjust to life after sight loss.\nWayne is undertaking a personal challenge throughout the month of May. The timing is especially significant, as May marks the 80th anniversary of VE Day — a date that resonates strongly with many blind veterans who served in the Second World War.\nVictoria Beech, of the Community Partnerships Team from Blind Veterans UK said:\n\"Wayne’s sight loss condition results in difficulties with his vision including trouble adjusting to light changes, difficulty seeing colours and narrowed peripheral vision, all of which will make this challenge more difficult for him. It makes his decision to undertake the challenge even more courageous and we are touched that Wayne is so motivated to ensure that – via the funds he raises – other veterans can receive life changing support should they find themselves in his position”.\nBridgwater MP Sir Ashley Fox met with Wayne to hear more about his plans and learn about the impact of Blind Veterans UK's work and said, \"Wayne’s determination is inspiring. It was a privilege to hear about his journey and his plans to raise awareness and support for Blind Veterans UK. His story is a powerful reminder of the challenges faced by those living with sight loss – and the incredible difference the right support can make.\"\nBlind Veterans UK is encouraging others to mark VE Day 80 by joining their national campaign and organising their own events or fundraising activities. Every pound raised will help provide specialist support for veterans living with sight loss.\nTo find out more about the campaign and the work of Blind Veterans UK, visit: www.blindveterans.org.uk/VEDay80doit",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_cookies/content_2.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_news_ashley-fox-mp-praises-welcoming-atmosphere-st-marys-primary/content_20.html": "St Mary’s CEVC Primary School in Bridgwater welcomed local Member of Parliament Ashley Fox for a visit this week, offering him the opportunity to see the school in action and hear directly from pupils and staff.\nAshley Fox was shown around the school by a group of Year 6 children and visited classrooms across all year groups. He took questions from pupils and spoke with them about their learning and interests.\nHe also had the chance to meet Ruby, a student at the school who serves on the advisory group for the Somerset UK Youth Parliament. Ashley Fox praised the school for encouraging students to take an active interest in democracy and public life from a young age and said, “It was a pleasure to visit St Mary’s and see first-hand the enthusiasm and curiosity of the children. The school has a welcoming atmosphere and shows its commitment to supporting every child’s development. I was particularly pleased to meet Ruby and I commend the school for encouraging pupils to engage with how decisions are made locally and nationally.”\nAshley Fox also met with Headteacher Morwenna Dunstan to learn more about the school’s approach and the ways it supports its pupils both in and outside the classroom.\nMrs Dunstan said, “Having received a letter from Ashley congratulating us on our recent positive Ofsted report, it was my pleasure to welcome him to school and accompany the Year 6 guides around each year group. The Year 6s had a raft of tricky questions to ask him and the whole year group were impressed with his answers.”\nThe school regularly engages with the wider community and was pleased to have the opportunity to share its work with the local MP.",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_news_ashley-fox-mp-law-must-treat-everyone-same-no-exceptions/content_5.html": "Ashley Fox MP has spoken in support of emergency legislation brought forward by the Lord Chancellor, Shabana Mahmood, to prevent the introduction of sentencing guidelines that could have led to unequal treatment before the courts based on race, religion or cultural background.\nThe Sentencing Guidelines (Pre-sentence Reports) Bill was introduced after the Sentencing Council proposed new guidance that would have encouraged judges and magistrates to request pre-sentence reports more frequently for individuals from ethnic or faith minority backgrounds. These reports help inform sentencing decisions and can influence whether an offender receives a custodial sentence or a community order.\nSpeaking in the House of Commons, Ashley Fox said, “This Bill is unfortunately necessary because of the unwise actions of the Sentencing Council. Under the proposed guidelines, a white, male defendant outside a minority group might not have received the same consideration before sentencing as someone else—solely on the basis of identity. That is wrong.”\nAshley welcomed the Lord Chancellor’s decision to act, but criticised the lateness of the intervention, “It was only after pressure from Members of Parliament, including the shadow Justice Secretary, that the Lord Chancellor rightly took action. The Sentencing Council did not withdraw the guidance out of principle—it did so because it was caught out.”\nThe Lord Chancellor, in her opening speech, described the proposed guidelines as risking the creation of a “two-tier justice system” and emphasised that “each of us, no matter who we are, where we come from or what we believe, stand equal before the law of the land.” She announced that she would legislate to prevent the guidelines from coming into force and has launched a wider review into the powers and remit of the Sentencing Council.\nAshley Fox agreed with the need for long-term reform saying, “We must ensure Parliament has oversight of all future sentencing guidance. If we lose equal justice, we lose the foundation of a free society.”",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_news_category_Local-News/content_11.html": "Ashley Fox MP presses Government on grooming gangs scandal 2nd May 2025 Bridgwater MP Sir Ashley Fox has raised serious concerns in Parliament about the Government’s approach to tackling group-based child sexual exploitation... Local News\nMy View on 750 Home Bower Lane Development 1st May 2025 I've written to Somerset Council to raise concerns about the planning application to build up to 750 homes between Bower Lane and the M5. I am not against... Local News\nAshley Fox MP: Law Must Treat Everyone the Same, No Exceptions 25th April 2025 Ashley Fox MP has spoken in support of emergency legislation brought forward by the Lord Chancellor, Shabana Mahmood, to prevent the introduction of sentencing... Local News\nWinners of Bridgwater & Burnham Independent Shop Awards 2025 Announced 17th April 2025 Ashley Fox MP has announced the winners of this year’s Independent Shop Awards – a celebration of the fantastic independent businesses in the Constituency. The... Local News\nAshley Fox MP Praises Welcoming Atmosphere at St Mary’s Primary 16th April 2025 St Mary’s CEVC Primary School in Bridgwater welcomed local Member of Parliament Ashley Fox for a visit this week, offering him the opportunity to see the school... Local News\nSir Ashley Fox Officially Opens New Steak Experience at The Old Vicarage Hotel in Bridgwater 14th April 2025 Bridgwater’s MP, Sir Ashley Fox, has officially opened Vicarage Kitchen – a bold new steak-focused dining experience at The Old Vicarage Hotel. The ribbon... Local News\nAshley Fox Meets Veteran Taking on VE Day Challenge 11th April 2025 A Bridgwater veteran is preparing to take on an ambitious fundraising challenge this May to mark 80 years since VE Day and raise funds for Blind Veterans UK... Local News\nAshley Fox MP: Train Dentists Locally to Fix Somerset Shortages 4th April 2025 Ashley Fox, MP for Bridgwater, has urged the Government to explore training dental students in Somerset as part of efforts to improve access to NHS dentistry... Local News\nAshley Fox MP Hosts First Annual Parish Council Summit in Wembdon 31st March 2025 Sir Ashley Fox MP has held the first Bridgwater Constituency Parish Council Summit, bringing together representatives from across the area to discuss key local... Local News",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_cdn-cgi_l_email-protection/content_23.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_school-visits/content_12.html": "Every year, MPs welcome hundreds of schoolchildren to Parliament and I am always tries to meet visitors from the constituency to talk about the politics and history of Westminster, the work of an MP and about local issues.\nIf you would like to book a tour of the Palace of Westminster, please contact my office.\nTours can be booked for groups of 20 people and repeated tours from the same school are acceptable. Unfortunately, I cannot meet travel costs.\nFor more details, such as the best times to arrange a tour of Parliament, please visit www.parliament.uk/visiting/visiting-and-tours/ukvisitors. Please be aware that tours do need to be booked months in advance.\nThere are also free educational visits which, in addition to a tour of the Palace, offer children and students the chance to learn more about Parliament through interactive workshops. There is also a travel subsidy available to state schools which could cover up to 75% of your travel costs.\nAll bookings are made by phone, one school term in advance, on a given date. To make a booking for an educational visit, please visit www.parliament.uk/education/visiting-parliament.",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_about-ashley-fox/content_7.html": "Ashley Fox was elected as the Member of Parliament for Bridgwater in July 2024.\nAshley is a qualified solicitor who specialised in Insurance Litigation. He practised for 15 years before being elected to the European Parliament in 2009. Ashley represented the South West of England & Gibraltar from 2009-2019. During that time he was the Chief Whip of the European Conservatives and Reformists Group and then Leader of the British Conservative MEPs for 4 years. He served on the Industry, Research & Energy committee and the Economic & Monetary Affairs committee.\nOn leaving the European Parliament Ashley set up his own company, Ashley Fox Consulting, which advises clients on how the EU operates.\nIn 2020 Ashley was appointed as the first Chairman of the Independent Monitoring Authority. This new public body was set up under the UK-EU Withdrawal Agreement to ensure that the rights of EU citizens in the UK were upheld. Ashley joined the board of the Financial Reporting Council as a Non Executive Director in February 2022. He stepped down from these 2 public appointments upon being selected as the Conservative candidate for Bridgwater in September 2023.\nAshley is married to Julia and they have two adult children.",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_mobile-and-broadband-survey/content_15.html": "Local crime can have a huge impact on our communities. It is vital residents feel safe in their homes and on the streets. I want to know your thoughts about crime and anti-social behaviour in your community.\nPlease take a few moments of your time to complete the survey and share your concerns on crime and anti-social behaviour.\nAs your MP, I am determined to deal with the issues affecting Bridgwater. I will report back on the results of this survey later this year and use the data to speak to our local police teams of the specific issues raised and how we combat them.",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_parliament/content_4.html": "Tweet Here, you can see the latest speeches and appearances by Ashley Fox in Parliament (provided by theyworkforyou):-",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_news/content_10.html": "Ashley Fox MP presses Government on grooming gangs scandal Friday, 2 May, 2025 Bridgwater MP Sir Ashley Fox has raised serious concerns in Parliament about the Government’s approach to tackling group-based child sexual exploitation. Speaking during an urgent question on the issue, Ashley Fox said, “My constituents in Bridgwater are horrified by the Government’s failure to order a national inquiry into the child rape gang scandal. Does the Minister share the concerns raised... Local News\nMy View on 750 Home Bower Lane Development 1st May 2025 I've written to Somerset Council to raise concerns about the planning application to build up to 750 homes between Bower Lane and the M5. I am not against... Local News\nAshley Fox MP: Law Must Treat Everyone the Same, No Exceptions 25th April 2025 Ashley Fox MP has spoken in support of emergency legislation brought forward by the Lord Chancellor, Shabana Mahmood, to prevent the introduction of sentencing... Local News\nWinners of Bridgwater & Burnham Independent Shop Awards 2025 Announced 17th April 2025 Ashley Fox MP has announced the winners of this year’s Independent Shop Awards – a celebration of the fantastic independent businesses in the Constituency. The... Local News\nAshley Fox MP Praises Welcoming Atmosphere at St Mary’s Primary 16th April 2025 St Mary’s CEVC Primary School in Bridgwater welcomed local Member of Parliament Ashley Fox for a visit this week, offering him the opportunity to see the school... Local News\nSir Ashley Fox Officially Opens New Steak Experience at The Old Vicarage Hotel in Bridgwater 14th April 2025 Bridgwater’s MP, Sir Ashley Fox, has officially opened Vicarage Kitchen – a bold new steak-focused dining experience at The Old Vicarage Hotel. The ribbon... Local News\nAshley Fox Meets Veteran Taking on VE Day Challenge 11th April 2025 A Bridgwater veteran is preparing to take on an ambitious fundraising challenge this May to mark 80 years since VE Day and raise funds for Blind Veterans UK... Local News\nAshley Fox MP: Train Dentists Locally to Fix Somerset Shortages 4th April 2025 Ashley Fox, MP for Bridgwater, has urged the Government to explore training dental students in Somerset as part of efforts to improve access to NHS dentistry... Local News\nAshley Fox MP Hosts First Annual Parish Council Summit in Wembdon 31st March 2025 Sir Ashley Fox MP has held the first Bridgwater Constituency Parish Council Summit, bringing together representatives from across the area to discuss key local... Local News\nAshley Fox MP Responds to Emergency Budget: “A Mess of Labour’s Own Making” 28th March 2025 Ashley Fox MP has criticised the Chancellor’s Emergency Budget, calling it “a mess of her own making” and a failure to take the decisive action needed to undo... Local News",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_accessibility/content_17.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_ashleyfox_org_uk_/https_www_ashleyfox_org_uk_your-views/content_9.html": "I'm dedicated to understanding and addressing the issues that matter most to you. Your opinions and feedback are invaluable to me as we strive to improve our constituency.\nBy participating in one of the surveys, you have the opportunity to share your views and make your voice heard.\nWhether it's about community issues, services, or other areas of interest, your thoughts are important to me.\nThank you for taking the time to provide your thoughts."
}