{
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_mep_html/content_5.html": "As MEP, Howitt represented the East of England since 1994. He held the titles of Co-President of the All-Party Disability Rights Group of MEPs and Spokesperson on Foreign Affairs for both British Labour and for the grouping of all centre-left MEPs in the European Parliament.\nUsing the fundamental principles of unity and solidarity from the trade union and Labour movement, Howitt has been able to make a difference in the European Parliament. He was unwavering in his support for the UN and international institutions, putting the case for peace and development in the Middle East and across the world. His work supporting human rights and workers rights saw him involved in many committees and debates.\nHowitt was also substitute on many committees in his years at the European Parliament including the Committee on Development and Cooperation; Committee on Economic and Monetary Affairs and Industrial Policy; Subcommittee on Human Rights; Committee on Employment and Social Affairs; the temporary Committee on the alleged use of European countries by the CIA for the transport and illegal detention of prisoners; Delegation to the EU-Russia Parliamentary Cooperation Committee; Subcommittee on Security and Defence; Committee on Legal Affairs; Delegation for relations with the NATO Parliamentary Assembly; Delegation for relations with the countries of South Asia; Delegation for relations with Afghanistan and Delegation to the EU-Turkey Joint Parliamentary Committee.\nHowitt helped drive European Union support for mandatory social, environmental and human rights reporting by business, starting from an initial resolution as long ago as 1999, and in the context of three successive reports on what has become widely known in business circles as the concept of Corporate Social Responsibility (CSR).\nIn 2012 Howitt helped to negotiate funding from the European Union totalling GBP 22 million to help finance food banks in the UK. Unfortunately, in 2013 the UK government refused to accept the funds, arguing that this much-needed help for food-banks would be a national responsibility, even though the reality was that they had no intention of providing government assistance. Howitt suggested the only conclusion to be made by this particular stance was that Conservative anti-European ideology was being put before the needs of the most deprived and destitute in the UK.\nHowitt was involved in consultations on barriers to long term and sustainable investment. This included visits outside Europe such as Benefit Corporations in California and companies in Asia where long-termism is already rooted to a far greater extent than elsewhere. As a result of this work European Commission President Juncker called for the establishment of an expert group to develop a comprehensive European strategy on sustainable finance.\nHowitt was one of many who got Europe to sign up to a human rights convention for the first time, and to do so for people with disabilities.\nHowitt worked for peace and human rights in Colombia when Socialist and Democrat Group Foreign Affairs Spokesperson in the European Parliament and Vice-President of Justice for Colombia. Howitt took part in secret peace talks which should secure an end to the 30 year civil war there.\nThere is an EU proposal on the table to require transparency from the biggest extractive industries, together with a new proposal on non-financial disclosure for businesses in all sectors. Howitt and others were in detailed discussions with the European Commission and other stakeholders on the detail of what the proposal would encompass.\nAfter the UK referendum result in June 2016, Howitt knew that his job as an MEP would come to an end in March 2019 due to Brexit. In his resignation speech, Howitt apologised for Brexit, saying he would continue to argue for Europe and looks forward to the day the UK returns to the European Union as a member state.",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_campaigns_html/content_11.html": "Howitt has always been keen to celebrate the continuing relevance of the trade union movement in the UK and overseas. Based on the fundamental principles of unity and solidarity, Howitt has joined others against the UK government’s proposed development aid cuts whilst achieving an agreement to put a cap on banker’s bonuses. Howitt has been involved in several other successful campaigns whilst being an MEP representing the East of England, a few of which are listed here.\nHowitt helped to win big EU investment in the region’s rail and other transport networks. He succeeded in extending eligibility so that Norfolk, Suffolk and Essex became eligible for a share of £60 million per year EU funding for twinning projects and to work with organisations such as the Prince’s Trust to run EU projects to help unemployed young people in his constituency. This was just part of the £300 million Howitt helped to attract specifically for the region.\nAt the Rio+20 talks in 2012 Howitt was supporting the UK Labour Party to seize the pro-business case for mandatory sustainability reporting. He stated that UK businesses, including all those in the FTSE100 top companies in the UK were producing annual sustainability reports under the Global Reporting Initiative (GRI), a coalition of companies, environmental NGOs and the United Nations Environment Programme. The UK Government announced plans to implement Labour's framework.\nAs a member of the Socialist Group in the European Parliament, Howitt joined campaigns against cuts and austerity, campaigning instead for jobs and services. The group won a European-wide agreement to introduce a youth jobs guarantee, which the UK Conservative government has not yet said whether or not it will implement.\nHowitt was one of many who voted all the labour rights of the Social Chapter in to British law. After the tragedy of the Rana Plaza factory collapse in Bangladesh, Howitt personally piloted through a new law to make multinationals accountable for their record overseas, including on health and safety, to ensure the same tragedy was not repeated.\nEuropean Socialists are implementing proposals for the Robin Hood Tax, a campaign fighting for everyone to pay their fair share. In the UK, this includes not just looking at tax advantages for the very wealthy, but looking also at zero-hour contracts, the bedroom tax, disability assessments, cuts to legal aid and the reduction of workplace inspectors.\nThe issue of working time is not just a UK issue. Compromise is being sought on the European rules for those not just on zero-hour contracts, but also those working excessive hours. In the UK, people have been forced to take part-time employment, with more than 300,000 people in the East of England affected this way.\nIn 2012, the oil refining sector in Europe was suffering from over-capacity, restructuring and planned closures. An oil refinery in Howitt’s constituency was marked for closure. Howitt argued that energy security around oil was just as important as the accepted arguments around gas. His concern was that unstable countries were fulfilling UK orders for refined oil and he urged the European Commission to do more.\nHowitt helped reform the UK Government’s National Contact Point under the guidelines of the OECD Guidelines on Multinational Enterprise. These allow specific complaints of social or environmental abuse by British business overseas to be investigated and determined. The reforms have been signed up in 42 countries.\nAfter the global financial crisis of 2008-09 and with the ongoing challenges of climate change, business and capital markets focus on the short-term was considered a major fault to be challenged and changed. Howitt attended the World Economic Forum with the UN Principles for Responsible Investment and the UN Global Compact, to lead a debate on shifting business and markets towards long-termism. His work on corporate governance to include accountability to other stakeholders in society, not just shareholders is one that continues after his Parliamentary career.\nWhilst in the European Parliament, Howitt had been discussing how to encourage and incentivise shareholder activism, investor engagement and how companies address social, environmental and human rights impacts of their businesses. These are as important to the future of the company as the economic impacts contained in traditional corporate reporting. Whilst sometimes called 'non-financial reporting' as an umbrella term, these impacts need to be recognised as having a real financial cost.\nThis can only happen if there is corporate governance. Boards and senior management have to see the relevance of the information so that it becomes mainstream. Whilst Howitt was part of two directives, he acknowledged these were not the perfect solutions, but still a significant step forward.",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_biography_html/content_7.html": "Howitt was raised in a single-parent family, living with his mother in a council house. He was educated at a comprehensive school before going on to study at Lady Margaret Hall, Oxford University, from where he graduated with a BA degree in Politics, Philosophy and Economics in 1982. He later added a Postgraduate Diploma in Management Studies from the University of Hertfordshire in 1992.\nAfter graduating from Oxford, Howitt worked in Harlow as a volunteer organiser for four years when he moved to become a disability rights worker in London until 1994. He has a lifelong interest in disability rights.\nPeace, democracy, human rights, the preservation of life - it is a privilege to represent our great party dealing with these great issues of our time.Richard Howitt - Eastern Regional Labour Party Annual Conference\nBetween 1983 and 1995, Howitt served as a councillor on Harlow District Council. This included three years as Leader of the council between 1991-1994. During this period he led ground-breaking work related to the assessment of local government’s environmental impact.\nIn the 1987 UK general election, Howitt was the Labour Party candidate in Billericay, but with only 19.4 percent of the vote, he came third behind the Conservative Teresa Gorman and Social Democrat Michael Birch. Billericay is staunchly conservative, with the party holding the seat since 1966.\nHowitt was a member of the Labour Party's National Policy Forum between 1994 and 2016 and a member of Labour Party Britain in the World Policy Commission since 1997.\nFrom 1994 Howitt has also been Honorary Vice-President of the UK Local Government Association and Chair of the South and East Economic Development Strategy Association.\nHowitt was also an Election Observer, working in the Democratic Republic of Congo, Angola, Afghanistan, the Palestinian territories, in the former Yugoslavia, and in Sierra Leone.",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_labour_html/content_4.html": "The UK Labour Party grew out of a growing political interest from urban workers in the late 19th century, particularly members of the trade union movement. Extensions of the voting franchise in 1867 and 1885 saw the Liberal Party endorse trade-union sponsored candidates with the first Lib–Lab candidate George Odger standing in the Southwark by-election in 1870.\nOther small socialist groups also formed around this time, with the intention of linking the trade union movement to political policies, including the Independent Labour Party set up in 1893 by Keir Hardie, a Scottish miner, elected MP for West Ham.\nIn 1900 the Trades Union Congress set up the Labour Representation Committee (LRC) to support working-class candidates in elections. Ramsey MacDonald was the LRC secretary. In 1903 the LRC and the Liberal Party secretly agreed that only one candidate (Liberal or Labour) should stand in each seat against the Conservatives in the next election.\nIn 1906 LRC-sponsored candidates won 29 seats in the election and set up as a separate party in Parliament under the formally agreed name of “The Labour Party”. Keir Hardie was elected as leader, officially Chairman of the Parliamentary Labour Party.\nFrom 1910, there were 42 elected Labour MPs. During the war years of 1914-1918, the Labour members struggled to agree on whether to support or oppose the war. After 1916, the Liberals were also struggling, split between those who supporters of Asquith versus Lloyd George.\nThe Labour Party won 63 seats at the 1918 election and increased this to 142 seats in the 1922 election when the Conservatives took over the government. The 1924 election saw Labour win 191 seats and the Liberals 158. Together formed a coalition government with Ramsey MacDonald as the first Labour prime minister, passing legislation to improve housing, education and social insurance while also addressing unemployment.\nThe Labour party was in government again, in another minority government under Ramsay MacDonald in 1929-1931, then as a junior partner in the wartime coalition from 1940-1945 and ultimately forming majority governments under Clement Attlee in 1945-1951. The Labour manifesto ‘Let us Face the Future’ laid out a bold vision, pledging to destroy the five ‘evil giants’: want, squalor, disease, ignorance and unemployment, a message which took Clement Attlee into Number 10 on the back of a landslide win of 393 seats.\nAttlee's government enacted Keynesian economic policies; presided over a policy of nationalising major industries and utilities including the Bank of England, coal mining, the steel industry, electricity, gas, and inland transport. The party developed and implemented the welfare state and the 1948 creation of Britain's National Health Service (NHS). Attlee's government also began the process of dismantling the British Empire when it granted independence to India and Pakistan in 1947, followed by Myanmar and Sri Lanka in 1948.\nThe Labour governments of 1964-70 and 1974-79 headed by Wilson and then James Callaghan were a period of great change: the Equal Pay Act of 1970, the permanent ending of the death penalty, decriminalisation of homosexuality, legislation to outlaw racial discrimination, and the establishment of the Open University.\nThe 1979 election began Labour’s wilderness years in opposition. Initially, under Michael Foot, the party began a period of contemplation and renewal. His successor, Neil Kinnock took on the work of reconstruction, with modernising reforms which would be continued by John Smith who introduced One Member One Vote (OMOV) to further democratise the people’s Party.\nFollowing the death of John Smith in 1994, Tony Blair was elected Leader, who began the era of New Labour which led to the landslide General Election win of 1997. This period saw record investment in the NHS, schools and the police; the introduction of the National Minimum Wage and devolution to Scotland, Wales and Northern Ireland and peace to the latter through the Good Friday Agreement.\nLabour lost at the 2010 and 2015 elections. Outsider Jeremy Corbyn won the party’s leadership election by a landslide and the snap election of 2017 saw the party campaign with a manifesto laying out plans for a living wage of £10 an hour; scrapping of tuition fees; mass housebuilding; investment in public services; public ownership of rail, water and post. In a shock result Labour won 262 MPs, and the Conservatives reduced their majority.\nHowitt wanted to influence the course of governance for the benefit of others. With good communication skills, commitment, high motivation and a secure and convincing manner, Howitt has the self-confidence, charisma and a great deal of patience and persistence to be a success.",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_iirc_html/content_3.html": "Founded in 2009, the International Integrated Reporting Council (IIRC) is a coalition of regulators, investors, companies, accounting professionals and non-government organisations (NGOs). The coalition works to communicate and promote corporate reporting that explains to investors how an organisation creates value over time through relationships with its key stakeholders, meaning employees, customers and products. The IIRC want corporate reports to include how the organisation understands and responds to stakeholder’s needs and interests,. IIRC believe that reporting only shareholder value is not a strategy, but a result, since it provides only limited information about a business.\nThe IIRC wants to move away from strategic decisions focused on the short-term goal of rewarding shareholders by increasing profits and dividends every quarter. They argue that this is a short-term outlook that neglects investment projects and future output.\nRichard Howitt has been involved in the evolution of Integrated Reporting from the start. He was a member of HRH The Prince of Wales Annual Forum on Accounting for Sustainability which led to the foundation of the IIRC. From the start, Howitt represented the IIRC as a voluntary Ambassador at international meetings, promoting integrated reporting within the policy and business communities, helping the IIRC achieve success in driving change in corporate reporting in more than 25 countries.\nHowitt started as Chief Executive Officer of IIRC in November 2016, succeeding Paul Druckman. Stepping down as an MEP of 22 years to take up his appointment, Howitt has been rapporteur on corporate reporting-related issues at the European Parliament. As lead-MEP on corporate responsibility, he represented the EU internationally and was pivotal in drawing up the EU’s non-financial information directive, one of the world’s biggest transformations in corporate disclosure.\nThe IIRC Board’s strategy is to embed integrated reporting principles into global corporate governance practices.\nIntegrated Reporting (IR)is a direct response to the spread of short-term risks in capital markets that cause uncertainty and volatility not just in business, but in economies, society and the environment. IR connects the financial details of an organisation with the relationships the organisation has with its key stakeholders and how it makes use of resources.\nWhen looking at short-terms aims, an organisation rarely reports how they will develop the organisation in terms of intellectual capital, or relationship building with stakeholders and customers. Minimising environmental risks are rarely considered either, yet all are critical to long-term success. IR keeps the focus on long term strategy, with forward-looking documents that cover strategy, the context in which it will delivered and how the company plans to create value for providers of goods and capital over the short, medium and long term.\nIR focus on all stakeholders including the business owners, investors and employees as well as customers, suppliers and creditors. Employees value a good working environment and pay. Customers appreciate quality, price and innovation in the products they purchase. Suppliers want a stable relationships and a fair contract. Creditors want a legitimate return on their loan. IR measures the return to each stakeholder.\nIn IR long-term production and profitability is the primary focus, leading to decisions that have been shown to increase the organisation’s competitiveness over time and builds social capital. Businesses with high social capital were shown to have higher stock returns, higher profitability, growth, and sales per employee when compared to low social capital businesses.\nTraditional company reports contain gaps since they usually focus on the short-term financials. However, if company executives can work together to think about inputs and outcomes in broader terms, the organisation can create a broader picture of what adds value to the business and what needs to be managed.\nThe IIRC has developed the International IR Framework which recognises that long term success requires sound management, good relationships, a satisfied work force and the availability of natural resources as a foundation. To date, around 1,5000 global organisations have adopted the International Integrated Reporting Framework for their business.\nThe IIRC supports companies to take the first step towards integrated reporting so there is a shared understanding amongst employees about the social and environmental risks and their impact on reputation and the bottom line.\nConsideration of inputs, outputs and outcomes help an organisation to take a broader view of the concept of value creation. These clarify their negative as well as positive impacts on financial, manufactured, intellectual, human, relationship, social and natural capital.\nFor clarification, outputs are different from outcomes. Outputs are the key products or services (together with all by-products and waste that these products or services) that create or reduce the value produced by an organisation. Outcomes are the internal and external financial consequences as a result of an organisation’s business activities and outputs.",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_index_html/content_13.html": "This website is dedicated to Richard Howitt MEP.\nRichard Stuart Howitt was born in Reading, Berkshire on 5 April 1961. He currently works as the Chief Executive Officer of the International Integrated Reporting Council IIRC, having worked as a voluntary IIRC Ambassador from 2011 where he promoted Integrated Reporting within business and policy communities. Prior to taking this post Howitt was a Member of the European Parliament for the Labour Party, a role he began in 1994.\nread moreHowitt has always been keen to celebrate the continuing relevance of the trade union movement in the UK and overseas. Based on the fundamental principles of unity and solidarity, Howitt has joined others against the UK government’s proposed development aid cuts whilst achieving an agreement to put a cap on banker’s bonuses. Howitt has been involved in several other successful campaigns whilst being an MEP representing the East of England, a few of which are listed here.\nread moreAs MEP, Howitt represented the East of England since 1994. He held the titles of Co-President of the All-Party Disability Rights Group of MEPs and Spokesperson on Foreign Affairs for both British Labour and for the grouping of all centre-left MEPs in the European Parliament.\nread moreRichard Howitt got into politics because he had the aspiration to change things, particularly for people with disabilities.\nUsing the fundamental principles of unity and solidarity from the trade union and Labour movement, Howitt has been able to make a difference in the European Parliament.\nIt is no longer sufficient for the Company Executive to say \"I didn't know.\" The concept of 'due diligence' says: \"You should know.\"\nRichard Howitt MEP, Openining Speech at CSR Europe ConferenceIn October 2016 Howitt announced his resignation from the European Parliament to join the financial services sector by becoming CEO of the International Integrated Reporting Council (IIRC). He said he would be replaced as Labour MEP for the East of England by his former press secretary Alex Mayer without the need for an election, due to the closed list electoral system European elections operate under. The UK will no longer send representatives to the European Parliament after March 2019.\nAs the lead on corporate responsibility across four terms (20 years) of the European Parliament, Howitt was a key architect of the EU’s non-financial information law, giving him the skills and experience necessary to be CEO at the IIRC which describes itself as a global coalition of companies, investors, regulators, standard setters, the accounting profession and NGOs.\nRead the latest articles from our blog on politics.\nThe Labour Party has promised to tackle what it has termed the Hidden Epidemic of gambling addiction and wants to protect children from exposure to betting at an early age by barring betting firms sponsoring football shirts.\nread moreThe Labour party line with regards to the EU referendum was to support the remain campaign, but Labour Leader Jeremy Corbyn has since said the people have voted and the decision should be respected. However, the Labour Party, together with the Greens and Liberal Democrats, wanted to see an immediate guarantee that EU citizens staying in the country could remain. The Conservatives did not oblige.\nread moreRichard Howitt has always been aware that pulling down barriers creates a better world for most people. A big supporter of the UK being a member state of the EU, Howitt appreciates the free movement across Europe and the fact that laws created in the European parliament have bought tangible benefits to people in Britain.\nread more",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com/content_1.html": "This website is dedicated to Richard Howitt MEP.\nRichard Stuart Howitt was born in Reading, Berkshire on 5 April 1961. He currently works as the Chief Executive Officer of the International Integrated Reporting Council IIRC, having worked as a voluntary IIRC Ambassador from 2011 where he promoted Integrated Reporting within business and policy communities. Prior to taking this post Howitt was a Member of the European Parliament for the Labour Party, a role he began in 1994.\nread moreHowitt has always been keen to celebrate the continuing relevance of the trade union movement in the UK and overseas. Based on the fundamental principles of unity and solidarity, Howitt has joined others against the UK government’s proposed development aid cuts whilst achieving an agreement to put a cap on banker’s bonuses. Howitt has been involved in several other successful campaigns whilst being an MEP representing the East of England, a few of which are listed here.\nread moreAs MEP, Howitt represented the East of England since 1994. He held the titles of Co-President of the All-Party Disability Rights Group of MEPs and Spokesperson on Foreign Affairs for both British Labour and for the grouping of all centre-left MEPs in the European Parliament.\nread moreRichard Howitt got into politics because he had the aspiration to change things, particularly for people with disabilities.\nUsing the fundamental principles of unity and solidarity from the trade union and Labour movement, Howitt has been able to make a difference in the European Parliament.\nIt is no longer sufficient for the Company Executive to say \"I didn't know.\" The concept of 'due diligence' says: \"You should know.\"\nRichard Howitt MEP, Openining Speech at CSR Europe ConferenceIn October 2016 Howitt announced his resignation from the European Parliament to join the financial services sector by becoming CEO of the International Integrated Reporting Council (IIRC). He said he would be replaced as Labour MEP for the East of England by his former press secretary Alex Mayer without the need for an election, due to the closed list electoral system European elections operate under. The UK will no longer send representatives to the European Parliament after March 2019.\nAs the lead on corporate responsibility across four terms (20 years) of the European Parliament, Howitt was a key architect of the EU’s non-financial information law, giving him the skills and experience necessary to be CEO at the IIRC which describes itself as a global coalition of companies, investors, regulators, standard setters, the accounting profession and NGOs.\nRead the latest articles from our blog on politics.\nThe Labour Party has promised to tackle what it has termed the Hidden Epidemic of gambling addiction and wants to protect children from exposure to betting at an early age by barring betting firms sponsoring football shirts.\nread moreThe Labour party line with regards to the EU referendum was to support the remain campaign, but Labour Leader Jeremy Corbyn has since said the people have voted and the decision should be respected. However, the Labour Party, together with the Greens and Liberal Democrats, wanted to see an immediate guarantee that EU citizens staying in the country could remain. The Conservatives did not oblige.\nread moreRichard Howitt has always been aware that pulling down barriers creates a better world for most people. A big supporter of the UK being a member state of the EU, Howitt appreciates the free movement across Europe and the fact that laws created in the European parliament have bought tangible benefits to people in Britain.\nread more",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_cdn-cgi_l_email-protection/content_8.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_future-plans_html/content_10.html": "September 01, 2017\nCurrently studying Politics at the University of Essex\nLabour Party supporter\nFirmly believes in Richard Howitt's ideas to improve working conditions for people with disabilities\nThe Labour party line with regards to the EU referendum was to support the remain campaign, but Labour Leader Jeremy Corbyn has since said the people have voted and the decision should be respected. However, the Labour Party, together with the Greens and Liberal Democrats, wanted to see an immediate guarantee that EU citizens staying in the country could remain. The Conservatives did not oblige.\nSince the referendum, talks between UK Brexit Secretary David Davies and the EU’s chief Brexit negotiator Michel Barnier remain stalled at the financial commitment stage, with the UK estimated to owe around £60bn. Jeremy Corbyn and shadow Brexit Secretary Keir Sharmer met with Michel Barnier in October 2017 to discuss the negotiations.\nLabour’s concern has been growing that the Conservative government will get to March 2019 with no deal. This means the country falls out of the EU and moves to World Trade Organisation rules which will threaten jobs across the UK.\nLabour’s 2017 manifesto, written for the snap election, included a pledge that the party would scrap the Brexit white paper and replace it with a new list of negotiation priorities. It also added that The Great Repeal Bill would be replaced with an EU rights and protections bill that would ensure workers' rights would be safeguarded. A week before the election, in a campaign speech, Jeremy Corbyn said that it was not a Labour policy option to walk away from the Brexit negotiations with no deal.\nThe referendum result has been accepted by Labour who intend to build a close new relationship with Europe, not as members but as partners. A year after the Brexit result the party announced they would retain the benefits of single market and customs union as well as membership of European research and development groups.\nWhilst immediately guaranteeing the existing rights of EU nationals living in the UK, the party would secure reciprocal rights for UK citizens living in any other EU country.\nLabour will speak plainly for Ireland to retain a customs union so that a border will not return.\nThe Conservatives, having stated that ‘no deal’ was better than a ‘bad deal’ have since conceded the need for a two-year transition period in a platitudinous and divisive speech by Theresa May in Florence. The Labour party would also make transitional arrangements at the end of Article 50 negotiations, for a period of four years.\nIt has not been made clear that if a transition period is agreed, under whose law the UK will operate under during this period, nor how it would work. There is no indication the EU would agree to a transition period, and the government cannot ask until the wisdom and legitimacy of asking for such a thing has been decided. The Brexit vote was emotional, but carrying out agreed Brexit terms must be based on facts and only then can the policy be shaped.\nPremier League shirt sponsorship for the 2017/18 season has earned the clubs £280m, with the value trebling in just seven years with a total that is more than double the fees earned by clubs in the Bundesliga.\nSince the referendum, talks between UK Brexit Secretary David Davies and the EU’s chief Brexit negotiator Michel Barnier remain stalled at the financial commitment stage, with the UK estimated to owe around £60bn.",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_blog-archive_html/content_9.html": "August 16, 2017\nBrexit came about because some members of the UK Conservative party wished to regain sovereignty from the EU and hoped that the threat of a British exit from the EU would strike such fear into the EU members states that they would be willing to restore British sovereignty whilst allowing the UK to continue reaping the rewards of a single market.\nread moreOctober 10, 2017\nPremier League shirt sponsorship for the 2017/18 season has earned the clubs £280m, with the value trebling in just seven years with a total that is more than double the fees earned by clubs in the Bundesliga. Previously shirt sponsorship was the domain of beer companies, but now nine Premier League clubs are tied to betting companies and the industry has spend £47.3m on shirt deals.\nread moreSeptember 01, 2017\nSince the referendum, talks between UK Brexit Secretary David Davies and the EU’s chief Brexit negotiator Michel Barnier remain stalled at the financial commitment stage, with the UK estimated to owe around £60bn. Jeremy Corbyn and shadow Brexit Secretary Keir Sharmer met with Michel Barnier in October 2017 to discuss the negotiations.\nread more",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_privacy_html/content_12.html": "At richardhowittmep.com, one of our main priorities is the privacy of our visitors. This Privacy Policy document contains types of information that is collected and recorded by richardhowittmep.com and how we use it.\nIf you have additional questions or require more information about our Privacy Policy, do not hesitate to contact us through email at [email protected].\nrichardhowittmep.com follows a standard procedure of using log files. These files log visitors when they visit websites. All hosting companies do this and a part of hosting services’ analytics. The information collected by log files include internet protocol (IP) addresses, browser type, Internet Service Provider (ISP), date and time stamp, referring/exit pages, and possibly the number of clicks. These are not linked to any information that is personally identifiable. The purpose of the information is for analyzing trends, administering the site, tracking users’ movement on the website, and gathering demographic information.\nLike any other website, richardhowittmep.com uses ‘cookies’. These cookies are used to store information including visitors’ preferences, and the pages on the website that the visitor accessed or visited. The information is used to optimize the users’ experience by customizing our web page content based on visitors’ browser type and/or other information.\nYou may consult this list to find the Privacy Policy for each of the advertising partners of richardhowittmep.com.\nThird-party ad servers or ad networks uses technologies like cookies, JavaScript, or Web Beacons that are used in their respective advertisements and links that appear on richardhowittmep.com, which are sent directly to users’ browser. They automatically receive your IP address when this occurs. These technologies are used to measure the effectiveness of their advertising campaigns and/or to personalize the advertising content that you see on websites that you visit.\nNote that richardhowittmep.com has no access to or control over these cookies that are used by third-party advertisers.\nrichardhowittmep.com’s Privacy Policy does not apply to other advertisers or websites. Thus, we are advising you to consult the respective Privacy Policies of these third-party ad servers for more detailed information. It may include their practices and instructions about how to opt-out of certain options.\nYou can choose to disable cookies through your individual browser options. To know more detailed information about cookie management with specific web browsers, it can be found at the browsers’ respective websites. What Are Cookies?\nAnother part of our priority is adding protection for children while using the internet. We encourage parents and guardians to observe, participate in, and/or monitor and guide their online activity.\nrichardhowittmep.com does not knowingly collect any Personal Identifiable Information from children under the age of 13. If you think that your child provided this kind of information on our website, we strongly encourage you to contact us immediately and we will do our best efforts to promptly remove such information from our records.\nThis privacy policy applies only to our online activities and is valid for visitors to our website with regards to the information that they shared and/or collect in richardhowittmep.com. This policy is not applicable to any information collected offline or via channels other than this website.\nBy using our website, you hereby consent to our Privacy Policy and agree to its Terms and Conditions.",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_betting-banned_html/content_6.html": "October 10, 2017\nCurrently studying Politics at the University of Essex\nLabour Party supporter\nFirmly believes in Richard Howitt's ideas to improve working conditions for people with disabilities\nThe Labour Party has promised to tackle what it has termed the Hidden Epidemic of gambling addiction and wants to protect children from exposure to betting at an early age by barring betting firms sponsoring football shirts.\nPremier League shirt sponsorship for the 2017/18 season has earned the clubs £280m, with the value trebling in just seven years with a total that is more than double the fees earned by clubs in the Bundesliga. Previously shirt sponsorship was the domain of beer companies, but now nine Premier League clubs are tied to betting companies and the industry has spend £47.3m on shirt deals.\nThis is all the more surprising as these gambling company deals have been signed just one month after the Football Association terminated an annual £4m contract with Ladbrokes because of a series of high-profile betting controversies in the sport, and the FA have agreed they will no longer have a sponsorship deal with any betting company.\nThe 2017/18 clubs and their sponsors name and headquarters, together with their sponsorship figure for the season are:\nWhilst these clubs account for 45 percent of the league, the reality is that the number of gambling firms involved in sponsoring Premier League club's shirts has dropped since the end of the 2016-17 season, which was the peak for betting on the front of shirts, being seen on 10 teams. In England’s second and third tiers, 16 other clubs have also agreed shirt sponsorship with betting companies.\nThe companies that sponsor these teams do not appear to have been put off by the UK Gambling Act, 2014 which requires companies that sponsor teams in the UK to obtain a licence and pay a 15 percent tax on profits from UK customers. Currently only Bet365 and Betway have a significant presence in the UK but lately many operators try to get a share of the market by offering amazing promotions for casino gamblers. ManBetX (Crystal Palace) and OPE Sports (Huddersfield) are sponsoring in the Premier League for the first time this season and like the other lesser known companies of LeTou, M88, Dafabet and SportPesa, the UK market is not particularly important to them, since they are just using the global appeal of the Premier League to entice new customers from Asia and elsewhere.\nDiscussions have already begun about banning gambling adverts on television. The CEO of William Hill has said he is sympathetic to a review around the level of advertising and already in Australia, gambling adverts are banned before 20:30hrs and are not allowed from five minutes before play starts until five minutes after it ends.\nLabour wants to take this one step further and ban football clubs from signing shirt sponsorship deals with betting companies. Deputy leader of the Labour Party, Tom Watson, who is the shadow minister for digital, culture media and sport, has said a Labour government would encourage the Football Association to implement its own ban, but was prepared to legislate if necessary.\nThe Football Association already bans betting firms from sponsoring youth teams under rules that state that clothing can not display products considered “detrimental to the welfare, health or general interests of young persons”. Labour sources say that the FA should extend this thinking to the millions of children who watch football and that promotion of gambling should go the same way as tobacco sponsorship which ended in 2005.\nThe Gambling Commission published a report estimating that the number of people aged over-16 in the UK and considered to be problem gamblers has grown by a third in three years, suggesting that about 430,000 people suffer from an addiction. Labour is concerned that shirt sponsorship means football clubs don’t take problem gambling among their own fans seriously enough. Labour wants clubs to follow the FA’s lead and remove gambling logos from football shirts, but understands that the potential loss of sponsorship funding could be considerable.\nIt is not just the shirts. The broadcasting of football matches and highlights shows tend to feature close-up shots showing advertising billboards as well as player’s shirts and most post-match interviews are conducted in front of boards covered with company logos.\nLabour is considering new plans compelling gambling operators to fund treatment for gambling addicts. The Labour party hopes their plans will apply pressure on the Conservative-led government to publish its own gambling review findings. The Conservative government is challenged by the potential tax losses if gambling is banned, as the difference would be significant.\nPremier League shirt sponsorship for the 2017/18 season has earned the clubs £280m, with the value trebling in just seven years with a total that is more than double the fees earned by clubs in the Bundesliga.\nSince the referendum, talks between UK Brexit Secretary David Davies and the EU’s chief Brexit negotiator Michel Barnier remain stalled at the financial commitment stage, with the UK estimated to owe around £60bn.",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_sitemap_html/content_2.html": "Premier League shirt sponsorship for the 2017/18 season has earned the clubs £280m...\nBrexit came about because some members of the UK Conservative party...",
  "http_www_richardhowittmep_com_/http_www_richardhowittmep_com_brexit_html/content_14.html": "August 16, 2017\nCurrently studying Politics at the University of Essex\nLabour Party supporter\nFirmly believes in Richard Howitt's ideas to improve working conditions for people with disabilities\nBrexit came about because some members of the UK Conservative party wished to regain sovereignty from the EU and hoped that the threat of a British exit from the EU would strike such fear into the EU members states that they would be willing to restore British sovereignty whilst allowing the UK to continue reaping the rewards of a single market. David Cameron, called for an EU referendum to placate members of his party who felt that his renegotiation of the terms of the country’s membership had created a draft deal they could not accept. Failing to convince the public, and his own MPs, that Britain should continue its EU membership, the UK opted for Brexit and Cameron resigned.\nBrexit remains an unknown quantity as discussions are still ongoing. Howitt believes there are several effects that may be seen after March 2019 when Britain is no longer a member of the European Union. Here are some:\nAs a member of the EU, citizens have freedom of movement across all member states, not just for holidays, but to live and to work. It also means that UK nationals can retire anywhere in Europe and still receive their UK pension. After Brexit, UK nationals living outside of the EU will not see an increase in their state pension each year. Visas are likely to be needed when visiting other European countries.\nEU member states have agreed that all EU citizens on holiday have the right to receive emergency healthcare in whichever country they are taking a vacation. A British citizen travelling outside the EU and in a country without a UK embassy, can ask for consular protection from any EU embassy. These benefits are unlikely to exist post March 2019.\nIn 2015 a report published by the Centre for Economics and Business Research estimated that more than 3 million jobs in the UK were linked to British exports to the EU, with the figure expected to reach 3.8 million by 2030. The UK exports about 45 percent of trade to the EU and imports about 53 percent of goods and services from the EU. It is likely that trading terms will not be as favourable as those between EU member states since the EU does not want other countries to leave the union.\nAbout two-thirds of small and medium-sized enterprises and two-thirds of the membership of the Confederation of British Influence (CBI) say the EU has had an overall positive impact on their business. The CBI have stated that the financial benefit of being an EU member is around £62-£78bn per year, which is about 4-5 percent of the UK’s GDP. Out of the EU the UK will revert to the World Trade Organisation rules for global business.\nBritish farmers are helped by considerable EU subsidies to maintain agriculture and ensure job stability for those directly and indirectly involved in farming. In the months since the EU referendum result, the number of European nationals who have left the UK due to continued uncertainty about their right to remain in the UK, has seen talk of migration control post-Brexit to be dropped as an unnecessary discussion.\nMany financial institutions and other businesses are already preparing to move to an EU country so as not to have to deal with border controls or immigration issues. Frankfurt is already waiting to welcome several banks, whilst other companies in the UK are turning to EU countries, particularly Ireland with its low business tax rates.\nThe majority of UK worker rights gained in recent years, from paternity rights to holidays have been EU directed. It is as yet unclear if these will remain in force once the UK is no longer an EU member state.\nCurrently, every EU citizen has equal consumer rights when shopping anywhere in Europe, which ensures the quality and safety of products. Two examples are the two-year guarantee on all products and the ceiling for roaming charges across the member states. It is also the reason the UK does not import food from the USA, because the food does not meet EU standards.\nHowitt’s main focus of interest within the EU aside from corporate reporting is in relation to people with disabilities. The EU has enacted a large number of disability rights and European social funding has supported people with disabilities into employment. Howitt’s concern is whether, when Britain leaves the EU, the UK government will reinstate each and every right offered by the EU.\nHowitt supported the Labour Party by campaigning against Brexit in the referendum. He now says the result must be honoured, with Labour aiming to keep workers' and consumer rights protected and environmental protections maintained. Labour wants to guarantee the rights of EU nationals living and working in the UK to stay in the country from \"day one\", with no target numbers for migration levels.\nThe current Conservative position is for a two-year transition and a hard Brexit, which means removing the UK from the customs union, Euratom (The European Atomic Energy Community) and the European Court.\nLabour has called for a four-year transition arrangement, during which Britain would remain a full member of the customs union and the single market. Labour wants a transition deal that stretches past the next election on 5 May 2022, which it hopes to win. Then it can decide a final deal or return Britain to full membership of the EU, if the other 27 member states agree.\nPremier League shirt sponsorship for the 2017/18 season has earned the clubs £280m, with the value trebling in just seven years with a total that is more than double the fees earned by clubs in the Bundesliga.\nSince the referendum, talks between UK Brexit Secretary David Davies and the EU’s chief Brexit negotiator Michel Barnier remain stalled at the financial commitment stage, with the UK estimated to owe around £60bn."
}