{
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_news_the-official-estimate-of-the-collateral-damage/content_16.html": "Friday saw the publication of the Government’s assessment of direct and indirect impacts of COVID-19 on excess mortality and morbidity. The Daily Mail has the details:\nMore than 100,000 people are likely to die from non-coronavirus causes because of the pandemic, according to an official Government estimate.\nBy the end of next month the chaos in hospitals and care homes will have led to 46,000 avoidable deaths, Department of Health research has suggested.\nCancellations to routine operations may cause 18,000 excess deaths in the long-term, on top of hundreds more from cancer.\nOfficials calculated that over the next few years another 40,000 people may die due to the economic impact of lockdown, including rising unemployment and mental health issues.\nThe Government paper says the overall death toll of the pandemic will be 222,000, with 54% dying from the virus.\nOverall, scientists suggest there will be 105,000 additional deaths because of the enormous disruption to non-Covid NHS care, as well as the economic downturn.\nThe document, dated December 17th and published yesterday by the Scientific Advisory Group for Emergencies (SAGE), was drawn up by civil servants at the Department of Health, the Office for National Statistics and the Home Office.\nIt laid bare the unintended consequences of lockdown in detail, but stressed that the overall death toll would be far higher without the draconian restrictions.\nSo far more than 103,000 people in the UK have died after testing positive for COVID-19.\nWithout lockdown, another 97,000 would have died from this winter alone, the report said.\nThe document also suggested the number of virus deaths could reach 122,000 by the end of next month…\nThe research supports a series of warnings from health charities that non-Covid patients are becoming “collateral damage” of the pandemic.\nIt said that plummeting non-Covid hospital admissions led to 4,000 excess deaths early in the pandemic, when many people avoided A&E even when they were suffering a heart attack or stroke.\nContinuing disruption to emergency care could lead to a further 10,000 deaths in the second wave, the document said.\nThe cancellation of operations and outpatient appointments could cause 18,200 deaths.\nAnd the impact on GP services could result in at least 1,400 deaths over five years from missed cancer diagnoses, according to an early estimate which only examined figures up to August.\nExcess deaths from non-Covid among adults receiving social care could hit 32,000 by the end of March due to reduced support and a rush to discharge vulnerable patients from hospital.\nThe report illustrated how even with a successful vaccination programme deaths are likely to remain well above pre-pandemic levels for years.\nOf the 222,000 toll, 61,000 deaths were estimated to take place after this March.\nThe report said that the health impact of the ensuing recession is likely to be much worse than previously feared because “the bounce-back and recovery are likely to be at a slower pace than previously predicted”.\nWhen assessing the Government’s claim that the Covid death toll would be roughly twice as high absent the three lockdowns, it’s worth remembering that Sweden’s deaths per million in 2020 were bang on the EU average in spite of not imposing any lockdowns last year. That suggests the lockdowns imposed in every other EU member state did nothing to reduce Covid mortality.\nThe report itself goes into more detail.\nUnder our central scenario there is a loss of approximately 1.3 million QALYs as a consequence of this pandemic induced recession. These health losses are largely accrued in the medium to long-term, with the morbidity affects largely falling in the medium term and the resultant mortality impacts falling in the longer-term. Under the upside scenario, there is an estimated 0.23 million QALY loss in the medium and long-run and under the downside scenario, there is an estimated 2.7 million QALY loss in the medium and long-run from COVID-19\nOverall, our analysis suggests that the recession resulting from COVID-19 and restrictions on activities to contain it could have large effects on lives through unemployment, mental health impacts, loss of income and increased financial uncertainty. These impacts are likely to have medium and long-term consequences on population health in terms of increased morbidity and mortality\nThis analysis also presents an increase in the impact of the recession on medium and long-term health compared to our previous update. This is because more recent economic forecasts suggest the bounce-back and recovery are likely to be at a slower pace than previously predicted, and therefore the health impacts from the economic downturn accumulate over a longer period of time than previously considered.",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_category_news_elections/content_19.html": "Registered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info\nCategory Archives: Elections\nManifesto – Bury South 2024\nWhether standing in local, general, or mayoral elections my beliefs and aims for our area remain the same, they don’t alter with each election just to gain votes, what you see is what you get. The English Democrats also don’t … Continue reading\nPosted in Elections, News\nTagged English Democrats, Indy4England, Parliament for England, RejectBritishRule, Stephen Morris\nComments Off on Manifesto – Bury South 2024",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_category_news/content_6.html": "Registered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info\nCategory Archives: News\nThe Illusion of choice – Unveiling the UK’s Corrupt Voting System\nThe documentary examines the current voting system in the UK and explores the limitations and implications of the first-past-the-post system in comparison to a proportional representation system. Through interviews with experts, politicians, and voters, the film highlights the flaws of … Continue reading\nPosted in News\nComments Off on The Illusion of choice – Unveiling the UK’s Corrupt Voting System\nManifesto – Bury South 2024\nWhether standing in local, general, or mayoral elections my beliefs and aims for our area remain the same, they don’t alter with each election just to gain votes, what you see is what you get. The English Democrats also don’t … Continue reading\nPosted in Elections, News\nTagged English Democrats, Indy4England, Parliament for England, RejectBritishRule, Stephen Morris\nComments Off on Manifesto – Bury South 2024\nGM Mayoral Election – Work to end foodbank dependency\n#Morris4GMMayor – I’ve pledged my support to work in ending the need for #foodbanks in my community if I am elected Mayor of Greater Manchester on 6 May. I believe that together we can build a #HungerFreeFuture @TrussellTrust > https://www.trusselltrust.org/2021-elections/ … Continue reading\nGM Mayoral Election – Creative Workforce Pledge\nI have signed the Creative Workforce Pledge to show I value, respect and support the creative and cultural workforce in our area. By protecting and promoting good employment in these sectors, we can kickstart our economic recovery, improve our local … Continue reading\nPosted in GM Mayor, News\nLeave a comment\nThe Official Estimate of the Collateral Deaths due to UK Government imposed Lockdowns and Restrictions on medical treatment in England.\nFriday saw the publication of the Government’s assessment of direct and indirect impacts of COVID-19 on excess mortality and morbidity. The Daily Mail has the details: More than 100,000 people are likely to die from non-coronavirus causes because of the pandemic, according to an … Continue reading\nPosted in News\nComments Off on The Official Estimate of the Collateral Deaths due to UK Government imposed Lockdowns and Restrictions on medical treatment in England.\nThe Battle for Greater Manchester is on, Friend!\nGive Burnham The Boot! Help Elect Stephen Morris as Mayor of Greater Manchester Friend, our National Secretary, Stephen Morris will be running against Sharia-Appeasing Andy Burnham for the Mayoralty of Greater Manchester. Only Stephen has the vision and the determination … Continue reading\nPosted in GM Mayor\nTagged English Democrats, English parliament, Indy4England, Workers of England\nComments Off on The Battle for Greater Manchester is on, Friend!",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_news_gmmayor_gmmayor_2021_1/content_11.html": "Give Burnham The Boot!\nHelp Elect Stephen Morris as Mayor of Greater Manchester\nFriend, our National Secretary, Stephen Morris will be running against Sharia-Appeasing Andy Burnham for the Mayoralty of Greater Manchester.\nOnly Stephen has the vision and the determination to make Greater Manchester a safer place for our daughters and better place to live for our people.\nStephen is the General Secretary for the Workers of England Union and been fighting against the Politically Correct Brigade and anti-English discrimination for over a decade!\nIf Stephen is elected he will automatically become the Police Commissioner of Greater Manchester and then we can finally start tackling the Islamic Grooming Gangs that plague the English people.\nStephen is promising to purge and prosecute the police officers that facilitated the grooming of our daughters and granddaughters.\nManchester’s Islamists vote Burnham…English Patriots vote for Stephen!\nThis is our opportunity to stand up and protect OUR girls.\n“Sharia-appeasing” Andy has washed his hands of the English people and looked the other way as tens of thousands of English girls were enslaved, pimped out, tortured and raped by the enemies of England.\nOn Andy Burnham’s watch, we even saw the most deadly single terror attack in our nation’s history at the Manchester arena, and what did “sharia-appeasing” Andy do in its aftermath…he condemned the non-existent backlash against Islamic community.\nWe are gearing up for this showdown, but we need your help. We want to rock the establishment and send Burnham to the back of the Dole Queue.\nWe will do everything in our power to achieve victory but our success depends on your support, Friend.\nGet behind our campaign and let’s replace traitorous Andy with a real English patriot!\nWill you back Stephen for Mayor of Greater Manchester, Friend?\nYours sincerely\nRobin Tilbrook Party Chairman",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info/content_1.html": "The documentary examines the current voting system in the UK and explores the limitations and implications of the first-past-the-post system in comparison to a proportional representation system. Through interviews with experts, politicians, and voters, the film highlights the flaws of the current system, such as wasted votes and disproportionate outcomes.\nThe documentary also delves into the history of voting reform in the UK and analyses the potential benefits of transitioning to a proportional representation system. Ultimately, the film argues for the need to update the UK’s voting system to better reflect the diversity of political opinions and ensure fair representation for all citizens.\nPosted inNews|Comments Off on The Illusion of choice – Unveiling the UK’s Corrupt Voting System\nWhether standing in local, general, or mayoral elections my beliefs and aims for our area remain the same, they don’t alter with each election just to gain votes, what you see is what you get.\nThe English Democrats also don’t use a party whip system, as such I am free to campaign and vote on issues that I believe in, unlike some other candidates from other parties that if elected have to toe the party line.\nBefore becoming the General Secretary for the Workers of England Union in 2017 I spent 15 years working in various departments on Metrolink Tram network, where for 7 years I was also the Unite Branch Secretary. Prior to Metrolink I spent 15 years managing various retail stores.\nMarried to Valerie we have 3 children, I have lived in Bury for over 37 years (Val for over 50 years) and my youngest child still attends the local high school.\nBelow are a few bullet points which I am committed to achieving.\nAims for our Police service\nUnder Labours failed leadership Greater Manchester Police was placed under special measures, only the 2nd Police force ever to be put under special measures. Labour Councillors fail to hold the Labour Mayor to account over our failed Police service.\nTo make sure Greater Manchester Police enforce the laws of England without fear or favour.\nTo make sure our Police service prosecute those responsible for sexual crimes against children, and those in authority who failed those children.\nZero tolerance policy towards political correctness in Policing.\nAims for our Economy\nThat businesses tendering for local Government contracts have Family-Friendly Policies.\nLocal hiring – Businesses tendering for local Government contracts will be encouraged to hire people who live close to the place of work.\nNo local Government contracts will be issued to a company that is ultimately controlled by a regime that has ongoing human rights violations.\nAims for Health and Social Care\nMental Health is now a major concern, my focus will be on pushing for wider community support for people living with mental illness.\nCare units will be set up to take all the homeless off the streets of Greater Manchester.\nA program for the early diagnosis of cancer will be rolled out across residents of Greater Manchester.\nAims for Transport\nTo stop any Greater Manchester Road Tax (Congestion charge), Emissions Zone tax, or whatever other label the other parties attach to it. We should encourage people to use alternative public transport where available, and look to provide it where its not, we should not add any more tax burdens on the people and businesses of our area.\nTo campaign for peak fares to be abolished on Greater Manchester public transport.\nGreater use will be made of city cycleways and pedestrian friendly areas.\nReview of all bus lanes, whether they help or hinder traffic flow, and those bus lanes which hinder traffic flow to be removed.\nAims for Planning and Environment\nTo stop building on Green Belt land.\nThat planning applications on brownfield sites located with greenbelt areas be tightly monitored, so not to adversely affect the surrounding greenbelt area.\nResidential Housing:\nThat all new housing applications will be required to have solar energy installed.\nThat all new residential flats will have to have car park facilities built underneath the building; areas above ground should be given to residential homes and not made into car parks.\nIndustrial units:\nThat all new industrial units will have to have solar panels installed\nThat all new industrial units will have to have car parking facilities built under their units, areas above ground should be given to industrial units and not made into car parks\nImplement a review on the feasibility of Small Hydroelectric Turbine Generators – making use of our rivers could be a possibility.\n‘Together Declaration’ – candidate Questions\nFREE SPEECH – I WILL BACK LAWS TO PREVENT ‘DEBANKING’ FOR POLITICAL REASONS\nHEALTH – WE MUST MAKE OUR OWN HEALTH DECISIONS, NOT “OUTSOURCE” THEM TO THE WORLD HEALTH ORGANSIATION.\nHEALTH – I WILL COMMIT TO REFORMING OUR OWN PUBLIC HEALTH ACT WHICH GAVE US LOCKDOWNS.\nHEALTH AND SOCIAL CARE– I WILL DEFEND INFORMED CONSENT IN ALL TREATMENT AND CARE DECISIONS.\nNET ZERO – I PLEDGE TO ENSURE THE PUBLIC GETS TRANSPARENCY INTO FUNDING AND INFLUENCE ON NET ZERO POLICIES.\nGreater Manchester Mayor Accountability\nThere is a lack of transparency surrounding the conduct and behaviour of the Greater Manchester Combined Authority (GMCA) and Greater Manchester Mayor, as such I support the introduction of a London-style assembly which would scrutinise the GMCA and GM Mayor in a transparent manner which voters can engage with. The current system used by Labour is not as transparent on its actions as it should be.\n#Morris4GMMayor – I’ve pledged my support to work in ending the need for #foodbanks in my community if I am elected Mayor of Greater Manchester on 6 May. I believe that together we can build a #HungerFreeFuture @TrussellTrust > https://www.trusselltrust.org/2021-elections/\nI have consistently campaigned to abolish Child Poverty, Deprivation and Homelessness spreading across our area under Labour, and this message is also in my Mayoral address to voters of Greater Manchester.\nI have signed the Creative Workforce Pledge to show I value, respect and support the creative and cultural workforce in our area. By protecting and promoting good employment in these sectors, we can kickstart our economic recovery, improve our local communities and build back better.\nMore than 100,000 people are likely to die from non-coronavirus causes because of the pandemic, according to an official Government estimate.\nBy the end of next month the chaos in hospitals and care homes will have led to 46,000 avoidable deaths, Department of Health research has suggested.\nCancellations to routine operations may cause 18,000 excess deaths in the long-term, on top of hundreds more from cancer.\nOfficials calculated that over the next few years another 40,000 people may die due to the economic impact of lockdown, including rising unemployment and mental health issues.\nThe Government paper says the overall death toll of the pandemic will be 222,000, with 54% dying from the virus.\nOverall, scientists suggest there will be 105,000 additional deaths because of the enormous disruption to non-Covid NHS care, as well as the economic downturn.\nThe document, dated December 17th and published yesterday by the Scientific Advisory Group for Emergencies (SAGE), was drawn up by civil servants at the Department of Health, the Office for National Statistics and the Home Office.\nIt laid bare the unintended consequences of lockdown in detail, but stressed that the overall death toll would be far higher without the draconian restrictions.\nSo far more than 103,000 people in the UK have died after testing positive for COVID-19.\nWithout lockdown, another 97,000 would have died from this winter alone, the report said.\nThe document also suggested the number of virus deaths could reach 122,000 by the end of next month…\nThe research supports a series of warnings from health charities that non-Covid patients are becoming “collateral damage” of the pandemic.\nIt said that plummeting non-Covid hospital admissions led to 4,000 excess deaths early in the pandemic, when many people avoided A&E even when they were suffering a heart attack or stroke.\nContinuing disruption to emergency care could lead to a further 10,000 deaths in the second wave, the document said.\nThe cancellation of operations and outpatient appointments could cause 18,200 deaths.\nAnd the impact on GP services could result in at least 1,400 deaths over five years from missed cancer diagnoses, according to an early estimate which only examined figures up to August.\nExcess deaths from non-Covid among adults receiving social care could hit 32,000 by the end of March due to reduced support and a rush to discharge vulnerable patients from hospital.\nThe report illustrated how even with a successful vaccination programme deaths are likely to remain well above pre-pandemic levels for years.\nOf the 222,000 toll, 61,000 deaths were estimated to take place after this March.\nThe report said that the health impact of the ensuing recession is likely to be much worse than previously feared because “the bounce-back and recovery are likely to be at a slower pace than previously predicted”.\nWhen assessing the Government’s claim that the Covid death toll would be roughly twice as high absent the three lockdowns, it’s worth remembering that Sweden’s deaths per million in 2020 were bang on the EU average in spite of not imposing any lockdowns last year. That suggests the lockdowns imposed in every other EU member state did nothing to reduce Covid mortality.\nUnder our central scenario there is a loss of approximately 1.3 million QALYs as a consequence of this pandemic induced recession. These health losses are largely accrued in the medium to long-term, with the morbidity affects largely falling in the medium term and the resultant mortality impacts falling in the longer-term. Under the upside scenario, there is an estimated 0.23 million QALY loss in the medium and long-run and under the downside scenario, there is an estimated 2.7 million QALY loss in the medium and long-run from COVID-19\nOverall, our analysis suggests that the recession resulting from COVID-19 and restrictions on activities to contain it could have large effects on lives through unemployment, mental health impacts, loss of income and increased financial uncertainty. These impacts are likely to have medium and long-term consequences on population health in terms of increased morbidity and mortality\nThis analysis also presents an increase in the impact of the recession on medium and long-term health compared to our previous update. This is because more recent economic forecasts suggest the bounce-back and recovery are likely to be at a slower pace than previously predicted, and therefore the health impacts from the economic downturn accumulate over a longer period of time than previously considered.\nPosted inNews|Comments Off on The Official Estimate of the Collateral Deaths due to UK Government imposed Lockdowns and Restrictions on medical treatment in England.\nHelp Elect Stephen Morris as Mayor of Greater Manchester\nFriend, our National Secretary, Stephen Morris will be running against Sharia-Appeasing Andy Burnham for the Mayoralty of Greater Manchester.\nOnly Stephen has the vision and the determination to make Greater Manchester a safer place for our daughters and better place to live for our people.\nStephen is the General Secretary for the Workers of England Union and been fighting against the Politically Correct Brigade and anti-English discrimination for over a decade!\nIf Stephen is elected he will automatically become the Police Commissioner of Greater Manchester and then we can finally start tackling the Islamic Grooming Gangs that plague the English people.\nStephen is promising to purge and prosecute the police officers that facilitated the grooming of our daughters and granddaughters.\nManchester’s Islamists vote Burnham…English Patriots vote for Stephen!\nThis is our opportunity to stand up and protect OUR girls.\n“Sharia-appeasing” Andy has washed his hands of the English people and looked the other way as tens of thousands of English girls were enslaved, pimped out, tortured and raped by the enemies of England.\nOn Andy Burnham’s watch, we even saw the most deadly single terror attack in our nation’s history at the Manchester arena, and what did “sharia-appeasing” Andy do in its aftermath…he condemned the non-existent backlash against Islamic community.\nWe are gearing up for this showdown, but we need your help. We want to rock the establishment and send Burnham to the back of the Dole Queue.\nWe will do everything in our power to achieve victory but our success depends on your support, Friend.\nGet behind our campaign and let’s replace traitorous Andy with a real English patriot!\nWill you back Stephen for Mayor of Greater Manchester, Friend?",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_about/content_21.html": "I am the General Secretary for the Workers of England Trade Union before this I was the Branch Secretary for Unite the Union on Metrolink Network.\nI, along with my wife and children, live in Bury, so any decisions I make as a Councillor would directly affect me, my family, and neighbours, along with every other resident.\nI was an active Parent Governor at the local high school when our older children attended, I want to make sure our children have the best education possible.\nI am a local Homewatch Coordinator, something I have done for over 30 years, working with varies organisations to reduce crime in our area.\nMy work history is varied and covers many aspects which the other candidates cannot match, I spent 15 years as a Manager in various types of retail, I know the problems retailers are facing, I then joined Metrolink Tram network where I worked in various departments, I know the problems facing our public transport system.\nSince leaving Metrolink in late 2014, I became General Secretary for the Workers of England Union, and help employees in all aspects of employment, up to and including representing at Employment Tribunals.\nMy work history, my local activism, and the fact I live in our area make me the ideal candidate for our area.\nWouldn’t it be nice, if we had a local, active, and experienced elected officials, who were not controlled by big party politics! That’s why voting for me makes sense.",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_news_gm-mayoral-election-creative-workforce-pledge/content_2.html": "I have signed the Creative Workforce Pledge to show I value, respect and support the creative and cultural workforce in our area. By protecting and promoting good employment in these sectors, we can kickstart our economic recovery, improve our local communities and build back better.\nRegistered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_tag_parliament-for-england/content_15.html": "Registered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info\nTag Archives: Parliament for England\nManifesto – Bury South 2024\nWhether standing in local, general, or mayoral elections my beliefs and aims for our area remain the same, they don’t alter with each election just to gain votes, what you see is what you get. The English Democrats also don’t … Continue reading\nPosted in Elections, News\nTagged English Democrats, Indy4England, Parliament for England, RejectBritishRule, Stephen Morris\nComments Off on Manifesto – Bury South 2024",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_tag_rejectbritishrule/content_17.html": "Registered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info\nTag Archives: RejectBritishRule\nManifesto – Bury South 2024\nWhether standing in local, general, or mayoral elections my beliefs and aims for our area remain the same, they don’t alter with each election just to gain votes, what you see is what you get. The English Democrats also don’t … Continue reading\nPosted in Elections, News\nTagged English Democrats, Indy4England, Parliament for England, RejectBritishRule, Stephen Morris\nComments Off on Manifesto – Bury South 2024",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_news_besses-ward-bury-local-elections-22/content_14.html": "Whether standing in local, general, or mayoral elections my beliefs and aims for our area remain the same, they don’t alter with each election just to gain votes, what you see is what you get.\nThe English Democrats also don’t use a party whip system, as such I am free to campaign and vote on issues that I believe in, unlike some other candidates from other parties that if elected have to toe the party line.\nBefore becoming the General Secretary for the Workers of England Union in 2017 I spent 15 years working in various departments on Metrolink Tram network, where for 7 years I was also the Unite Branch Secretary. Prior to Metrolink I spent 15 years managing various retail stores.\nMarried to Valerie we have 3 children, I have lived in Bury for over 37 years (Val for over 50 years) and my youngest child still attends the local high school.\nBelow are a few bullet points which I am committed to achieving.\nAims for our Police service\n- Under Labours failed leadership Greater Manchester Police was placed under special measures, only the 2nd Police force ever to be put under special measures. Labour Councillors fail to hold the Labour Mayor to account over our failed Police service.\n- To make sure Greater Manchester Police enforce the laws of England without fear or favour.\n- To make sure our Police service prosecute those responsible for sexual crimes against children, and those in authority who failed those children.\n- Zero tolerance policy towards political correctness in Policing.\nAims for our Economy\n- That businesses tendering for local Government contracts have Family-Friendly Policies.\n- Local hiring – Businesses tendering for local Government contracts will be encouraged to hire people who live close to the place of work.\n- No local Government contracts will be issued to a company that is ultimately controlled by a regime that has ongoing human rights violations.\nAims for Health and Social Care\n- Mental Health is now a major concern, my focus will be on pushing for wider community support for people living with mental illness.\n- Care units will be set up to take all the homeless off the streets of Greater Manchester.\n- A program for the early diagnosis of cancer will be rolled out across residents of Greater Manchester.\nAims for Transport\n- To stop any Greater Manchester Road Tax (Congestion charge), Emissions Zone tax, or whatever other label the other parties attach to it. We should encourage people to use alternative public transport where available, and look to provide it where its not, we should not add any more tax burdens on the people and businesses of our area.\n- To campaign for peak fares to be abolished on Greater Manchester public transport.\n- Greater use will be made of city cycleways and pedestrian friendly areas.\n- Review of all bus lanes, whether they help or hinder traffic flow, and those bus lanes which hinder traffic flow to be removed.\nAims for Planning and Environment\n- To stop building on Green Belt land.\n- That planning applications on brownfield sites located with greenbelt areas be tightly monitored, so not to adversely affect the surrounding greenbelt area.\n- Residential Housing:\n- That all new housing applications will be required to have solar energy installed.\n- That all new residential flats will have to have car park facilities built underneath the building; areas above ground should be given to residential homes and not made into car parks.\n- Industrial units:\n- That all new industrial units will have to have solar panels installed\n- That all new industrial units will have to have car parking facilities built under their units, areas above ground should be given to industrial units and not made into car parks\n- Implement a review on the feasibility of Small Hydroelectric Turbine Generators – making use of our rivers could be a possibility.\n‘Together Declaration’ – candidate Questions\n- FREE SPEECH – I WILL BACK LAWS TO PREVENT ‘DEBANKING’ FOR POLITICAL REASONS\n- HEALTH – WE MUST MAKE OUR OWN HEALTH DECISIONS, NOT “OUTSOURCE” THEM TO THE WORLD HEALTH ORGANSIATION.\n- HEALTH – I WILL COMMIT TO REFORMING OUR OWN PUBLIC HEALTH ACT WHICH GAVE US LOCKDOWNS.\n- HEALTH AND SOCIAL CARE– I WILL DEFEND INFORMED CONSENT IN ALL TREATMENT AND CARE DECISIONS.\n- NET ZERO – I PLEDGE TO ENSURE THE PUBLIC GETS TRANSPARENCY INTO FUNDING AND INFLUENCE ON NET ZERO POLICIES.\nGreater Manchester Mayor Accountability\n- There is a lack of transparency surrounding the conduct and behaviour of the Greater Manchester Combined Authority (GMCA) and Greater Manchester Mayor, as such I support the introduction of a London-style assembly which would scrutinise the GMCA and GM Mayor in a transparent manner which voters can engage with. The current system used by Labour is not as transparent on its actions as it should be.",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_tag_english-parliament/content_20.html": "Registered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info\nTag Archives: English parliament\nThe Battle for Greater Manchester is on, Friend!\nGive Burnham The Boot! Help Elect Stephen Morris as Mayor of Greater Manchester Friend, our National Secretary, Stephen Morris will be running against Sharia-Appeasing Andy Burnham for the Mayoralty of Greater Manchester. Only Stephen has the vision and the determination … Continue reading\nPosted in GM Mayor\nTagged English Democrats, English parliament, Indy4England, Workers of England\nComments Off on The Battle for Greater Manchester is on, Friend!",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_tag_stephen-morris/content_13.html": "Registered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info\nTag Archives: Stephen Morris\nManifesto – Bury South 2024\nWhether standing in local, general, or mayoral elections my beliefs and aims for our area remain the same, they don’t alter with each election just to gain votes, what you see is what you get. The English Democrats also don’t … Continue reading\nPosted in Elections, News\nTagged English Democrats, Indy4England, Parliament for England, RejectBritishRule, Stephen Morris\nComments Off on Manifesto – Bury South 2024",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_contact-form/content_18.html": "Your Name (required)\nYour Email (required)\nSubject\nYour Message\nΔ\nOr write to\nStephen Morris\nStanmore House\n64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JS\nStephen Morris on X\nStephen Morris on Facebook\nStephen Morris c/o 64-68 Blackburn Street Radcliffe Bury M26 2JS\nTel: 0330 223 2292 e-mail: mail@stephenmorris.info",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_tag_english-democrats/content_4.html": "Registered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info\nTag Archives: English Democrats\nManifesto – Bury South 2024\nWhether standing in local, general, or mayoral elections my beliefs and aims for our area remain the same, they don’t alter with each election just to gain votes, what you see is what you get. The English Democrats also don’t … Continue reading\nPosted in Elections, News\nTagged English Democrats, Indy4England, Parliament for England, RejectBritishRule, Stephen Morris\nComments Off on Manifesto – Bury South 2024\nThe Battle for Greater Manchester is on, Friend!\nGive Burnham The Boot! Help Elect Stephen Morris as Mayor of Greater Manchester Friend, our National Secretary, Stephen Morris will be running against Sharia-Appeasing Andy Burnham for the Mayoralty of Greater Manchester. Only Stephen has the vision and the determination … Continue reading\nPosted in GM Mayor\nTagged English Democrats, English parliament, Indy4England, Workers of England\nComments Off on The Battle for Greater Manchester is on, Friend!",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_tag_workers-of-england/content_8.html": "Registered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info\nTag Archives: Workers of England\nThe Battle for Greater Manchester is on, Friend!\nGive Burnham The Boot! Help Elect Stephen Morris as Mayor of Greater Manchester Friend, our National Secretary, Stephen Morris will be running against Sharia-Appeasing Andy Burnham for the Mayoralty of Greater Manchester. Only Stephen has the vision and the determination … Continue reading\nPosted in GM Mayor\nTagged English Democrats, English parliament, Indy4England, Workers of England\nComments Off on The Battle for Greater Manchester is on, Friend!",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_author_admin/content_9.html": "Registered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info\nAuthor Archives: admin\nThe Illusion of choice – Unveiling the UK’s Corrupt Voting System\nThe documentary examines the current voting system in the UK and explores the limitations and implications of the first-past-the-post system in comparison to a proportional representation system. Through interviews with experts, politicians, and voters, the film highlights the flaws of … Continue reading\nPosted in News\nComments Off on The Illusion of choice – Unveiling the UK’s Corrupt Voting System\nManifesto – Bury South 2024\nWhether standing in local, general, or mayoral elections my beliefs and aims for our area remain the same, they don’t alter with each election just to gain votes, what you see is what you get. The English Democrats also don’t … Continue reading\nPosted in Elections, News\nTagged English Democrats, Indy4England, Parliament for England, RejectBritishRule, Stephen Morris\nComments Off on Manifesto – Bury South 2024\nGM Mayoral Election – Work to end foodbank dependency\n#Morris4GMMayor – I’ve pledged my support to work in ending the need for #foodbanks in my community if I am elected Mayor of Greater Manchester on 6 May. I believe that together we can build a #HungerFreeFuture @TrussellTrust > https://www.trusselltrust.org/2021-elections/ … Continue reading\nGM Mayoral Election – Creative Workforce Pledge\nI have signed the Creative Workforce Pledge to show I value, respect and support the creative and cultural workforce in our area. By protecting and promoting good employment in these sectors, we can kickstart our economic recovery, improve our local … Continue reading\nPosted in GM Mayor, News\nLeave a comment\nThe Official Estimate of the Collateral Deaths due to UK Government imposed Lockdowns and Restrictions on medical treatment in England.\nFriday saw the publication of the Government’s assessment of direct and indirect impacts of COVID-19 on excess mortality and morbidity. The Daily Mail has the details: More than 100,000 people are likely to die from non-coronavirus causes because of the pandemic, according to an … Continue reading\nPosted in News\nComments Off on The Official Estimate of the Collateral Deaths due to UK Government imposed Lockdowns and Restrictions on medical treatment in England.",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_category_news_gmmayor/content_5.html": "Registered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info\nCategory Archives: GM Mayor\nGM Mayoral Election – Work to end foodbank dependency\n#Morris4GMMayor – I’ve pledged my support to work in ending the need for #foodbanks in my community if I am elected Mayor of Greater Manchester on 6 May. I believe that together we can build a #HungerFreeFuture @TrussellTrust > https://www.trusselltrust.org/2021-elections/ … Continue reading\nGM Mayoral Election – Creative Workforce Pledge\nI have signed the Creative Workforce Pledge to show I value, respect and support the creative and cultural workforce in our area. By protecting and promoting good employment in these sectors, we can kickstart our economic recovery, improve our local … Continue reading\nPosted in GM Mayor, News\nLeave a comment\nThe Battle for Greater Manchester is on, Friend!\nGive Burnham The Boot! Help Elect Stephen Morris as Mayor of Greater Manchester Friend, our National Secretary, Stephen Morris will be running against Sharia-Appeasing Andy Burnham for the Mayoralty of Greater Manchester. Only Stephen has the vision and the determination … Continue reading\nPosted in GM Mayor\nTagged English Democrats, English parliament, Indy4England, Workers of England\nComments Off on The Battle for Greater Manchester is on, Friend!",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_news_the-illusion-of-choice-unveiling-the-uks-corrupt-voting-system/content_10.html": "The documentary examines the current voting system in the UK and explores the limitations and implications of the first-past-the-post system in comparison to a proportional representation system. Through interviews with experts, politicians, and voters, the film highlights the flaws of the current system, such as wasted votes and disproportionate outcomes.\nThe documentary also delves into the history of voting reform in the UK and analyses the potential benefits of transitioning to a proportional representation system. Ultimately, the film argues for the need to update the UK’s voting system to better reflect the diversity of political opinions and ensure fair representation for all citizens.",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_news_gm-mayoral-election-work-to-end-foodbank-dependency/content_3.html": "#Morris4GMMayor – I’ve pledged my support to work in ending the need for #foodbanks in my community if I am elected Mayor of Greater Manchester on 6 May. I believe that together we can build a #HungerFreeFuture @TrussellTrust > https://www.trusselltrust.org/2021-elections/\nI have consistently campaigned to abolish Child Poverty, Deprivation and Homelessness spreading across our area under Labour, and this message is also in my Mayoral address to voters of Greater Manchester.\nEngland-elections-briefing",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_author_stemorris/content_7.html": "Registered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info\nAuthor Archives: Administrator\nThe Battle for Greater Manchester is on, Friend!\nGive Burnham The Boot! Help Elect Stephen Morris as Mayor of Greater Manchester Friend, our National Secretary, Stephen Morris will be running against Sharia-Appeasing Andy Burnham for the Mayoralty of Greater Manchester. Only Stephen has the vision and the determination … Continue reading\nPosted in GM Mayor\nTagged English Democrats, English parliament, Indy4England, Workers of England\nComments Off on The Battle for Greater Manchester is on, Friend!",
  "http_www_stephenmorris_info_/http_www_stephenmorris_info_tag_indy4england/content_12.html": "Registered Address\nStephen Morris\nc/o 64-68 Blackburn Street\nRadcliffe\nBury\nM26 2JSTel: 0330 223 2292\ne-mail: mail@stephenmorris.info\nTag Archives: Indy4England\nManifesto – Bury South 2024\nWhether standing in local, general, or mayoral elections my beliefs and aims for our area remain the same, they don’t alter with each election just to gain votes, what you see is what you get. The English Democrats also don’t … Continue reading\nPosted in Elections, News\nTagged English Democrats, Indy4England, Parliament for England, RejectBritishRule, Stephen Morris\nComments Off on Manifesto – Bury South 2024\nThe Battle for Greater Manchester is on, Friend!\nGive Burnham The Boot! Help Elect Stephen Morris as Mayor of Greater Manchester Friend, our National Secretary, Stephen Morris will be running against Sharia-Appeasing Andy Burnham for the Mayoralty of Greater Manchester. Only Stephen has the vision and the determination … Continue reading\nPosted in GM Mayor\nTagged English Democrats, English parliament, Indy4England, Workers of England\nComments Off on The Battle for Greater Manchester is on, Friend!"
}