{
  "https_zarahsultana_com/https_zarahsultana_com_cost-of-living/content_10.html": "Cost of Living Support\nAll financial support for Coventry residents administered by the Council can be found at this website.\nCoventry Citizens Advice have provided a Support for Households document which compiles a list of national and local support.\nCoventry Law Centre has a useful leaflet outlining support across the city including how to access free school meals and support with your rent.\nThe Coventry Independent Advice Service have also created this leaflet which you may find useful.\nHOPE Coventry have a dedicated website containing Cost of Living Support.\nAGE UK COMMUNITY SUPPORT\nThe charity has a central telephone number that our vulnerable communities are able to contact in order to reach out to a wide range of support. That number is 02476 231 999 and is available Monday – Friday 10-3 with a facility to record messages and an email which is info@ageukcovwarks.org.uk.\nAge UK also provide the following resources for financial and well-being advice over the winter:\nWATER BILLS SUPPORT\nSevern Trent provide a number of resources available to help with your water bills. A list of these can be found by clicking here.\nDIGITAL SUPPORT\nHELP COVERING NHS COSTS\nIf you are struggling to cover NHS medical costs such as prescriptions, you can fill in the following form to apply for support at this link.\nSupport for Disabled People\nFor specialised help and advice please visit Disability Rights UK or Scope, or the free helpline 0808 800 3333. For textphone please dial 18001 then 0808 800 3333.\nDetails of support can be found on Scope’s website at this link.\nWARM SPACES\nHOPE Coventry have also created a Warm Food & Food Parcels Guide.\nBENEFITS ASSESSMENT\nTo seek help on your benefits entitlement please contact Coventry Independent Advice Services on 024 7652 1101 or Coventry Citizens Advice on 0800 144 88 48.\nHOUSING BENEFIT AND COUNCIL TAX SUPPORT\nContact the Council’s Benefits team for advice and support at benefits@coventry.gov.uk, by calling 024 7683 1800, or visiting the Housing Benefit and Council Tax Support page.\nAnyone who is finding it difficult to pay their Council Tax should contact the Council Tax Team to discuss alternative payment arrangements. Call 024 7683 1111, or email counciltax@coventry.gov.uk.\nCOVENTRY INDEPENDENT ADVICE SERVICE\nCoventry Independent Advice Service offers free, confidential, community-based advice in Coventry. They can assist on matters of benefits, debt and more. They can be contacted at 024 76521101 or you can fill in this form to request assistance.\nFood support\nYou can enquire about accessing support from Coventry Foodbank here.\nAdditionally, you can find a comprehensive list of food hubs around the city at this link.\nTo access an emergency food hub parcel via the Household Support Fund, please call 08085 834333.\nIf you are more than 10 weeks pregnant or have a child under 4, the ‘Healthy Start’ scheme may be able to help you to buy healthy foods and get free vitamins.\nCLOTHING SUPPORT AND BABY BANK\nCoventry’s clothing bank, Coventry Clothing supports anyone in need of clothes or shoes.\nGet help with school uniform, school shoes and warm clothing by requesting a clothes parcel.\nCoventry’s baby bank is called Baby Godiva and information can be found at this link.\nCOVENTRY LAW CENTRE\nCoventry Law Centre can be contacted for support during mandatory reconsiderations and appeals with the Department for Work and Pensions.\nCall on 02476 223053\nEmail at enquiries@centralenglandlc.org.uk\nHELP WITH RENT\nIf you cannot afford to pay your rent you may be able to claim extra help from the Council. This extra help is called Discretionary Housing Payments (DHPs).\nEmail DGATeam@coventry.gov.uk or call 024 7683 3773.",
  "https_zarahsultana_com/https_zarahsultana_com_contact/content_9.html": "This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settingsACCEPT\nPrivacy & Cookies Policy\nPrivacy Overview\nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience.\nNecessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.\nAny cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website.",
  "https_zarahsultana_com/https_zarahsultana_com_casework/content_4.html": "Casework\nIf you need help with any issues ranging from immigration and housing, to benefits and unemployment, please do not hesitate to contact me. I receive hundreds of emails a month from constituents and my casework team and I will do everything we can to advocate for Coventry South constituents, no matter the case at hand.\nBelow are a series of links and contact details for various organisations across the city, and online resources which may be able to help you or answer any questions you have.\nTo raise casework with me, please email coventrysouth@parliament.uk including your address, details of your case and any further information or reference numbers that may be relevant to your case. Please be aware that I can only take on the cases of constituents of mine in Coventry South and that as an MP’s office we do not hold statutory powers.\nLegal Aid\nThe Coventry Law Centre can be reached at 02476 223053 and enquiries@centralenglandlc.org.uk\nCommunity Support\nYou can request support from Coventry Foodbank here and from the Council’s Emergency Food Network here and at 08085 834 333.\nAge UK Community Support can be reached at info@ageukcovwarks.org.uk or 02476 231 999.\nRAPE AND SEXUAL ASSAULT\nFor support with sexual violence and abuse regardless of age or gender identity, and whether it is recent, historic or ongoing, contact Coventry Rape and Sexual Assault Centre here.\nCouncil queries\nRaise issues regarding Council services at customer.services@coventry.gov.uk or 08085 834333, report missed bin collection here, or get support from your local councillor here.\nPARLIAMENT RESOURCES\nIf you’d like to browse the House of Commons Library for information regarding your case, please click here.\nMIGRANT SUPPORT\nThe Coventry Refugee and Migrant Centre can be reached at adviceteam@covrefugee.org and 02476 227 254.\nCARAG can be found here.\nCarriers of Hope can be reached at 07429415489.\nHOME OFFICE\nIf you need support with an existing Home Office application, please email me with your full name, address, date of birth, nationality and a reference number.\nBenefits\nRead about and apply for benefits here.\nCalculate your benefit entitlement with entitledto or turn2us.\nGet help applying for Universal Credit from Citizens Advice here.\nCOVENTRY WOMEN'S PARTNERSHIP (FWT)\nSUPPORT FROM THE COUNCIL\nContact the Council’s Benefits team for advice and support at benefits@coventry.gov.uk, by calling 024 7683 1800, or visiting the Housing Benefit and Council Tax Support page.",
  "https_zarahsultana_com/https_zarahsultana_com_donate/content_11.html": null,
  "https_zarahsultana_com/https_zarahsultana_com_privacy-policy/content_2.html": "Privacy Policies\nIn order to find out how your data is stored and used, please chose from whichever of the below two policies is relevant to you.\nParliamentary and Constituency Office\nTo find out how data is processed by Zarah Sultana’s Parliamentary and Constituency Offices, please click here.\nZarah Sultana Campaigns Ltd\nTo find out how data is processed by Zarah Sultana’s Parliamentary and Constituency Offices, please click here.",
  "https_zarahsultana_com/https_zarahsultana_com_about/content_8.html": "About Zarah.\nMP for Coventry South.\nZarah Sultana MP – My Story\nI am proud to be your Labour Member of Parliament for Coventry South.\nI was elected in December 2019 and it’s a huge privilege to serve the local community.\nMy family moved from Kashmir to the West Midlands. My grandad was one of the workers who helped to make the region a booming centre of the motor industry. I studied International Relations and Economics at the University of Birmingham, where I was in the first cohort of students to pay £9,000 tuition fees. I got involved in political campaigns, on issues from Free Education to anti-racism.\nI worked in retail throughout my studies and after graduating, I went into the third-sector and then became a community organiser for Labour in the West Midlands. I helped to organise community campaigns against the closure of public services and saw first-hand the devastating effects of a decade of cuts and stagnating wages.\n“As your MP, I am committed to standing up for Coventry South.“\nI have an office in the constituency and I hold regular surgeries, where I offer help and advice to people in need of my support. In Parliament, I use my voice to champion the interests of Coventry and to fight for a better deal for its people.\nPlease do not hesitate to contact me if you have a question or issue I can assist with.\nYours,\nZarah\nZarah Sultana MP",
  "https_zarahsultana_com/https_zarahsultana_com_volunteer/content_3.html": "A version of this action that uses less javascript and may be usable for those who don't use javascript is available at https://actionnetwork.org/forms/join-team-zarah?nowrapper=true&referrer=&source=&oneclick=\nIf you don't subscribe we won't be able to update you on this campaign or send opportunities to take action together.\nIf you don't want to hear more about this campaign or our work via email close this prompt:",
  "https_zarahsultana_com/https_zarahsultana_com_privacy-policy-campaigns/content_7.html": "Privacy Policy – Zarah Sultana Campaigns Ltd\nThis privacy policy informs you how Zarah Sultana Campaigns Ltd will use and protect your personal data. This data is collected, processed and retained for use in political campaigning and associated activities by Zarah Sultana Campaigns Ltd.\n1. WHO WE ARE\nZarah Sultana Campaigns Ltd is the controller and responsible for your personal data (referred to as “we”, “us” or “our” in this privacy policy).\n2. HOW TO CONTACT US\nTo raise any questions, concerns, or complaints about how your data has been processed, please contact us at info@zarahsultana.com.\n3. PURPOSE OF THIS PRIVACY POLICY\nThis privacy policy aims to give you information on how we collect and process your personal data through:\n- your use of this website (including, but not limited to, any data you may provide through this website by, for example, signing-up to our email list); and/or\n- engaging with us on third party websites and platforms (including, but not limited to, Typeform, Facebook, WhatsApp, Instagram and Twitter).\nBy collecting such data, we will be able to inform you about Zarah Sultana’s political campaigning activities.\nWe may share your data with other campaigns and movements that share the values, principles and aims of Zarah Sultana and which are supportive of our objectives. This will only be done in limited circumstances where we are satisfied that there is a lawful basis to permit such a transfer to take place.\nThis website is not intended for children and we do not knowingly collect data relating to children.\nIt is important that you read this privacy policy, together with any other privacy policy or fair processing policy we may provide on specific occasions when we are collecting or processing personal data about you. We want you to be fully aware of how and why we are using your data.\nThis privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\n4. CHANGES TO THIS POLICY\nWe keep our privacy policy under regular review and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website.\n5. THE DATA WE COLLECT ABOUT YOU\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data). We may collect, use, store and transfer different kinds of personal data about you which we have grouped together as follows:\n- identity data, including first name, maiden name, last name, username or similar identifier, title, date of birth and/or gender;\n- contact data, including address, email address and/or telephone number(s);\n- financial data, including bank account and payment card details;\n- transaction data, including details about payments to and from you and other details of products and services you have purchased from us;\n- technical data, including internet protocol (IP) address, your login data, browser type and version, time zone setting and location, browser plug-in types and versions, operating system and platform, and other technology on the devices you use to access this website and/or third party websites and platforms hosting our content;\n- profile data, including your username, your interests, preferences, feedback and/or survey responses;\n- usage data, including information about how you use our website;\n- aggregated data such as statistical or demographic data for any purpose. Aggregated data could be derived from your personal data but is not considered personal data in law as this data will not directly or indirectly reveal your identity. For example, we may aggregate your usage data to calculate the percentage of users accessing a specific website feature. However, if we combine or connect aggregated data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this privacy policy.\n6. HOW WE COLLECT YOUR PERSONAL DATA\nWe use different methods to collect data from and about you.\nProvided by you – directly\nYou may give us your name and contact details by filling in forms or by corresponding with us by post, phone, email or otherwise. This also includes personal data you provide when you subscribe to any mailing lists, give feedback and/or contact us directly via such forms, email, telephone or similar mediums.\nThird-party sources – indirectly\n- Automated technologies or interactions, including cookies: as you interact with our website, we will automatically collect technical data about your equipment, browsing actions and patterns – where this is strictly necessary to enable the delivery of the website to you, then these cookies will be downloaded automatically. We collect this personal data by using cookies and other similar technologies. We may also receive technical data about you if you visit other websites employing our cookies. You will have the option of declining cookies that are not strictly necessary for the delivery of the website if you do not wish to provide this kind of data to us.\n- Publicly available sources: we may receive personal data about you from public sources where there is a lawful basis for such transfers to take place.\n- Relevant third-party sources.\n7. HOW WE USE YOUR PERSONAL DATA\nThe uses\nWe will only use your personal data when the law allows us to. We will use your personal data in the following circumstances:\n- Inform and engage you about the campaigning work of Zarah Sultana;\n- Inform and engage you with any other campaigns and movements that share the values, principles and aims of Zarah Sultana;\n- Manage donations, payments, fees and/or charges;\n- Comply with our legal obligations; and/or\n- Answer your queries and respond to your questions and/or complaints.\nThe legal bases\n- Where you have specifically consented to a particular use of your data (such as where you have subscribed to receive information about Zarah Sultana’s campaigning activities);\n- Where you have entered into a legal agreement with us that necessitates that particular use of your data (such as where you make a payment or donation to us);\n- Where it is a necessary lawful basis for our legitimate interests (or those of a third party) and your interests and fundamental rights do not override those interests; or\n- Where we are obliged to process your data in a particular way by law (for example, if we are required to notify any authority or regulator of the nature or value of your donations).\n8. WHEN WE WILL SHARE YOUR DATA\nWe will never sell your personal data to any other organisation and we will not share your personal data unless it is obvious that this is what we are going to do (such as the signing of a petition). We may share your data:\n- With third parties to perform services on your behalf and to help promote the campaigning work of Zarah Sultana by serving you advertisements and content online about Zarah Sultana policies we think you might be interested in and/or other campaigns and movements that share the values, principles and aims of Zarah Sultana. We require all third parties to respect the security of your personal data and to treat it in accordance with the law;\n- To enable transfers to take place (where appropriate);\n- Where we need to comply with a legal obligation; and/or\n- With suppliers who act as our ‘data processors’ and who provide the means of processing financial transactions including, but not limited to Action Network, MailChimp, NationBuilder, Stripe, PayPal and others.\nWe do not allow our third party service providers to use your personal data for their own purposes and only permit them to process your personal data for specified purposes and in accordance with our instructions.\n9. COOKIES\nA cookie is a tiny text file that is stored on users’ machines (computers, tablets or mobile devices). We may use cookies – including analytics cookies provided by third party companies – in order to tailor your experience on our site according to the preferences you have specified. You can set your browser to refuse all or some browser cookies, or to alert you when websites set or access cookies. If you disable or refuse cookies, please note that some parts of this website may become inaccessible or not function properly.\n10. THIRD-PARTY LINKS\nThis website may include links to third-party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\n11. INTERNATIONAL TRANSFERS\nIn order to process your personal data for the purposes outlined in this Privacy Policy, we may need to transfer your data to countries or jurisdictions outside the European Economic Area (EEA). In each case, we ensure that our suppliers provide adequate protection for the rights of data individuals in connection with the transfer of their personal data. Currently, we expect all suppliers to use a standard contractual clause approved by the European Union or be part of the Privacy Shield scheme in the United States.\n12. DATA SECURITY\nWe have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. In addition, we limit access to your personal data to those employees, agents, contractors and other third parties who have a business need to know. They will only process your personal data on our instructions and they are subject to a duty of confidentiality. We will notify you and any applicable regulator of a breach where we are legally required to do so.\n13. HOW LONG WE WILL HOLD YOUR PERSONAL DATA FOR\nWe will only retain your personal data for as long as reasonably necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, regulatory, tax, accounting or reporting requirements. We may retain your personal data for a longer period in the event of a complaint or if we reasonably believe there is a prospect of litigation in respect to our relationship with you.\nTo determine the appropriate retention period for personal data, we consider the amount, nature and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal, regulatory, tax, accounting or other requirements.\n14. YOUR LEGAL RIGHTS\nAs a data subject, you have a number of rights in relation to your personal data. The rights you have include:\n- request access to the personal data that we hold which relates to you (this is often described as a “subject access request”). You can exercise this right at any time by contacting us at info@zarahsultana.com and telling us that you are making a subject access request.\n- request that we correct personal data that we hold about you which you believe is incorrect or inaccurate, or to request we erase personal data if you do not believe that we need to continue retaining it. Please note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is right. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase, we will tell you what that reason is at the time we respond to your request.\n- request to stop receiving communications. You can opt-out of communications you receive from us at any time by using the ‘unsubscribe’ link that appears in the footer of each communication (or the equivalent mechanism in those communications). Alternatively, if for any reason you cannot use those links, or if you would prefer to contact us directly – you can unsubscribe by contacting us at info@zarahsultana.com and telling us which communications you would like us to stop sending you.\n- request that personal information you have given your consent for us to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”).\n15. RIGHT TO LODGE A COMPLAINT\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom.\nThe contact details for the ICO are:\n- Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n- Telephone: 0303 123 1113\nWebsite: https://ico.org.uk/concerns/",
  "https_zarahsultana_com/https_zarahsultana_com_cookie-policy/content_12.html": "About this cookie policy\nThis Cookie Policy explains what cookies are and how we use them. You should read this policy to understand what cookies are, how we use them, the types of cookies we use i.e, the information we collect using cookies and how that information is used and how to control the cookie preferences. For further information on how we use, store and keep your personal data secure, see our Privacy Policy.\nYou can at any time change or withdraw your consent from the Cookie Declaration on our website.\nLearn more about who we are, how you can contact us and how we process personal data in our Privacy Policy.\nYour consent applies to the following domains: zarahsultana.com\nWhat are cookies ?\nCookies are small text files that are used to store small pieces of information. The cookies are stored on your device when the website is loaded on your browser. These cookies help us make the website function properly, make the website more secure, provide better user experience, and understand how the website performs and to analyse what works and where it needs improvement.\nHow do we use cookies ?\nAs most of the online services, our website uses cookies first-party and third-party cookies for a number of purposes. The first-party cookies are mostly necessary for the website to function the right way, and they do not collect any of your personally identifiable data.\nThe third-party cookies used on our websites are used mainly for understanding how the website performs, how you interact with our website, keeping our services secure, providing advertisements that are relevant to you, and all in all providing you with a better and improved user experience and help speed up your future interactions with our website.\nWhat types of cookies do we use ?\nEssential: Some cookies are essential for you to be able to experience the full functionality of our site. They allow us to maintain user sessions and prevent any security threats. They do not collect or store any personal information. For example, these cookies allow you to log-in to your account and add products to your basket and checkout securely.\nStatistics: These cookies store information like the number of visitors to the website, the number of unique visitors, which pages of the website have been visited, the source of the visit etc. These data help us understand and analyze how well the website performs and where it needs improvement.\nMarketing: Our website displays advertisements. These cookies are used to personalize the advertisements that we show to you so that they are meaningful to you. These cookies also help us keep track of the efficiency of these ad campaigns.\nThe information stored in these cookies may also be used by the third-party ad providers to show you ads on other websites on the browser as well.\nFunctional: These are the cookies that help certain non-essential functionalities on our website. These functionalities include embedding content like videos or sharing contents on the website on social media platforms.\nPreferences: These cookies help us store your settings and browsing preferences like language preferences so that you have a better and efficient experience on future visits to the website.\nHow can I control the cookie preferences ?\nShould you decide to change your preferences later through your browsing session, you can click on the “Privacy & Cookie Policy” tab on your screen. This will display the consent notice again enabling you to change your preferences or withdraw your consent entirely.In addition to this, different browsers provide different methods to block and delete cookies used by websites. You can change the settings of your browser to block/delete the cookies. To find out more out more on how to manage and delete cookies, visit wikipedia.org, www.allaboutcookies.org.",
  "https_zarahsultana_com/https_zarahsultana_com_donation-policy/content_5.html": "Donation Policy\nI don’t have billionaire donors or press baron friends. That’s why I need your support to fund a people-powered campaign to win in Coventry South and to build a brighter future.\nDonations given through this website are regulated by the Political Parties, Elections and Referendum Act 2000 and taken in compliance with the Code of Conduct and the Guide to the Rules relating to the conduct of Members (as approved by the United Kingdom House of Commons).\nTo donate to the campaign, we require certain information from you so that we can perform checks where we are legally required. If you donate to us, you acknowledge and agree that (i) the donation is from your own funds, (ii) any donation over the value of £500 must be checked by us to make sure that your name is registered on a UK electoral register (including overseas electors) and you consent to us conducting those checks; and (iii) any donation over the value of £1,500 will result in your name and the amount of your donation being made public on the website of the UK Parliament’s Register of Members’ Financial Interests.\nDonations made using this website are only for individuals. If you wish to donate on behalf of an organisation, please email us at info@zarahsultana.com.\nDonations should be from an individual’s own funds and may not be passed on from a third party. It is an offence not to reveal the true source of a donation. Please note that donations are not tax-deductible.",
  "https_zarahsultana_com/https_zarahsultana_com/content_1.html": "ZARAH SULTANA\nStanding up for\nST MICHAEL'S\nCHEYLESMORE\nEARLSDON\nWAINBODY\nWESTWOOD\nLOWER STOKE\nZarah Sultana\nMember of Parliament for Coventry South\nI am proud to be the Labour Member of Parliament for Coventry South.\nTogether, I know that we can build a more equal, caring, and democratic society. If you have an issue or question you’d like to raise, please don’t hesitate to email me at info@zarahsultana.com.\nSupport Our Movement\nCheck out my YouTube channel\nSurgeries\nI hold regular in-person and online surgeries for constituents who need my support. Please email me to arrange an appointment.\nSocial Media\nKeep up to date with the latest on my\nsocial media platforms.",
  "https_zarahsultana_com/https_zarahsultana_com_privacy-policy-office/content_6.html": "Privacy Policy – Parliamentary and Constituency office of Zarah Sultana\n1. DATA CONTROLLER’S CONTACT DETAILS\nName: Zarah Sultana\nAddress: House of Commons, London, SW1A 0AA\nPhone Number: 0207 219 8079\nE-mail: zarah.sultana.mp@parliament.uk\n2. THE TYPE OF PERSONAL INFORMATION WE COLLECT\nWe currently collect and process the following information:\n- Personal identifiers, contacts and characteristics (for example: name, address and contact details)\n- Special category data (for example: political affiliation, disability, religion, criminal record)\n3. HOW WE GET THE PERSONAL INFORMATION AND WHY WE HAVE IT\nMost of the personal information we process is provided to us directly by you for one of the following reasons:\n- Soliciting Zarah Sultana MP for personal casework assistance\n- Seeking the opinion of Zarah Sultana MP on national policy matters\n- Seeking the opinion of Zarah Sultana MP on party political matters\n- Seeking updates on Zarah Sultana MP’s work\n- Advising Zarah Sultana MP of events\n- Passing comment on the work of Zarah Sultana MP\n- Seeking employment\nWe also receive personal information indirectly, from the following sources in the following scenarios:\n- From a third-party, such as a governmental department, who we have solicited information from\n- From a third-party, such as a legal firm, who have solicited Zarah Sultana MP on your behalf\nWe use the information that you have given us in order to:\n- Complete casework on your behalf\n- Reply to your correspondence\nWe may share this information with third-parties in order to assist you but will always seek your consent to do so. Where we deem there to be a safeguarding concern, consent may not be sought or required. Such third-parties include but are not limited to\n- Governmental departments\n- Local authorities\n- Public bodies\n- Private companies\n- Public companies\nUnder the UK General Data Protection Regulation (UK GDPR), the lawful bases we rely on for processing this information are:\n(a) Your consent. You are able to remove your consent at any time. You can do this by contacting zarah.sultana.mp@parliament.uk\n(b) We need it to perform a public task.\n(c) We have a legitimate interest.\n(d) We have a contractual obligation.\nFurther to the above, the lawful bases we rely on for the processing of special category data are:\n(a) There is a substantial public interest.\n(b) Your consent. You are able to remove your consent at any time. You can do this by contacting zarah.sultana.mp@parliament.uk\n(c) For employment purposes.\n4. HOW WE STORE YOUR PERSONAL INFORMATION\nYour information is securely stored.\nWe keep personal and special category data for 2 years after it has been last used. We will then dispose of your information from our mailboxes and online software.\n5. YOUR DATA PROTECTION RIGHTS\nUnder data protection law, you have rights including:\nYour right of access – You have the right to ask us for copies of your personal information.\nYour right to rectification – You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete.\nYour right to erasure – You have the right to ask us to erase your personal information in certain circumstances.\nYour right to restriction of processing – You have the right to ask us to restrict the processing of your personal information in certain circumstances.\nYour right to object to processing – You have the the right to object to the processing of your personal information in certain circumstances.\nYour right to data portability – You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances.\nYou are not required to pay any charge for exercising your rights. If you make a request, we have one month to respond to you.\nPlease contact us using the following details if you wish to make a request:\nAddress: House of Commons, London, SW1A 0AA\nPhone Number: 0207 219 8079\nE-mail: zarah.sultana.mp@parliament.uk\n6. HOW TO COMPLAIN\nIf you have any concerns about our use of your personal information, you can make a complaint to us at:\nAddress: House of Commons, London, SW1A 0AA\nPhone Number: 0207 219 8079\nE-mail: zarah.sultana.mp@parliament.uk\nYou can also complain to the ICO if you are unhappy with how we have used your data.\nThe ICO’s address:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nICO website: https://www.ico.org.uk"
}