{
  "https_www_shaunbailey_org_uk_/https_www_shaunbailey_org_uk_campaigns_sorting-out-roads-tipton-and-wednesbury/content_6.html": "Is there an issue on your road that Sandwell Council need to fix?\nNow's your chance to report it.\nLet me know what needs fixing and I'll log it with the Council for you.\nIs there an issue on your road that Sandwell Council need to fix?\nNow's your chance to report it.\nLet me know what needs fixing and I'll log it with the Council for you.",
  "https_www_shaunbailey_org_uk_/https_www_shaunbailey_org_uk_news_category_Articles/content_8.html": "James Cleverly Fundraiser 25th February 2024 A massive thank you to Home Secretary, James Cleverly who spoke to a packed room full of members and supporters on Friday for our latest Tipton & Wednesbury... Articles\nVisit to ALUCAST Ltd Wednesbury 27th January 2024 It was amazing to visit ALUCAST foundry in Wednesbury with Andy Street to discuss how we can support the UK metals industry. I am so proud to have such... Articles\nTory Doorstep 27th January 2024 Out campaigning across Tipton today in support of our amazing councillors, candidates and of course out fantastic Mayor, Andy Street Thanks to everyone for the... Articles\nGod Save the King! Coronation Weekend 6th May 2023 God Save the King Looking forward to today's Coronation of Their Majesties King Charles III & Queen Camilla. However you're spending this Coronation Weekend... Articles\n**International Women's Day 2023** 8th March 2023 I'm always grateful for the strong women in my life, particularly these two! My Mum & my Nan have always been my biggest inspirations, supporters and grounders... Articles\nRemembrance Sunday. 13th November 2022 Remembrance Sunday Sunay 13 November 2022 Today we remember those we lost in battle. The below poem highlights how they are remembered. They shall grow not old... Articles\nSt. John's Church Hall - Life in the Community 10th June 2022 It was fantastic to visit St. Johns Church Hall in Princes End to meet the Life in the Community team. They are always doing a brilliant job at offering... Articles\nVisiting schools across the local area. 10th June 2022 Over the past few months, I have been doing a tour of visits to schools across Wednesbury, Oldbury & Tipton. The students across each School definitely do not... Articles\nNew locations for polling stations 3rd May 2022 This week is polling week where the local elections are being held on Thursday 5 May 2022. Several polling stations have changed, so before you go to vote, make... Articles",
  "https_www_shaunbailey_org_uk_/https_www_shaunbailey_org_uk_cdn-cgi_l_email-protection/content_11.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_shaunbailey_org_uk_/https_www_shaunbailey_org_uk_news_category_Speeches-in-Parliament/content_9.html": "Shaun Bailey MP challenges Sandwell Council's attempts to silence tenants 19th November 2021 Yesterday, Shaun Bailey, MP for Wednesbury, Oldbury and Tipton, stood up for council tenants who, over fear of losing their homes, are being silenced against... Speeches in Parliament\nShaun Bailey MP speaks in the Covid-19 Restrictions debate 17th June 2021 Yesterday, Wednesday, 16 June, Shaun was glad to speak in the Covid-19 restrictions debate. It is incredibly important that the time the Government has now been... Speeches in Parliament\nShaun Bailey MP questions the Director-General of the Border Force at the Public Affairs Committee 8th June 2021 Yesterday; Shaun questioned Paul Lincoln, the Director-General of the Border Force; and Matthew Rycroft, the Permanent Secretary of the Home Office on a variety... Speeches in Parliament\nShaun asks about local infrastructure to get vaccines out in coming months 25th May 2021 Earlier this afternoon, Shaun asked the Minister for Covid-19 Vaccine Deployment about getting vaccines out and the local infrastructure needed for this to... Speeches in Parliament\nShaun fights for GP resources in Tividale 20th May 2021 After being inundated with correspondence from constituents in Tividale and the amazing work being done by Emma Henlan to stand up for residents, Shaun... Speeches in Parliament\nShaun praises local carers and NHS staff while calling for further investment into GP care 20th May 2021 Yesterday, Wednesday, May 19, Shaun was delighted to be back in the chamber of the House of Commons. He was honoured to speak in the Queen's speech debate on... Speeches in Parliament\nHRH Prince Philip tributes in House of Commons 12th April 2021 I was unfortunately unable to speak in Parliament this afternoon to pay tribute to the life and work of HRH Prince Philip, the Duke of Edinburgh, and as such... Speeches in Parliament\nShaun Bailey MP seeks reassurances over Liberty Steel in Oldbury 25th March 2021 Shaun Bailey, MP for Wednesbury, Oldbury and Tipton, questioned the Government about Liberty Steel. He expressed concern regarding the support employees of... Speeches in Parliament\nShaun Bailey MP welcomes 'New Plan for Immigration' in Parliament 24th March 2021 Shaun Bailey, MP for Wednesbury, Oldbury and Tipton, today spoke in Parliament about the cost of processing asylum claims and the importance of European... Speeches in Parliament",
  "https_www_shaunbailey_org_uk_/https_www_shaunbailey_org_uk_news_thankyou-steve-and-kevin/content_4.html": "A massive thank you to Steve and Kevin for turning what could have been a devastating story on Ridgeway Road to one where they've saved the day!\nhttps://www.wmfs.net/.../bin-man-hailed-as-hero-after.../\nA massive thank you to Steve and Kevin for turning what could have been a devastating story on Ridgeway Road to one where they've saved the day!\nhttps://www.wmfs.net/.../bin-man-hailed-as-hero-after.../",
  "https_www_shaunbailey_org_uk_/https_www_shaunbailey_org_uk_news_category_Written-Questions-News/content_10.html": "Covid-19 Roadmap Update from Shaun Bailey MP 10th May 2021 Earlier this evening, Monday, May 10 2021, the Prime Minister confirmed further details regarding the next stage of the Covid-19 Roadmap. From next Monday, May... Written Questions News",
  "https_www_shaunbailey_org_uk_/https_www_shaunbailey_org_uk_accessibility/content_5.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_shaunbailey_org_uk_/https_www_shaunbailey_org_uk_news/content_2.html": "A thankyou to Steve and Kevin Tuesday, 27 February, 2024 A massive thank you to Steve and Kevin for turning what could have been a devastating story on Ridgeway Road to one where they've saved the day! https://www.wmfs.net/.../bin-man-hailed-as-hero-after.../ Local News\nJames Cleverly Fundraiser 25th February 2024 A massive thank you to Home Secretary, James Cleverly who spoke to a packed room full of members and supporters on Friday for our latest Tipton & Wednesbury... Articles\nSupporting Balls to Cancer 16th February 2024 Supporting Balls to Cancer Balls to Cancer are a Coseley based cancer support charity. Balls to cancer was established in 20ll to support men with cancer as... Local News\nIMPORTANT A461 Road Works Meeting 16th February 2024 A461 Road Works Meeting Thanks to everyone who turned up to our public meeting about the ongoing nightmare that is the A461 Road works. Disappointing that yet... Local News\nSupermarket Stall Tipton! 13th February 2024 Supermarket Stall Tipton! I was delighted to hold my first supermarket stall in Princes End Asda. Thank you so much to the team there and everyone who came over... Local News\nWednesbury door knock 11th February 2024 Great to be out and about knocking doors in Wednesbury & Friar Park with Andy Street and our fantastic candidates and councillors! Future of our bin services... Local News\nVisit to ALUCAST Ltd Wednesbury 27th January 2024 It was amazing to visit ALUCAST foundry in Wednesbury with Andy Street to discuss how we can support the UK metals industry. I am so proud to have such... Articles\nTory Doorstep 27th January 2024 Out campaigning across Tipton today in support of our amazing councillors, candidates and of course out fantastic Mayor, Andy Street Thanks to everyone for the... Articles\nDiscussing £20 Million secured for Wednesbury with Mayor Andy Street 25th January 2024 Discussing the £20 Million secured for Wednesbury with the Mayor of the West Midlands Andy Street - This is a fantastic opportunity for our town and I will make... Local News\nTipton Regeneration- Update 23rd January 2024 Many people are concerned about the Tipton regeneration project, we want as many people as possible to feed into the consultation to let their views be heard... Reports",
  "https_www_shaunbailey_org_uk_/https_www_shaunbailey_org_uk/content_1.html": "Much of the content on this website was established while I was a Member of Parliament. As Parliament has been dissolved there are no MPs until after the General Election on 4th July 2024.\nLatest News\nCampaigns\nShaun on Facebook\nShaun on Twitter\nBecome a member\nContact\nWestminster Office\nHouse of Commons, London SW1A 0AA",
  "https_www_shaunbailey_org_uk_/https_www_shaunbailey_org_uk_volunteer-shaun/content_3.html": "Shaun needs your help!\nHelp support Shaun for the General Election Campaign!\nThe General Election has now been launched for the 4th of July 2024.\nWe need to get Shaun re-elected to continue his work across our towns, any volunteering makes a difference from half an hour of leaflets to phonecalls from home.\nWe hope to see you across the campaign.",
  "https_www_shaunbailey_org_uk_/https_www_shaunbailey_org_uk_news_discussing-ps20-million-secured-wednesbury-mayor-andy-street/content_7.html": "Discussing the £20 Million secured for Wednesbury with the Mayor of the West Midlands Andy Street\n- This is a fantastic opportunity for our town and I will make sure that unlike in the past local residents are properly engaged with.\nDiscussing the £20 Million secured for Wednesbury with the Mayor of the West Midlands Andy Street\n- This is a fantastic opportunity for our town and I will make sure that unlike in the past local residents are properly engaged with."
}