{
  "https_nataliefleet_co_uk_/https_nataliefleet_co_uk_cdn-cgi_l_email-protection/content_3.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_nataliefleet_co_uk_/https_nataliefleet_co_uk/content_1.html": "I was born just down the road in Huthwaite, and I’ve lived round here all my life. I raised my children across our towns and villages – with Tae Kwon Do in Pinxton, friends in Blackwell, music lessons in Tibshelf, shopping in South Normanton, horse riding in Pleasley, football in Glapwell and cycling the Five Pit Trail to Holmewood.\nIn our mining family, hard work meant coming home covered in coal. I knew how to handle a racing pigeon before I could walk and looked forward to days out in Skegness. But growing up after the pits closed was tough, kids like me on free school meals had more chance of going to prison than university. I worked as hard as I could. I left school with a great set of GCSEs, but also a newborn, like too many girls across our area.\nTHE DIFFERENCE A LABOUR GOVERNMENT CAN MAKE\nI was lucky that a change of government meant a step change in the opportunities available to me. It was a Labour government that invested properly in education, finally giving my teachers the space to support me through a vulnerable time. I got a job in the local pub, earning Labour’s brand new Minimum Wage, Labour built a Sure Start on my estate and covered 80% of my childcare fees. I even got a grant to become the first in the family to go to university.\nAfter university I volunteered for the local Citizens Advice Bureau, and was delighted to move into a paid role at the community advice centre in Bestwood, then onto the National Education Union fighting for the rights of the teachers who made such a difference to me.\nFIGHTING FOR THE FUTURE\nWe always expect the next generation will do better than the last, and it breaks my heart to see how badly the Tories are letting our kids down. My son has been studying at Sheffield Hallam University and my eldest is settling down in Pinxton with her partner. I’m so proud of them, but I dread the challenges ahead of them if we can’t get rid of a Government that doesn’t care about people round here.\nAll I ever wanted was better for my kids, that’s why I’m standing to be our MP.\nI joined Unison in my first job; leading local action as a workplace rep on pensions and supporting colleagues as we went out on strike. Members voted me in as Branch Secretary,, negotiating a high quality contract with enhanced terms and conditions, annual leave and five years pay protection for our members. I’ve worked for the National Education Union for eight years, starting as a Helpdesk Advisor, and now leading my department. I’m indebted to my teachers and I fight relentlessly for their working conditions, so they can offer the same transformative education and nurture to our next generation.\nVolunteering and working in community advice for six years, I supported thousands of local people, keeping them in their homes, challenging unscrupulous landlords and negotiating debt repayments to affordable amounts. I supported them through to tribunals - winning life-changing payouts where people had been let down by government agencies. Within three years of this Conservative government, I was made redundant as austerity hit; the need didn’t disappear, but the funding certainly did.\nWhen Labour lost in 2010, I was so gutted I knew I needed to get involved. Since then, I’ve been active at every level, knocking on doors and motivating members in my branch and constituency, getting elected to East Midlands Labour Regional Board to make members’ voices heard, and creating education policy on the National Policy Forum. My focus has always been fighting to regain and retain power at all levels, so we can make the most difference to our communities.\nI’ve spoken up passionately for our party and our area in local, national and international print and broadcast media. It's not in my nature to walk on by when I see an injustice. Watching my daughter suffer with painful allergies led to one of my proudest wins - forcing food outlets to improve labelling to help people like Lottie. I’ve campaigned across the UK to deliver a Labour government and raised funds to make it happen; in the 2019 general election I raised more than £20,000 in the short campaign alone. I’ve hosted shadow-ministerial visits, held formal dinners and informal socials, as well as large rallies, securing high-profile speakers to maximise turnout.\nWhen we lost Bolsover, we lost the legendary name recognition that went with Dennis as our local champion. I’ll be out across the area, at the galas and community centres, relentlessly on their doorsteps, making sure they know that we hear them, we are with them, we are on their side. I’ll make sure our campaign is noticed - securing funding for visible campaign HQs across the CLP and getting regular television and newspaper coverage. And because we need to make the most of all the tools available to us, I’ll revolutionise our digital presence to engage across platforms and reach voters in their online space.\nOf course, you’ll have my mobile number should you want to discuss policy or rant about the opposition. But more than that, after twelve years of activism, I appreciate my large and diverse Labour family, and the lifelong friends I’ve made as a result. We’ll campaign together, and make regular time to strengthen our labour community over a pizza or pint afterwards. It’s going to be a tough two years and it won’t be plain sailing, I’ll make sure we have enough social events to keep us sane along the way.\nEach of us has a story around why we are Labour, I’ll harness that passion and embed each of your strengths into a deliverable strategic campaign, fit for a crucial target seat. I’ll spend the next two years mobilising activists, recruiting members and volunteers, taking our message to residents across Bolsover, offering hope around the next Labour’s government. Whether you are an experienced campaigner, new to canvassing, a dedicated footsoldier, a social media hero, or simply want to attend our fundraisers, there will be a role for you in our team.\nWe share a frustration around the lack of national attention on Bolsover. As your candidate, I’ll always be fighting our corner in Westminster, making sure we get high profile visits and every opportunity to shout about the great things that happen across our towns and villages thanks to your hard work. I’ll advocate for our area with business, attracting jobs and investment, I’ll use every media opportunity I can to bring positive publicity to our area. I’ll work with our trade unions to fight for as much funding and activism as possible to be funnelled into winning back this vital seat.\nBolsover’s schools lost over £200 per pupil between 2015 and 2020. That’s the equivalent of 60 teachers across our towns and villages. A third of pupils in Bolsover receive free school meals, but reversing the progress made with a Labour government, the attainment gap has been widening for these pupils under the Tories. I’ll keep fighting for our schools and early years to be invested in, and for good quality, affordable and available childcare right across the constituency.\nTwelve years of Tory cuts have hit hard, with their new promise of a GP appointment in two weeks a slap in the face to residents who used to be about to access a same-day appointment at Cresswell Medical Centre and across the area. I’ll push for more investment in our local NHS, bringing down waiting times and working to reverse the stagnating life expectancy. I’ll fight for rapid access to mental health support, making sure Labour’s new national target - guaranteeing mental health support within a month for those who need - is rolled out promptly across Bolsover.\nToo many people tell me they will have to choose between heating and eating this winter. The Tory answer is to frack for gas under our homes, but I’ll stand against this and highlight the detrimental impact this would have to our area. Instead, Labour’s Great British Energy Company will establish the UK as a clean energy superpower, guaranteeing long term energy security, bringing down energy prices for residents across our area. In the meantime, I’ll fight for energy companies making huge profits to face a windfall tax that subsidises bills, rather than taxpayers subsidising their profit.\nBolsover District Council have shown how Labour are in power can make great things happen. The amount of social rented housing across Bolsover is higher than both the regional and national average, and private rented housing is lower. I’ll support the powerful ambitions to keep finding innovative ways to extend the social housing offer. The next Labour government will set a target to ensure 70% of residents own their own homes; I’ll work to make sure new developments are genuinely affordable, with the cost linked to local incomes.\nI’ll be the strong national voice fighting for local investment in our area. Too many people struggle to travel between our towns and villages; improving public transport links for work and pleasure will be my priority. I’ll work with the Coalfield Regeneration Trust to identify opportunities for investment in our area. I’ll support the roll out of Labour’s New Deal for Working People; ensuring work once again pays a good wage that you can live on, and gives employment rights from day one. I’d work with employers and trade unions to end appalling practices like fire and rehire, working tirelessly to attract high quality, secure jobs for our residents.\nFor more information about the campaign, or to volunteer get in touch via the contact form.",
  "https_nataliefleet_co_uk_/https_nataliefleet_co_uk_contact-us/content_2.html": "Bring Back Bolsover\nQuestions about the campaign? Want to get involved? Fill out the form below and I’ll be in [email protected]"
}