{
  "https_www_josh_org_uk_/https_www_josh_org_uk_surgeries/content_6.html": "Thank you for your interest in attending an advice surgery with Josh!\nJosh holds surgeries both online and in person.\nPlease email josh.babarinde.mp@parliament.uk to book in to one of his upcoming surgeries.\nYou can book in for one of my advice surgeries by emailing josh.babarinde.mp@parliament.uk, or by calling 01323 733030.\nJosh holds surgeries both online and in person.\nPlease email josh.babarinde.mp@parliament.uk to book in to one of his upcoming surgeries.",
  "https_www_josh_org_uk_/https_www_josh_org_uk_meet-josh/content_7.html": "1993\nBorn at the DGH\nI was born at the Eastbourne District General Hospital (DGH) and was named ‘Eastbourne’s cutest baby’ in a town-wide competition! My mum was so proud!\n1998\nGrew up in Eastbourne\nI went to fantastic local schools: St. Thomas A Becket, Stafford, Cavendish and East Sussex College. I was also a Scout with 8th Eastbourne, then 1st Seaside – Bushy Wood was my second home! My first job was serving pizzas as a waiter in town.\n2011\nWon a place at University\nAt 18, I won a place at the London School of Economics (LSE). This meant a lot to my parents especially because they hadn’t been to university. While at LSE, I supported talented yet underestimated teenagers to become the first in their families to apply to university.\n2014\nBecame a youth and gangs worker\nAfter university, I moved to the East End of London, where I supported young people out of crime and gang activity and into employment.\n2014\nLaunched an award-winning business\nI launched and ran a business for 7 years, training and employing ex-offenders in tech sector roles. We were named ‘Social Enterprise of the Year’ by the Evening Standard and Centre for Social Justice.\n2020\nAwarded an OBE by the Queen\nI was honoured to receive an OBE in The Queen’s 2020 Birthday Honours List for services to criminal justice, social enterprise and the economy. It was presented to me by Princess Anne at Windsor Castle (I took the opportunity to invite her down to Eastbourne!) I dedicated it to Eastbourne, the town that made me, ‘me’.\n2021\nBecame a Covid vaccinator\nDuring the pandemic, I wanted to help the people of my town. I rolled up my sleeves to train as a local Covid vaccinator and had the life-changing experience of vaccinating hundreds of Eastbournians at the Harbour NHS Vaccination Centre.\n2021\nElected as a local councillor\nAs a local councillor for Hampden Park, I’ve played a leading role in developing a £250,000 support package to help Eastbournians who are struggling through the cost of living emergency. This package supported people within Hampden Park, and wider throughout the town.",
  "https_www_josh_org_uk_/https_www_josh_org_uk_help-josh/content_4.html": "Get involved!\nIt’s my mission to give our town the fresh start that we deserve. But to do this, I need your help.\nI’m looking for like-minded and passionate volunteers to join me. Could you help deliver campaign leaflets? Perhaps host a coffee morning?\nThere are lots of ways to help. Sign up and, together, we can fight for Eastboourne!\nVolunteerI need your support\nTogether, we can make a difference. I need your help so we can reach the most people in Eastbourne, but it isn’t cheap.\nIf you can donate, it will go towards fighting for our town, enabling me to be a strong voice for all of us.\nDonate",
  "https_www_josh_org_uk_/https_www_josh_org_uk_privacy-policy/content_5.html": "Josh Babarinde (of 100 Seaside Road, BN21 3PF, phone: 01323 733030, email: josh.babarinde.MP@parliament.uk) is committed to respecting and protecting your personal data. This policy explains who Josh Babarinde is, what personal data (“Data”) he collects, how he uses it, information on your rights, and how you can contact him. The way Josh Babarinde is able to process personal data is governed by the General Data Protection Regulations (GDPR) and Data Protection Act (DPA) 2018.\nWho is collecting your data:\nFor the purposes of UK data protection law, Josh Babarinde is the Data Controller of all personal data sent to him by constituents in his capacity as the Member of Parliament for Eastbourne.\nFrom 01 April 2019 elected representatives and prospective representatives (including police and crime commissioners) are exempt from paying a fee and registering with the Information Commissioner’s Office (ICO). For more information on this visit: https://ico.org.uk/for-organisations/in-your-sector/political/\nHow your data is collected, used and stored:\nWhen you contact Josh Babarinde seeking assistance with a casework issue or to ask a question about local or national policy issues you will be asked for some personal data to enable him and his office to respond.\nJosh Babarinde will use your data for the purposes for which you provide it. While Josh Babarinde MP will treat as confidential any personal information that you pass to him, he will normally allow staff and authorised volunteers to see it if this is needed to help and advise you. Josh Babarinde MP may pass on all or some of the information, unless requested otherwise, to agencies if this is necessary to help with your case.\nJosh Babarinde may wish to write to you from time to time to keep you informed on issues that you may find of interest. Please let him know if you do not wish to be contacted for this purpose. Josh Babarinde may share some of your data, including your name and email address, with the Liberal Democrats for the purpose of communicating with you.\nJosh Babarinde takes the security of your data extremely seriously. Your data will be stored on secure servers in a locked and protected environment. Access to your personal data will be limited to Josh Babarinde and his staff for the purpose of dealing with your query/case and maintaining office records.\nCategories of Personal Data collected may include:\n- Postal Address\n- Email Address\n- Phone Number\n- Correspondence related to your query/casework\n- Case or identification numbers related to your case or query\nWho your data may be shared with:\nWhen taking up casework or policy questions on your behalf, it may be necessary for Josh Babarinde and his office to share the personal data you provide with government departments, local authorities, and other public bodies. Josh Babarinde MP will only share as much information as is necessary to take your case forward.\nOther than in the circumstances above, Josh Babarinde will not share your personal data with other organisations or individuals without your explicit consent.\nHow long your data will be kept:\nJosh Babarinde and his office will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Unless you request otherwise, Josh Babarinde and his office will retain your data for up to five years after your case has been closed in case you get in touch again.\nThe legal basis for processing your data:\nUnder GDPR personal data can only be processed using a lawful basis defined in Article 6.\nJosh Babarinde will process your data using the lawful basis of consent (Article 6a). Your data will be retained and processed in the future under the legal basis of Legitimate Interests (Article 6f) for the purpose of managing constituents’ casework and policy concerns effectively and/or the legal basis of task carried out in the public interest or in the exercise of official authority vested in the controller (Article 6e).\nSpecial Category Data:\nIt may be the case that you disclose personal data classified as special category data under GDPR as part of your casework or policy concern. This may include information related to health, sexuality, race, ethnicity and religion. Under GDPR this data can only be processed using a lawful basis under Article 6 and a condition of processing defined in Article 9. Josh Babarinde MP will process such data under Article 6(a) (Consent) and Article 9(a) (Consent).\nYou have several rights in relation to your data and can choose how it is used. You can:\n- Obtain copies of the data we hold about you (known as a “subject access request”)\n- Request that we correct or update any data held about you\n- Withdraw your consent and ask that we delete your data or restrict the ways in which we use your data\n- Request that data you have given your consent for us to use is provided in an electronic format so it can be transferred to another data controller (known as “data portability”)\n- Opt-out of receiving further communications from us via any medium at any time.\nYou also have the right to make a complaint directly to the Information Commissioner’s Office. They can be contacted at: https://ico.org.uk/global/contact-us/ and concerns can be also logged via: https://ico.org.uk/concerns\nPlease note that Josh Babarinde is not required to comply with Freedom of Information requests.\nContact us\nIf you would like more information on any of the above or have any questions about this policy, then please contact our data protection representative by emailing Josh.babarinde.mp@parliament.uk or by phoning the office on 01323 733030.\nChanges to our Privacy Policy\nWe keep our privacy policy under regular review and as such it may be updated from time to time so you should check it each time you submit personal information to us. The date of the most recent revisions will appear on this page. If you do not agree to these changes, please do not continue to use this website to submit personal information to us. If material changes are made to this privacy policy we will notify you by placing a prominent notice on our website.",
  "https_www_josh_org_uk_/https_www_josh_org_uk/content_1.html": "Hi there!\nBorn and bred here in sunny Eastbourne, I’ve grown up here and I love our town! It really is the jewel in the South Coast’s crown and it is my mission to ensure that we continue to thrive.\nI’m passionate about Eastbourne and the people who live here. As the Liberal Democrat MP for Eastbourne, it’s my mission to represent you, and to make sure your voices are heard and our town gets the representation that it deserves.\nRead my storyMeet Josh\nI believe that in order to truly represent Eastbourne’s residents, I need to meet as many of you as possible. You’ll see me out and about regularly in our town, at events, in the Beacon, walking on the Downs and the seafront, or at your front door.\nIf you see me, stop me and say hello!\nAlternatively, book to speak with me at one of my many advice surgeries at the button below.\nMy advice surgeries",
  "https_www_josh_org_uk_/https_www_josh_org_uk_campaigns/content_2.html": "Action on the Cost of Living\nWith the busiest Foodbank in the UK, I led the charge for Eastbourne to be the first in the country to declare a Cost of Living Emergency. The emergency declaration called on the government to implement a Windfall Tax on the super profits of oil and gas giants and made national news. Within days, the government U-turned and introduced a basic Windfall Tax.\nMy campaign also led to the creation of the UK’s first ‘Cost of Living Emergency Grant Scheme’, a £250,000 Eastbourne Borough Council fund for organisations on the frontline of tackling the cost of living emergency, such as Eastbourne Foodbank.\nI also hosted the first ‘Cost of Living Emergency Summit’, bringing together key stakeholders from across the town (such as the Foodbank, Citizens Advice, Age Concern, local schools, and more) to develop local solutions to the cost of living emergency in the face of the government’s neglect of the issue\nCampaigning for the new hospital we need\nWith reports that the government is set to break its pledge of a brand new hospital for Eastbourne, I’m campaigning for the Conservatives to keep their promise for the new hospital our town needs and deserves.\nA brand new hospital will put us in the best position to bring back the core services that we’ve shamefully lost to Hastings in recent years\nWorking to end the sewage in our sea\nI’m campaigning for the government to hold Southern Water to account for dumping raw sewage into our sea. Me and my Liberal Democrat team are calling for a Sewage Tax on polluting water companies, and for a ban on their bonuses until they get raw sewage discharges under control.\nOur grassroots campaign went national. It forced Southern Water to apologise for their raw sewage discharges and they have already begun taking measures to get a grip\nSupporting local charities\nWe’ve got so many local charities and community groups in every nook and cranny of our town and I’m proud to support them in their life-changing work.\nI draw on my background running community organisations in the past to provide fundraising advice, make connections with local movers and shakers, help raise their profile via social media and helping to raise money for them directly – including jumping out of a plane for Eastbourne’s You Raise Me Up charity, raising over £1,000!\nInspiring the next generation\nRather than leaving my medal from The Queen to gather dust, I launched my OBE Schools Roadshow to inspire local school kids.\nWhen sharing my journey with children like Sakura in the photo, my message is: ‘if you dream big, work hard, believe in yourself and get the right support, anything is possible in our town’.\nMy mission is to make sure that every one gets the support they need to thrive",
  "https_www_josh_org_uk_/https_www_josh_org_uk_contact/content_3.html": "As you can imagine, as a newly elected Member of Parliament, it will take a little time for me to set up a team for my constituency and Westminster offices.\nIn the meantime, if there’s something you think I might be able to support you with, please get in touch via one of the methods below:\nEmail: josh.babarinde.mp@parliament.uk\nTelephone: 01323 733030"
}