{
  "https_www_tandy-labour_org_/https_www_tandy-labour_org_category_robs-blog/content_8.html": "by tandylabour | Mar 4, 2021 | Rob's Blog\nWednesday 3 March saw a Conservative Chancellor struggle to do the right thing at the wrong time. It is great news to see essential measures such as the extension of furlough, self-employment support and the £20/week increase in Universal Credit extended until...\nby tandylabour | Feb 17, 2021 | Rob's Blog\nEvent. Outrage. Silence. Inadequate response. Outrage. Outrage. U-Turn. We have all grown accustomed to this Government’s shambling amateurism, whereby they try to ignore a problem, and then get shamed into action by an unavoidable sense of national outrage. We have...\nby tandylabour | Feb 1, 2021 | Rob's Blog\nDeeper than Brexit Sure, everyone expected the first weeks of Brexit to be a fiasco. What isn’t these days? But I don’t think anyone expected the initial victims to be fishermen (after all the commotion about fish!), Percy Pig and musicians. The disaster around food...\nby tandylabour | Jan 24, 2021 | Rob's Blog\nI received a letter today from an individual with additional health needs in Thornbury, who had written to their Council and MP first, but felt understandable dissatisfied by their inaction. He wanted advice about how the pandemic restrictions affected someone in his...\nRecent Comments",
  "https_www_tandy-labour_org_/https_www_tandy-labour_org_author_tandylabour/content_4.html": "Welcome\nto the home of the Thornbury and Yate Constituency Labour Party.\nAny Labour member or supporter living in the Thornbury and Yate is part of our party.\nMake a difference TODAY\nYour Labour Candidate\nRob Logan\n“Rob has a long-standing family connection to the area, his wife grew up in the outskirts of Thornbury and his extended family is lucky enough to live here still, so he really understands our community and the issues we face here.”\n“An experienced member of the Labour Party, he is currently a school governor, and member of the public body which appoints and regulates magistrates and has experience of criminal justice work. He has extensive experience of supporting people in the community and of working in housing, local government and higher education.\nLatest News\nCatch up with all the updates from the TANDY team and the latest instalments of Rob’s Blog…\nBUDGET RESPONSE\nWednesday 3 March saw a Conservative Chancellor struggle to do the right thing at the wrong time. It is great news to...\nGOVERNMENT BY SHAME\nEvent. Outrage. Silence. Inadequate response. Outrage. Outrage. U-Turn. We have all grown accustomed to this...\nDeeper than Brexit\nDeeper than Brexit Sure, everyone expected the first weeks of Brexit to be a fiasco. What isn’t these days? But I...",
  "https_www_tandy-labour_org_/https_www_tandy-labour_org_page_2/content_2.html": "Welcome\nto the home of the Thornbury and Yate Constituency Labour Party.\nAny Labour member or supporter living in the Thornbury and Yate is part of our party.\nMake a difference TODAY\nYour Labour Candidate\nRob Logan\n“Rob has a long-standing family connection to the area, his wife grew up in the outskirts of Thornbury and his extended family is lucky enough to live here still, so he really understands our community and the issues we face here.”\n“An experienced member of the Labour Party, he is currently a school governor, and member of the public body which appoints and regulates magistrates and has experience of criminal justice work. He has extensive experience of supporting people in the community and of working in housing, local government and higher education.\nLatest News\nCatch up with all the updates from the TANDY team and the latest instalments of Rob’s Blog…\nCentral Government can and should do better\nI received a letter today from an individual with additional health needs in Thornbury, who had written to their...",
  "https_www_tandy-labour_org_/https_www_tandy-labour_org/content_1.html": "Welcome\nto the home of the Thornbury and Yate Constituency Labour Party.\nAny Labour member or supporter living in the Thornbury and Yate is part of our party.\nMake a difference TODAY\nYour Labour Candidate\nRob Logan\n“Rob has a long-standing family connection to the area, his wife grew up in the outskirts of Thornbury and his extended family is lucky enough to live here still, so he really understands our community and the issues we face here.”\n“An experienced member of the Labour Party, he is currently a school governor, and member of the public body which appoints and regulates magistrates and has experience of criminal justice work. He has extensive experience of supporting people in the community and of working in housing, local government and higher education.\nLatest News\nCatch up with all the updates from the TANDY team and the latest instalments of Rob’s Blog…\nBUDGET RESPONSE\nWednesday 3 March saw a Conservative Chancellor struggle to do the right thing at the wrong time. It is great news to...\nGOVERNMENT BY SHAME\nEvent. Outrage. Silence. Inadequate response. Outrage. Outrage. U-Turn. We have all grown accustomed to this...\nDeeper than Brexit\nDeeper than Brexit Sure, everyone expected the first weeks of Brexit to be a fiasco. What isn’t these days? But I...",
  "https_www_tandy-labour_org_/https_www_tandy-labour_org_2021_02_01_deeper-than-brexit/content_7.html": "Deeper than Brexit\nSure, everyone expected the first weeks of Brexit to be a fiasco. What isn’t these days? But I don’t think anyone expected the initial victims to be fishermen (after all the commotion about fish!), Percy Pig and musicians.\nThe disaster around food supply chains is a fairly predictable consequence of a government that always prioritises messages over detail. Signing a deal on Christmas Eve and implementing it on New Year’s Day was always a terrible idea (remember that the EU offered them a 2-year transition period), and inevitable led to key issues being forgotten or miscommunicated. The fact that M&S cannot send its sweets (which are produced in Germany) to its own stores in the Republic of Ireland without paying VAT twice is a ridiculous but inevitable consequence of spending 30 years building up integrated supply chains and then trying to unwind them over a holiday weekend.\nThis has practical consequences for all of us – in December you could spot a bargain from a company in any EU country and see it arrive in a few days. Now you might face a Customs bill of tens or even hundreds of pounds. For nothing.\nThe failure to allow musicians to perform (without an expensive work permit) says something deeper. This was planned.\nThe government was offered a deal on mobility that includes 90 days of visa-free travel, including short-term work. They turned it down – in favour of 90 days of visa-free travel for leisure but not work. Very lovely for Boris Johnson’s dad but utterly useless for most of us. Tragic for those people, such as touring musicians, who want to visit a number of cities and countries for short periods. This means sacrificing a successful British industry for pure ideological reasons.\nIt betrays a basic dislike of foreigners and of British people who want to spend some time abroad.\nThis is the same government that has withdrawn from the Erasmus student exchange programme and presided over continual cuts to teaching languages in schools, as schools have to cope with increasing pressure to do ‘more with less’ by combining ever greater focus on exam results with inadequate investment. It’s not just formal education that is under pressure, but the softer links between schools and cities – an area where Bristol has a grand tradition, with some of the UK’s oldest twinning relationships with Bordeaux and Hannover becoming harder to sustain.\nNo-one gains from stopping young people studying or British musicians performing. Central Government should recognise this and negotiate a more sensible solution – now, not in 2024.\nRob Logan\nLabour Candidate",
  "https_www_tandy-labour_org_/https_www_tandy-labour_org_2021_03_04_budget-response/content_5.html": "Wednesday 3 March saw a Conservative Chancellor struggle to do the right thing at the wrong time.\nIt is great news to see essential measures such as the extension of furlough, self-employment support and the £20/week increase in Universal Credit extended until September – but these decisions should not have been left so late.\nPeople dependent on this support should have been told weeks or months ago that they would continue – instead of waiting for a Chancellor to pull them out of a hat as a PR stunt to distract attention from his risky decision to raise taxes early.\nAny delay causes uncertainly – and uncertainty over whether furlough, in particular, will be extended costs jobs.\nJobs are still being lost, notably in the exporting industries hit by red tape and by creative industries that saw only meagre support, and are still being preventing from touring even after Covid restrictions are removed by a Government still refusing to agree that artists and musicians should be able to tour Britain and Europe without complex and expensive work permits.\nThe West of England is a loser from this Budget, with new infrastructure and public institutions being promised elsewhere in England, and ‘freeports’ being created in almost every other region – including some far from the sea. But nothing for the West of England.\nThat’s why we need a Metro Mayor willing and able to make the case for the region. Dan Norris is that person, and he has my full support.\nStay safe,\nRob Logan,\nLabour Candidate",
  "https_www_tandy-labour_org_/https_www_tandy-labour_org_2021_02_17_government-by-shame/content_3.html": "Event. Outrage. Silence. Inadequate response. Outrage. Outrage. U-Turn.\nWe have all grown accustomed to this Government’s shambling amateurism, whereby they try to ignore a problem, and then get shamed into action by an unavoidable sense of national outrage.\nWe have seen tone-deaf responses and inadequate action preceding inevitable U-Turns across a greater sweep of public policy than any previous Government:\n- School exams\n- School closures\n- Free school meals\n- The failed Covid App that didn’t use Google/Apple technology\n- Covid Test and Trace\n- Covid border controls\n- Christmas\nThe model is clear – try to avoid taking any action, then take minimal action, then keep a much keener eye on public opinion than was ever kept on delivering public services, in order to judge what the public will just about accept. This is what happens when governments are led by newspaper columnists who have never have a proper job in their lives.\nThe most recent example is one of the most shameful yet – the removal of dangerous cladding from residential buildings.\nIt is nearly four years since 72 people lost their lives in the terrible Grenfell Tower fire. During this time, far too little has been done. Thousands of people continue to live in buildings where cladding has yet to be removed. The danger to life remains, and the level of distress is palpable. The outrage rose. ‘Something had to be done’.\nAnd what was done? Too little. The Government has announced a minimal package of support that vastly underestimates the scale of work required and has two huge gaps:\n- The support covers dangerous cladding only, excluding insurance (which can cost more than the removal itself), doesn’t cover fire security staff and means that when surveyors find other fire safety risks, they won’t be able to fix them.\n- The treatment of leaseholders is scandalous – the Government has only funded the removal of cladding on tall buildings (over 18 metres, roughly 6 storeys), meaning that the much greater number of leaseholders in smaller buildings will be saddled with loans that will take decades to pay back. The Government has ‘dealt with’ the problem of people not being able to sell their homes, by creating a new problem of negative equity. This leads to stress, foreclosures and poverty.\nOnce again, the Government is seeing if they can get away with an inadequate response. Don’t let them. Make your voice heard. If the outrage grows, another U-Turn becomes inevitable.\nRob Logan\nLabour Candidate",
  "https_www_tandy-labour_org_/https_www_tandy-labour_org_2021_01_24_central-government-can-and-should-do-better/content_6.html": "I received a letter today from an individual with additional health needs in Thornbury, who had written to their Council and MP first, but felt understandable dissatisfied by their inaction.\nHe wanted advice about how the pandemic restrictions affected someone in his position, as well as making some very good points around a lack of information and responsiveness in the local area – notably relating to Thornbury High Street, something that I’ve commented about in the past. I personally feel the lack of engagement with local shopkeepers is extraordinary and the economic impact on the town will be devastating unless this is addressed.\nBut my main reflection is on how worrying it is for people who just want to know the best thing to do, and who know that the Government (and the local MP) are not listening to them, and not putting their needs first.\nCentral Government can and should do better, but sadly shows no signs of doing so. Particularly so today as they objected to Labour’s request not to cut Universal Benefit in the middle of a pandemic and an economic crisis. — in Thornbury, Gloucestershire."
}