{
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_about-us/content_12.html": "Our vision is to maintain and enhance Northern Ireland’s constitutional position within the United Kingdom, achieving long-term political stability to deliver a peaceful and prosperous future for our people.\nWe want the hard won peace and stability to build a prosperity that flows to each district, community and family. We want to normalise our institutions and political arrangements to demonstrate that democratic standards apply and fairness and equality of opportunity is the right of all.\nThe DUP wants to strengthen our relationship within the United Kingdom. Our representatives in Westminster dedicate themselves to involvement in the affairs of the Nation and in partnership with their Stormont colleagues maximise Northern Ireland’s contribution to the United Kingdom. We will work to increase the respect and status of our region within the Union.\nBeyond our borders the DUP wants Northern Ireland to have a global reputation as a place welcoming to all and thriving. We want Northern Ireland to be regarded as a location where a dedicated, committed and skilled workforce can be found. We want the natural beauty and the friendly character of our people to be promoted to make Northern Ireland “the place to visit”. We want the name of Northern Ireland to be synonymous with progress.\nThe DUP has representation at every level: in Local Councils, Assembly and Westminster. The Party's leader is Gavin Robinson MP.\nParty Executive: Comprised of Party Officers, Parliamentary Party, Assembly Members and Constituency/University delegates.\nElected by the Party Executive. A Director of Elections and up to four co-opted Officers can also be appointed.\nChairman – Lord Morrow of Clogher Valley\nVice Chairman – Edwin Poots MLA\nSecretary - Michelle McIlveen MLA\nAssistant Secretary – Diane Forsythe MLA\nTreasurer – Gregory Campbell MP\nConstituency Associations integrate all the Branches within a Constituency.\nThere can be multiple branches within a constituency.\nA history of the Democratic Unionist Party from its formation in 1971 until the present day.\nMeeting in Grand Central Hotel where agreement was reached to form a new political party. Dr Paisley changes to be DUP MP for North Antrim at Westminster having been elected on 18th June 1970.\n4 MPs join the Ulster Democratic Unionist Party at Stormont; Dr Paisley, William Beattie, Desmond Boal and Johnny McQuade. Charles McCullough joined the party in the Senate.\nEight members elected to a Northern Ireland Assembly.\nTwelve members elected to a Constitutional Convention.\nThree MPs elected to Westminster; Dr Paisley, Peter Robinson and Johnny McQuade.\nDr Paisley elected to the European Parliament.\nThe final 'Carson Trail' rally held at Stormont after a series of Provincewide demonstrations held in opposition to the ongoing Anglo-Irish governmental talks.\nTwenty one members elected to a Northern Ireland Assembly.\nThree MPs elected to Westminster; William McCrea won Mid Ulster and was returned with Dr Paisley and Peter Robinson.\nTwenty four members elected to the Northern Ireland Forum.\nTwenty members elected to the Northern Ireland Assembly.\nDr Paisley tops the poll in fifth consecutive European Election.\nWilliam McCrea wins By Election in South Antrim.\nThree new members join Dr Paisley and Peter Robinson at Westminster; Iris Robinson, Gregory Campbell and Nigel Dodds.\nThe DUP becomes the largest party in the Northern Ireland Assembly with 30 members elected.\nDUP representation in the Northern Ireland Assembly increased to 33 with the defection from the UUP of Jeffrey Donaldson, Arlene Foster and Norah Beare. Jeffrey Donaldson also joins the DUP team at Westminster.\nThe DUP once again tops the poll in the European Election following the retirement from Europe of Dr Paisley.\nNine MPs elected to Westminster with the addition of Sammy Wilson, David Simpson and William McCrea to the existing DUP representatives. The DUP assumes the position as the largest party in Local Government with 182 Councillors.\nThirty DUP MLAs returned to the Northern Ireland Assembly in the first election following the St Andrews Agreement.\nDr Paisley becomes the First Minister of Northern Ireland.\nPeter Robinson becomes Leader of the Democratic Unionist Party and First Minister of Northern Ireland after Dr Paisley steps down from both positions.\nDiane Dodds becomes the DUP Member of the European Parliament.\nThe DUP is returned once again as the largest party in Northern Ireland, increasing its representation in the Northern Ireland Assembly to 38.\nDiane Dodds is returned as the leading unionist MEP and the DUP emerges as the largest party in local government once again in the first election for the new 11 District Councils with 130 seats.\nArlene Foster becomes leader of the Democratic Unionist Party following the retirement of Peter Robinson.\nArlene Foster assumes the office of First Minister.\nThe DUP is returned at the Assembly election once again with 38 seats.\nArlene Foster’s appointed to the Privy Council is approved by HM The Queen.\nThe first Assembly election to implement a reduction in size to 90 MLAs. The Party returns 28 MLA’s.\nFollowing the 2017 General Election and the election of 10 DUP MP’s, the DUP signs a Confidence & Supply Agreement to support the Conservative Government.\nThe Prime Minister calls a snap General Election. The DUP wins 8 seats.\nReturn of Devolution after its collapse in 2017. Signing of the New Decade, New Approach Deal.\nArlene Foster steps down as leader of the Democratic Unionist Party. Edwin Poots is ratified as Party Leader.\nJeffrey Donaldson is ratified by the Party Executive and becomes the fifth leader of the DUP.\nEast Belfast MP Gavin Robinson is elected as Deputy Leader of the Party.\nThe Northern Ireland Assembly is restored following the publication of the Safeguarding the Union Command Paper by the Government. Emma Little-Pengelly is nominated as the deputy First Minister.\nGavin Robinson is ratified as Party Leader having served as Interim Leader since 29th March.\nOpportunities for employment within the Democratic Unionist Party will be listed here.",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_our-team/content_7.html": "Enter your postcode here to find your local DUP representatives.\nGavin Robinson is the Party Leader\nWe’ll email you about campaigns, events and opportunities to get involved.Find out more about how we use your information.",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_legal_cookie-policy/content_14.html": "Last Updated 20th August 2021\nThis Cookies Policy explains what Cookies are and how We use them. You should read this policy so You can understand what type of cookies We use, or the information We collect using Cookies and how that information is used.\nCookies do not typically contain any information that personally identifies a user, but personal information that we store about You may be linked to the information stored in and obtained from Cookies. For further information on how We use, store and keep your personal data secure, see our Privacy Policy.\nWe do not store sensitive personal information, such as mailing addresses, account passwords, etc. in the Cookies We use.\nInterpretation\nThe words of which the initial letter is capitalised have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.\nDefinitions\nFor the purposes of this Cookies Policy:\nCookies can be \"Persistent\" or \"Session\" Cookies. Persistent Cookies remain on your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close your web browser.\nWe use both session and persistent Cookies for the purposes set out below:\nNecessary / Essential Cookies\nType: Session Cookies\nAdministered by: Us\nPurpose: These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts. Without these Cookies, the services that You have asked for cannot be provided, and We only use these Cookies to provide You with those services.\nFunctionality Cookies\nType: Persistent Cookies\nAdministered by: Us\nPurpose: These Cookies allow us to remember choices You make when You use the Website, such as remembering your login details or language preference. The purpose of these Cookies is to provide You with a more personal experience and to avoid You having to re-enter your preferences every time You use the Website.\nTracking and Performance Cookies\nType: Persistent Cookies\nAdministered by: Third-Parties\nPurpose: These Cookies are used to track information about traffic to the Website and how users use the Website. The information gathered via these Cookies may directly or indirectly identify you as an individual visitor. This is because the information collected is typically linked to a pseudonymous identifier associated with the device you use to access the Website. We may also use these Cookies to test new pages, features or new functionality of the Website to see how our users react to them.\nTargeting and Advertising Cookies\nType: Persistent Cookies\nAdministered by: Third-Parties\nPurpose: These Cookies track your browsing habits to enable Us to show advertising which is more likely to be of interest to You. These Cookies use information about your browsing history to group You with other users who have similar interests. Based on that information, and with Our permission, third party advertisers can place Cookies to enable them to show adverts which We think will be relevant to your interests while You are on third party websites.\nStrictly Necessary Cookies\n| Cookie Name | Description | Duration |\n| CRAFT_CSRF_TOKEN | This cookie is used by Cloudflare to identify trusted web traffic. | Session Cookie |\n| CraftSessionId | This cookie name is associated with the Craft web content management system, where is functions as an anonymous session identifier. | Session Cookie |\n| nsid | This domain is owned by Paypal. The main business activity is: E-commerce Provision | Session Cookie |\n| LANG | This domain is owned by Paypal. The main business activity is: E-commerce Provision | Session Cookie |\n| enforce_policy | This domain is owned by Paypal. The main business activity is: E-commerce Provision | 365 Days |\n| l7_az | This domain is owned by Paypal. The main business activity is: E-commerce Provision | Session Cookie |\n| x-cdn | This domain is owned by Paypal. The main business activity is: E-commerce Provision | Session Cookie |\n| tsrce | This domain is owned by Paypal. The main business activity is: E-commerce Provision | 3 Days |\n| ts_c | This domain is owned by Paypal. The main business activity is: E-commerce Provision | 1096 Days |\n| ts | This domain is owned by Paypal. The main business activity is: E-commerce Provision | 1096 Days |\n| x-pp-s | This domain is owned by Paypal. The main business activity is: E-commerce Provision | Session Cookie |\n| akavpau_ppsd | This domain is owned by Paypal. The main business activity is: E-commerce Provision | Session Cookie |\n| Cookie Name | Description | Duration |\n| _gat | This cookie name is associated with Google Universal Analytics, according to documentation it is used to throttle the request rate - limiting the collection of data on high traffic sites. It expires after 10 minutes._ga | Session Cookie |\n| _ga | This cookie name is associated with Google Universal Analytics - which is a significant update to Google's more commonly used analytics service. This cookie is used to distinguish unique users by assigning a randomly generated number as a client identifier. It is included in each page request in a site and used to calculate visitor, session and campaign data for the sites analytics reports. By default it is set to expire after 2 years, although this is customisable by website owners._ga | 730 Days |\n| _gid | This cookie name is associated with Google Universal Analytics. This appears to be a new cookie and as of Spring 2017 no information is available from Google. It appears to store and update a unique value for each page visited._gid | 1 Day |\n| Cookie Name | Description | Duration |\n| __stripe_sid | Stripe is used to making credit card payments. Stripe uses a cookie to remember who you are and to enable the website to process payments without storing any credit card information on its own servers. | Session Cookie |\n| __stripe_mid | Stripe is used to making credit card payments. Stripe uses a cookie to remember who you are and to enable the website to process payments without storing any credit card information on its own servers. | 365 Days |\n| Cookie Name | Description | Duration |\n| YSC | YouTube is a Google owned platform for hosting and sharing videos. YouTube collects user data through videos embedded in websites, which is aggregated with profile data from other Google services in order to display targeted advertising to web visitors across a broad range of their own and other websites. | Session Cookie |\n| test_cookie | This domain is owned by Doubleclick (Google). The main business activity is: Doubleclick is Googles real time bidding advertising exchange | Session Cookie |\n| VISITOR_INFO1_LIVE | This cookie is used as a unique identifier to track viewing of videos | 180 Days |\n| CONSENT | YouTube is a Google owned platform for hosting and sharing videos. YouTube collects user data through videos embedded in websites, which is aggregated with profile data from other Google services in order to display targeted advertising to web visitors across a broad range of their own and other websites. | 5995 Days |\nIf You prefer to avoid the use of Cookies on the Website, first You must disable the use of Cookies in your browser and then delete the Cookies saved in your browser associated with this website. You may use this option for preventing the use of Cookies at any time.\nIf You do not accept Our Cookies, You may experience some inconvenience in your use of the Website and some features may not function properly.\nIf You'd like to delete Cookies or instruct your web browser to delete or refuse Cookies, please visit the help pages of your web browser.\nFor the Chrome web browser, please visit this page from Google: https://support.google.com/accounts/answer/32050\nFor the Internet Explorer web browser, please visit this page from Microsoft: http://support.microsoft.com/kb/278835\nFor the Firefox web browser, please visit this page from Mozilla: https://support.mozilla.org/en-US/kb/delete-cookies-remove-info-websites-stored\nFor the Safari web browser, please visit this page from Apple: https://support.apple.com/guide/safari/manage-cookies-and-website-data-sfri11471/mac\nFor any other web browser, please visit your web browser's official web pages.\nMore Information about Cookies\nFor further information visit www.aboutcookies.org or www.allaboutcookies.org.\nIf you have any questions about this Cookies Policy, You can contact us by email at [email protected]",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_donate/content_13.html": "We’ll email you about campaigns, events and opportunities to get involved.Find out more about how we use your information.",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_policies-consultations/content_4.html": "The DUP has a 5-point plan to build a better Northern Ireland within the Union\nWe’ll email you about campaigns, events and opportunities to get involved.Find out more about how we use your information.",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com/content_9.html": "Writing today, DUP Leader Gavin Robinson said,\nThe Democratic Unionist Party has an\nexperienced track record of speaking up\nfor you on the issues that matter. The DUP\nhas the strength and depth to be able to\nmake the Pro-Union case and to unashamedly\nmake the case for Northern Ireland in Parliament, the Northern Ireland Assembly and your local Council.\n08:00\nWriting today, DUP Leader Gavin Robinson said,\nWe have a plan to build a better Northern Ireland within the Union",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_who-we-are_frank-mccoubrey/content_1.html": "Enter your postcode here to find your local DUP representatives.\nGavin Robinson is the Party Leader\nWe’ll email you about campaigns, events and opportunities to get involved.Find out more about how we use your information.",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_legal_privacy-policy/content_11.html": "This is a privacy policy for the Democratic Unionist Party. The homepage of our website can be found at www.mydup.com\nWe have a specific privacy policy for staffing.\nThe policy has been created in order to demonstrate the Party’s commitment to the protection of your data and to be transparent on how we deal with it.\nThe Party will process your data in accordance with the General Data Protection Regulation (GDPR) and the Data Protection Act 2018.\nThis privacy policy was amended and published on 26th July 2021.\nIt will be reviewed annually along with other data protection policies and procedures, or earlier if there are changes to processing systems, legislation or Data Protection Impact Assessments.\nIf you have any questions about our privacy policy, about how we use your data or would like to exercise any of your rights you can contact our Data Protection Officer\nBy post at:\n91 Dundela Avenue\nBelfast\nBT4 3BU\nBy Email at:\n[email protected]\nBy Phone on:\n+44 (0) 2890 471155\nHow we may collect personal data about you:\nThe Party may collect personal data via means such as:\nWhat type of information do we collect?\nHow your data is used is protected by law and we only use your data where we have an acceptable reason for doing so.\nThe reasons we may process your data are:\nThe law restricts the processing of what is termed “special categories of personal data”. The work of the Democratic Unionist Party and the wider Democratic Unionist Party is deemed to be of substantial public interest and therefore we are permitted to process special categories of personal data relating to your political opinions and voting intentions.\nBelow lists examples of how we use your data and our justification and legal basis for it.\nAny personal information collected by the Party will be processed and stored exclusively for the purposes of the Democratic Unionist Party. Depending on how and why you provide us with your personal data it may be shared within the Party and our elected representatives.\nWe may use named third-party service providers to process and store personal data.\nYou will always have the opportunity to opt out of communications from us at any time or to exercise any of your legal rights.\nSome data may be stored by a service provider outside of the European Economic Area. Where we transfer your data to a service provider outside the EEA we seek to ensure that appropriate safeguards are in place to make sure your personal data is held securely and your rights as a data subject are upheld.\nIf you join the Party we have a legitimate interest in processing your data and contacting you about all aspects of your membership, including information about your entitlements as a member and of Party events; either by post or by electronic means. Membership data will be shared between the central party and the relevant local Branch/Association. The party is run by its members and therefore we have a legitimate interest in member engagement and retention.\nIf you do not renew your membership we will continue to send you information about the Party for a reasonable period. We also have a legitimate interest to retain your data after membership lapses, as well as a legal duty to keep a record of the financial transition. We will endeavour to remove details of lapsed members after five years of their last active payment.\nApplications and membership data are collected and stored using sheepCRM from Authentic Digital (www.authenticdigital.co.uk). More details are available in the section on our service providers.\nMembers can access and amend their data via the Members section of the Party website. There is an option to upload a photograph to your membership profile. This may aid with party events etc.\nIf you donate money to the Party then we have a legitimate interest in processing and retaining your information and to contact you about our fundraising activities either by post or electronic means. We justify this because our activities are funded by donations. For donations over certain thresholds we also have a legal obligation to report it to our regulator, the Electoral Commission, who will publish certain details on their website.\nOnline donations can be made via PayPal or Stripe. More details are available in the section on our service providers.\nMailchimp (The Rocket Science Group)\nWe use Mailchimp to manage our email newsletter subscriber lists and to collect data necessary to process online applications for Party membership.\nAlongside the details submitted in the capture form on the website, Mailchimp will collect data including:\nGoogle\nWe use Google Analytics on our website to measure the performance of the Party website. The users I.P address will be logged and details of visitor behaviour patterns monitored. This information is only processed in a way which does not identify anyone.\nInformation collected include:\nRead more about how Google uses data here:\nhttps://policies.google.com/technologies/partner-sites?hl=en-GB&gl=uk\nPayPal & Stripe\nWe use PayPal and Stripe as a facility to make online donations. Information stored will include name, email address and the amount donated. For donations over £500 you must be a permissible donor. We may use the data provided to either contact you, or to check publicly available records to check permissibility of the donation. All donations made via the Party website will be to the central Party, and donations over £7,500 will be reported to the Electoral Commission and will be published by them.\nRead their privacy policy\nhttps://www.paypal.com/en/webapps/mpp/ua/privacy-full\nhttps://stripe.com/en-gb/privacy\nActionPoint\nThey provide our email service and host this website.\nVertical Structure\nThey host this website.\nPlease visit our cookies page for information on cookies used by this site.\nhttp://www.mydup.com/cookies\nOur website links to other sites, but it will be clearly identifiable where this is the case. Please note we are not responsible for the privacy practices of other sites. Make sure you read their privacy statements if you are concerned about the information they are collecting about you. This statement only applies to our website.\nEmail Updates - You can opt-out of receiving email updates at any time using the “unsubscribe” link in each email we send or using the contact details at the top of this privacy notice.\nMembership - You can cancel your Party membership at any time using the contact details at the top of this privacy notice.\nYou have the right to request a copy of any personal information that we hold about you. This is commonly known as a Subject Access Request.\nMore information on submitting such a request can be found here:\nhttps://ico.org.uk/your-data-matters/your-right-to-get-copies-of-your-data/preparing-and-submitting-your-subject-access-request/\nThis may entitle you to a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nIn certain cases where you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nYou have a right to opt out of our data being used for direct marketing.\nIf we process your data on the basis of “legitimate interests” or “a task carried out in the public interest” then you have the right to object us using your data in that way. This right is not absolute and we may continue to process your data if we can demonstrate compelling legitimate grounds for the processing.\nIf you need to change your email address on our mailing list you can unsubscribe and sign-up again using new information. Other information can also be amended online or by contacting the party via the contact details listed above.\nWe will retain your data for as long as it is required to meet the purposes set out in this notice, unless a longer retention period is required by law.\nData from those who have unsubscribed from our email newsletter mailing list will remain on the database afterwards. All data for those who have unsubscribed will be periodically deleted. This process will take place at least once every calendar year.\nDetails of those who have applied for membership online remain on the database, whether the application has been successfully completed or not. Data will remain on the database for at least twelve months following the date of application but will be deleted at some point during the following twelve months.\nAnyone who wishes their data to be deleted earlier than this can contact the party using the details above and make a request for this to happen. There may be good legal reason for us to continue to hold all or some of the data that you have asked us to erase. If this is the case we will tell you what that reason is at the time we respond to the request.\nIf you have a complaint about any issue related to your data you can submit a complaint to the party, addressed to the Chief Executive, to the party’s contact details listed above.\nThe supervisory authority for the United Kingdom is the Information Commissioner’s office. They can be contacted at:\nhttps://ico.org.uk/",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_news/content_5.html": "08:00 Why the Irish language signage decision cannot stand Writing today, DUP Leader Gavin Robinson said,\n01 May, 2025 Lockhart welcomes protection of women’s sport by FA rules Upper Bann MP Carla Lockhart has welcomed the new eligibility criteria announced bt the FA for women’s football in England and said there must be no dither or delay in offering women in Northern Ireland the same protection.\n30 Apr, 2025 Dublin must do more to establish truth behind Omagh bomb DUP Leader Gavin Robinson MP has said the response received by the Speaker of the NI Assembly to correspondence issued to the Taoiseach, following an Assembly debate relating to the Omagh bomb inquiry, falls predictably short of the openness needed to establish the truth behind the atrocity\n30 Apr, 2025 Minister Lyons celebrates title success for Belfast Giants Communities Minister Gordon Lyons has today hosted a reception at Stormont to mark the incredible success of the Belfast Giants as they take the Elite League title for the third time in four years.\n29 Apr, 2025 Kingsmill report leaves unanswered questions - DUP DUP East Belfast MLA Joanne Bunting, who also chairs the Assembly’s Justice Committee has said the eventual publication of the decade delayed Ombudsman’s report is another milestone for the Kingsmill families, but the sectarian perpetrators still remain at large.\n29 Apr, 2025 Givan Publishes TransformED Delivery Plan Education Minister, Paul Givan has today launched a new Delivery Plan for the TransformED Strategy, which aims to reform and improve education delivery in Northern Ireland.\n29 Apr, 2025 SDLP focused on constitutional politics rather than public services The DUP South Down MLA Diane Forsythe has told the Northern Ireland Assembly that the SDLP’s call for additional NI Executive fiscal powers is reckless and driven by constitutional politics rather than better public services.\n29 Apr, 2025 Dunne marks McIlroy success North Down DUP MLA Stephen Dunne has marked Rory McIlroy's Grand Slam success with a Matter of the Day speech at the Northern Ireland Assembly.\n28 Apr, 2025 Glorifying the PIRA makes light of the ‘Disappeared’ DUP Leader Gavin Robinson MP has said the appointment of Eamonn Henry as the new Lead Investigator for the Independent Commission for the location of Victims' Remains is a reminder of the horrific acts of terror perpetrated by PIRA and those who eulogise and glory in the PIRA’s actions, make light of crimes such as this.\n25 Apr, 2025 Robinson Slams Irish Hypocrisy DUP Leader Gavin Robinson MP has called out the Republic of Ireland for holding the UK to a standard it fails to meet itself. The Irish government needs to confront its own shortcomings in addressing legacy issues and delivering justice to innocent victims.",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_join/content_8.html": "We are the Party for Northern Ireland. Register your support or join as a member to help us keep Northern Ireland moving forward.\nWe’ll email you about campaigns, events and opportunities to get involved.Find out more about how we use your information.",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_legal_safeguarding/content_3.html": "Approved by the Officers of the Democratic Unionist Party and Operational from\n4th September 2020.\nThe welfare of children and adults at risk is paramount and it is the responsibility of all staff, members, volunteers, and elected representatives to behave with the highest standards of integrity, maturity and good judgement.\nIt is the responsibility of all staff, members, volunteers and elected representatives to ensure that their behaviour upholds the standards of this policy, and the party’s Code of Conduct, at all times.\nNotification\nAny breaches of the policy must be reported:\nStaff, members, volunteers and elected representatives who are found to have breached this policy will be subject to the Democratic Unionist Party’s disciplinary procedures.\nFor members, volunteers and elected representatives breaching this policy such a breach will be considered to be a breach of Democratic Unionist Party rule 19 (a), that is: “No member shall bring the Party into disrepute.”\nAny breach of the policy involving a volunteer or member of staff from another organisation will result in them being reported to the appropriate safeguarding officer within that organisation.\nA referral may be made to a statutory agency i.e. the police and/or the local authority or relevant government department if the behaviour alleged to have breached this policy constitutes a safeguarding allegation.\nAbuse of a position of trust\nStaff, members and volunteers, including elected representatives, should be aware that they may be seen as role models by children, young people and adults at risk and therefore they must act in an appropriate manner at all times. They must not engage in sexual activity or allow a sexual relationship to develop with any member under the age of eighteen years old.\nIt is essential that staff, volunteers, members and elected representatives do not:\nDefinitions\nChild: A person under the age of eighteen years old. The fact that a young person has reached the age of sixteen, is living independently, is in further education, is a\nmember of the armed forces, is in hospital or is in custody does not change their entitlement to protection.\nAdult at risk: A person aged eighteen years old or over, who is, or may be, in need of community care services by reason of mental or other disability, age or illness; and who is, or may be, unable to take care of him themselves, or unable to protect him or herself against significant harm or exploitation.\nVolunteer: Any person officially engaged in an activity related to the Democratic Unionist Party which involves spending time, unpaid (except for travel and other approved out-of pocket expenses), doing something which aims to benefit the Democratic Unionist Party.\nThis term includes:\n- Any member of the Democratic Unionist Party elected to local government;\n- Any member elected to a role of their Branch or Constituency Association;\n- Any member who is a member of the Democratic Unionist Party’s Central\nExecutive Committee.",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_contact/content_2.html": "Enter your details and query into the form below and we will endeavour to respond as quickly as possible.\nPlease include your Postcode within the message to ensure that your query can be processed by the most relevant person.\nFor queries to elected representatives please use their contact details provided within the Our Team section.\n028 9047 1155\n[email protected]\n028 9065 4479 (Ext 1)\n[email protected]\n028 9047 1155\n[email protected]\n91 Dundela Avenue\nBelfast\nBT4 3BU\nNorthern Ireland",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_policies/content_6.html": "The DUP has a 5-point plan to build a better Northern Ireland within the Union\nWe’ll email you about campaigns, events and opportunities to get involved.Find out more about how we use your information.",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/http_www_mydup_com/content_15.html": "Writing today, DUP Leader Gavin Robinson said,\nThe Democratic Unionist Party has an\nexperienced track record of speaking up\nfor you on the issues that matter. The DUP\nhas the strength and depth to be able to\nmake the Pro-Union case and to unashamedly\nmake the case for Northern Ireland in Parliament, the Northern Ireland Assembly and your local Council.\n08:00\nWriting today, DUP Leader Gavin Robinson said,\nWe have a plan to build a better Northern Ireland within the Union",
  "https_www_mydup_com_who-we-are_frank-mccoubrey/https_www_mydup_com_legal_terms-of-use/content_10.html": "Acceptance of Terms\nThe services that the Democratic Unionist party provides to you are subject to the following terms of use. The Democratic Unionist Party reserves the right to update the terms at any time without notice to you.\nPrivacy and Protection of Personal Information\nSee the Privacy Policy relating to the collection and use of your information. The Democratic Unionist Party website enables the end user to:\nCopyright and permission\nThe design, formatting, layout, code and appearance of this website belong to the Democratic Unionist Party.\nNo third party has the right to reproduce, in whole or in part, any of the design, formatting, layout, code or appearance without the express consent of the site owners.\nThe Democratic Unionist Party has made every effort to ensure that the information on this website is current and accurate. Neither the developer or the site owner can be held responsible for errors.\nLinking to Third Party sites\nLinks will be provided in this website that will let you leave mydup.com. The linked sites are not under the control of the Democratic Unionist Party and we are not responsible for the contents of any linked site or any link contained in a linked site, or any changes or updates to such sites.\nThe Democratic Unionist Party are providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement by the Democratic Unionist Party of this site. Those sites may also have privacy policies different than our policy.\nMember accounts, password and security\nIf you are a registered user of the members area, permission is granted to access and amend your information there and to any documents or information within that section for Party campaigning, activism and democratic representation.\nYou must complete the registration process by providing us with current, complete and accurate information as prompted by the applicable registration form. You are entirely responsible for maintaining the confidentiality of your password and account.\nYou agree to notify the Democratic Unionist Party immediately of any unauthorised use of your account or any other breach of security. The Democratic Unionist Party will not be liable for any loss that you may incur as a result of someone else using your password or account, either with or without your knowledge. However you could be held liable for losses incurred by the Democratic Unionist Party or another party due to someone else using your account or password.\nYou may not use anyone else's account at any time, without the permission of the account holder."
}