{
  "https_www_abenaoppongasare_com_/https_www_abenaoppongasare_com_category_nhs-wellbeing-and-social-care/content_4.html": "Dear Friends,\nThank you for taking the time to look at my monthly newsletter for February 2025.\nI hope you enjoy this update on some of the work I have been doing in Erith and Thamesmead and in Parliament over the last month.\nAs ever, if you want to get in touch, don’t hesitate to contact me using the email address: abena.oppongasare.mp@parliament.uk\nAbena\nGovernment’s ‘Plan for Change’\nThis month, I wanted to highlight some of the vital actions being taken by the Government that will make a real difference for Erith and Thamesmead residents.\nFixing our NHS remains a top priority, and I’m pleased to see that the extra 2 million NHS appointments promised by the Prime Minister has already been achieved seven months early. We must build on this progress to create an NHS truly fit for the future.\nThis month, the Government has also stepped-up efforts to expand social and affordable housing, a key issue for our community. Ministers announced a £350 million boost to drive construction, alongside measures to improve standards and crack down on rogue landlords in supported housing.\nAdditionally, the Chancellor has recently announced new measures to kick start the economy and put more money in people’s pockets. I back her belief in Britain’s potential and her refusal to accept a low growth future. I look forward to these projects creating a brighter future for the country and here in Erith and Thamesmead.\nWhile tough decisions have been necessary, I hope you agree that this Government is making real progress on these and many other issues to deliver the change agenda the country voted for last year.\nGreenwich Holocaust Memorial Day Event\nI was honoured to attend the Royal Borough of Greenwich’s Holocaust Memorial Day commemoration. It was a poignant reminder to remember the past and stand against hatred. Grateful for the chance to reflect and pay tribute.\nVisit to St Margaret Clitherow Primary School\nIt was a pleasure to be able to visit St Margaret Citherow Primary school in Thamesmead. Firstly, I thanked the students for their lovely designs for my recent Christmas Card Competition. I then had a mini-Interview with two of the runners up, Michelle and Arielle, who fired questions at me about my role in politics. I also asked what inspired their designs, and they shared that the beautiful scenery in our constituency was their main inspiration.\nIt was great to also join the Key Stage 2 assembly whereby the students asked about my role as their MP and my political journey. Lastly, I was taken on a lovely tour of the school by the Head Girl, Claire, and the Head Boy, Jimi.\nWalkabout with Greenwich Safer Neighbourhood Policing Team\nIt was important to recently join a walkabout with the Thamesmead Safer Neighbourhood Team (SNT). It was insightful to see and hear firsthand how they deal with the challenges of policing in the local area. What stood out as especially valuable was observing how they cooperate with local schools to ensure a safe dispersal at the end of the school day – making sure the area is kept safe for the students and residents.\nIt is important we continue to restore trust in our police and crack down on all forms of crime.\nRe-opening of Woodlands Farm Trust Education Centre\nIt was a pleasure to attend the relaunch of education classes at the Vaughan Mills Education Centre on Woodlands Farm, alongside Shooters Hill Councillors, Ivis Williams and Raja Zeeshan and the respective Mayors for Greenwich and Bexley.\nI saw the fantastic nature on offer at the Farm on our tour led by Dr Barry Gray, chairman of the Woodlands Farm Trust. It is imperative more young people get outside and enjoy the great green spaces available to them in our constituency.\nMinisterial work in the Cabinet Office\nThis month, I’ve been excited to continue my work in the Cabinet Office. I’ve had the privilege of visiting various teams across the country, each doing incredible work in their areas of expertise.\nI began the month with an important visit to the University of Glasgow’s Advanced Research Centre to speak to them about their groundbreaking quantum research and the Government’s investment in the sector to build a more resilient Britain.\nFollowing this, it was great to spend time with the Lincolnshire Resilience Forum (LRF), alongside fellow Minister Alex Norris, responsible for Local Growth and Building Safety. I was very impressed to see how the LRF Innovation Fund is driving projects that boost public preparedness and resilience. It was also good to visit the Waddington Fire & Rescue Training Centre, where teams master crisis response skills.\nLastly, it was a pleasure to open this February’s Local Resilience Forum Chairs’ Conference in Birmingham. During the event, I had the opportunity to engage with local resilience leaders from across the UK to discuss and identify key priorities for ensuring the safety of our communities.\nFurthermore:\n- Visit to Parliament by Trinity School, Belvedere – Great to see their Year 11 GCSE Citizenship Studies class had a great visit to the Houses of Parliament, including meeting my Parliamentary team and visiting 10 Downing Street!\n- Visit to Parliament by St Patrick’s Catholic Primary School – Lovely to hear about their students’ visit to Parliament, including a tour, an Education Centre session as well as taking the time to raise some important local issues with me.\n- New Location for Plumstead Post Office – In case you missed it, the Plumstead Post Office has reopened across the road at 7 Brewery Road. I know how vital the Post Office is to our community so I’m glad to see a smooth transition from the old location.\n- Knife Amnesty Bins – Important to see knife amnesty bins installed in our community by the Royal Borough of Greenwich. One is in Abbey Wood at the back of the Old Council Office.\n- Children’s Mental Health Week 2025 – This month I supported Place2Be’s important work marking Children’s Mental Health Week 2025. Find out more here.\n- National Apprenticeship Week – Good to see the Government going further and faster to support apprentices nationwide with up to 10,000 more places per year.\n- Time to Talk Day 2025 – This day gives us all a chance to get comfortable and start talking about mental health. Find out more here.\n- LGBT+ History Month – Glad to celebrate the heritage and contributions of LGBT+ communities in our local area and across the country this month.\n- Hearts Unions Week – Pleased to celebrate all the work unions do to make our workplaces fairer and stronger during this recognition week.\nStay updated on social media\nFor regular updates on my activities, follow me on Twitter (@abenaopp), Facebook (Abena Oppong-Asare MP, Erith and Thamesmead), and Instagram (abena.oppongasare.mp).\nYou can also sign up to my digital newsletter at www.abenaoppongasare.com/get_in_touch",
  "https_www_abenaoppongasare_com_/https_www_abenaoppongasare_com_category_treasury/content_2.html": "Dear Friends,\nThank you for taking the time to look at my monthly newsletter for March 2025.\nI hope you enjoy this update on some of the work I have been doing in Erith and Thamesmead and in Parliament over the last month.\nAs ever, if you want to get in touch, don’t hesitate to contact me using the email address: abena.oppongasare.mp@parliament.uk\nAbena\nCelebrating International Women’s Day 2025\nThis month, we celebrated International Women’s Day 2025 – an important occasion for girls and young women across our country and the world. It’s a time to reflect on the significant progress made toward gender equality and to renew our commitment to creating equal opportunities for everyone, regardless of gender or background.\nThis year was particularly special as we celebrated the remarkable progress in electing women to the House of Commons. In last year’s election, a record-breaking 263 women were elected, making up an all-time high of 40 percent.\nTo mark the day, I was proud to stand alongside my fellow women MPs in the House of Commons chamber. I also posted a video on the day, which you can see here.\nGreenwich Mummies Forum visit on IWD\nLovely to join the Greenwich Mummies Forum at the Plumstead Centre as part of their festivities celebrating International Women’s Day (IWD). It was inspiring to hear from our local mums and shine a spotlight on their incredible strength.\nVisit to Lessness Heath Primary School\nEnjoyed my visit to Lessness Heath Primary School in Belvedere, meeting Headteacher Miss Bolton, Assistant Headteacher Mr Jackson and Primary First Trust’s CEO Miss Hamilton.\nIt was also fantastic to tour the school, meet the wonderful students during their lunch break, and even wish the school dog, Lola, a very happy birthday!\nVisit to Oscar Mayer in Erith\nPleased to visit Oscar Mayer on Erith Marshes this month. I had a productive discussion with Alex James and his team on their role locally and the challenges they face. I’m committed to supporting our local businesses while also securing the strongest workers’ rights in a generation.\nGhana’s 68th Independence Day Parliament Event\nI was thrilled to attend Ghana’s 68th Independence Day celebration reception in Parliament, hosted by Bell Ribeiro-Addy MP. It was a fantastic event, joined by Lord Paul Boateng, the Minister for Africa, Lord Collins, and many other important voices from the Ghanaian community here in the UK.\nAs the first female Minister of Ghanaian heritage, it meant a lot to be part of this celebration and represent our constituency, which has the largest African descendant population in the country. It was a great chance to shine a light on the incredible contributions of Ghanaians in the UK and come together for such a special occasion!\nUsdaw ‘Breaking Down Barriers’ event in Parliament\nPleased to join members of Usdaw’s Breaking Down Barriers programme during their visit to the Houses of Parliament.\nIt was good to see the important work Usdaw is doing to strengthen representation in union roles, workplaces across the country, and in politics. The group was full of impressive individuals from all walks of life who asked thoughtful questions.\nWomen’s History Month in Parliament\nThis March, we’re also celebrating Women’s History Month. It was great to join fellow Members of Parliament at the House of Commons Speaker’s reception to mark the occasion and reflect on the progress made by women in the UK.\nUpdate on the Government’s ‘Plan for Change’\nThis month, the Government has continued delivering on its ‘Plan for Change’. I’m pleased to see the Education Secretary recently launch the initial rollout of free breakfast clubs, benefiting children across England, including Jubilee Primary School and Willow Bank Primary School in our constituency of Erith and Thamesmead.\nI also backed the Children’s Wellbeing & Schools Bill, which will cut school costs for families, drive up standards, and ensure no child falls through the cracks. Additionally, Parliament approved the Employment Rights Bill, the biggest upgrade to workers’ rights in a generation – strengthening sick pay, banning exploitative contracts, and protecting against unfair dismissal.\nFinally, I welcome the Government’s “Pathways to Work” Green Paper, which includes proposals to tackle inactivity and improve employment support for disabled people and those with health conditions. While I recognise the sensitivity of this issue, I believe these crucial steps will contribute to creating a fairer system that enables individuals to live with dignity and independence.\nMinisterial work in the Cabinet Office\nI’ve been excited to carry on my work in the Cabinet Office this month. I began by attending and speaking at the opening of Lloyd’s of London’s ‘Life in the Sun’s Atmosphere’ exhibition. I spoke about what the Government is doing to build a more resilient society. Find out more here.\nDuring Cabinet Office Questions, I was pleased to update the House of Commons on the Government’s emergency alert system to keep the public alert and safe as quickly as possible during emergencies.\nAdditionally, it was important and moving to join Cabinet Office colleagues and other Members of Parliament to commemorate the COVID-19 Day of Reflection – marking five years on from the start of the pandemic. It was a time to remember those we lost and honour the sacrifices made by so many.\nFurthermore:\n- Greater London UNISON Regional Women’s Committee Networking Day – Great to speak with some amazing UNISON women about my background and path in politics.\n- Women in Westminster Reception – Lovely to join this important reception in Parliament to celebrate many successful and hard-working women in Westminster.\n- Ash Wednesday – Wishing everyone in Erith and Thamesmead a blessed 40-day period of Lent, which began at the start of this month on Ash Wednesday.\n- Happy Holi – Hope everyone who is celebrating a very happy Holi!\n- Ramadan Mubarak – A very peaceful Ramadan to those who observe.\n- Happy St Patrick’s Day – Hope everyone had a fantastic St Patrick’s Day this year!\n- Happy St David’s Day – Happy St David’s Day to everyone who celebrated!\n- Happy World Book Day – Was good to mark this day and celebrate the work of local teachers, librarians and parents who are getting more children every year into reading.\nStay updated on social media\nFor regular updates on my activities, follow me on Twitter (@abenaopp), Facebook (Abena Oppong-Asare MP, Erith and Thamesmead), and Instagram (abena.oppongasare.mp).\nYou can also sign up to my digital newsletter at www.abenaoppongasare.com/get_in_touch",
  "https_www_abenaoppongasare_com_/https_www_abenaoppongasare_com/content_1.html": "Serving the people of Erith and Thamesmead\n– Abena Oppong-Asare\nIf you are a resident of Erith and Thamesmead and need assistance with an issue you can book a meeting with me by email",
  "https_www_abenaoppongasare_com_/https_www_abenaoppongasare_com_category_environment/content_3.html": "Rishi Sunak, Chancellor of the Exchequer, detailed his plans to protect jobs and boost the economy today but despite big spending pledges the announcement offers little support for people in Erith and Thamesmead.\nConcerned business owners and employees in the creative and beauty industries were expecting to hear details about when they can expect to see business get back to normal today, but the Chancellor’s package managed to completely ignore these important issues. Instead of offering flexible support packages to businesses still closed or operating a reduced service, the Chancellor has offered bonus’ to those that manage to survive the crisis.\nRishi Sunak MP clearly hasn’t had to read the hundreds of emails a day that myself and many other MPs are receiving from business owners on the brink of collapse and constituents struggling to feed their families.\nOne constituent has been in contact with me with concerns about their beauty business, they said:\n“My profession, my reputation and my business is at stake. The action of reopening my beauty business is not from a profit perspective, it’s survival.”\nKnowing that if they survive and manage to retain staff for a further 6 months they can claim £1000 from the Government, will offer little solace to many small business owners across Erith and Thamesmead at this point.\nPlans announced for the hospitality and tourism sector today, one of the few industries that were acknowledged, reveal a Government that does not understand the extent of the health and economic crisis we are in. The Chancellor’s 50% off meal deal does little to support a hospitality industry that were looking forward to a robust new deal.\nThe Government’s failed contact tracing app and confusing messaging throughout the crisis has done little to calm public fear regarding the spread of the virus, with a second wave still a looming possibility. The hospitality and tourism industry is unable to re-open at the capacity levels needed to sustain struggling businesses without a thorough test and trace system – none of the Chancellor’s measures address this.\nMillions of job losses are predicted for the coming months and whilst plans to create new jobs are welcomed, many will still find themselves on Universal Credit for the first time. Over 12,000 jobs have been furloughed in Erith and Thamesmead and unemployment rose by an unprecedented 2% between March and April.\nThe Department for Work and Pensions (DWP) has been promised a £1 billion investment to support schemes and services which help people back into work. Again, this will offer little comfort to the thousands of people applying for Universal Credit for the first time who will be expected to survive on a reduced household income. The return of benefit sanctions, whilst vulnerable people remain exposed to the virus and businesses remain closed, demonstrates the lack of understanding and compassion offered by the Government to those struggling financially from the crisis.\nIf people in Erith and Thamesmead are to feel the benefits of government investment and feel supported through the upcoming period of economic instability, support needs to be targeted locally, with a net-zero target in mind and with long lasting benefits. The Labour Party are calling for four tests to be met in regards to economic support:\n- Projects must involve local firms, upskill the local workforce and lead to material improvement in the quality and availability of local employment\n- The Chancellor must rebuild economic resilience right across the entire country and protect those institutions, like local authorities, that can help deliver that resilience\n- Every single project must be consistent with the drive to net-zero so we can build the green jobs of the future\n- Any benefits of investment now must be cancelled out by poor decisions later. The Conservatives promised at the last election there would be no rises in income tax, national insurance or VAT. We need the economy to bounce back from the crisis, so there’s money in the coffers to protect public finances.\nThe people of Erith and Thamesmead deserve a better economic deal for jobs from the Government, to survive the impact of the COVID-19 pandemic."
}