{
  "https_debbiesoloman_co_uk_/https_debbiesoloman_co_uk_privacy-policy/content_6.html": "Promoted by Debbie Soloman on her own behalf\nCopyright © 2023 Debbie Soloman - All Rights Reserved.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_debbiesoloman_co_uk_/https_debbiesoloman_co_uk/content_1.html": "Conservative Councillor,\nAssociation Chairman\n& Parliamentary Candidate\nConservative Councillor, Association Chairman and Parliamentary Candidate\nI am particularly passionate about small businesses, achieving the benefits of Brexit, improving social care especially for children and investing in skills & education.\nAs an active member of the Rushcliffe Conservative Association, I have worked hard to promote our values and organised multiple fundraising events. Read more about them here.\nDebbie Soloman\nPromoted by Debbie Soloman on her own behalf\nCopyright © 2023 Debbie Soloman - All Rights Reserved.",
  "https_debbiesoloman_co_uk_/https_debbiesoloman_co_uk_my-campaigns/content_3.html": "“SMALL BUSINESS IS THE BACKBONE OF THE UK ECONOMY”\nI’ve been a small business owner for over 25 years.\nI have the experience to understand the unique challenges that we face and understand how small businesses can and should be supported better. Self-employed business owners work hard and are the first cog in the wheel of the UK economy. Without plumbers and electricians our homes can not be built. Without childminders who will look after our children so parents can go to work?\nAs an MP I will be a real advocate for small business and microbusiness owners.\nInvitation to present to No10 Policy Unit: I am already advocating for small and microbusinesses through a policy for Microbusiness & Pensions that I developed & submitted to the policy unit. Subsequently I was invited to present my policy in person as one of the policies under consideration. The individuals who presented at this group meeting represent a wealth of experience and knowledge in this sector and all contributions were very positive to helping small business.\nI will work to promote local business and bring investment in as a thriving local economy is vital!\n“CONSERVATIVES BELIEVE IN DEMOCRACY\"\nSince the Conservative Party enacted the result of a democratic referendum and left the European Union, the United Kingdom is finding its feet again as an independent self governing nation. Delivering the benefits of Brexit is a process and one that I am committed to.\nI believe in the unity of the United Kingdom and that together England, Scotland, Northern Ireland & Wales make a strong partnership.\nI believe in strong borders so that we control who enters and stays in our country. I want the UK to be an economic power house and we can achieve that by attracting business to invest here through incentives and low tax.\nBritish values are strong, fair and compassionate and I will work to deliver for the British people.\n“EDUCATION SHOULD BE ABOUT ENSURING YOUNG PEOPLE HAVE THE RIGHT SKILLS TO BE SUCCESSFUL IN THE REAL WORLD”\nAs a self-employed business owner providing training, I understand how important it is that young people develop the right skills to succeed. That’s why I advocate that apprenticeships are a fantastic way for young people to ‘earn & learn’.\nThe shortage of skills in new and key technologies as well as traditional trades means that getting young people active in our workforce benefits everyone.\nI believe that young people also need to understand basic finance and how to plan for their future.\nAs an MP I will advocate for financial literacy to be taught in schools, so individuals know how to plan for their financial security with a pension, effectively save for their own home and understand how any need for social care when they are older will affect them.\nPromoted by Debbie Soloman on her own behalf\nCopyright © 2023 Debbie Soloman - All Rights Reserved.",
  "https_debbiesoloman_co_uk_/https_debbiesoloman_co_uk_fundraising/content_5.html": "A great Chairman's Dinner with The Rt Hon James Cleverley MP as the special guest. James gave an in-depth and, at times, amusing speech about some of the most important current issues. He also chatted with our members. It was a very enjoyable evening and James helped raise funds for our local PCC Caroline Henry and prospective East Midlands Mayor Ben Bradley.\nWhat an amazing experience! Organising and hosting a fantastic evening for the Rushcliffe Conservative Association, with The Rt Hon Suella Braverman KC MP as the special guest. Suella gave a fabulously passionate and heartfelt speech, interacted with our members and helped raise an amazing amount of money to be used for future campaigns. It was a lot of work but well worth it.\nPolicy should be fun! After a series of successful CPF group meetings discussing policy and becoming the top performing group in the party, each year I organise an evening of policy and FUNdraising at Christmas. Each year we host a guest speaker, buffet dinner, challenging quiz and policy discussion. The funds we raise go towards our successful local campaigning. I've also written an article about how to make your CPF group a success. Just click the picture above to take a look.\nOne million steps with a great team of people to collectively raise over £126,000 for the Buses4Homeless charity.\nFurther fundraising for mental health charities The Lucy Rayner Foundation and StrongMen raised a further £165,000.\nAttending local events and supporting local businesses is one of my favourite ways to spend some time. If I'm not actively involved by baking a cake or helping with organisation, I love to take part and chat to the lovely people who spend so much of their time working hard on community events.\nPromoted by Debbie Soloman on her own behalf\nCopyright © 2023 Debbie Soloman - All Rights Reserved.",
  "https_debbiesoloman_co_uk_/https_debbiesoloman_co_uk_gallery/content_2.html": "Promoted by Debbie Soloman on her own behalf\nCopyright © 2023 Debbie Soloman - All Rights Reserved.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_debbiesoloman_co_uk_/https_debbiesoloman_co_uk_about-debbie/content_4.html": "Throughout my career I’ve been passionate about making a positive impact on the lives of others. Whether this has been through my business providing specialist technical training, fundraising for various charities or helping with activities for young people.\nI entered politics as I believe I can do more to ensure that our Country thrives.\nI have valuable candidate experience, having stood in the 2019 General Election: participated in hustings, conducted media interviews and campaigned solidly for over 4 months.\nI am deeply committed to bringing positive change and progress through political engagement at all levels of our democracy.\nI am very proud to be elected Chairman of my local association. My focus in on securing long term financial stability to support campaigning at all tiers of local government.\nTo deliver this I’ve set up initiatives such as the Rushcliffe Legacy, Local Conservative Business Club, membership drives and a comprehensive fundraising plan.\nIn my past role as DC Membership, I focused on improving member engagement through regular newsletters, increasing membership by 10% and ensuring digital ticketing & payments were implemented.\nWorking for the local community is very important to me. That is why I strive to help individuals through my elected roles as Borough Councillor and Parish Councillor.\nDuring the last local elections we campaigned hard as a team to retain control of our flagship Rushcliffe Borough Council. Since this success, we’ve been able to approve the Local Development Order (LDO) for the redevelopment of the Ratcliffe on Soar Freeport site. This achievement is key to bringing in significant jobs & investment to the local area and more widely across the D2N2 region.\nAs a Councillor I enjoy working for residents and have represented them opposing unwanted developments and working with enforcement officers over local transport issues.\nI’m actively involved with plans for growing the local economy by sitting on the Growth & Development Scrutiny Group, Licensing Committee, Local Development Framework Group and supporting all councillors by Chairing the Member Development Group.\nIn my capacity as a geospatial specialist it means I can use specialist software for maps and databases.\nThis is a vital skill that forms the foundation of delivering a spatial plan at constituency, regional and national level. These skills mean that I am well placed to help deliver national and local initiatives around key policies to serve local communities.\nThrough my business I am proud that I’ve been able to provide high quality training to many individuals supporting a large number of UK businesses, local authorities and government departments. It is gratifying to know that I have had a hand in helping UK businesses harness geospatial technology so they can expand and grow.\nI am a firm believer that the key to successful government is valuing members and their views on policy. To ensure that members views are heard by the Party I set up my local Conservative Policy Forum (CPF) group.\nUnder my leadership and report submissions, within 12 months, the new group climbed to No1 place in the CPF leader board (out of 300 groups) and has remained there ever since.\nI am committed to ensuring members have a voice in national politics.\nAs a successful leader I have presented to the No10 policy unit, been involved in the development of Campaign Literature focusing on Capitalism in our economy and provided peer marking for other CPF group reports. I have also lead groups at Regional and National Party conferences.\nI have been happily married for over 25 years and place a high value on family. I have 3 wonderful children and enjoy spending time with them whenever possible. In my free time\nI like to go walking, work in my garden and will have a go at most activities - including jumping out of an aeroplane!\nPromoted by Debbie Soloman on her own behalf\nCopyright © 2023 Debbie Soloman - All Rights Reserved."
}