{
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news/content_36.html": "Conservatives - Economic Update – indisputable facts. Sunday, 25 February, 2024 Conservatives - Economic Update – indisputable facts. Like every country, the UK economy has faced its challenges following the pandemic and the war in Ukraine. That is why over the past year we have been working on our five priorities, to: halve inflation, grow the economy, reduce debt, cut waiting lists, and stop the boats. A year later, there has been some good progress. Inflation has fallen... Westminster News\nHelen campaigning with the Conservative Women's Association in Sheffield 16th February 2024 Helen campaigning with the Conservative Women's Association in Sheffield Local News\nA message from the Prime Minister 16th February 2024 Am I in your WhatsApp contacts? If not, you're missing out. A message from the prime Minister Rishi Sunack I've started an exclusive WhatsApp channel just for... Westminster News\nNew Postal Vote Regulations 16th February 2024 How to apply for a postal vote. Please click on this link https://www.gov.uk/apply-postal-vote?deliveryName=DM36519 to direct you to the GOV.UK web site Articles\nRishi explains his economic plan 13th February 2024 Rishi explains his economic plan Westminster News\nBlackburn Conservatives call for council car park charge rise rethink. 15th December 2023 The proposed increased parking fees by the Labour run council for all parking in Blackburn town centre to rise by a 30p from Monday, February 5, while the... Local News\nBlackburn Conservative Councillor 'calls in' BwD burial fee rise proposals. 12th December 2023 Blackburn with Darwen Council's Conservative group has forced a review of the authority's proposed increases in charges for burials and cremations. The... Local News\nDO YOU WANT TO TAKE CONTROL! 2nd December 2023 DO YOU WANT TO TAKE CONTROL! We need brilliant young conservatives in public life sitting at the decision making table. Do you know someone who would be... Local News\nConservative Commissioner Snowden's £1m investment set to make a difference in Lancashire 1st November 2023 Andrew Snowden, the Conservative Police and Crime Commissioner for Lancashire has provided £1m to schemes in Lancashire, helping to deter crime and keep people... Local News\nRepresentatives from the Executive team @ Blackburn Conservatives Association attend a meeting along with the Conservative Lancashire Constabulary and Police and Crime Commissioner Andrew Snowden. 19th October 2023 Representatives from the Executive team @ Blackburn Conservatives Association attended a meeting this Thursday along with the Conservative Lancashire... Local News\nThe Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_huge-govt-support-blackburn-darwen-revealed/content_35.html": "Government support made available to residents of BwD via the Council or to the Council itself to help deal with Covid-19 is a huge £79.732m.\nThe figures were revealed in the Council’s Covid-19 Finance Report. The government support includes:\n- £9.3m in grant funding to the Council\n- £2.2m to provide Council Tax Relief to vulnerable residents\n- £16.3m of Business Rates Relief\n- £46.4m of Business Rate Grant support for small businesses\n- £2.2m for the Council to support small businesses that did not qualify for Business Rate Grants\n- £1.4m for Care Home Infection Control\n- £0.016m to support housing rough sleepers\n- £0.131m to support reopening the High Street safely\n- £0.385m of emergency active travel funding\n- £1.4m to support the new Test & Trace service\nThese figures are only for help provided via the Council and exclude other Government help and support, such as the furlough scheme.\nIn addition to that, the Government has also helped the Council with cashflow by providing:\n- Upfront payment of the Business Rates Grant\n- Deferring business rates payments from Councils to government\n- Paying £850m of social care grants in advance.\nBlackburn Conservatives thank our Government for the unprecedented help they have provided to the people of Blackburn during these difficult times.",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_people_mark-russell/content_13.html": "Councillor - Livesey with Pleasington\nMark is a local business professional who is passionate about politics and feels strongly that Blackburn deserves better than what the Labour council have done for the town.\nMark is your Conservative Candidate for Livesey With Pleasington",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_blackburn-central/content_4.html": "Please take our Blackburn Central survey so that we know what you want to be done for your ward. We need to know what you think so we can campaign for what you want.\nSee Also\nPlease take our Blackburn Central survey so that we know what you want to be done for your ward. We need to know what you think so we can campaign for what you want.\n| Attachment | Size |\n|---|---|\n| Ward Map - Blackburn Central (2.46 MB) | 2.46 MB |",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_new-bus-routes-bwd-thanks-govt-grant/content_8.html": "The government has given the Council a grant of £56,788 to introduce 3 new bus routes for the Borough.\nOne route will run between Darwen and Blackburn town centre via Lower Darwen, Guide, Royal Blackburn Hospital, North Road and Audley Range. This service has been campaigned for by Conservative MP Jake Berry and it will have 10 trips per day Monday to Friday.\nThere will also be a new peak service from Blackburn town centre to Whitebirk industrial estate for workers. Return journeys will be handled by the existing Service 3 Sunny Bower service.\nAnother route will see off-peak rural services introduced between Darwen and Edgworth.\nConservative candidate for Audley & Queens Park, Tiger Patel, said \"A new bus service for Audley connecting it to the hospital and town centre is great news. I am pleased that the government has invested in our local bus services\".",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_accessibility/content_25.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_audley-queens-park/content_28.html": "Please take our Audley & Queens Park survey so that we know what you want to be done for your ward. We need to know what you think so we can campaign for what you want.\nSee Also\nPlease take our Audley & Queens Park survey so that we know what you want to be done for your ward. We need to know what you think so we can campaign for what you want.\n| Attachment | Size |\n|---|---|\n| Ward Map - Audley & Queens Park (2.18 MB) | 2.18 MB |",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_mill-hill-moorgate-survey/content_27.html": "Tweet Please share your views on Mill Hill & Moorgate by completing the survey below. We need to know what you think so we can campaign for what you want. Mill Hill & Moorgate Survey Current Mill Hill & Moorgate Issues Get involved Your details Leave this field blank 1.1. What local issues concern you in Mill Hill & Moorgate? Housing Developments Lack of Amenities Anti-Social Behaviour Crime Speeding Parking Litter Fly-tipping Potholes Traffic Congestion Public Transport School Provision None Other… Enter other… 1.2. What, if anything, do you think could be done to improve Mill Hill & Moorgate? 1.3. Which of these local Conservative campaigns do you support? Weekly Bin Collections Scrap Labour's Garden Tax We will scrap Labour's charge for brown bin collections Free Parking in the Town Centre Brownfield First We want to see brownfield sites developed before greenfield sites Free Parking at Witton Park Scrap the Council Exec System The Exec system places too much power in the hands of too few councillors None Other… Enter other… 1.4. Looking ahead to the next local elections, how likely are you to vote for each of the following Parties? Questions 0No chance of voting for them 1 2 3 4 5 6 7 8 9 10Absolutely certain to vote for them Conservative 0 No chance of voting for them 1 2 3 4 5 6 7 8 9 10 Absolutely certain to vote for them Labour 0 No chance of voting for them 1 2 3 4 5 6 7 8 9 10 Absolutely certain to vote for them UKIP 0 No chance of voting for them 1 2 3 4 5 6 7 8 9 10 Absolutely certain to vote for them Other 0 No chance of voting for them 1 2 3 4 5 6 7 8 9 10 Absolutely certain to vote for them 1.5. In order to make this survey representative, how did you vote at the last local elections? Conservative Labour UKIP Other Didn't vote",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_residents-reassured-over-public-open-space/content_14.html": "The Council has reassured residents on Old Gates Drive that a plot of Public Open Space will be returned to its original state once maintenance works on a culvert are completed.\nConcerns were raised when the Council began clearing bushes on the Public Open Space last week. Council actions had previously caused unrest when they tried to sell the land as part of a proposed housing scheme, a move which caused residents to contest its legality and ultimately cause the planning application to be postponed.\nCllr Derek Hardman complained to the Council and has now received the reassurances.\nIt is to be hoped that the Council is true to its word and that this is not an attempt to repurpose the land by the back door.",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_livesey-pleasington/content_9.html": "Cllr Paul Marrow pictured above with Mr Lee Anderson MP and Deputy Chair of the Conservative Party.\nYour Conservative team in Livesey with Pleasington is headed up by our 3 sitting Councillors:\nCllr Derek Hardman\nCllr Paul Marrow\nCllr Mark Russell\nTogether they work hard to deal with issues affecting local residents and retain Livesey with Pleasington's status as a great place to live.\nPlease take our Livesey with Pleasington survey so that we know what you want to be done for your ward. We need to know what you think so we can campaign for what you want.\nPeople\nSee Also",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_sarah-morrison-selected-mill-hill-moorgate/content_37.html": "Blackburn Conservatives are delighted to announce Sarah Morrison as our candidate for Mill Hill & Moorgate ward at the 2020 council elections.\nSarah is a strong local candidate who lives on Railton Avenue so has intimate knowledge of the issues facing the ward and will be easily accessible to local residents.\nSarah will be a fantastic representative in the Council Chamber for local people.",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_shear-brow-corporation-park/content_2.html": "Please take our Shear Brow & Corporation Park survey so that we know what you want to be done for the ward. We need to know what you think so we can campaign for what you want.\nSee Also\nPlease take our Shear Brow & Corporation Park survey so that we know what you want to be done for the ward. We need to know what you think so we can campaign for what you want.\n| Attachment | Size |\n|---|---|\n| Ward Map - Shear Brow & Corporation Park (2.22 MB) | 2.22 MB |",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_people_type_Association-Officers/content_15.html": "Julian Arnold Chairman, Blackburn Conservative Association Parish Councillor - Livesey Parish Council Association OfficersParish Councillors\nLes Cade Treasurer Blackburn Conservative Association & Livesey Parish Councillor Association Officers\nRick Moore Vice Chair Political Blackburn Conservative Association & Livesey Parish Councillor Association Officers",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_baffling-praise-exemplar-councillors/content_33.html": "At the Standards Committee meeting on 20th July, there was some baffling praise for Councillors.\nToward the end of the meeting, one of the participants said: “As the Independent Person for your Standards Committee and an Independent Person for some other Standards Committees, Blackburn with Darwen has the utmost integrity and their Members are exemplar as far as I can see in upholding standards in public life”.\nWas such praise really warranted or appropriate?\nA councillor for Blackburn South East has been expelled from the Labour Party for antisemitism, having authored a Facebook post saying that “Jewish leaders are worse than the Nazis”.\nAnother councillor for Billinge & Beardwood is currently suspended from the Labour Party after allegedly uploading a video to Facebook. The video is allegedly of himself shouting “Murderers” at a group of Jewish people.\nWe are not sure what standards in public life the Independent Person regards as acceptable, but in our opinion these examples fall far short of that.\nA few bad councillors give the many good ones a bad name, but an Independent Person should think carefully before making such a sweeping (and flawed) generalisation. Otherwise his independence could be called into question.\nPerhaps this helps explain why the Council has not seen fit to take any action against either councillor.",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_blackburns-new-ps5m-bus-station-could-be-subsiding/content_7.html": "There are fears that Blackburn's new £5m bus station could be subsiding after a large crack appeared in its floor.\nThe appearance of the large crack, along with damage to a glass door, has raised fears that the structure may be subsiding and could become unsafe. The Council have ordered an investigation.\nThe River Blakewater runs in a culvert near the bus station and, if it is subsidence, then it is likely that its proximity may prove to be the cause.\nCouncillor Derek Hardman said \"The Council will need to undertake a full structural survey as soon as possible. We then expect a full explanation of any problems\".\nDeputy Chair of Blackburn Conservatives Mark Russell said \"I really hope these fears are unfounded and that the bus station doesn't turn out to be subsiding. It only opened in 2016 and could be very expensive to fix. Labour are already wasting millions of pounds of taxpayer money on an unnecessary new cinema so the Council does not have much money to spare\".\nThe bus station was described when it opened in 2016 as \"the Harrods of bus stations\" by the construction firm that built it, a claim which was trumpeted at the time by Labour's regeneration chief Cllr Phil Riley.\nIf the bus station is found to be subsiding then Blackburn Conservatives will seek assurances over the structural integrity of the Cathedral Quarter development, which the River Blakewater also runs under.",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_griffin-development-made-possible-ps670000-government-grant/content_21.html": "The redevelopment of the Griffin area to provide 140 new homes was only made possible by funding of £670,000 from the Ministry of Housing, Communities and Local Government's Land Release Fund.\nDenise Park, Chief Executive of Blackburn with Darwen Borough Council, said of the Griffin redevelopment project: \"There was very little developer interest for the site due to the high remediation costs making redevelopment unviable. The clearance site was unlikely to be brought forward in the short term without public sector financial support\".\nA case study of the project can be found here: https://www.local.gov.uk/development-griffin-regeneration-area\nBlackburn with Darwen also received £32,000 for Newfield Development Area and £35,000 for Fishmoor Drive, meaning that the Council received £737,000 in total.\nThe £45m Land Release Fund was announced by the then Housing Minister Dominic Raab in 2018 to help build the new homes our country desperately needs. It has helped unlock brownfield sites for development which is very welcome, especially compared to Blackburn with Darwen's usual preference for developing greenfield sites.\nIt is great to see Blackburn - in particular Mill Hill & Moorgate, Blackburn Central and Blackburn South East wards - reaping the rewards of a Conservative government.",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_message-prime-minister/content_22.html": "Am I in your WhatsApp contacts? If not, you're missing out.\nA message from the prime Minister Rishi Sunack\nI've started an exclusive WhatsApp channel just for my top supporters.\nAnd now we've launched it. So why not be one of the first to get involved?\nThis channel will:\nGive you exclusive insight into the big decisions as they're being made.\nProvide you with behind the scenes content like never before\nDeliver instant updates on what we're doing to deliver on your priorities, straight to your phone.\nMy channel is private - so other people on the channel won't be able to see who's in and who's out.\nAnd this is a WhatsApp channel not a groupchat. So by signing up you'll only get updates from me and my team, not idle chatter.\nNo-one else in Westminster is doing this. So why not get involved?",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_about-rss/content_11.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_bastwell-daisyfield/content_19.html": "Please take our Bastwell & Daisyfield survey so that we know what you want to be done for your ward. We need to know what you think so we can campaign for what you want.\nSee Also\nPlease take our Bastwell & Daisyfield survey so that we know what you want to be done for your ward. We need to know what you think so we can campaign for what you want.\n| Attachment | Size |\n|---|---|\n| Ward Map - Bastwell & Daisyfield (1.37 MB) | 1.37 MB |",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_kemis-speech-foreign-policy/content_38.html": "The Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_conservative-partys-final-party-election-broadcast/content_34.html": "Tweet Tuesday, 29 April, 2025 National News Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are\nConservative response to Labour's Emergency Budget Wednesday, 26 March, 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_category_Articles/content_24.html": "New Postal Vote Regulations 16th February 2024 How to apply for a postal vote. Please click on this link https://www.gov.uk/apply-postal-vote?deliveryName=DM36519 to direct you to the GOV.UK web site Articles\nBlackburn with Darwen Awarded £2.25m Government Grant 8th March 2021 Blackburn with Darwen has been awarded a £2.25m grant from the Government Public Sector Decarbonisation Scheme. The Grant Scheme will offer a total of £1bn of... Articles",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_contact/content_3.html": "Skip to main content\nBlackburn\nConservatives\nMain navigation\nHome\nJoin\nNews\nOur team\nEvents\nPlease Share Your Views\nContact Us\nAudley & Queen's Park\nBastwell & Daisyfield\nBlackburn Central\nBlackburn South East\nLittle Harwood & Whitebirk\nLivesey with Pleasington\nMill Hill & Moorgate\nRoe Lee\nShear Brow & Corporation Park\nWensley Fold\nContact\nLeave this field blank\nAssociation Office\nSt Marks Conservative Club, Preston Old Rd, Blackburn BB2 2SS\n01254 680586\n[email protected]\nFind us on Facebook\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by Blackburn Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_mill-hill-moorgate/content_16.html": "Please take our Mill Hill & Moorgate survey so that we know what you want to be done for the ward. We need to know what you think so we can campaign for what you want.\nSee Also\nPlease take our Mill Hill & Moorgate survey so that we know what you want to be done for the ward. We need to know what you think so we can campaign for what you want.\n| Attachment | Size |\n|---|---|\n| Ward Map - Mill Hill & Moorgate (1.63 MB) | 1.63 MB |",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_get-involved/content_26.html": "If you want to see a Conservative candidate elected in your area then join our team.\nWe need you help to get Conservative candidates elected in your local ward, so that we can effectively combat the dreadful Labour council that runs Blackburn.\nEveryone has different time constraints and different skill sets. Thankfully there are many ways you can help us and there is a role for anyone. Whether it be leafleting, canvassing, sharing your ideas for Blackburn, becoming a member, standing for election, donating, or helping us organise fundraisers or social events, we welcome your help and support. Political campaigning is a fun and rewarding way to take part in the democratic process.",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_cdn-cgi_l_email-protection/content_12.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_bastwell-daisyfield-survey/content_32.html": "Tweet Please share your views on Bastwell & Daisyfield by completing the survey below. We need to know what you think so we can campaign for what you want. Bastwell & Daisyfield Survey Current Bastwell & Daisyfield Issues Get involved Your details Leave this field blank 1.1. What local issues concern you in Bastwell & Daisyfield? Housing Developments Lack of Amenities Anti-Social Behaviour Crime Speeding Parking Litter Fly-tipping Potholes Traffic Congestion Public Transport School Provision None Other… Enter other… 1.2. What, if anything, do you think could be done to improve Bastwell & Daisyfield? 1.3. Which of these local Conservative campaigns do you support? Weekly Bin Collections Scrap Labour's Garden Tax We will scrap Labour's charge for brown bin collections Free Parking in the Town Centre Brownfield First We want to see brownfield sites developed before greenfield sites Free Parking at Witton Park Scrap the Council Exec System The Exec system places too much power in the hands of too few councillors None Other… Enter other… 1.4. Looking ahead to the next local elections, how likely are you to vote for each of the following Parties? Questions 0No chance of voting for them 1 2 3 4 5 6 7 8 9 10Absolutely certain to vote for them Conservative 0 No chance of voting for them 1 2 3 4 5 6 7 8 9 10 Absolutely certain to vote for them Labour 0 No chance of voting for them 1 2 3 4 5 6 7 8 9 10 Absolutely certain to vote for them Other 0 No chance of voting for them 1 2 3 4 5 6 7 8 9 10 Absolutely certain to vote for them 1.5. In order to make this survey representative, how did you vote at the last local elections? Conservative Labour Other Didn't vote",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_kemi-launches-our-2025-local-elections-campaign/content_5.html": "Tweet Wednesday, 26 March, 2025 National News At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_blackburn-central-survey/content_29.html": "Tweet Please share your views on Blackburn Central by completing the survey below. We need to know what you think so we can campaign for what you want. Blackburn Central Survey Current Blackburn Central Issues Get involved Your details Leave this field blank 1.1. What local issues concern you in Blackburn Central? Housing Developments Lack of Amenities Anti-Social Behaviour Crime Speeding Parking Litter Fly-tipping Potholes Traffic Congestion Public Transport School Provision None Other… Enter other… 1.2. What, if anything, do you think could be done to improve Blackburn Central? 1.3. Which of these local Conservative campaigns do you support? Weekly Bin Collections Scrap Labour's Garden Tax We will scrap Labour's charge for brown bin collections Free Parking in the Town Centre Brownfield First We want to see brownfield sites developed before greenfield sites Free Parking at Witton Park Scrap the Council Exec System The Exec system places too much power in the hands of too few councillors None Other… Enter other… 1.4. Looking ahead to the next local elections, how likely are you to vote for each of the following Parties? Questions 0No chance of voting for them 1 2 3 4 5 6 7 8 9 10Absolutely certain to vote for them Conservative 0 No chance of voting for them 1 2 3 4 5 6 7 8 9 10 Absolutely certain to vote for them Labour 0 No chance of voting for them 1 2 3 4 5 6 7 8 9 10 Absolutely certain to vote for them Other 0 No chance of voting for them 1 2 3 4 5 6 7 8 9 10 Absolutely certain to vote for them 1.5. In order to make this survey representative, how did you vote at the last local elections? Conservative Labour Other Didn't vote",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_people_councillor-paul-marrow/content_20.html": "Councillor - Livesey with Pleasington\nParish Councillor - Pleasington Parish Council\nElected: 02 May 2019\nFirst Elected: 06 May 2016\nWard: Livesey with Pleasington\nElected: 02 May 2019\nFirst Elected: 06 May 2016\nWard: Livesey with Pleasington",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_roe-lee/content_18.html": "Please take our Roe Lee survey so that we know what you want to be done for the ward. We need to know what you think so that we can campaign for what you want.\nSee Also\nPlease take our Roe Lee survey so that we know what you want to be done for the ward. We need to know what you think so that we can campaign for what you want.\n| Attachment | Size |\n|---|---|\n| Ward Map - Roe Lee (1.82 MB) | 1.82 MB |",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_representatives-executive-team-blackburn-conservatives-association-attend-meeting-along/content_31.html": "Representatives from the Executive team @ Blackburn Conservatives Association attended a meeting this Thursday along with the Conservative Lancashire Constabulary and Police and Crime Commissioner Andrew Snowden.\nRecently Commissioner Snowden announced the next phase of £2m ASB hotspot patrols across Lancashire. In addition Home Office funding secured by the Commissioner already funds additional foot patrols in six Lancashire districts as part of Op Centurion, Lancashire Constabulary's targeted operation to crack down on ASB and deliver on Mr Snowden's Fighting Crime Plan priority of getting tough on anti-social behaviour.",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_people_mrs-helen-r-voegt-ba-hons/content_30.html": "Helen is a Blackburn born woman and her political journey began when she gained a history and politics degree at Blackburn College. She is the vice Chair of the Blackburn Conservative Association and is a member of the CWO (Conservatives Women’s Organisation) which amongst other things supports women into elected office. Helen also writes as a contributor to the CWO Forgotten Icons Project.\nHelen has invested 1000’s of hours in local volunteer work, and was the chair of the Corporation Park Supporters Group for 10 years. During this time Helen got the funding for the stunning lighting installation for the Triumphal Arches in the Park, campaigned for many years for the new children’s playground and worked to restore the tennis courts. Helen also works tirelessly to improve Blackburn’s green and public spaces and can often be seen out and about doing necessary jobs.\nHelen has also worked with the Access Ability team empowering people with disabilities and long term health issues.\nHelen believes passionately about democracy, Conservative values and the right for all people in Blackburn in this day and age to be able to vote freely and without intimidation.\nHelen is also widely travelled, including India and extensively across 14 African countries where she witnessed abject poverty, suffering and criminality, all of which gave her deeper compassion about some of the social injustices in the world as she believes that we should help people less fortunate than ourselves.",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_helen-campaigning-conservative-womens-association-sheffield/content_10.html": "Tweet Friday, 16 February, 2024 Local News Helen campaigning with the Conservative Women's Association in Sheffield\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk/content_1.html": "Welcome to the website of Blackburn Conservatives\nWe're campaigning to make Blackburn a better, cleaner and safer place to live, work and play in.\nContact us if you would like to get involved and help Conservative candidates get elected across Blackburn. You can also report issues to us so we can campaign to resolve them, or simply let us know your views on what's happening locally or nationally. We always welcome donations which help us to fund election campaigns, for small donations of under £500 you can use the donate button below. For donations over £500 please Contact us\nFind us on Facebook\nFind us on Twitter\nGet email updates\nContact us\nAssociation Office\nSt Marks Conservative Club, Preston Old Rd, Blackburn BB2 2SS\n01254 680586",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_new-postal-vote-regulations/content_23.html": "How to apply for a postal vote. Please click on this link https://www.gov.uk/apply-postal-vote?deliveryName=DM36519 to direct you to the GOV.UK web site\nHow to apply for a postal vote. Please click on this link https://www.gov.uk/apply-postal-vote?deliveryName=DM36519 to direct you to the GOV.UK web site",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_blackburn-south-east/content_6.html": "Please take our Blackburn South East survey so that we know what you want to be done for your ward. We need to know what you think so we can campaign for what you want.\nSee Also\nPlease take our Blackburn South East survey so that we know what you want to be done for your ward. We need to know what you think so we can campaign for what you want.\n| Attachment | Size |\n|---|---|\n| Ward Map - Blackburn South East (1.59 MB) | 1.59 MB |",
  "https_www_blackburnconservatives_org_uk_/https_www_blackburnconservatives_org_uk_news_category_Westminster-News/content_17.html": "Conservatives - Economic Update – indisputable facts. 25th February 2024 Conservatives - Economic Update – indisputable facts. Like every country, the UK economy has faced its challenges following the pandemic and the war in Ukraine... Westminster News\nA message from the Prime Minister 16th February 2024 Am I in your WhatsApp contacts? If not, you're missing out. A message from the prime Minister Rishi Sunack I've started an exclusive WhatsApp channel just for... Westminster News\nRishi explains his economic plan 13th February 2024 Rishi explains his economic plan Westminster News"
}