{
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_news_category_European-News/content_16.html": "Standing with Ukraine 24th February 2025 Three years ago, Putin ordered the illegal invasion of Ukraine violating international law. Putin thought it would be over in weeks, he was mistaken. Three... European News\nSaqib visits Tallinn to mark the first anniversary of the UK-Estonia Tech Partnership 12th December 2023 Saqib visited Tallinn, the capital city of Estonia to mark the first anniversary of the UK-Estonia Tech Partnership. This partnership allows the UK and Estonia... European News",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk/content_1.html": "Saqib on Facebook\nSaqib on Twitter\nContact\nMeriden & Solihull East\nAm I your MP?\nEnter your postcode to confirm that Saqib Bhatti is your candidate.\nI'm Saqib Bhatti and it is a great honour to be the MP for Meriden and Solihull East. Here you can find my latest news, campaigns and more about me, including what I stand for and how to contact my office. I'm here to help, regardless of how you voted, so please don't hesitate to get in touch.\nEnter your postcode to confirm that Saqib Bhatti is your candidate.",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_news/content_5.html": "St George's Day Parade Sunday, 27 April, 2025 Saqib was delighted to join the Scouts at today’s Cole District Scouts St George’s Day Parade in Knowle. Saqib commented \"An absolutely fantastic display by the Scouts and they should be incredibly proud of the effort they have made to honour such a special and important occasion. Scouting from across Solihull turned out in huge numbers with squirrels, beavers and cubs making us all proud. This is... Local News\nHeart of England Social Club Visit 18th April 2025 To finish off a busy day of visits and meetings Saqib met with Stephen Kibble from the Heart of England Social Club. Saqib commented \"Stephen gave me a tour... Local News\nBaby Life Line Visit 16th April 2025 Last week Saqib was invited to meet with Baby Lifeline in their Solihull office to discuss some of the amazing work the charity has been doing. Baby Lifeline is... Westminster News\nBalsall Common Parkinson's Cafe 14th April 2025 On Friday Saqib was invited to a morning gathering of the Parkinson’s Cafe at Balsall Common Methodist Church. The Solihull Parkinson’s Café is a friendly and... Local News\nCommunity Diagnoatic Drop-in 10th April 2025 Recently I dropped in at a Community Diagnostics in the community event in Parliament event hosted by BIVDA. BIVDA is the national industry association for... Westminster News\nPuberty Blockers Trial 7th April 2025 Earlier in March, reports emerged that suggested the Health Secretary had failed to intervene in an NHS puberty blocker trial. Evidence has demonstrated that... Westminster News\nEaster Egg Collection 4th April 2025 This morning Saqib dropped off a selection of Easter Eggs at the Solihull Council offices as part of the Corporate Parenting Board’s donation drive running up... Local News\nGamechanger Awards 1st April 2025 Today in Parliament Saqib met with Lucy McCann after she was awarded with a Changemaker Award for her work as an Advanced Physiotherapy Practitioner and the... Westminster News\nStill Parents Podcast 29th March 2025 The latest episode of the Still Parents Podcast is out now! I was thrilled to be invited onto the show back in January. The podcast was created by Lily Mae... Local News\nLetter to the Business Secretary on Car Exports 28th March 2025 The UK has a proud tradition of developing and exporting some of the finest cars around the world. Equally, the motor vehicle industry is a key part of our... Westminster News",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_news_heart-england-social-club-visit/content_12.html": "To finish off a busy day of visits and meetings Saqib met with Stephen Kibble from the Heart of England Social Club.\nSaqib commented \"Stephen gave me a tour around the club and the stunning beer garden, which is a clear centre of the community in Meriden.\nI was delighted to hear that the club is doing well and that the decisions they have taken, such as the installation of solar panels, will ensure the club will continue to be around for a long time to come.\nThank you Stephen for the kind invitation to visit.\"",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_about-rss/content_3.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_news_still-parents-podcast-0/content_9.html": "The latest episode of the Still Parents Podcast is out now! I was thrilled to be invited onto the show back in January.\nThe podcast was created by Lily Mae Founder Ryan Jackson alongside Radio Presenter Dan Kelly and Matt Whitehouse to help support bereaved parents, combining helpful advice and guidance with heartfelt humour.\nSaqib commented \"I spoke to the guys about my work as the Vice Chairman of the All Party Parliamentary Group on Baby Loss and the work that has been taking place on a national level to overhaul maternity care in the United Kingdom.\nThank you again to the team for having me on, it was an absolute delight to chat with them.\"\nYou can listen the latest and all episodes of the podcast here: https://www.stillparentspodcast.co.uk/about-the-show",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_news_community-diagnoatic-drop/content_13.html": "Recently I dropped in at a Community Diagnostics in the community event in Parliament event hosted by BIVDA.\nBIVDA is the national industry association for manufacturers and distributors of in vitro diagnostic tests in the UK.\nIn vitro diagnostics or tests conducted outside of a person are used to detect diseases, conditions, and infections, helping healthcare providers diagnose, monitor, and treat patients. A common example of this is a blood test.\nSaqib commented: \"These vital tests are crucial to all of our health and wellbeing and they must be delivered in the most effective way.\nThat’s why I’m calling for community diagnostics to become part of the Government’s Neighbourhood NHS.\nNeighbourhoods are places where GP practices, NHS Community Services, Social Care, Local Authorities, Education and Community organisations deliver coordinated and proactive care through Neighbourhood teams.\nI hope the Government makes the decision to place the delivery of these tests in the hands of healthcare professionals in the community so that they can most effectively be delivered.\"",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_contact/content_6.html": "When writing to me by letter or email please always include your full name and home address including postcode.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_events_feed/content_7.html": null,
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_business-forum/content_17.html": "If you own or run a business in the Meriden constituency*, you’re invited to sign up to Saqib’s business forum and be part of our constituency’s thriving business community.\nThe Business Forum serves as a platform for all businesses to have an open and direct line of contact with their local MP, Saqib Bhatti. There is no doubt that it is the businesses in our constituency which are the life and blood of our communities.\nWhether you are a small business on the local high street, or a larger company, we want to hear from you. The last few months of battling the virus has taken its toll on all businesses, that is why it is more important than ever that business owners have the opportunity to express their needs and concerns with Saqib.\nAs the former President of the Greater Birmingham Chambers of Commerce and now as your Member of Parliament for Meriden, Saqib understands what it means to run a business and the challenges that come with it.\nYou can become a part of our business community today, free of charge! Simply add in your details below and we will be in touch.\n*Remember, the Meriden constituency includes all businesses in Meriden, Knowle, Dorridge, Hockley Heath, Balsall Common, Hampton in Adren, Catherine de Barnes, Castle Bromwich, Chelmsley Wood and everything in between.",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_ae-solihull-petition/content_10.html": "As the Member of Parliament for Meriden & Solihull East, my constituents' access to healthcare services is of the utmost importance to me. We have several wonderful healthcare facilities across Solihull borough but we must continue to improve our healthcare network to better serve the local community. Our next step is to restore Accident and Emergency (A&E) services to the Solihull borough. At the moment, residents of the Solihull borough have to travel to different areas to access an A&E department, with many travelling to Bordesley Green to attend Heartlands Hospital. For many people within our community, travelling to Bordesley Green is impractical and arduous, making accessing A&E services difficult.\nOur community deserves the best healthcare facilities available, and restoring an A&E department to the Solihull borough is paramount to developing our access to emergency medical services. I am campaigning on this issue by talking to the Health Secretary and the Head of the NHS Birmingham and Solihull Integrated Care Board to bring this issue to their attention and ask them how we can best bring A&E services to the Solihull borough. You can support this campaign by signing my petition for this initiative. Together, we can secure an A&E department for the Solihull borough and make sure that everyone has convenient access to this vital emergency medical service.",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_cookies/content_15.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_news_puberty-blockers-trial/content_8.html": "Earlier in March, reports emerged that suggested the Health Secretary had failed to intervene in an NHS puberty blocker trial.\nEvidence has demonstrated that the use of puberty suppressing drugs can have dangerous consequences on children.\nSaqib commented: \"That is why, following my question in the House of Commons, I have written to Wes Streeting, the Secretary of State for Health and Social Care, to express my deep concern regarding the use of puberty blockers on children.\nIn my view, it would therefore be unconscionable to conduct further trials on the use of puberty suppressing drugs on children and I have urged the Health Secretary to show courage and moral leadership to keep our children safe.\"",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_parliament/content_11.html": "Saqib has co-signed a letter with over 100 politicians from around the world, including from Canada, Australia and France, urgently demanding that China immediately release 77-year-old British citizen Jimmy Lai.Mr Lai has been held in Hong Kong by the Chinese authorities since February 2021.",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_news_saqib-appointed-shadow-minister-state-department-culture-media-and-sport/content_14.html": "Saqib has been appointed as a Shadow Minister of State in the Department of Culture, Media and Sport (DCMS). This appointment follows the recent end of the Conservative leadership contest, with new leader, Kemi Badenoch MP, making her shadow ministerial appointments. Prior to this appointment, Saqib was a Shadow Minister in the Department of Science, Innovation and Technology (DSIT) and a Shadow Minister in the Department of Health and Social Care (DHSC). In his new role, Saqib will hold the government to account by scrutinising its policies and actions to secure the best outcome for the nation.\nDuring the last parliament, Saqib served as Parliamentary Under Secretary of State for DSIT, giving him firsthand knowledge of working within a government department as a minister. He also served as a Parliamentary Private Secretary for DCMS, supporting the work of ministers on numerous pieces of legislation, including the Football Governance Bill. These experiences will help Saqib to properly scrutinise the work of DCMS and hold the ministers to account.\nCommenting on the appointment, Saqib said:\n“I am delighted to be appointed to the shadow front bench. As his Majesty’s opposition, our primary duty is to hold the Government to account. As a nation, we Brits love our culture and sport and it is essential the Government do what they can to make it accessible and open for everyone. As Shadow Minister, I will work hard to ensure the Government continue to make Britain the cultural and sporting capital of the world.\"",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_cdn-cgi_l_email-protection/content_4.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_saqibbhatti_org_uk_/https_www_saqibbhatti_org_uk_about-saqib-bhatti/content_2.html": "Saqib Bhatti (full name Mohammad Saqib Bhatti) is the MP for Meriden & Solihull East and was previously the MP for Meriden. Prior to his political career, he was a chartered accountant and President of the Greater Birmingham Chambers of Commerce. He was previously the Vice Chairman of the Conservative Party for Business and a member of the Foreign Affairs Committee in Parliament. Saqib was the Parliamentary Under-Secretary of State for Tech and the Digital Economy, a position he held from November 2023 to July 2024.\nEarly Life\nSaqib was born in 1985, in Walsall, West Midlands where he grew up and attended school. His father is a chartered accountant and runs his own firm of chartered accountants. Both of his parents are of Pakistani origin.\nHe attended King Edwards VI School for boys before reading Law at the London School of Economics where he graduated with LLB (Hons). Bhatti also holds an honorary doctorate from Aston University in Business Administration and was awarded MBE in 2020 for Services to Diversity and Inclusion in Business Communities.\nEarly Career\nUntil his election on 12 December 2019, was the youngest ever President of the Greater Birmingham Chambers of Commerce since its inception in 1813 and acted as a voice for over 3,000 businesses in the West Midlands.\nThe Greater Birmingham Chambers of Commerce’s geography extended across the West Midlands and with 3000 members is one of the largest and fastest-growing Chambers of Commerce in the country. During his tenure he championed the role that business played in society and the fact it is a force for good. He often spoke about the role business will play in beating the challenges faced by society including climate change, knife crime and helping greater integration in society.\nHe remained as president until his election on December 13th 2019.\nAfter graduating from university, Saqib joined international accountancy firm Deloitte in 2007 and trained as a chartered accountant and financial auditor. He specialised in financial service sector audits and trained as a financial instruments specialist. In 2010 he joined the family firm of Chartered accountants, Younis Bhatti & Co which caters for small and medium sized businesses where he was appointed a director in 2012.\nIn 2013 Bhatti joined the board of the Asian Business Chamber of Commerce (then IAB) and was President from 2014 until 2018. He then served as its Honorary Chairman from 2018 to 2020.\nHe was also Director of the Greater Birmingham and Solihull Local Enterprise Partnership responsible for business support. In October 2015 he launched the Growth Hub, the premier access point for business support, on behalf of the GBS LEP. The Greater Birmingham and Solihull LEP area has enjoyed the largest amount of start-ups outside of London since 2014.\nIn 2016 he was recognised by the Institute of Chartered Accountants in England and Wales as a Rising Star.\nPolitical Career\nSaqib was on the National Board for Vote Leave and campaigned to give ethnic minorities a voice on the Leave side of the debate; during which time he also launched ‘Muslims for Britain’ and he is credited with delivering the Leave vote in Birmingham. He was also Deputy Chair for the Andy Street 2020 Mayoral Campaign.\nSaqib is a board member of the West Midlands Reserve Forces and Cadets Association. In 2019 he received an honorary doctorate from Aston University in Business Administration and has been a guest lecturer at Birmingham City University, Warwick University and University College Birmingham.\nDuring his time in Parliament, Saqib served as Private Parliamentary Secretary (PPS) to Liz Truss, the then Secretary of State to the Department for International Trade in 2020. He then served as PPS to the Secretary of State, the Rt Hon. Sajid Javid MP up until July 2022.\nIn September 2022, Saqib was appointed the Conservative Party's Vice Chair for Business. On the 29th November 2022, Saqib was elected onto the Foreign Affairs Committee. Saqib was the Parliamentary Under-Secretary of State for Tech and the Digital Economy, a position he held from November 2023 to July 2024.\nPersonal Life\nCharity work is a fundamental part of Saqib’s life: in July 2019 he raised £27,000 for Prostate Cancer UK and has supported charities around the world in providing education and training for women. He also sits on the board for West Midlands Reserve Forces and Cadets Association. He also been involved with a number of international charitable projects from a young age. Saqib has also formerly served as a trustee of The Lord Mayor’s Charity in Birmingham and on the board of the Lunar Society.\nSaqib often says, “The biggest influence on me is my father who moved to the UK in the 60s in pursuit of the ‘Great British Dream’, he taught me the values of hard work, integrity and determination which have driven my life so far.”\nSaqib lives in Dorridge with his family."
}