{
  "https_charlottenicholsmp_com_/https_charlottenicholsmp_com_contact/content_3.html": "Please note that due to strict Parliamentary protocol, I am only able to make enquiries on behalf of my own constituents. To check if you live in my constituency, check your MP here\nAs your MP I can help with a variety of issues and concerns.\nKeeping the issue private,\nI can write to the relevant department, official, or Minister or make a personal appointment to discuss the issue. This can often go a long way to providing a solution to your issue.\nI can also help to make the issue public by raising it in the House of Commons, where it will be officially recorded, and could potentially come to the attention of the press and public.\nOutside Parliament, you can request that I speak at an event concerning your issue, pledge my support to a campaign or write to the local media on your behalf.\nI hold weekly advice surgeries. They are by appointment only. To make an appointment please send an email using the contact form.\nMy team in Warrington North can often help without you having to attend an advice surgery. Contact my constituency office via one of the ways listed below and a member of the team will get in touch.\nEmail address\nAddress\nEmail address\nAddress\nPhone Number\nI welcome opportunities to meet with local groups, organisations and businesses throughout Warrington North.\nPlease consider inviting me to your meeting or event, but understand that it will not always be possible, due to my parliamentary and other commitments.",
  "https_charlottenicholsmp_com_/https_charlottenicholsmp_com_my-work/content_2.html": "Result: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Failed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Failed\nResult: Motion Failed",
  "https_charlottenicholsmp_com_/https_charlottenicholsmp_com/content_1.html": "I’m Charlotte, the Member of Parliament for Warrington North. I am proud to represent every community in my constituency in Parliament.\nI am here to listen to the issues which matter to you. If they are important to you, they are important to me.\nI welcome opportunities to meet with local groups, organisations and businesses throughout Warrington North.\nPlease consider inviting me to your meeting or event, but understand that it will not always be possible, due to my parliamentary and other commitments."
}