{
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_campaign-responses-international-trade/content_67.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nCampaign Responses - International Trade\nJuly 2020\nDownload File: Trade Bill NC4, 7, 11 + 20_0.pdf",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_search/content_12.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nSearch this site\nSearch\nSearch",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_statement-plan-b-vote/content_18.html": "Today, MPs faced one of the most divisive votes of this Parliament, namely the measures relating to the Omicron variant. Having been repeatedly asked how I intended to vote, I have spent much of the week reading the correspondence that I have received, counselling widely and taking advice. Given that all arguments are deeply polarised and that opinions vary wildly, this has not been easy.\nAfter expressing my concerns to the Government about the lack of evidence presented to date and need for greater certainty, it is reassuring at least that rapid action is being taken. Yet a clear conflict exists between the imperative to maintain our recovery and keep people safe against this new and unknown type. I would therefore have been comfortable voting against the Government had I felt it was the right thing to do but it is with a heavy heart that I have decided to support the measures.\nThe Omicron variant is incredibly infectious, with rates doubling in the UK every 2 days. We know that a booster jab offers a huge increase in protection, with the vast majority of those who are currently in hospital with Covid being unvaccinated. Our world-leading scientific and medical community has also built-up huge experience of Covid over the past 18 months and their advice is the best available, along with that of the DHSC, NHS, SAGE, the JCVI and other eminent experts.\nSo, alongside the accelerated booster programme, I believe that the measures being proposed are reasonable, proportionate, present no loss of individual autonomy and will serve as a precautionary step whilst we gather data on Omicron and get jabs into people's arms. I accept that this will not find favour with everyone, but my reasons have been carefully considered for reasons of public health. It is also imperative that we protect the NHS by minimising the preventable spread of a virus which could needlessly occupy capacity that is required for people requiring emergency treatment and waiting for other procedures. We all have a collective responsibility to each other too.\nPlan B brings three key measures to help slow the spread of Omicron, flatten the infection curve and minimise the R rate, whilst also bringing additional time for people to get their boosters. Whilst little here is new from what has been implemented in Wales, Scotland, Northern Ireland and beyond, I remain clear that no restriction must be in force for any longer than is absolutely necessary:\n- From 10th December, face coverings are compulsory in most public indoor venues, such as cinemas, theatres and places of worship. Some exemptions apply, including pubs and gyms.\n- From 13th December, those who can are asked to work from home. Those who cannot do so can still go to the workplace and there are no restrictions on travel across the UK.\n- Covid-19 passes will be introduced from 15th December for entry into nightclubs and other larger settings. This includes unseated indoor events with 500 or more attendees, unseated outdoor events with 4,000 or more attendees and any event with 10,000 or more.\nFor constituents who are concerned about vaccine passes, I empathise greatly with the counter logic, but I need to set the record straight. The NHS App has already been used with success and is simply a record of vaccination; it is not a 'passport'. And for those who cannot produce a pass, the Government will still allow unvaccinated people to attend large events and nightclubs if they show proof of a negative lateral flow test, regardless of vaccination status. This is something that larger venues and events have already been doing since the Summer on a voluntary basis so it's not new. These tests are widely available from gov.uk, local pharmacies and even sent direct to your home.\nContrary to perception, there is no 'medical apartheid' or marginalisation here as the new measures are in fact a pragmatic way of maintaining normal activities at a time when other countries are seeking to curtail them with more draconian and risk averse measures. And people who have received a double vaccine won’t need to take a test, boosters are not required for the pass and the under-18s remain exempt, so the measures are deemed to be broad, fair and inclusive.\nImplementing Covid status certificates therefore allows a more permissive and collective approach by keeping the community safer with fewer restrictions. Given that no constituent will be barred from specific settings due to their vaccination status and given that lateral flow tests are freely available on demand, I believe that few freedoms are being taken away. And it may even be that certification can help to avert lockdown, perhaps returning all sectors to normal much earlier.\nEven with Plan B, we will have fewer restrictions than most of Europe due to the success of our vaccine rollout. I am adamant too that the case for any tighter restrictions must be irrefutable and those we do have must not remain in place any longer than necessary: this is an issue that I have continually raised in Parliament over the last few months. Even if Omicron is less severe in the UK, this could still lead to large numbers in hospital if people get sick at the same time. But noting that the jury is still out on what this variant does, we must again protect the NHS and get jabs in arms.\nSo, given the latest briefings on Omicron, the emerging data, expert advice, need for caution and the fact that Plan B restrictions will not discriminate against anyone, I decided to reluctantly support the Government's position, albeit with the provisos stated. This tough decision was taken alongside the vast majority of my colleagues on both sides of the House, where broader consensus has been achieved. And for the avoidance of doubt, these measures are not indicative of a totalitarian state but a Government simply wanting to keep people safe and adopt some caution before we know more. I appreciate once again that this will not please everyone, but this is a sensible step to ensure that we can enjoy the festive season and not have to again shut down key economic sectors.\nLastly, I would urge everyone to get vaccinated if not already and to please get your booster at the first opportunity. Given the preliminary data that three jabs do neutralise Omicron, it is imperative that we all get boosted now and protect ourselves, our loved ones and the wider community.\nBook or manage a coronavirus (COVID-19) vaccination\nOrder coronavirus (COVID-19) rapid lateral flow tests\nhttps://www.gov.uk/order-coronavirus-rapid-lateral-flow-tests",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_campaign-responses-parliament-government-and-politics/content_66.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nCampaign Responses - Parliament, Government and Politics\nApril 2022\nDownload File: PartyGate Letter (22 Apr 2022).pdf\nMay 2020\nDownload File: Dominic Cummings Letter.pdf",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_important-notice-about-bracknell-train-station/content_87.html": "22 February 2024\nImportant notice about Bracknell Train Station\nFrom Monday, February 26th, the ticket office building at the station will be closed whilst the temporary scaffolding “tunnel” over the gateline is removed and the full repair of the space is carried out. The repair work is expected to be completed within four weeks and will being tracking this to ensure no unnecessary delays.\nDuring this period, the temporary ticket office in the external cabin will remain open, and customers will access the platforms through the side gate as they did during the flooding.\nJames is in constant communication with SWR/Network Rail and continue to advocating for improvements to the service.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_local-mp-visits-jobs-fair/content_15.html": "Local MP James Sunderland visited the Jobs Fair at Bracknell & Wokingham College to meet with exhibitors and jobseekers.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_christmas-and-new-year-south-western-railway-engineering-works/content_97.html": "Christmas and New Year South Western Railway Engineering Works\nDetails of engineering work being carried out by South Western Railway over the Christmas period will take place on some routes between Sunday 19 December 2021 and Sunday 2 January 2022.\nChristmas and New Year Travel | South Western Railway",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_remembrance-sacrosanct/content_82.html": "James Sunderland writes for The House Magazine.\nAt a remarkable event on 05th June 2019, the world came to Portsmouth for the D Day 75 Commemorations. In what hardly seems two summers ago, this proved to a very special remembrance occasion and one that I will not forget.\nAs one of the lucky few to be present, I had been invited as a member of the Army Engagement Group to host the dignitaries and to play my small part in honouring our World War Two veterans. These living legends had travelled back to the Solent in their hundreds, proudly representing the allied nations who had sent thousands more to land in Normandy on that fateful day in June 1944. Many of course did pay the ultimate price 75 years ago and many more had since fallen at the final hurdle without getting the chance to come to Portsmouth, but their magnificent old friends were still there in force.\nTo my shame, I had anticipated the event to be little more than another public duty, but I was blown away by the occasion and completely overcome by the privilege I felt at being there. Nothing in my years of military service had prepared me for the emotion of that day and nothing has ever come close to the pride I felt at being amongst true heroes, either before or since. Lest indeed we forget that we may never see their like again or fail to honour them.\nUnder blue skies and beautiful sunshine, those fantastic veterans stood out like burning gold. Sitting tall in their magnificent rows, resplendent in their ageless uniforms and with faces contorted by emotion, there was not a dry eye in the audience as the formalities began. Sentimentality raged unabated as wartime memories, songs, sketches, and poems were projected from the stage. Gifted actors spoke movingly about the painful decisions that Eisenhower had taken to launch the invasion in poor weather. Theresa May spoke hauntingly about Captain NWG Skinner, a member of my own Corps, who had died on Sword Beach just after writing a heartfelt letter to his wife. And how many in the audience could fail to feel the hairs on the back of their neck during the RAF fly-past? As someone who was there, I would have defied anyone not to have wobbled with emotion as the veterans themselves climbed onto the stage to poignant applause, a grateful audience reaching out to every single one.\nBut there they were, superbly dressed and impossibly smart, with straight lines on their trousers, immaculate black shoes, old Regimental ties, embroidered blazers and their perfectly polished medals glittering in the sun like diamonds. Some were in wheelchairs, some were walking with sticks and a few were able to move unassisted, but all had beautiful, beaming smiles in the knowledge that their efforts had not been in vain and had not been forgotten, at least for that special day. And my own heart went out to them as never before.\nYears earlier as those brave men attacked the Normandy beaches on 06th June 1944, they could not have conceived the perils that lay ahead or how long the war would last. So, as we approach Remembrance Sunday, please spare a thought for those who gave so much to protect our freedoms, both for those who came back to the families and more poignantly, for those who did not.\nSo please do wear your poppy with pride, put your Sunday best on, polish your medals if you have them, worry not if you don't and get on parade! Why not go to Church and shed a tear, march alongside our military heroes or why not pause in reflection to remember those who made the ultimate sacrifice to protect the freedoms we now enjoy? Or if you are so inclined, just spare a thought for our ancestors during the 2 minutes silence at 11am or simply clap our heroes, as we have rightly done for so many of our brilliant key workers over the past wretched 18 months. Our veterans from every conflict deserve our humble thanks and we will see them proudly wearing their splendid uniforms in every Church, singing loudly and parading along our streets. But those who are still with us from the time of D Day and VE Day are very special indeed. And if you are lucky enough to meet them, please go and say hello.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-calls-defence-spending-invest-uk-defence-industry-and-back-global/content_73.html": "James Sunderland welcomes the commitment to extra defence spending and urges the Government to ensure the extra money is spent responsibly and flexibly both to secure the best equipment for our armed forces and to support Global Britain by investing in the British defence industry and growing UK defence exports.\n2.52pm\nJames Sunderland (Bracknell) (Con)\nThe debate has been animated and enjoyable. It is a great pleasure to speak from the Back Benches from a position of unequivocal strength. As someone who would ordinarily have been critical of defence spending at any time over the past three decades, I admit that today I cannot be. Why? This year, the Government announced an unprecedented multi-year settlement for defence.\nMr Kevan Jones\nIt is not.\nJames Sunderland\nYes, it is. It offers a once-in-a-generation opportunity to modernise our armed forces.\nThroughout my 27-year career in uniform, I lost count of the times I was told that I could not do something, whether it was going on an exercise, organising adventure training, buying trucks or getting the latest equipment. I was always told by the bean counters that it could not be done. It was all doom and gloom, but now it is different. If anything, part of me wishes I were still in uniform because I believe that defence is well placed to take advantage of the excellent settlement.\nLet us look at the facts. First, the deal for defence is worth an extra £24.1 billion over the next four years. It is a huge increase, unlike anything we have seen in recent history.\nMr Jones\nNo, it isn’t.\nJames Sunderland\nYes, it is. It will exceed not only the manifesto commitment—\nMr Jones\nWill the hon. Gentleman not keep repeating that Front-Bench or central-party pump-out? He should look at the Library note. I explained the increase. He says he would like to be there now, but I am not sure he would get the opportunity were he a young man wanting to join the armed forces now, because there are nearly 55,000 fewer people because of the Conservative Government. The budget today is still lower than it was in 2009. Even with the increase, the £13 billion black hole in the equipment budget will not be filled. The idea of painting this rosily might get him on the Front Bench, but he should look at the facts and be independent—which he usually is on a lot of the issues.\nJames Sunderland\nI thank the right hon. Gentleman, but of course he is wrong. I will explain why—because the figures speak for themselves. Have a look at the maths! He is also wrong, because I believe that the offer right now for our armed forces is better than ever before. If I were 21 or 22 years old, I would want to do exactly the same thing that I did almost 30 years ago. I am proud of my service and of the fact that the Government support defence. So, £6.6 million has been invested in research and development, generating £25.3 billion a year for the UK economy and directly employing 133,000 people across the country. Defence spending is critical to levelling up, and we are doing it—fact.\nThe recent Command Paper “Defence in a Competitive Age” reflects a balanced budget. The MOD now has a fantastic opportunity to balance its red line, to get above the line—\nMr Jones\nIt doesn’t!\nJames Sunderland\nYes, it does. The UK armed forces will become a threat-focused integrated force with a continued shift in thinking across land, sea, air, space and cyber, while also being financially sustainable for the first time in decades. If I may say so, the Conservative Government over the past 10 years have spent much of their time putting right the mess that Labour left this country in 2010.\nDefence will spend £85 billion on equipment over the next four years. Shipbuilding investment will double over the life of this Parliament, rising to more than £1.7 billion a year. This will support the MOD in its commitment to grow the Royal Navy surface fleet to 24 frigates and destroyers by 2030. Admittedly, we need more, but of course we have to balance the budget as well.\nRecently, too, the Procurement Minister launched the new defence and security industrial strategy, which benefits British industry to a superb degree. It is about jobs, livelihoods and, above all, export markets. The new strategy allows us to mandate UK content in all our defence contracts in a way that we could not do under the auspices of the European Union.\nMr Jones\nNonsense!\nJames Sunderland\nIt is a fact.\nMr Jones\nThe hon. Gentleman is just wrong on that. Military contracts were excluded from any EU law. The only individuals who chose to put a military contract out to international tender, hiding behind the EU, were this Government, when they were arguing to put FSS out to international competition, even though they could have designated a warship, as did every other country in Europe—France, Spain, Italy and everyone else—and built it at home.\nJames Sunderland\nAgain, I thank the right hon. Gentleman for his intervention. My clear understanding as someone who has spent time working in Defence Equipment and Support and in the MOD is that European Union legislation prevented this country from preferring UK industry. We are now not beholden to the European Union. We can place contracts with whom we want, and we are seeing it right now with our new strategy.\nJohn Spellar\nWill the hon. Gentleman give way?\nJames Sunderland\nI will not give way, sorry.\nJohn Spellar\nGo on, give way.\nJames Sunderland\nGo on then, if the right hon. Gentleman insists.\nJohn Spellar\nI thank the hon. Gentleman for giving way, because he said something very significant—about his understanding when working at DE&S. He was saying that the culture there was to embody in their thinking the idea that they could not do it. In fact, that was totally untrue, and every other European country looked after its own industry. He has, very helpfully, exposed the deeply rotten culture inside the Ministry of Defence.\nJames Sunderland\nMy clear view is that the Ministry of Defence has the ability in law to extend contracts to whom it wants. We are no longer beholden to the European Union.\nJohn Spellar\nWe never were.\nJames Sunderland\nYes, we were. I rest my case.\nLet us look at what we have right now. We have Lightning II.\nJack Lopresti\nDoes my hon. Friend agree that, now that we have left the European Union, we have a great opportunity, because we do not have to adhere to state aid rules or to European Union procurement rules, and that most defence contracts were bilateral anyway?\nJames Sunderland\nI reiterate my previous points on this. The Opposition can make as much noise as they want from the Back Benches, but the fact is this: under the new defence industrial strategy, it is absolutely clear that the MOD can purchase equipment from whom it wants in a way that has not been possible over the past 10 to 40 years.\nMr Kevan Jones\nYeah, American.\nJames Sunderland\nPerhaps. But it is also about balancing the need for the right equipment against the need to make sure that we look after our nascent defence manufacturing industry. I believe that the balance is right today in a way that has not been possible before.\nMr Jones\nI am not precious about this. I agree with the hon. Gentleman in terms of wanting to buy the best kit for our armed forces. May I ask him why, in all those Government-to Government contracts—on Wedgetail, on Apache and now on Brimstone—there is no work share, not even in terms of allowing ongoing maintenance for those things? Why have we just given that out and exported UK jobs to the United States, if this Government are so committed to ensuring that we have a vibrant UK defence policy?\nJames Sunderland\nIt is my clear understanding that the MOD’s responsibility is to purchase the best kit. This is about supporting our soldiers, airmen, sailors and so on. This is about a balanced decision made by the MOD, on advice from DE&S, about buying the right kit. In my humble view, we are in a new era. This is post Brexit and post EU. This is a new era where the Government have the autonomy, as never before, to make the decisions that they want to make. The post-Brexit era gives us that opportunity—that incentive—to look after British industry, which, in my view, is what we must do right now. In terms of what has gone before, that has happened. As of now, under this Government, from 2021, I am absolutely clear that our new strategy gives us the opportunity to do the right thing with the kit that we buy.\nSeveral hon. Members rose—\nJames Sunderland\nI am not giving way again.\nTime is marching on. What have we got? We have Lightning II, an advanced fifth generation aircraft, procured to operate alongside the RAF Typhoon. We have Dreadnought, which will replace the Vanguard-class submarine. It will be the largest ever submarine operated by the Royal Navy. We have the Astute-class nuclear submarines, the largest and, again, most powerful attack submarines ever procured. We have our fantastic carriers: the Queen Elizabeth and the Prince of Wales, again, the largest and most powerful warships ever built for the Royal Navy.\nWe have Ajax, which, I know, has been the subject of debate in this House, but it is a purpose-built platform and, like many other state of the art protected mobility platforms, it will be the best on the market. We have Type 26 frigates, Type 31 frigates, the fleet solid support ships and so much more.\nThese are not vanity projects. These platforms allow us to project force, deter, fight and win. Our forces might be small in comparison with yesteryear, but they are perfectly formed, battle ready, potent and anything but cuddly. They are poised at readiness to be deployed anywhere in the world and our adversaries know that, which is why so much mischief is being caused by them in other domains, but we are ready there, too, as the review has proven.\nFor those in any doubt, and I address my remarks to those on the Opposition Benches, defence spending is a necessary evil to keep us safe. Today, we do face a multitude of threats in multiple domains. Some are known to us and some are not. We are living in an era of constant competition, with persistent engagement against our foes. Sub-threshold conflict pervades all around us. It is a dichotomy perhaps that, in this age of relative peace and prosperity, our future has rarely been less certain or predictable, not least in the battlegrounds of space and cyber. As a fan of the integrated review, it seems obvious to me that the proverbial golf bag of military capability will need to carry ever more clubs and that is happening under this Government. For a start, the golden thread that links hard power with soft power through worldwide free trade exports, balance of payments and creating national wealth is persuasive. We must therefore protect our ability to project force anywhere in the world by being able to call upon the additional, if needed. It is about platforms, ro-ro ferries and long-range aircraft such as the C-17 and the A400—the list goes on.\nI am being urged to finish by Madam Deputy Speaker, but, before I do, I want to quickly cover a few points. Given that we now have more money to spend on defence—fact—the MOD should be placed under even greater pressure to ensure that it is spent wisely. That is about integration of British kit and integration in the UK of overseas equipment if we have to buy overseas equipment. This is about UK content in our defence contracts.\nIn finishing, I will raise three quick points. We have fantastic kit in the UK and I am confident in the main that our forces have what they need. I say that after three decades in the armed forces. I am also proud to serve under a supportive Government who really get defence, and we must spend responsibly and flexibly both to secure what we need for defence and to keep our British defence industry at the forefront of what we do. It is also about producing competitive exports that allow us to benefit our balance of payments, prosperity and reputation. Global Britain is here to stay.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_lexicon-half-marathon/content_21.html": "James Sunderland enjoyed a day at The Lexicon Half Marathon organised by Everyoneactive and Bracknell Forest Council.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-welcomes-funding-boost-schools-bracknell-constituency-government-brings/content_62.html": "James has welcomed the news that schools in England are set to benefit from record funding as England’s core school budget reaches almost £60 billion in 2024-25 – its highest ever level in real terms – with the Bracknell Constituency set to benefit from a total funding increase of £1,792,141 in 2024-25 compared to 2023-24.\nThanks to the Government’s widespread education reforms, England continues to rise up the global rankings in maths, reading, and science. Just this month, England was ranked 11th in the world for maths, up from 27th in 2009, placing England as one of the top performing countries in the western world, and in May, England was named ‘best in the west’ for primary reading.\nSir Keir Starmer said that Wales will be a ‘blueprint for what Labour can do across the UK’, yet Labour-run Wales is behind England, Scotland and Northern Ireland in maths, reading and science, in addition to ranking worst in the UK for the fifth time running in PISA 2018 with results lower than the OECD average in every case.\nAs education standards continue to rise across England, so is support for schools. That is why this Government is increasing funding for schools in England to the highest ever in real terms per pupil.\nPupil premium funding rates will increase to £1,480 for primary pupils and £1,050 for secondary pupils in 2024-25, an increase of ten per cent since 2021-22, to support schools in disadvantaged areas to raise educational outcomes for the pupils who need it most.\nThis funding also includes an extra £440 million investment to support pupils with special educational needs and disabilities (SEND) to fund special schools and provide mainstream schools with additional resources to meet the needs of pupils with complex SEND.\nThe Government is continuing to deliver long-term decisions to ensure our education system is fit for every child, giving them the best start in life and ensuring that they develop all the skills they need to fulfil their potential.\nCommenting James said:\n“Education is the closest thing we have to a silver bullet to transform life choices, and I know that our schools are a top priority for many people across the Bracknell Constituency.\n“That is why I welcome the Government’s decision to increase total funding for schools across Bracknell, Crowthorne, Finchampstead, Sandhurst and Wokingham Without by £1,792,141 next year, as education funding reaches almost £60 billion in 2024-25.\n“This funding will help ensure that schools across the country have the funding and tools they need to make sure every child receives the world class education they deserve for a brighter future.”\nEducation Secretary Gillian Keegan said:\n“Our schools and our teachers are better than ever – and it’s so important that as standards continue to rise, so does our support for schools.\n“That is why boosting school funding was the first thing I did as Education Secretary, and why I will continue to make sure our brilliant schools and teachers have the tools they need to make sure every child receives a world class education.\n“I know costs for schools continue to be high, but ensuring schools are funded at their highest level in history in real terms will give parents and schools the confidence that education continues to be the top for this Government.”",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_article-wokingham-paper/content_100.html": "I write this on the early morning train into Westminster. Even at this ungodly hour, I am surprised by how many more people appear to be commuting into London, how much busier the trains are and the efforts that everyone is consciously making to ensure social distancing throughout the carriage. This is of course a good thing. Not only are we rightly continuing to return to some kind of normality after months of lockdown, but the economy requires our best effort to bring the resurgence that is needed and I am pleased that all those I meet are behaving responsibly. For me, the vastly improving public health picture must be accompanied by an increased determination to get back to work and I remain confident that business confidence will return quickly. We will get through this.\nAcross the UK, the Government's Roadmap has so far proven to be successful in easing our path to recovery and the vaccination roll-out has continued at its remarkable pace. This is the fastest and most comprehensive inoculation programme anywhere in history and the impressive figures speak for themselves. If anyone reading this does perceive that they have somehow slipped through the net or if those who have previously declined the vaccination are now having second thoughts, please contact your surgery immediately. We each owe it to each other to keep our community safe and frankly, talk of blood clotting as a potential side effect with the Astra Zeneca vaccine has achieved little except to undermine public confidence. Statistically, the proven benefits of being vaccinated against Covid-19 far outweigh any perceived negative consequences and I would urge everyone to embrace it.\nIn Bracknell, I have been taking advantage of the recent easing of restrictions to conduct more visits and meet constituents. The tempo has been fierce in campaigning for the forthcoming local elections and I know that activists from all parties have been pounding the streets in line with the new rules. I have personally been out on several occasions to Finchampstead and Great Hollands and it has been great to see so many people at this lovely time of the year. I have been taken by how positive the general mood is and while there is still so much to be done to get back to normal and to recover lives and livelihoods, I am grateful to everyone in the constituency for their fortitude, patience and humour during what has been a tough year. I do not underestimate the sacrifices that have been made.\nAnd in Westminster, I have enjoyed the opportunity to chair the Armed Forces Bill Select Committee. Our careful line by line scrutiny has now been completed and the final report will be presented to the House imminently. As stated before, working collaboratively with Labour, the SNP and other parties has proven to be worthwhile and I have learned much about Parliamentary procedure. As Jo Cox MP famously said, far more unites us than divides us and I believe that politics works at its best when all sides come together for the common good. Beyond this, the Government continues to press ahead with its manifesto promises and tackle the multitude of national challenges facing all of us.\nLastly, I would like to pay a quick tribute to Prince Phillip, Duke of Edinburgh. I watched his funeral on the TV with a mix of pride, respect and emotion and he will be much missed. As the longest serving consort in history and distinguished war veteran, his loyalty, dedication and service to the Queen will be recorded favourably and I wish him a humble farewell.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_sunderland-pushes-smarter-approach-increased-defence-spending/content_71.html": "With international tensions at their most dangerous since world war two and war raging in Europe, James Sunderland backs the Government’s commitment to spend 2.5% of GDP on defence as vital both strategically and politically. He calls for a capability audit and for the additional money to be allocated to build up existing capabilities and ensure that what we have works well in battle.\n9.16pm\nJames Sunderland (Bracknell) (Con)\nIt is a great privilege to speak in this debate. I am not a Minister—to echo the remarks of my hon. Friend the Member for North Wiltshire (James Gray)—but I am a former serviceman, and I hope to bring some value, as a practitioner, to what we are discussing.\nWe know that the first duty of any Government is the defence of their people—that is quite clear—so the need to keep people safe is non-discretionary. Right now we have war raging across Europe, not too far away, and multiple threats are proliferating right across the globe. Given that the international landscape now is probably more dangerous, unstable and incendiary than it has been at any time since world war two, defence spending is absolutely essential. Voters care about their security, and many are nervous about what is happening across the world. Most importantly, it is our duty as politicians to keep them safe.\nThat is why the Government’s commitment to a defence budget equal to 2.5% of GDP by 2030 is so important, both strategically and politically. As a member of the UN Security Council, the UK’s continued role as a bastion of global rights and democracy can be underpinned only by hard power. It is a reality of history that we may yet be called upon to protect our own security and that of our allies. We know that the Defence Secretary has recently increased military aid to Ukraine, securing an extra £700 million and thereby taking Britain’s total contribution beyond £3 billion—that is a lot of money—so we are doing our bit.\nOn the 2.5% target, it is extra money, but the issue is what we do with it and how we spend it—that is important—so I advocate for a capability audit right now. The reason I say that is that the extra injection of funds means that we need to work out what we can now do. When I was working at Northwood permanent joint headquarters many years ago, we had this thing called the JOECR—the joint operational estimate of capability and readiness. In my view, with the extra money that we have now, we should be turning all those capabilities that are flashing red to green—in other words, we should plug the capability gaps—and not just on land, at sea and in the air, but in space and cyber. Yes, state-of-the-art platforms are fine, and yes, we must procure weapons that we know can beat our adversaries, but it is also about spending wisely and smartly where necessary.\nMy second point on the 2.5% is that we need to better operate what we already have so that every part of our lexicon works. We must not rely on the exquisite exclusivity that we have spoken so much about; we must ensure that all our platforms work and can be sustained across the battlespace.\nIn terms of equipment generally, as one part of capability we need to procure what we need and nothing more. It is about strategic lift as well as exquisite exclusivity. If we do not have the ships—the roll-on roll-off ferries—or the strategic lift, including C-17s and A400Ms, to get equipment and people right across the globe, there is no point having the kit in the first place. It is therefore about enabling expeditionary reach. We cannot put boots on the ground if we cannot get the boots there. Plus, Minister, it is about logistic tail, spares, the supply chain, sustainment, defence contractors, delivery and munitions. We must be careful to ensure that if we buy it, we will be able to use it and then fight it through, and it must be sustainable and enduring.\n“Platform” is an interesting word. It means the platform on which a capability sits, but what is put on that platform also matters. I therefore favour a modular approach for future equipment programmes, whereby we can apply different degrees of mobility, firepower and protection, but it is the kit that is bolted on and bolted off that really matters, and that is the battle-winning equipment for me. For me, this is about a commonality of platforms, about spares, about logistics, about interoperability and about cannibalisation. If we run out of something, can we get it? With complex platforms and complex supply chains, we cannot, so let us please go for modular and for commonality.\nRichard Foord\nIs the hon. Member aware of the Supacat range of vehicles, which operate in much the way that he has described?\nJames Sunderland\nI am very aware of Supacat. I have visited the company, which is in the hon. Member’s neck of the woods. It is a very impressive British company. Yes, we need to do more to ensure that it produces and builds what we need. Let us work with it a bit more on that. As the hon. Member suggests, this is about fewer variants, an easier supply chain, and not having equipment that is too complex to use or to maintain. That is very important: we should keep it cheap, simple and easy.\nLet me say a little about NATO. As we know, it is the only show in town. It is the umbrella for European security in the north Atlantic. It now consists of 32 countries, and that is to be welcomed. It has responded magnificently to Putin’s aggression in Ukraine. It has galvanised the alliance since the invasion, in a way that Putin could not possibly have conceived. In many ways, it is much stronger because of what has happened. Article 5 is the prize for NATO membership. It has defined Putin’s actions in Ukraine, in that so far he has not attacked a NATO country. Why? He is worried about article 5, and that strategic uncertainty underpins our security in Europe.\nHowever, there are issues with NATO. First, only 18 of its 32 member countries are currently committed to 2% of GDP, and that is not enough. In addition, the five non-EU members—the United States, the United Kingdom, Canada, Turkey and Norway—contribute 80% of the operating budget, which is outrageous, with 96% of the EU effectively reliant on NATO for its security. That is a stark contrast. Europe must therefore become much more responsible for its own security, and that is non-discretionary.\nJim Shannon\nDoes the hon. Gentleman share the concerns that some of us have about Trump’s comments? He has said that if he is the next president of the United States—he may not be—and if NATO members do not up their commitment to 3%, the United States will withdraw and reduce its own commitment. Is Trump a danger?\nJames Sunderland\nIt is not for me to endorse Trump in this Chamber, but what I will say is that to a certain extent he is right. It is absolutely right that Europe must take on more responsibility for its own security, to allow the United States to worry about parts of the world that NATO will not necessarily worry about. It is important to ensure that the United States is not overly committed in Europe for the same reason. We know that NATO in Europe massively overmatches Russia, but we need to reach a point, strategically, at which Europe itself overmatches Russia, leaving the United States to focus on the parts of the world on which it needs to focus.\nAnother important point that I would like the Minister to note is that the UK has a global footprint that extends beyond NATO. We have discussed NATO a great deal this evening, but it is not just about NATO. East of Suez, where we have not had a presence for quite some time, we now have bases in Bahrain, Diego Garcia—we have always had one there—and of course Oman. If the UK is to be a bastion of global democracy, it is important for us to have that reach across the far side of the globe. We also have operating bases in Cyprus, Gibraltar, the Falklands, Ascension and Diego Garcia. I mention that because it is really important for us to look after those bases. Were we to withdraw from Diego Garcia, for example, that will be a part of the world that we can no longer cover with our strategic reach. We therefore need to be very careful what we wish for politically.\nIt is imperative that the UK is able to fulfil its global commitments: in the middle east with carrier strike, as well as in the Falklands, west Africa, the Red sea, the Caribbean, the Baltic and the north Atlantic—the list goes on. We are not just focused on NATO, so it is really important that our defence capabilities extend beyond the north Atlantic and fulfil our global responsibilities. We need only look at where UK forces are deployed right now to realise how important that global footprint is. Dean Acheson, the former US Secretary of State, famously said that\n“Britain has lost an empire and has not yet found a role.”\nWell, we clearly do have that role. We have seen that this evening in this debate, and it is very important that we are resourced and funded to be able to fulfil that role in perpetuity.\nLastly, what numbers should the armed forces consist of? There is a lot of debate about the Army being cut and whether 72,000 is enough, the size of the Navy and the state of the RAF, but the answer is that the forces must be big enough to do the job with which they are tasked. The answer therefore lies in defence tasks. The idea of having an Army or Navy of a certain size is pie in the sky. We know that we have to be able to resource them, but the important thing is that our forces have to be able to meet defence tasks. We know that we do not have enough ships—we need more frigates and more destroyers. Quantity has a quality all of its own. We have state-of-the-art equipment in the RAF, including the C-17, A400M, P-3, F-35B, Typhoon, and Tempest to come, but do we have enough of those platforms?\nAs for the Army, I keep being told by constituents, “Well, Mr Sunderland, the Army cannot fight Russia.” Of course the British Army is unlikely to be fighting Russia on its own—it is called NATO. We know that NATO has approximately 3 million troops to call upon, and we also know that NATO overmatches Russia in Europe. We need to play our part in NATO, not necessarily being perplexed about what we used to be able to do. The UK needs to be able to retain autonomous and unilateral forces to support NATO and its other tasks, as we have mentioned, so we cannot afford to be harder on numbers.\nIn conclusion, 2.5% is the right thing to do, but that number must keep rising to meet the threat. Do we need more ships? Yes, we do. A bigger Army? Perhaps. Is NATO fundamental to our future? It absolutely is. Trident? Unequivocally yes—we need to invest in it and reinforce it. It gives us a seat on the UN Security Council, which is really important. Do we need to focus on autonomous and remote platforms? Absolutely, yes. With cyber and space, we now have five domains, not three; we need to invest much more in those, as we saw today. We need to invest in precision capabilities. We need to have better training, better activity, more training, more exciting activity, and opportunities that keep people and attract them to stay. Richard Branson famously said, “We need to train people so well that they can leave, but treat them so well that they do not want to.” With the Minister in his place, I urge him to think about wokery—not too much of it in the armed forces, please; we still have a job to do. Dumbing down of standards? Absolutely not; we have to set the bar and maintain it, because discipline depends upon it. The divisive new accommodation model? No, thank you.\n9.28pm",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_about/content_3.html": "I am honoured to have been elected as the Member of Parliament for the Bracknell Constituency. I am proudly local, having been born and brought up close to Bracknell and spent much of my working life in the Bracknell, Sandhurst and Aldershot area. To be a good community MP, it is vital to be part of the community and to live nearby. My clear priority will be to serve the people of Bracknell Constituency.\nBracknell has a golden opportunity to embrace its future as an international hub for the post-Brexit economy. With so many global, national and local employers here, we are blessed with near full employment and must continue to attract overseas investment. Wages compare well with those in neighbouring areas, our health and social care is generally good, and Bracknell is a place of opportunity.\nMy priority as your MP is to the people I serve, in the same way that I loyally served my country for 26 years in the Army. I will continue to focus on ensuring the best possible local NHS and social care, proper funding for our schools, increased Police numbers, more affordable houses in the right areas, the best possible leisure facilities and open spaces, and a safe and healthy environment for our families.\nI will represent local views on housebuilding, infrastructure and climate change, making sure that we protect jobs, council services and the excellent quality of life that we have here. I will be a robust champion for local people, our community and our excellent charity sector. I am also proud of my Conservative principles , family values and my record of public service as an Army officer. Strong on Defence, Law and Order, Education, Jobs, the Economy and Global Britain, I will continue to fiercely represent the people of Bracknell in Westminster.\nAbout me....\nI was born in nearby Chertsey and brought up locally. After leaving school in Guildford, I was educated at the University of Birmingham (BA Hons), Royal Military Academy at Sandhurst, Kings College London (MA), Defence Academy and the Royal College of Defence Studies. I have spent much of my adult life working and living in the Aldershot, Camberley and Bracknell area and remain very familiar with its surroundings and local people. I was commissioned into the British Army from the Royal Military Academy at Sandhurst in 1993 and served for 26 years as a Regular officer, only leaving at short notice in November 2019 to stand as a Parliamentary candidate.\nMy Regular service consists of continuous Regimental Duty and staff appointments from 2Lt to Col and I have lived throughout the UK, Germany and worldwide. My operational service includes tours in Iraq, Bosnia, Africa and the Falklands and I have been fortunate to travel extensively in support of both the Ministry of Defence and Foreign Office. My career has been hugely varied and rewarding: I have lived in snow holes on the NATO Northern flank in Norway, run complex Army change programmes, delivered humanitarian operations, led UK civil contingency planning, overseen Theatre drawdown operations in Iraq and planned the multi-national contribution to Afghanistan.\nI was privileged to command 27 Regiment Royal Logistic Corps in Aldershot from 2014 – 16, where I was entrusted with over 800 soldiers under command. More recently I served as Commander of the Army Engagement Group, responsible for high-level engagement with Ministers, MPs, Lord Lieutenants, High Sheriffs, Councillors and local people on behalf of the Army Board. With my career having begun in the constituency at the Royal Military Academy, it is fitting that my final 2 years should have ended here and that I am now the local MP.\nIn addition to my military career, I have been a Governor at a primary school in Surrey (Graded Outstanding), Speedwatch and Road Safety Campaigner in Hampshire, Trustee of the Royal Logistic Corps Benevolence Committee, Chairman of the British Army Motorsports Association and a regular fund-raiser for several charities, including the Royal British Legion, Samaritans, Help for Heroes, SSAFA and Step by Step (Aldershot). I am also an occasional contributor to publications and my interests include football, cricket and history.\nJames\nChair, Armed Forces Bill Committee, 2021\n| Nov 2022 – | Parliamentary Private Secretary (PPS) to the Home Secretary |\n| Oct 2022 – Nov 2022 | Parliamentary Private Secretary (PPS) to the Secretary of State for Health and Deputy Prime Minister |\n| Jan 2022 – Jul 2022 | Parliamentary Private Secretary (PPS) DEFRA |\n| Sept 2021 – Jan 2022 | Parliamentary Private Secretary (PPS) Ministry of Defence |",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-raises-concerns-about-iran-and-peace-middle-east/content_93.html": "James Sunderland raises concerns that whilst talks on reviving the joint comprehensive plan of action nuclear deal (JCPOA) continue, Iran is getting closer to a nuclear weapon thereby threatening peace in the Middle East.\nJames Sunderland (Bracknell) (Con)\nAs talks continue in Vienna on reviving the joint comprehensive plan of action nuclear deal, there are fears that Iran gets ever closer to a nuclear weapon. Will my right hon. Friend please convince the House of what is happening to maintain peace in the middle east?\nElizabeth Truss (The Secretary of State for Foreign, Commonwealth and Development Affairs)\nThis negotiation is urgent, and progress has not been fast enough. We continue to work in close partnership with our allies, but the negotiations are reaching a dangerous impasse. Iran must now choose whether it wants to conclude a deal or be responsible for the collapse of the JCPOA. If the JCPOA collapses, all options are on the table.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-visits-stepping-stones-recovery-college/content_91.html": "Local MP, James Sunderland, visited Stepping Stones Recovery College which offers course to help anyone experiencing challenges to their mental, physical and emotional wellbeing.\nThis might be due to a diagnosed or long-term condition, recovery from addiction, homelessness, trauma or abuse. It also caters for people without any diagnosis but who feel lonely, stressed or anxious and whose quality of life is not what it should be.\nJames said:\n“It was great to catch up with the team at Stepping Stones Recovery College in Bracknell. They do amazing work helping people understand their experiences and develop the skills and confidence they need to build a happier and more fulfilling life.\n“If you are looking for help in understanding you then do call them or pop in for a chat with one of the team about the courses they have on offer.”",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_campaign-responses-health-services-and-medicine/content_58.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nCampaign Responses - Health Services and Medicine\nJun 2020\nDownload File: NHS and Trade Bill Letter.pdf\nDownload File: NHS Pay Rise Letter.pdf",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-supports-happiness-hub-mental-health-awareness-week/content_102.html": "James Sunderland joined the Happiness Hub at South Hill Park for Mental Health Awareness Week and met local community services and partners.\nHe said:\n“It’s ‘ok to not feel ok’ but more investment is needed to ensure we can all get the right help. Please also look out for friends, family, colleagues and neighbours, especially if they are sad or lonely. Thank you to everyone for all that you do.”\nThe services that make up the Happiness Hub are:\n• Bracknell Forest Community Network\n• Sport in Mind\n• Stepping Stones Recovery College\n• Bracknell Forest Social Prescribers/NHS Frimley CCG Social Prescribers\n• Friends in Need\nWalks are taking place each day in various locations across the borough.\nTo find out more where and when you can join visit Happiness Hub",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_campaign-responses-agriculture/content_60.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nCampaign Responses - Agriculture, animals, food and rural affairs\nOctober 2020\nDownload File: Agriculture Bill (Food Standards).pdf\nJune 2020\nDownload File: Agriculture Bill (Food Standards Commission).pdf\nDownload File: Animal Welfare Letter.pdf\nDownload File: Horse Racing - Ban Whip Letter.pdf\nMay 2020\nDownload File: Agriculture_Bill_Letter.pdf",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news/content_2.html": "James Sunderland spoke in Parliament yesterday to welcome news that the Government's economic plan is working with inflation down to 2.3% despite the global macro-shocks of the pandemic and Russian invasion of Ukraine. This is good for the people in Bracknell Forest who want low inflation, higher employment, higher wages and higher growth.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_sunderland-seeks-assurances-uk-armed-forces-protection-middle-east-region/content_85.html": "Sunderland seeks assurances on UK armed forces protection in middle east region\nFollowing the statement on the role of the UK armed forces in the middle east, James Sunderland seeks assurances that protection and security of our armed forces is factored into all operational level planning.\nJames Sunderland (Bracknell) (Con)\nThe Minister is rightly reluctant to discuss the roles, dispositions and locations of British forces in the middle east, but could he again confirm to the House that the requisite force protection will be factored into all operational level planning, and also that it is not beyond the realms of possibility that the UN could be coerced into taking a more active role in Gaza?\nThe Minister for Armed Forces (Leo Docherty)\nMy hon. Friend also asks a relevant question, and I can give him that assurance in relation to the deployment of RFA Cardigan Bay.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_sunderland-calls-defence-operational-capability-audit/content_105.html": "James Sunderland calls for a defence operational capability audit to ensure the military is procuring sufficient basic logistics needed to support the unique advanced high-tech specialist weapons it is procuring.\nJames Sunderland (Bracknell) (Con)\nThe pursuit of exquisite exclusivity in defence procurement is to be lauded, but can the Minister confirm that his Department is also focused on procuring the logistic platforms that we need to sustain it? Is it perhaps time for a defence operational capability audit to look into that key capability gap?\nThe Minister for Defence Procurement (James Cartlidge)\nMy hon. Friend makes an excellent point—of course, he speaks with great experience. As we have been stressing, the whole point of acquisition reform is, instead of seeking exquisite platforms, to go for 80% to get them into service faster and then to have spiral development. We think that that is the future of procurement.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_mental-health-awareness-week/content_96.html": "James Sunderland supports the Mental Health Foundation in Mental Health Awareness Week.\nThe Happiness Hub\nLocally, James is backing the Happiness Hub.\nHe said:\n“This week is Mental Health Awareness Week. We all know that when you are feel low or stressed getting out for a walk and talking to others can be a huge help so I am pleased to support the Happiness Hub which is run by Bracknell Forest Council and local mental health and advice services.”\nThe Happiness Hub walks are being held this week in different locations across the borough. You will be able to grab a drink and a bite to eat, enjoy a walk through the beautiful local environment and chat to fellow walkers.\nFriday’s session will include Thai Chi, as well as a walk, with a chance to meet local community services that might be of interest, such as the volunteer service.\nThe services that make up the Happiness Hub are:\n• Bracknell Forest Community Network\n• Sport in Mind\n• Stepping Stones Recovery College\n• Bracknell Forest Social Prescribers/NHS Frimley CCG Social Prescribers\n• Friends in Need\nWalks are taking place each day in various locations across the borough.\nTo find out more where and when you can join visit Happiness Hub",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-raises-concerns-military-accommodation-maintenance-delays/content_95.html": "James Sunderland raises concerns at substandard military accommodation at Sandhurst, highlights failings in the Pinnacle Service Families contract over Christmas last year and calls on the Government to use the summer period to plan ahead with the contractors to make sure the problems to not reoccur.\nJames Sunderland (Bracknell) (Con)\nThe Minister will know that I have constituents in substandard military accommodation at Sandhurst. When they asked for help under the Pinnacle Service Families contract over Christmas, it did not turn up. Will he use the relative lull of the summer months to plan ahead with the contractors to make sure we do not have another problem at Christmas?\nThe Secretary of State for Defence (Mr Ben Wallace)\nI have already met the contractors and the Defence Infrastructure Organisation, and the good news is that maintenance issues that were around at Christmas have been cut by 75%. That is continuing in the right direction, but my hon. Friend is right: the key is to plan ahead for next winter. That is what we are getting on with at the moment. I am determined to hold these contractors to account.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-attends-homelessness-event-parliament/content_57.html": "30 April 2024\nJames Sunderland attends homelessness event in Parliament\nJames Sunderland attended Crisis’ Parliamentary event ‘Make History: Build a Future Free From Homelessness’ to discuss how we need to come together to end homelessness.\nJames Sunderland attended Crisis’ Parliamentary event ‘Make History: Build a Future Free From Homelessness’ to discuss how we need to come together to end homelessness.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_aviation-industry/content_14.html": "Today, MPs faced one of the most divisive votes of this Parliament, namely the measures relating to the Omicron variant. Having been repeatedly asked how I intended to vote, I have spent much of the week reading the correspondence that I have received, counselling widely and taking advice. Given that all arguments are deeply polarised and that opinions vary wildly, this has not been easy.\nJames Sunderland calls on the Secretary of State for Health and Social Care to work with the Department for Transport to embrace a bit more risk to open up the international travel sector fully.\nFollowing the Prime Minister’s statement to the House of Commons on the Government’s covid winter plan, James Sunderland calls on the PM to look at having vaccination stamps in passports, or an equivalent scheme, to enable international travel to resume which is vital for the recovery of our aviation, hospitality, leisure and business sectors.\nFollowing the Home Secretary’s statement on the introduction of the 14-day quarantine period for passengers arriving in the UK, James Sunderland calls on the Government to be pragmatic and lift this policy at the first opportunity.\nJames Sunderland welcomes the Government’s statement on support for the aviation industry in general and the offer of bespoke arrangements for individual airlines in particular. He asks how the Government can mitigate the behaviour of British Airways which, despite utilising the Government’s furlough scheme to protect jobs, has still served notice to all its employees.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_seven-new-special-free-schools-england/content_35.html": "James Sunderland welcomes the Government’s plans announced today to create over a thousand new special school places, backed by £70 million, making sure all children can get the best possible start in life.\nEvery child and young person should continue to get consistently high-quality support, no matter what their educational needs are or where in the country they live.\nThat is why today the Government announced plans to create over a thousand new school places for children with special educational needs, with £70 million to help open seven new special free schools as part of a programme to test and refine our SEND reforms so that they are informed by the experiences of real families.\nOnce complete, these reforms will more than double the number of special free school places available across the country – from around 8,500 to 19,000 – so that every child receives a quality education tailored to their needs.\n23 August 2023\nSeven new special free schools in England",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-raises-concerns-compression-population-gaza/content_43.html": "James Sunderland urges the Government to do everything possible to convince the Israelis of the need to preserve the sanctity of human life in Gaza.\nJames Sunderland (Bracknell) (Con)\nFor me, the defining feature of this appalling tragedy in Gaza is that the civilian population is trapped between the oppression of an appalling terrorist organisation and an appalling military onslaught. Given the increasing compression of that population within Rafah, in a much smaller geographical area, the need for precision, restraint and proportionality from the Israelis is ever more acute. Will the Minister please assure the House that he is doing everything possible to convince the Israelis of the need to preserve the sanctity of human life?\nThe Deputy Foreign Secretary (Mr Andrew Mitchell)\nMy hon. Friend will know that the Government have repeatedly underlined the importance of Israel abiding by international humanitarian law. The Foreign Secretary and the Prime Minister have underlined that point in their frequent contacts.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-attends-berkshire-care-association-awards/content_39.html": "25 April 2024\nJames Sunderland attends Berkshire Care Association Awards\nJames Sunderland attended the inaugural Berkshire Care Association Awards.\nHe said:\n“I was delighted to be invited to attend the inaugural awards.\n“Those who work in the care sector provide vital support to those who need it most. They work day in day out to support their residents and make their lives special.\n“A special congratulations to Jenean and Kim who collected a leadership award for Bracknell Care Home.”",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_my-six-point-plan-bracknell/content_7.html": "I will continue to push for improved work and leisure facilities, better housing, protection of our public buildings and history, better retail opportunities and an improved transport network for road and rail.\nI will continue to work with Bracknell Forest Council, Frimley Health Integrated Care Board, local NHS facilities and the voluntary and community sectors to enhance our excellent public services.\nI will ensure that new investment, funding, commerce and employment are attracted to Bracknell Forest. . By working alongside the Chamber of Commerce, The Bracknell Improvement District (The BID) and the Council, we can strengthen the economic strategy and growth of the Borough.\nThe Bracknell Constituency is blessed with many schools and colleges that are Ofsted-rated Good or Outstanding, but we can still improve the offer. We have more to do to support Special Educational Needs and I will continue to push for early delivery of our new SEN units. I will also work with business and colleges to promote T Levels and apprenticeships.\nWith the overall net edition of 60+ police officers in the Bracknell and Wokingham police area (784 in Thames Valley) since 2010, we will maintain law and order, better investigate crime, reduce nuisance driving/speeding, crack down on anti-social behaviour and make our communities even safer.\nWe must safeguard our green open spaces, protect the environment, achieve Net-Zero targets and maintain the climate emergency plan in Bracknell Forest. This will be achieved by reducing carbon emissions, developing sustainable energy policies, building new net-zero homes, expanding electric vehicle charging facilities and recycling measures.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-attends-official-opening-heathlands-care-home/content_81.html": "Local MP, James Sunderland, attended the official opening of the new Heathlands Care Home, by HRH the Duke of Gloucester.\nThe new Heathlands Care Home is a partnership between Bracknell Forest Council and Frimley CCG. Windsar Care, a care provider specialising in supporting people living with dementia, has been appointed to manage the care home.\nJames said:\n“It was a beautiful day in Bracknell, yesterday and a privilege to welcome the Duke of Gloucester to the opening of this fantastic new care home.\n“It was great to meet the superb staff, residents and people involved with the development.\n“I would also like to especially thank Cllr Dale Birch, Stuart McKellar at Bracknell Forest Council and Fiona Slevin-Brown from Frimley NHS Clinical Commission Group for their leadership.\n“Plus, of course, a big shout out to Stepnell Ltd who completed the redevelopment of the site.”",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-urges-mod-reach-out-more-veterans/content_107.html": "Speaking in a debate on support for veterans, James Sunderland highlights help available from agencies, charities and organisations such as RBL and SSAFA and calls on the MOD to reach out more to those who have left with a single point of contact so people do not feel so isolated from the organisation they served.\nJames Sunderland (Bracknell) (Con)\nI commend my right hon. Friend for her excellent speech. I am a serviceman. I left the Army in 2019 with no resettlement and no termination but through choice, to become a candidate for the Conservative party. I do not regret it, but having gone through that process and been left on a cliff edge with that immediate loss from the Department, I would say to my right hon. Friend that I empathise greatly with all the concerns raised by veterans. I am also chair of the all-party parliamentary group on veterans, and my experience of veterans, having left the Army myself, is that the issue in most cases is not that veterans once served, it is that they are no longer serving. There is a distinction.\nWe have highlighted a number of issues today, and I wish to make two points very quickly. First, as the hon. Member for Strangford (Jim Shannon) said, there are a lot of agencies, charities and organisations that can help, such as RBL and SSAFA. I would urge everyone to make contact with them. I would also want to see the MOD, with the Minister in his place, doing a catch-up, reaching out a bit more to those who have left and having that single point of contact or repository, whereby people do not feel quite so isolated from the organisation they served. Yes, there is a plethora of support out there, but a bit more from the MOD for those who have left the forces would be welcome.\nJames Sunderland\nThe Minister will recall that we met earlier this year in the all-party parliamentary group on veterans and discussed the much-needed reform of Veterans UK. As part of his closing address, or perhaps in the near future, is he able to provide an update to the House on where we are with the review of Veterans UK and any subsequent work that needs to be done?\nThe Minister for Defence People, Veterans and Service Families (Dr Andrew Murrison)\nI am grateful to my hon. Friend. He and I have discussed this before. I am afraid that I will not be able to show very much ankle on this occasion, but in my remarks I will certainly touch on where we are with the two commissioned reviews, which will improve matters as part of the process I described. In the meantime, we have invested £40 million to digitally transform veterans’ services and phase out paper, which is so much impeding the quality of the service we want to offer our veterans. We are introducing online verification, which will make it much quicker and easier to establish veteran status, and that is also why we have introduced the reviews to which my hon. Friend refers.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_update-south-western-railway/content_75.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\n24 March 2020\nUpdate from South Western Railway\nDownload File: Update_from_South_Western_Railways.pdf",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk/content_1.html": "James Sunderland has served as the Member of Parliament for Bracknell since 2019.\nJames was born in Chertsey and grew up in the local area. After leaving school, he was educated at the University of Birmingham, Royal Military Academy Sandhurst, King's College London and Royal College of Defence Studies. He was commissioned into the British Army in 1993 and served on operations worldwide. He held a variety of command and staff appointments, both in the UK and overseas, before retiring with the rank of Colonel to stand for Parliament.\nHe has served as Parliamentary Private Secretary to multiple departments and chaired the Armed Forces Bill Committee. His interests in Parliament include the Armed Forces, Veterans, Special Educational Needs, Malaria, Motorsport and the Overseas Territories\nJames is a passionate advocate for his constituents. He has worked hard to secure investment in Bracknell and is campaigning on issues including education, a new hospital and better railway services.\nJames is a low tax, low-state Conservative and strong on law and order, defence, jobs, education and Global Britain.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-questions-aviation-minister-british-airways/content_38.html": "James Sunderland welcomes the Government’s statement on support for the aviation industry in general and the offer of bespoke arrangements for individual airlines in particular. He asks how the Government can mitigate the behaviour of British Airways which, despite utilising the Government’s furlough scheme to protect jobs, has still served notice to all its employees.\nJames Sunderland (Bracknell) (Con)\nI am grateful to the Minister for confirming that the Government would be willing to enter into bespoke agreements and arrangements with airlines. Given that British Airways in particular is ultimately a private company and thinks that it can behave as disgracefully as it wishes, how do the Government intend to mitigate that?\nKelly Tolhurst\nAs I have said, as aviation Minister, I would expect any organisation to treat their employees fairly and in the spirit of partnership. Absolutely, it is a question for the organisations as to whether they feel that they are carrying out their social responsibility and acting in a good way, but there are opportunities for us as we move forward. We have the restart and recovery project in which we are working with the sector to find ways that we can speed up the recovery in the aviation sector. I am sure that, across the Treasury and the Government, we are looking at ways in which we can mitigate all of the things that colleagues have, quite rightly, raised here this morning.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-seeks-confirmation-further-covid-19-restrictions-are-only-imposed-last/content_31.html": "James Sunderland supports the Government’s actions to stem the spread of the Covid-19 omicron variant but seeks confirmation that these further restrictions are only imposed as an absolute last resort.\nJames Sunderland (Bracknell) (Con)\nLike many other Members, I welcome today’s statement, and I agree that further measures and restrictions would only be a necessary evil. Will the Secretary of State acknowledge the many millions of people and businesses throughout the UK who are clawing back jobs, livelihoods and freedoms after a difficult two years, and does he agree that these further restrictions should only be an absolute last resort?\nSajid Javid (The Secretary of State for Health and Social Care)\nI do agree with my hon. Friend. We all know from our experience of the pandemic thus far that while many of the restrictions may well be necessary to fight covid, they have other impacts, especially on the economy, on people’s life chances and on children’s education and social lives. I am very much aware of the impact that they have had on non-covid outcomes, so I very much agree with my hon. Friend.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_supporting-great-britains-brightest-sporting-prospects/content_4.html": "21 May 2024\nSupporting Great Britain’s brightest sporting prospects\nJames Sunderland attended a SportsAid parliamentary reception to meet with Conall from Wokingham who competes in Goalball.\nThe reception celebrated SportsAid and Entain’s partnership to support Great Britain’s brightest sporting prospects. James met with Conall and learned about Goalball which is similar to handball but it is specialised for the visually impaired. Recently, Conall was part of the team that won the Goalball UK Finals. He is one of SportsAid and Entain’s sponsored athletes for 2024.\nEntain has worked with SportsAid since 2019 and to date has provided over 200 athletes with awards to help athletes with training and competition costs.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_sunderland-welcomes-economic-progress-inflation-falls-23-benefiting-residents-bracknell/content_27.html": "James Sunderland welcomes news that the Government's economic plan is working with inflation down to 2.3% despite the global macro-shocks of the pandemic and Russian invasion of Ukraine. This is good for the people in Bracknell Forest who want low inflation, higher employment, higher wages and higher growth.\nJames Sunderland (Bracknell) (Con)\nGiven the global macro-shocks faced during this Parliament, particularly the pandemic and the Russian invasion of Ukraine, it is quite remarkable that we have got inflation back down to 2.3%. It is testament to good fiscal policy, and we are leading the way within the G7. Does the Minister agree that, for those constituents living in Bracknell Forest who want low inflation, higher employment, higher wages and higher growth, sticking to the plan is absolutely the right thing to do?\nThe Economic Secretary to the Treasury (Bim Afolami)\nMy hon. Friend is a brilliant champion for Bracknell Forest, a part of the country that I know well, and I completely agree with his remarks.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-hosts-launch-roadmap-end-veteran-homelessness/content_111.html": "23 January 2024\nJames Sunderland hosts the launch of roadmap to end veteran homelessness\nJames Sunderland hosted the launch of the University of York’s research report entitled ‘No Homeless Veterans: A roadmap to end homelessness amongst veterans’.\nYou can read the report here.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-welcomes-tax-cutting-budget/content_41.html": "Today, the Chancellor, Jeremy Hunt, presented his Spring Budget to the House, which is aimed primarily at continuing the journey to a high-wage, high-skilled, low-tax UK economy but at the same time supporting working families and the most vulnerable.\nWith inflation down from 11.1% to 4.0% per cent in less than 12 months and wages growing, I am pleased that the Conservative Government remains focused on cutting the taxes that help to grow the economy. Yes, taxes are currently higher than envisaged due to the heavy borrowing that was needed to help people during the pandemic, but the path to lower taxes remains clear and will happen. Inflation is on target to be below 2% in the coming months!\nBracknell Forest has always been a borough where ambition, aspiration and enterprise are celebrated. Opportunity is created through our fantastic local schools, colleges and employers and our highly skilled local workforce benefits from near full employment. The Spring Budget rewards that proud work ethos and cuts taxes for hardworking business owners. It also continues to drive down inflation to help with the cost of living, incentivises further growth through the fiscal headroom we have and supports the public services that we all rely on.\nAs a result of #SpringBudget24, the Government will:\nCut National Insurance contributions (NICs) from 10% to 8%. This is in addition to the tax cut announced in the Autumn Statement 2023, meaning the Government will deliver a reduction worth £900 for those on an average wage of £35,400. A family with two earners on the average income of £35,400 each will be better off by £1,827 a year.\nCut Class 4 NICs for the Self Employed to 6%. Taken alongside the Autumn Statement 2023, this is a tax cut of £650 for the typical self-employed worker on £28,000.\nIncrease the registration threshold for VAT from £85,000 to £90,000 for small businesses, allowing them to focus on their priorities of expanding their businesses and creating jobs. This will mean that the UK’s VAT registration threshold will be higher than across the EU.\nProvide an extra £500m for the Household Support Fund to support the most vulnerable. I was able to lobby in support of Bracknell Forest Council to an expected figure of c.£1m.\nRaise the threshold at which parents start paying the High-Income Child Benefit Charge from £50,000 to £60,000. This will support families in Bracknell Forest who will be better off by an average of £1,260.\nFreeze fuel duty for the 14th consecutive year, saving people money when they fill up at the pump and ensuring that businesses can keep their costs as low as possible.\nExtend the alcohol duty freeze, thereby alleviating pressure on the hospitality sector with duty two pence lower on a pint of beer and ten pence lower on the average bottle of wine.\nInvest an additional £3.4 billion into the NHS in order to reform outdated IT systems and procure modern AI-enabled MRI scanners that will cut scan times by over a third. Based on our Long-Term Workforce Plan, this investment in technology and innovation, together with reform of NHS productivity and incentives, will overhaul the way the NHS works, reducing administrative burdens, freeing up doctors and nurses to focus on treating patients, and unlocking £35 billion of cumulative productivity savings by 2030.\nInvest £800m in new technology to save up to 55,000 hours a year of administrative time in the justice system, creating new children’s social care places to reduce costs for local authorities and saving £100 million for the public purse by reducing fraud, thanks to expanding the use of Artificial Intelligence (AI) to catch fraudsters.\nGiven that #SpringBudget24 is unlikely to be the only fiscal event of the year, I am confident that further tax cuts and policy incentives will follow as the economy continues its recovery.\nhttps://www.gov.uk/gove.../topical-events/spring-budget-2024",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_campaign-responses-european-union/content_53.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nCampaign Responses - European Union\nSeptember 2020\nDownload File: United Kingdom Internal Market Bill.pdf\nJune 2020\nDownload File: UK+EU Transition Period Letter.pdf",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_newsletters/content_10.html": "Please tick this box to confirm you opt-in to receive my email newsletters.\nYou can unsubscribe at any time by clicking the link in the footer of my emails. For information about our privacy practices, please visit my website.\nWe use Mailchimp as our marketing platform. By clicking below to subscribe, you acknowledge that your information will be transferred to Mailchimp for processing. Learn more about Mailchimp's privacy practices here.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_cookies/content_20.html": "We want to make this website as easy to use and helpful as possible. This sometimes involves placing small amounts of information on your computer. These are called 'cookies'.\nThese cookies cannot be used to identify you personally and are only used to improve the service offered to users of this website.\nYou can manage or disable these small files yourself in your web browser, but some features of the website may not function as a result. To learn more about cookies visit AllAboutCookies.org.\nThe cookies we use\nThe open source platform and content management system on which this website is built uses the following cookies:\n|\nDrupal |\nSESS |\nLogs the current session, Expires 21 days from the session date. |\n|\n|\n|\nhas_js |\nLogs whether or not you have javascript enabled. Expires at end of session. |\n|\n|\n|\nDrupal.tableDrag.showWeight |\nThis cookie determines whether a numeric weight is shown when a table is dragged. Expires 1 year from the session date. |\n|\n|\nGoogle Analytics |\n_gat _ga _gid |\nThese cookies are used to collect information about how visitors use this website. We use the information to compile reports and to help us improve the website. The cookies collect information in an anonymous form, including the number of visitors to the website, where visitors have come to the site from and the pages they visited |\n|\n|\nCookie control |\nCookiecontrol |\nThis cookie is set when you accept cookies from this site. Expires 2 months from the session date. |\nThird Party cookies\nSome third-party services used on this website also use cookies. These are not controlled by us, but are controlled by the service provider:\nGoogleMaps",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_privacy/content_24.html": "This data protection and privacy policy relates to the personal data processed by the Office of James Sunderland, in relation to casework and policy queries.\nThis document outlines how the Office of James Sunderland processes and manages personal data. It:\n- identifies our data controller;\n- provides our lawful basis for processing personal data;\n- outlines the scope of personal data we hold and process;\n- outlines the scope of the special category personal data we hold and process;\n- describes and justifies our data retention policy;\n- shows how we intend to respond to Subject Access Requests;\n- shows how we share your data;\n- outlines your rights to your personal data;\n- states how to contact us about your data; and\n- states how to make a complaint.\nThe policies outlined within this document come into full effect on 1 January 2020.\nWho is the Data Controller?\nThe Data Controller is James Sunderland\n2. Lawful basis for processing\ni. Casework is processed primarily under the lawful basis of public task, with exceptional cases processed under the lawful basis of consent.\nii. Personal data contained in our mailing list is processed under the lawful basis of consent. it does not fall within the definition of direct marketing.\niii. We undertake to always act within the reasonable expectations of our constituents and any other individuals about whom we hold personal data.\n3. Data we hold\nPersonal data is stored electronically and securely on our computer systems and paper records are stored in a locked filing cabinet system. Our systems are in offices which are locked when unattended and alarmed and monitored by CCTV.\nCasework\nThe Office uses a CMS (Content Management System) application, Caseworker.mp, specifically designed to help with the management of constituent casework records. This information predominantly includes but is not limited to:\n- Names, addresses and email addresses.\n- Telephone numbers.\n- National Insurance Numbers, Passport Numbers.\n- Special category data, outlined in point 4.\nPolicy\nPolicy casework is stored on the same CMS application. This information predominantly includes but is not limited to:\n- Names, addresses and email addresses.\n- Telephone numbers.\n- Special category data on political beliefs.\nMailing lists\nThe Office also maintains a mailing list. These subscribers receive a regular newsletter. Personal data we hold in this regard includes:\n- email addresses, names and postcode.\nThis information is not political in nature and therefore it is not categorised as direct marketing.\n4. Special category data\nThe office may also hold special category data for a smaller number of data subjects. This data will be processed under the lawful basis indicated in point two, as is permitted in clauses 23 and 24 of schedule 1 of the Data Protection Act.\n5. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use.\n6. Subject Access Requests\nWe will comply with Subject Access Requests in line with the guidance given by the Information Commissioners Office (ICO).\ni. We will respond as quickly as possible, within 30 calendar days.\nii. We will request verification of the identity of any individual making a request and ask for further clarification and details if needed.\niii. Data subjects have the right to the following:\na. To be told whether any personal data is being processed.\nb. To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\nc. To be given a copy of the information comprising the data and given details of the source of the data where this is available.\n7. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, we may pass your personal data on to a third-party in the course of dealing with you, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended. When they no longer need your data to fulfil this service, they will dispose of the details in line with our procedures.\nWe will not share the personal information of members of our mailing list or those in receipt of our newsletter.\nIn any case, we will not use your personal data in a way that goes beyond your reasonable expectations in contacting us.\n8. What rights do I have to my personal data?\nAt any point while we are in possession of or processing your personal data, you, the data subject, have the following rights:\n- Right of access – you have the right to request a copy of the information that we hold about you.\n- Right of rectification – you have a right to correct data that we hold about you that is inaccurate or incomplete.\n- Right to be forgotten – in certain circumstances you can ask for the data we hold about you to be erased from our records.\n- Right to restriction of processing – where certain conditions apply to have a right to restrict the processing.\n- Right of portability – you have the right to have the data we hold about you transferred to another organisation.\n- Right to object – you have the right to object to certain types of processing, such as direct marketing.\n- Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n- Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n9. How can I contact somebody about my privacy?\nYou can get in touch with our office by letter, email or telephone using the details at the foot of this page.\nPlease note that we will ask for identification should you choose to exercise any of the above rights in relation to personal data we hold.\n10. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact James Sunderland via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_gwr-customer-and-community-improvement-fund/content_36.html": "5 March 2024\nGWR Customer and Community Improvement Fund\nThe GWR Customer and Community Improvement Fund is open for bids (closes 25th March) to supports small and medium rail-related projects from customers, charities, community groups and voluntary organisations across their network.\nThey are particularly interested in schemes that:\nbenefit customers\nincrease rail travel\nencourage carbon reduction\nconnect communities, people, and places\nsupport economic growth\npromote inclusion and diversity educational programmes that support careers in rail or increase awareness and experience of public transport and rail safety.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_campaign-responses-crime-civil-law-justice-and-rights/content_84.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nCampaign Responses - Crime, Civil Law, Justice and Rights\nDownload File: Black Lives Matter Letter.pdf",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_surgeries/content_16.html": "Constituency Advice Surgeries\nSurgeries are open to constituents of Bracknell, Crowthorne, Finchampstead, Sandhurst and Wokingham Without by advance appointment.\nTo book an appointment, please call 01344 481900 or email james.sunderland.mp@parliament.uk. Please include your name, full postal address, date of birth and phone number on any correspondence. If you require urgent help or advice which cannot wait until an advice surgery, please contact James’s office for help.\nWhen requesting an appointment, please give as many details as possible about the issue/s which you wish to discuss with James, as this will enable him to help you more effectively.\nIf the issue is very urgent constituents should call the office to arrange a telephone / video appointment.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_global-fight-against-malaria-must-continue/content_74.html": "James Sunderland writes for ConservativeHome.\nThis week, the USA is hosting the Seventh Replenishment of the Global Fund to Fight AIDS, Tuberculosis and Malaria. This important global conference is where countries will pledge their funding commitments for the next three years to help defeat these horrible illnesses.\nThe extent of the UK’s contribution will be one of the first key foreign policy undertakings for the new Prime Minister, a decision which has the potential to shape the UK’s reputation on the world stage and accelerate progress against the world’s deadliest infectious diseases.\nTwenty years ago, the UK Government co-founded the Global Fund – an organisation which has helped save 50 million lives to date. A key target for this vital work is malaria, a life-threatening, yet fully preventable and curable, disease, which has devastated mankind for centuries. Half of the world’s population lives under its terrible shadow. Children under five are particularly vulnerable. On average, one child dies from malaria every minute.\nOver the last two decades, huge progress had been made in malaria control, supported by UK investment and leadership, in the areas of prevention, treatment and research. This has been a source of real pride for the brilliant brains at the heart of this work. But in 2018 that progress began to stall. Faced by the Covid-19 pandemic and new threats such as drug and insecticide resistance, climate dangers and our changing natural environment, malaria deaths have risen to the highest rate in nearly a decade. In 2020, 627,000 lives were lost.\nHaving seen first-hand the devastating impact of malaria and watched helplessly as others succumbed to it, I am clear that the UK must not renege on its global responsibility. In June, I was privileged to attend the successful Kigali Summit on Malaria and Neglected Tropical Diseases, where the UK endorsed the Commonwealth’s goal to end the malaria epidemic by 2030.\nWhile in Rwanda, I also visited an antenatal health clinic where mothers spoke passionately about the effects of insecticide-treated nets in keeping their babies alive and allowing families to sleep at night. In 2021 alone, the Global Fund distributed a staggering 133 million insecticide-treated nets to protect vulnerable people from malaria, just one of the many examples of incredible, lifesaving, preventative interventions that are making a real impact.\nThe Global Fund also works with international partners to provide timely testing and treatment for the two million community health workers who remain critical to fighting malaria In Rwanda, I met Thérése Twagiramariya, a volunteer community health worker, who has worked for years to help those in her locality to detect and treat malaria. She is passionate about her work. Her purpose is to keep people alive. For them, it is about life and death.\nThe Global Fund is effective, cost-efficient, and ensures that all interventions get to the right people, at and in the appropriate time and way. In countries where the Global Fund invests, malaria deaths have dropped by 26 per cent since it was founded in 2002. Without these interventions, fatalities would have increased by a staggering 84 per cent over the same period. In fact, the Global Fund provides more than half of all international finance for malaria programmes and the need for continuity is clear throughout all affected regions. It is no exaggeration to state that if we take our foot off the pedal now, we risk a widespread resurgence of a disease that we have worked so hard to defeat. Millions more will die.\nAs one of the few countries of the G7 yet to declare its hand, the UK must not now step back. As a proud Conservative and member of the new Government, I remain in awe of our long-standing commitment to tackling malaria and how we have led the way with exciting new vaccines and technology. But these significant strides in funding, research, innovation, vector control and pioneering drug development are in danger of being undermined.\nDespite the huge fiscal challenge facing the UK, our commitments on supporting women and girls, health systems and the fight against malaria and NTDs should be maintained if we are to play our rightful role at the head of the global fight. I have no doubt that our new Prime Minister and Foreign Secretary will honour them. But the extent of that contribution remains unclear. Importantly, if we invest now, there really is an end in sight. Other countries are stepping up: the United States and Germany leading the way in their early commitments to the Replenishment. We must do so too.\nLastly, the economic benefits of continuing to invest into the Fund are staggering. In 2015, it was estimated that malaria cost the African economy around US $117 billion in lost productivity. Research has also shown that every $1 invested in the Global Fund results in approximately $31 in health and economic returns and that each 10 percent reduction in malaria incidence is associated with an average rise of 0.3 percent in GDP per capita and faster GDP growth. Indeed, the downstream benefit to UK trade alone could be trillions of pounds.\nAs we approach the Seventh Replenishment on Wednesday, I urge the new Prime Minister to be ambitious, kind and bold. This would be a timely and impressive marker in the sand.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_mp-sends-support-teamgb-winter-olympic-team/content_64.html": "19 January 2022\nMP sends support for TeamGB Winter Olympic Team\nJames Sunderland MP has wished the TeamGB Winter Olympic Team “Good Luck” as they head off to Beijing.\nJames said:\n“The UK’s top athletes are heading off to Beijing in the coming few days. They have had to overcome huge challenges in the last two years. I wish them good luck as they head off and I, along with the whole nation, look forward to some extraordinary sporting moments that will undoubtedly inspire us all. Good Luck!”",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-intervenes-debate-dementia-research-uk/content_92.html": "James Sunderland intervenes in a debate on dementia research to pay tribute to the hidden army of about 6.5 million carers across the UK who save the Treasury billions and calls for an increase in the carer’s allowance.\nJames Sunderland (Bracknell) (Con)\nI was not going to speak today because of a clash with a Bill Committee, but I have been asked by several constituents to come in to listen to the debate. The hon. Lady is putting forward a persuasive case. I want briefly to pay tribute to the hidden army of carers across the UK: the current estimate is that there are about 6.5 million of them. They are perhaps saving the Treasury over £100 billion in lost wages. Does she agree that we should do more to increase carer’s allowance and to formally recognise those very selfless and diligent people?\nDebbie Abrahams\nI thank the hon. Member for his intervention. I am very grateful to him for coming here. I agree totally with the points he has made to acknowledge the army of family carers who support people living with dementia and the fact that they are supported by a pittance. We need to do much, much more in that regard.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-questions-pm-military-support-ukraine/content_83.html": "James Sunderland asks the Prime Minister about the feasibility of direct military action by NATO to support Ukraine.\nJames Sunderland (Bracknell) (Con)\nThe Prime Minister will know that Ukraine is not a full member of NATO, but may I ask him to comment on the feasibility of direct military action by NATO, notwithstanding that article 5 does not apply?\nThe Prime Minister (Boris Johnson)\nI thank my hon. Friend very much, and I go back to the answer I gave to my right hon. Friend the Member for Bournemouth East (Mr Ellwood). I know that, emotionally, many people will want to commit NATO troops to the defence of Ukraine. We have UK troops there now, and members of the Ranger Regiment are going to supplement those we already have.\nI have to say that no member of NATO is currently willing to deploy in Ukraine in large numbers to fight Russian aggression in the way that my hon. Friend suggests. Indeed, we have to beware of doing things that would constitute a pretext for Putin to invade. We have to calculate and calibrate what we do very carefully, and I think that the right approach is to build a strong package of economic sanctions, continue to supply defensive weaponry and do all the other things that we are doing.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-backs-visitengland-accessibility-campaign/content_90.html": "James Sunderland backs VisitEngland accessibility campaign to make the UK the most accessible tourism destination in Europe by 2025.\nResearch in 2018 showed 430,000 British adults with an impairment did not take a domestic trip in the last 12 months due to the lack of accessibility provision.\nVisitEngland provides direction and support to businesses and destinations on harnessing the valuable and growing accessible tourism market with a dedicated section of guidance and resources on their Business Advice Hub at www.visitengland.org/access\nHe said:\n“A lack of accessibility provision could be costing British business £116m in tourism revenue. To make the UK the most accessible country in Europe by 2025 I encourage local tourism businesses to visit the VisitEngland Business Advice Hub: www.visitbritain.org/business-advice/make-your-business-accessible”",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_wade-day-centre-visit/content_9.html": "19 April 2024\nWade Day Centre visit\nJames Sunderland attended a reception at the Wade Day Centre. The day centre provides a safe, caring and stimulating environment for senior residents in Wokingham, including Finchampstead and Wokingham Without.\nJames met with Sandy Sweet, Vice Chair of the Centre for the invitation and Andrew Tye, the Lord-Lieutenant of the Royal County of Berkshire, and Lucy Zeal, Deputy Lord-Lieutenant and the High Steward of Wokingham.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_sunderland-questions-government-ensuring-british-businesses-are-not-impacted-sanctions/content_65.html": "James Sunderland questions the Government on promoting British industry and efforts to make sure that the sanctions against Russia do not negatively impact British businesses.\nBritish Industries\nJames Sunderland (Bracknell) (Con)\n6. What steps his Department is taking to promote British industries around the world. (906416)\nThe Minister without Portfolio (Nigel Adams)\nThe GREAT campaign, for which the Cabinet Office has responsibility, showcases to the world all four corners of our nation and our thriving industries. Working with other Departments and arm’s length bodies, the GREAT campaign partners with the private sector to promote our industries internationally and encourage trade and investment with the UK. As of last year, GREAT had an average return-on-investment ratio, since its launch in 2011, of more than 15:1 to the UK economy.\nJames Sunderland\nBracknell lies at the heart of the silicon valley of the Thames valley, and we are very proud of our overseas businesses and British firms. Can the Minister confirm what we are doing to make sure that the sanctions against Russia do not negatively impact British businesses?\nNigel Adams\nMy hon. Friend is a fantastic champion for businesses in Bracknell, and he makes a very good point. I reassure him and businesses all over the UK that the overall impact on the UK economy of sanctions will be limited. Some firms will be more exposed than others to Russian trade and financial market measures, but we have put in place mitigations to manage the impact on UK businesses and workers. We are also putting in place the appropriate licences to allow certain businesses to keep running and pay staff.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_bracknell-town-centre-master-plan-public-consultation/content_51.html": "25 April 2024\nBracknell Town Centre Master Plan Public Consultation\nJames Sunderland visited Princess Square this morning to meet with Cllr Paul Bidwell and review the draft Bracknell Town Centre Master Plan that is open to public consultation.\nPlease do pop down to Princess Square in The Lexicon Bracknell today or on Saturday to see for yourself and also add your comments here: https://consult.bracknell-forest.gov.uk/.../37920/page/001",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_sunderland-speaks-armed-forces-bill-debate/content_99.html": "James Sunderland, who chaired the Armed Forces Bill Select Committee, speaks in the Committee Stage debate and whilst welcoming the draft statutory guidance to support the Armed Forces Covenant, calls on the Government to look again at the complaints process in respect of local councils.\nJames Sunderland (Bracknell) (Con)\nAfter that speech, who on earth would be a Defence Minister? It is a great privilege to speak during Armed Forces Week. We have a clear responsibility in this place to support Her Majesty’s forces, so the timing is neat. As Chair of the Select Committee on the Armed Forces Bill, I am familiar with the Bill. It is a good Bill, but may I commend to hon. Members the Select Committee report and the subsequent statement made in this House on 22 April? Both were fully objective and the result of painstaking analysis and debate within the Select Committee. Yes, we did not agree on every issue. In fact, we did not agree on many issues.\nMr Kevan Jones\nIt was remiss of me in my contribution not to thank the hon. Member for chairing the Select Committee. He got thrown in at the deep end at the last minute, but I think all members of the Select Committee thought he did an excellent job and ensured that everyone had their say. May I put on record my thanks, and I am sure that of other Members, to him for the way in which he chaired the Select Committee?\nJames Sunderland\nI thank the right hon. Gentleman —my friend—for those kind words. It was a real pleasure to chair that superb Committee. The report was pretty good. I believe it to be a framework for what lies ahead and perhaps even a template for what we do with this standing legislation in five years’ time. We are progressing all the time, and the future looks good.\nI want to discuss two areas: the statutory guidance and the latest amendments to the Bill. First, I thank the Minister for his written response to the Select Committee report and for the draft statutory guidance, which we have now got. We must acknowledge that the covenant is already with us. It has been signed by the vast majority of councils all over the UK, including in Northern Ireland. In fact, it has its 10th birthday at this point in time, so what better present could there be than to bring it into statute?\nThe door is already open for the statutory guidance, and it is a good bit of work so far. I welcome the fact that it places a due regard on the placeholder, that it recognises rightful outcomes, that it reflects the unique sacrifices and obligations on HM forces and that it places a legal obligation on the delivery of health, accommodation and local support from councils. It also provides examples of good practice and pragmatic guidelines on how that is to be provided.\nI note that prescriptive performance targets are still absent, but it may be that it is impossible to apply any meaningful metrics and tools to this area. I do not believe that councils are in any doubt about what is expected of them after 10 years, but—it is a big but—it may be that guidance is still needed on how they will be held to account if they do not meet their obligations. I read with interest the line in the guidance that:\n“Covenant duty does not mandate public specific delivery outcomes or advantageous treatment of the Armed Forces Community. It only mandates that consideration takes place…when exercising certain functions”.\nThat worries me, as the local authority complaints process does not cut it in terms of what I believe is still needed. Simply inviting disaffected personnel to contact their MP fills me with horror. I urge the Minister to please look again at this, dig deeper and do the right thing.\nI turn to the amendments. I am comfortable with what the Government have tabled, and I want to talk to a handful of the others. New clause 1 would amend the Immigration Act 2014 to waive the fee for indefinite leave to remain applications for any current or previously serving members of the UK armed forces. Similarly, new clause 7 provides that foreign and Commonwealth veterans applying for indefinite leave to remain following four years of service will pay only the unit cost of an application.\nI am clear in my mind that the Government have this key issue in hand, and I welcome the consultation recently announced by the MOD and the Home Office. I personally wish to see an amnesty for those F and C personnel who slip through the net, and I agree that it is right to abate the cost of visa fees as a function of time to incentivise longer service. As a former commanding officer of the largest and most diverse unit in the British Army, I say that is the right way to go, even though it may set a precedent for other Departments.\nNew clause 2 would require the Secretary of State to establish a duty of care standards in relation to legal, pastoral and mental health support provided to service personnel. The MOD takes very seriously its duty of care for service personnel and veterans, and over the years it has established a comprehensive range of legal, pastoral, welfare and mental health support for service personnel and veterans. We have come a long way from the early days of operations in Iraq and Afghanistan, with which I am very familiar. The covenant has also been enshrined in law, so I think that the new clause may be redundant at this point.\nNew clause 3 would require the Government to publish a report on changes to personnel numbers across all services and to detail the impact of reductions on operational capabilities. However, none of that is a closely guarded secret. The MOD recently published its Command Paper “Defence in a competitive age” and noted that the size of the Army would be reduced. I believe that that new clause is also redundant; the information is out there.\nNew clause 4 would require the Government to conduct a comprehensive review of the number of people who are dismissed or forced to resign from the armed forces due to their sexuality and make recommendations on appropriate forms of compensation. Restorative justice is difficult due to the policies that were legally enforceable at the time, but I am comfortable, for now, that the Government are making strides to tackle this, not least by restoring medals and engaging much more broadly with the LGBTQ+ community. That is absolutely the right thing to do.\nAs for new clause 6, the duty of care for alcohol, drugs and gambling disorders is already there. It is called good leadership—and also the covenant, which is being enshrined in law.\nLastly, new clause 8 is laudable, but we are not there yet. The new clause would create a representative body for the armed forces, akin to the Police Federation, which would represent its members in matters such as welfare, pay and efficiency. The Government have not been persuaded at this point that there is a requirement or a groundswell of support for a federation along the lines that have been suggested.\nThe interests of armed forces personnel are already represented through a range of mechanisms, not least, again, the chain of command. Furthermore, the Service Complaints Ombudsman provides impartial scrutiny of service complaints made by members of the UK armed forces regarding any aspect of their service life. However, for the Minister’s benefit, I would, in this case, welcome an independent body to provide additional rigour for service complaints. In my experience, service complaints are very awkward, and it may just be that taking them out of units and out of the chain of command is the right thing to do.\nTo conclude, one of the main criticisms of the Bill is that it does not go far enough, but as an ex-serviceman I refute that. Any new legislation has to be deliverable, proportionate, pragmatic and responsible, and has to attract the necessary due diligence and analysis, for it needs to consider the effect on those it relates to, and no Government can write cheques they cannot cash, as they have to maintain the fundamental ethos and integrity of the organisation itself. Our armed forces are pre-eminent in their field and must be afforded the autonomy they need to do their job. So this is about evolution, not revolution, and I believe that we will get there in due course through what the Select Committee has recommended.\nI say to those who wish to turn this unique organisation into what they would wish it to be by clipping its wings, softening its operational capability and ignoring its hard edge or negating the importance of the chain of command: please be careful what you wish for.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-urges-government-lift-quarantine-restrictions-air-passengers-soon/content_30.html": "Following the Home Secretary’s statement on the introduction of the 14-day quarantine period for passengers arriving in the UK, James Sunderland calls on the Government to be pragmatic and lift this policy at the first opportunity.\nJames Sunderland (Bracknell) (Con)\nMany of my constituents depend on the aviation sector for their livelihoods. Bracknell also has the offices of more than 150 global companies. Can the Home Secretary assure me that support for my constituency and beyond will be given through a pragmatic application of the policy and that the policy will not just be reviewed but lifted at the first opportunity?\nPriti Patel\nI thank my hon. Friend for his question. He is right, and he makes a powerful case on behalf of his constituents and their livelihoods for the sector they are employed in. It is right that the Government continue to work to give that support. I am committed to doing that, as are all Secretaries of State across Government.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_liz-truss-will-put-true-conservative-principles-heart/content_89.html": "James Sunderland writes for The Times.\nAmong all the bold policy promises of the leadership campaign, it is curious that “Conservatism” itself has barely attracted more than fleeting interest. While blind adherence to dogma is never a good look for any incoming prime minister, it is clear now, perhaps more than ever, that a return to traditional Conservative policies will be needed to control public spending, inflation and debt, and also to stimulate economic growth. This is the fiscal imperative of our age and No 10 must be ready.\nOne of the unintended consequences of Covid-19 is that the state has become too big, unwieldy, expensive and omnipotent. With the tax burden now just too high, people have become reliant upon central government in a way that could hardly have been envisaged by the free-market Conservative policy makers of yesteryear. Rowing back on this dependency is now essential if the UK is to fulfil its full potential as a truly democratic and sovereign nation, and a return to a low-state, low tax economy of opportunity, entrepreneurial spirit and individual responsibility is vital.\nAs the leadership contest draws towards its protracted conclusion, undecided party members will wish to be assured that the next prime minister will take a bold step forward by re-igniting those fundamental Conservative principles and values that hold us together. The UK must once again become a bedrock of economic growth and innovation. And that is why I am supporting Liz Truss.\nEveryone will have their own definition of Conservatism and what it means. The Oxford English Dictionary cites “the holding of political views that favour free enterprise, private ownership, and socially traditional ideas” and the Cambridge Dictionary highlights policies “that traditionally support business and oppose high taxes and government involvement”. In recent decades, notably the Thatcher years, Conservatism has become the primary model for economic growth, and this has been achieved through privatisation of state industries, free markets, low taxes, a limited role for government, personal responsibility, economic freedoms and self-determination. So, whilst we may still need to remind ourselves how to re-ignite the economy in 2022, I am confident that we will.\nFor me, Conservatism is about many things. First and foremost, the primary role of any government is to defend the realm and keep its people safe. Given that the world is probably more dangerous, competitive and unstable than at any time since the Second World War, I am reassured that Liz Truss has promised to increase defence spending to 3 per cent GDP by 2030 — it is the right thing to do.\nThe high cost of living also needs to be tackled but the answer does not lie solely in government handouts. Cutting taxation for people and businesses will provide a timely boost for investment, using our new freedoms outside the EU to cut red tape, achieve new free trade deals and unshackle business from over-regulation. Indeed, scrapping the national insurance tax rise, cutting corporation tax back to 19 per cent and introducing a moratorium on green energy levies, will leave more money in pockets and provide a buffer to meet the high cost of living. Importantly, there is no evidence that this will be inflationary, but it will incentivise economic growth and investment to prevent stagnation.\nThe Conservative Party is the party of law and order. By reinforcing the drive to recruit 20,000 new police officers, creating new crime league tables, investing more to fight organised crime and passing new legislation to protect our borders, people in the UK will be safer. A renewed focus in dealing with illegal immigration and the activities of people-trafficking gangs across the Channel through the Bill of Rights will also result in the UK fixing those elements that make us beholden to the European Court of Human Rights. Liz Truss has stated that she is prepared to take any action necessary to fix the problem, and such decisive leadership is needed to break the cycle of dangerous Channel crossings and fix our broken asylum system. This clear commitment to the security and sanctity of our sovereign shores is hugely welcome.\nTrue Conservatism centres upon the need for equality of opportunity and education. A new six-point plan to get our education system back on track after the interruptions of Covid-19 will bring down the cost of childcare, expand high performance schools, apprenticeships, improve standards and reform university admissions. And unlocking the opportunity of home ownership for millions of people will be achieved by reforming mortgage rules, planning regulations and local red tape.\nIt will be necessary too to abolish the prescriptive housing targets that have concreted over our open spaces and vexed local councils and local people for decades. The best people to decide local housing needs are those elected locally to do so, and councils must be afforded the autonomy to make planning decisions that are right for their communities. Stalin-like planning targets from central government are the antithesis of Conservatism. Building responsibly and sustainably in the right locations will become as important as not building in wrong locations. Liz Truss has already announced the abolition of top-down targets and rightly so.\nWhen the new prime minister is unveiled on September 5, it will be critical for the Conservative Party to resolutely unite behind whichever candidate is chosen. While I would be honoured to serve under either Liz Truss or Rishi Sunak, it is clear to me that a return to Conservative principles and values must lie at the heart of future policies, and I would urge the new government to embrace this from the outset. Preserving the Union and completing the final throes of Brexit remain pivotal. And by fixing current challenges, we can ensure that a Conservative government stays at No 10.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_campaign-responses-environment/content_46.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nCampaign Responses - Environment\nDownload File: Sewage_Letter.pdf",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_campaign-responses-transport/content_88.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nCampaign Responses - Transport\nMay 2020\nDownload File: British Airways Letter.pdf",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-pays-tribute-mps-leaving-parliament/content_6.html": "James Sunderland speaks at Business of the House questions to pay tribute to all MPs who are leaving Parliament and highlight the privilege of serving in Westminster which works best when people work together by consensus to make the country a better place.\nJames Sunderland (Bracknell) (Con)\nI wish you all the very best in your future life, Madam Deputy Speaker.\nI thank the Leader of the House for her weekly feast of “Penny TV” every Thursday, which keeps many colleagues and constituents inspired and enthused. Will she join me in paying tribute to all those who are leaving this place at the end of this Parliament by agreeing that the privilege of serving in Westminster is, in reality, about good people working together by consensus and as a team to make the country a better place, and doing their very best under huge pressure?\nThe Leader of the House of Commons (Penny Mordaunt)\nI thank my hon. Friend for his kind words. All the issues raised in these sessions are very important, but so is morale, and I hope that we have all contributed to it in these sessions. He is right that these sessions quite often show the best of this House, not just this week but in previous weeks. I hope that that encourages people to consider whether they might be able to serve in this place.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-urges-government-look-vaccination-stamps-passports-get-people-flying/content_48.html": "Following the Prime Minister’s statement to the House of Commons on the Government’s covid winter plan, James Sunderland calls on the PM to look at having vaccination stamps in passports, or an equivalent scheme, to enable international travel to resume which is vital for the recovery of our aviation, hospitality, leisure and business sectors.\nJames Sunderland (Bracknell) (Con)\nInternational travel is vital for our recovery, not least in the aviation, hospitality, leisure and business sectors. Has the Prime Minister given any thought to the utility of having vaccination stamps in passports, or an equivalent scheme, to get our planes off the ground?\nThe Prime Minister\nI can assure my hon. Friend that the Secretary of State for Transport is looking at all such schemes. I am sure he will have heard what my hon. Friend has said loud and clear. He will be making some announcements very shortly.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_campaign-responses-education/content_77.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nCampaign Responses - Education\nAug 2020\nDownload File: A Level + GCSE Results Letter.pdf\nJun 2020\nDownload File: Schools Reopening Letter.pdf",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_proposed-railway-station-ticket-office-closures-have-your-say/content_78.html": "James Sunderland MP is encouraging constituents to take part in the railway ticket office consultation being run by the Passenger Watchdog Transport Focus.\nThe proposals are basically to close ticket offices across the network, not necessarily immediately, but progressively to bring staff out of ticket offices and on to stations, because just 12% of all tickets are sold at station ticket offices.\nJames said:\n“I encourage anyone concerned about these changes to email the consultation. I know that disabled groups are particularly concerned about the impact, as are older people who are not able to use online systems. It appears that these proposals are being based on when tickets are sold rather than the needs of passengers, especially those who need assistance.\n“I have arranged a meeting with SWR and GWR to let them know my concerns and the impact these changes will have on local people.”\nConsultation closes 1 September.\nEmail the consultation with your concerns:\nSouth Western Railway - ticketoffice.SWR@transportfocus.org.uk\nGreat Western Railway - ticketoffice.GWR@transportfocus.org.uk",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-joins-south-western-railway-all-party-parliamentary-group/content_61.html": "MPs in Westminster have taken a decisive step forward in holding rail businesses to account by establishing the first All Party Parliamentary Group (APPG) for the South Western Railway. Fifteen MPs, including James Sunderland MP, have vowed to take a direct and decisive role in improving the train service for constituents across South London and the South West of England region.\nThe group will examine the entire railway business, including franchisees, and the role that the Department for Transport, the network operator (Network Rail), other industry businesses and transport authorities play to deliver the train service on the railway that operates in and out of London Waterloo. Scrutiny will extend to the geographical area from London Waterloo to Portsmouth, Weymouth, Exeter, Bristol and Reading, as well as the network and connecting lines within these points.\nAt the meeting in Westminster on 21st January, chaired by West Dorset’s MP Chris Loder, the group agreed five objectives for the network:\n- Capacity: Timetable, frequency, capacity, journey time, train and bus connections and service availability. Objective: adequate rail capacity that meets demand\n- Future: Investment, strategy, industry structure, Route Study, franchise sustainability, franchise mapping and infrastructure enhancements. Objective: future investment and organisation delivers the service that constituents require and expect\n- Passenger Service: Comfort, provision of information, accessibility, station services provision, WiFi provision, recompense, refreshments, quality of train refurbishment. Objective: passenger experience meets expectations\n- Performance: Operating Performance, service delivery, train service contingencies and resources. Objective: reliable and punctual train services delivered for passengers\n- Value: Taxpayer value for money, delivery of franchise obligations, Network Rail use of its Government funding.Objective: achieving value for money for passenger and taxpayer\nIn a call to action on behalf of constituents, James Sunderland MP said: “I am honoured to join the new All Party Parliamentary Group for South Western Railway as Vice Chair. MPs from all parties are taking decisive action to champion constituents who travel to and from London Waterloo and other lines across Berkshire’’",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_sunderland-backs-case-building-western-rail-link-heathrow/content_70.html": "James Sunderland backs the case for building the Western Rail Link to Heathrow and urges the Government to underwrite the project which has huge benefits for the local area and for people travelling to Heathrow from the west of England and Wales.\nJames Sunderland (Bracknell) (Con)\nAs the vice-chair of the all-party parliamentary group, I commend the hon. Member, my neighbour and friend, for all the work that he does to make this happen. The rail link is about jobs, economic growth, boosting travel opportunities across the UK and boosting Heathrow airport. Does he agree that, in the year 2024, it is almost perverse that passengers coming from the west of England and Wales cannot travel directly to our major international airport hub? Does he also agree that the rail link will bring huge benefits to London itself?\nMr Tanmanjeet Singh Dhesi (Slough) (Lab)\nThe hon. Gentleman undersells himself. He was the vice-chair of our all-party parliamentary group, but he has recently been elevated to co-chair, taking on the role of the hon. Member for Newbury (Laura Farris), who was herself elevated to the Government Front Bench. He highlights that the link would benefit people not just in the south-east, the west, Wales and the south-west, but in London, because it would decongest roads, as well as London Paddington, as I will explain shortly.\nJames Sunderland\nDoes the hon. Member agree that there is strong cross-party consensus across the House, which includes colleagues I have spoken to from Wales, western England and the midlands? It is great when the House comes together. They are all as one in wanting this project to happen. Does he share my hope that, in a minute, the Minister will outline at the Dispatch Box the preconditions for the Government taking the bold step of underwriting the project?\nMr Dhesi\nThat was very eloquently put, and that is what we hope for from the Minister, who is, I know, a good chap and a great champion of rail, but unfortunately for several years we have faced an impasse. I have been a Member of this esteemed House for the last seven years, and there have been lots of promises. Indeed, my first ever Prime Minister’s question to my constituency neighbour the right hon. Member for Maidenhead (Mrs May) was on this very issue. There have been many promises, but we are yet to see a timeline, and I do hope we will hear one from the Minister. Indeed, that is what the business community is expecting.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderlands-letter-constituents-about-british-airways/content_76.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\n2 July 2020\nJames Sunderland’s letter to constituents about British Airways\nIn a letter to constituents, James Sunderland MP outlines his position on British Airways.\nDownload File: British Airways (Gavin Newland Bill) Letter.pdf",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-questions-government-uk-response-humanitarian-crisis-afghanistan/content_79.html": "James Sunderland questions Government on UK response to the humanitarian crisis in Afghanistan\nFollowing the Government response to an Urgent Question on the UK response to the humanitarian crisis in Afghanistan, James Sunderland asks about a UK physical presence in Kabul.\nJames Sunderland (Bracknell) (Con)\nThe Minister will know that true political influence comes from having a physical presence. Could she please confirm what the FCDO physically has on the ground in Kabul, and whether that footprint will increase?\nVicky Ford (The Parliamentary Under-Secretary of State for Foreign, Commonwealth and Development Affairs)\nI am afraid I am not at liberty to discuss individual situations, especially those of local charities, for example, because I have been told that to do so could put them at risk.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-calls-full-protection-war-memorials/content_109.html": "James Sunderland welcomes the inclusion of elements of the Desecration of War Memorials Bill into the Police, Crime, Sentencing and Courts Act 2022, and presses the Justice Secretary to complete the job and implement the remaining provisions.\nJames Sunderland (Bracknell) (Con)\nThe Justice Secretary will know of the hard work undertaken in this Parliament to bring the Desecration of War Memorials Bill into law. Elements of that Bill were subsumed into the Police, Crime, Sentencing and Courts Act 2022, but will he now undertake to complete the job?\nThe Lord Chancellor and Secretary of State for Justice (Alex Chalk)\nMy hon. Friend is one of two hon. Members who have fought hard on this issue, and he does so from the position of having served his country. It is completely iniquitous that people should seek to act in a way that desecrates war memorials. His specific point seems utterly compelling and I am happy to discuss it with him hereafter.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament/content_23.html": "James Sunderland speaks at Business of the House questions to pay tribute to all MPs who are leaving Parliament and highlight the privilege of serving in Westminster which works best when people work together by consensus to make the country a better place.\nJames Sunderland welcomes news that the Government's economic plan is working with inflation down to 2.3% despite the global macro-shocks of the pandemic and Russian invasion of Ukraine. This is good for the people in Bracknell Forest who want low inflation, higher employment, higher wages and higher growth.\nJames Sunderland raises concerns about the scope and timing of the International Criminal Court's arrest warrants for the Israeli Prime Minister, Hamas leader, and others. He worries that this timing might suggest a moral equivalence between Hamas and Israel, which could harm efforts to end the fighting in Gaza.\nWith international tensions at their most dangerous since world war two and war raging in Europe, James Sunderland backs the Government’s commitment to spend 2.5% of GDP on defence as vital both strategically and politically. He calls for a capability audit and for the additional money to be allocated to build up existing capabilities and ensure that what we have works well in battle.\nFollowing the Defence Secretary’s statement on the cyber attack where a malign actor hacked into the armed forces payment network, James Sunderland seeks assurances a diplomatic protest has been made, that firewall protocols given to defence contractors match those used by the MOD itself and that no malign actor can gain access to bank accounts.\nJames Sunderland backs the case for building the Western Rail Link to Heathrow and urges the Government to underwrite the project which has huge benefits for the local area and for people travelling to Heathrow from the west of England and Wales.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-urges-government-embrace-bit-more-risk-open-international-travel/content_19.html": "James Sunderland calls on the Secretary of State for Health and Social Care to work with the Department for Transport to embrace a bit more risk to open up the international travel sector fully.\nJames Sunderland (Bracknell) (Con)\nWhat evidence he plans to use to inform the Government’s decision on whether to proceed with step 4 of the covid-19 road map on 19 July 2021. (902653)\nThe Secretary of State for Health and Social Care (Sajid Javid)\nThe Government have committed to taking a cautious approach to easing restrictions, guided by the data and not by dates. As I set out in my statement to Parliament yesterday, the decision to lift the remaining measures on 19 July and proceed to step 4 is based on an assessment of the four tests that were set out in the road map.\nJames Sunderland\nI also welcome yesterday’s step 4 announcement. Does the Secretary of State agree that his Department should embrace a bit more risk by working with the Department for Transport to open up the international travel sector fully? Will he also ensure that GPs return to fully physical appointments and that we open up the full range of dental services?\nSajid Javid\nI am pleased to tell my hon. Friend that, now that we have begun the process of opening up, more work is being done between my Department and the Department for Transport on international travel. The announcements made by my right hon. Friend the Transport Secretary last week will certainly help and be welcomed by the sector and travellers. On GP access, now that we have started to open up, working together with GPs we can see better direct access, and especially face-to-face access.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-speaks-debate-uk-taiwan-friendship-and-co-operation/content_106.html": "James Sunderland highlights the success story that is Taiwan and calls for Taiwan to be celebrated and not threatened.\nJames Sunderland (Bracknell) (Con)\nI agree completely with what my hon. Friend is saying. Taiwan is one of the great success stories of the far east. It has a multicultural liberal democracy, a growing economy, fantastic trade and many political freedoms and press freedoms. It is superbly championed worldwide, not least by the excellent Taipei representative in London. Does my hon. Friend agree that Taiwan should be celebrated and not threatened?\nAndrew Rosindell\nI could not agree more with my hon. Friend. Taiwan is a model of a country that has succeeded against all the odds. It is a nation that should be upheld as a great example of what can be achieved in a part of the world where there are so many failing countries. Taiwan has bucked the trend and proved that it can be successful, so I hope that in this House today we will celebrate Taiwan and all its achievements.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-highlights-need-improve-special-educational-needs-diagnosis/content_25.html": "James Sunderland welcomes the Government’s efforts to improve outcomes for children and young people with special educational needs and disabilities or in alternative provision and funding for a new SEND school in Bracknell in particular, but highlights the importance of diagnosis and the need to improve the Child And Adolescent Mental Health Service (CAMHS).\nJames Sunderland (Bracknell) (Con)\nI was thrilled last week to receive notification from the Minister that the Department will fund a new SEND school in Bracknell for pupils with autistic spectrum disorder at key stages 1 to 5. That will be massive locally, so I thank her very much.\nHaving fought for improved SEND provision since becoming an MP, I know the importance of today’s announcement. Again, I am thrilled and I thank the Minister, but may I politely point out that diagnosis is really important? We have to fix CAMHS as well.\nThe Parliamentary Under-Secretary of State for Education (Claire Coutinho)\nMy hon. Friend has long campaigned for extra specialist provision in Bracknell, so I am delighted that that is happening. He is absolutely right that diagnosis is important, which is why we are increasing the number of educational psychologists. We will work closely with the Department of Health and Social Care on CAMHS and will ensure that we are rolling out mental health support in schools.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_mp-welcomes-send-review-consultation/content_69.html": "15 April 2022\nMP welcomes SEND Review consultation\nJames Sunderland has welcomed the publication of the Government's Green Paper on the Special Educational Needs and Disabilities (SEND) and alternative provision (AP) system in England.\nHe said:\n“I am pleased with the Government's new plans to improve support for children with special educational needs and disabilities and alternative provision. The consultation seeks views on changing practice across education, health and care for a more inclusive system and I would encourage people who have an interest to take part.\n“The Government wants to hear from a wide range of people; parents and carers, children and young people and people working in the sector.\n“Closing date is 1 July 2022.”\nhttps://sendreview.campaign.gov.uk/",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_south-western-railway/content_47.html": "From Monday, February 26th, the ticket office building at the station will be closed whilst the temporary scaffolding “tunnel” over the gateline is removed and the full repair of the space is carried out.\nSouth Western Railway\nJames Sunderland is Vice-Chair of the South Western Railway All-Party Parliamentary Group (APPG). The aims of the group are:\n- Capacity: Timetable, frequency, capacity, journey time, train and bus connections and service availability.\nObjective: adequate rail capacity that meets demand\n- Future: Investment, strategy, industry structure, Route Study, franchise sustainability, franchise mapping and infrastructure enhancements.\nObjective: future investment and organisation delivers the service that constituents require and expect\n- Passenger Service: Comfort, provision of information, accessibility, station services provision, WiFi provision, recompense, refreshments, quality of train refurbishment.\nObjective: passenger experience meets expectations\n- Performance: Operating Performance, service delivery, train service contingencies and resources.\nObjective: reliable and punctual train services delivered for passengers\n- Value: Taxpayer value for money, delivery of franchise obligations, Network Rail use of its Government funding.\nObjective: achieving value for money for passenger and taxpayer\nNews",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-welcomes-bracknell-forests-send-safety-valve-agreement-department-education/content_17.html": "James has been working with Ministers and lobbying for this additional £16m in dedicated schools funding to help the council to better use their resources and manage spending on special educational needs and disabilities (SEND).\nJames said:\n“I was pleased today with the announcement that Bracknell Forest Council has confirmed its Safety Valve agreement with the Department for Education . Having worked on this with Ministers for months and lobbied continuously, it means an additional £16m of dedicated schools funding from the Government, plus ongoing advice and consultancy. The improved provision that this should bring, not just in school places but in earlier intervention and specialist support too, is to be welcomed.\n“I will also continue to champion the earlier release of funding for the new SEND school in Crowthorne, for additional SEND provision beyond that and an ever better deal for our local families.”",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_campaign-responses/content_32.html": "Campaign Responses\nI receive large numbers of standard emails in support of various campaigns. Unfortunately, I am unable to respond to each individually, so to save on time, costs and the environment I post my responses to these campaigns here. Click on the subject matter to download the relevant letter.\nIndividual emails and letters will, of course, receive an individual response.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_jobs-fair/content_28.html": "At the recent Jobs Fair at Bracknell and Wokingham College James Sunderland met with Gemma, who is promoting the DWP initiative for the over 50s to get back in to the work place.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-attends-meeting-women-defence-appg/content_108.html": "12 June 2023\nJames Sunderland attends meeting of Women in Defence APPG\nJames Sunderland attended a meeting of the Women in Defence All-Party Parliamentary Group.\nHe said:\n“I am delighted to support my friend and colleague Sarah Atherton, Chair of the APPG for Women in Defence, to discuss the challenges and opportunities for women in defence with Secretary of State for Defence, Rt Hon Ben Wallace MP.”",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_parliament-must-ensure-veterans-uk-fit-purpose/content_44.html": "Over the past three months, the All-Party Parliamentary Group (APPG) for Veterans has been running an unprecedented nationwide survey on the experiences of our ex-servicemen and women when claiming compensation, war pensions or wider financial support through Veterans UK.\nGoverned by the Ministry of Defence under the auspices of Defence Business Services, Veterans UK is the organisation entrusted to look after former military personnel. Run by dedicated people at all levels, it performs a vital role for our veteran community and provides that vital link between them, the Government, and the fiscal support on which many are dependent.\nThere is no question of course that the vast majority of our two million veterans live happily, successfully, and without difficulty. Having benefited from rewarding careers, good medical support and generous resettlement provision, most veterans integrate seamlessly back into civilian life after their service and throw themselves into new challenges.\nAnecdotally, however, the APPG has been presented over many months with evidence that not everyone has positive experiences when dealing with Veterans UK, with the claims process deemed to be too confrontational, bureaucratic, antiquated and time-consuming. Greater scrutiny is needed to ensure this most fundamental task is being discharged properly.\nThe survey itself opened on November 1 2022 and closed on January 31 2023. Entirely cross-party in nature, independent and supported by the major service charities, recipients were able to respond online, and it was commended in the media.\nIt will now enable the APPG to build up a broad picture of individual experiences and wider trends, so that a final report can be presented to Ministers in February. Ultimately, we hope that sufficient evidence will be provided for the MoD to initiate a further review of Veterans UK’s operations.\nIn terms of trends, we already know that Veterans UK has suffered under-investment for years; that some staff may still be working from home; that decisions take too long; that calls take time to answer; and that the migration from paper records to digitisation has been too protracted.\nWe have also heard that some veterans feel like they’re on a knife-edge due to the prolonged waits for what feel like life-and-death outcomes, and that there are cases where individual engagement is sub-optimal.\nWhilst we will of course have to balance our findings against the good work that is being conducted by Veterans UK to avoid prejudicing outcomes, it is anticipated that broader modernisation is needed too.\nBut how is Veterans UK governed? At a superficial level, the levers needed for making procedural changes and efficiencies already exist, for the simple reason that the organisation sits under the MoD. Forming part of Defence Business Services, the authority for these core responsibilities should, and clearly does, come from good command and control.\nHowever, internal management is only part of the solution. To show why, let’s take a fictional example: Corporal (Retired) John Smith.\nHaving experienced an issue with Veterans UK and exhausted his options for redress, he might write to his MP. His MP writes in due course to the Minister.\nBut because there is currently no independent body for representing grievances or challenges, the Minister then writes directly to Veterans UK for a response.\nVeterans UK is both judge and jury of complaints against it and effectively marks its own homework, with the resultant lack of visibility and accountability that this often entail. Whilst huge progress continues to be made in adequately compensating veterans, it remains the view of the APPG that this process may require wider reform.\nThe purpose of the Veterans Survey is not, of course, to situate the estimate, as young officers are warned not to do, but to generate the evidence needed for further scrutiny.\nWhat should be the full role of Veterans UK? Does it need further assistance with its digital conversion programme, noting that one blind veteran who recently contacted the APPG was asked by a caseworker to “just fill out a form”? Is there need for a formal structural review, or even a dedicated Delivery Board to ensure greater efficiency? How do we know if Veterans UK is governed appropriately or whether our veterans are given the best deal?\nHow do we overcome the rectitude that some veterans do sadly report when dealing with individual desks, and in the case of our Christmas Island veterans, how do these claimants receive the correct advice when their medical records are still classified?\nThis list of questions is by no means exhaustive, but it does give an idea of the scale of the challenge.\nLastly, a ready solution may already exist for providing the necessary oversight, if that is deemed to be necessary.\nWhilst service charities such as SSAFA, COBBSEO, RBL and Help for Heroes, along with the new veterans commissioners, all play their full part in supporting our veterans, the more formalised body of the Veterans Advisory and Pensions Committees (or VAPCs) could offer a statutory solution.\nLater this year, Robin Millar MP will bring forward the Veterans Advisory and Pension Committees Bill for its Second Reading. This will release members from some of their current legal constraints and enable them to be more adaptive and innovative in working in direct support of veterans.\nVAPCs are a significantly untapped resource, and reforming their relationship with the Office of Veterans Affairs (OVA) might allow them to be much more effective. They could be given the formal task of holding Veterans UK to account by providing an ombudsman-like or other assurance entity.\nEqually, they could be given formal oversight of decisions that become subject to challenge or independent adjudication. There is even some logic that the VAPCs could be formally subsumed by the Office of Veterans Affairs (OVA) to provide additional structural rigour.\nEither way, there is no question that we must continue to ensure that the UK is the best place in the world to have served in the Armed Forces. I commend the Government for its ground-breaking work to date.\nWhilst there is no guarantee that our survey will hit all the buttons, it may yet provide the necessary evidence for a further MoD review, and help deliver the first-class support services our veterans deserve.\nFirst published in ConservativeHome",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_sunderland-calls-wider-access-mod-sites-income-generating-activities-such-motorsport/content_63.html": "James Sunderland secures a meeting with the Defence Procurement Minister to discuss wider access to MOD sites, for motorsport and other income generating activities.\nJames Sunderland (Bracknell) (Con)\nBritain’s world-leading motor sports industry is worth at least £10 billion annually to the UK economy. The sport’s governing body, Motorsport UK, has proudly sponsored access to military venues for many years, but despite recently signing the armed forces covenant, that access appears to be diminishing. Will the Minister please agree to meet me, and perhaps the Defence Infrastructure Organisation, to discuss better third-party revenue-generating opportunities for the MOD estate?\nThe Minister for Defence Procurement (James Cartlidge)\nI would of course be delighted to meet my hon. Friend. On the subject of motorsport, I stress to him and the House that the MOD has a brilliant partnership with McLaren, jointly innovating to look at, for example, technology relating to electronic vehicles. I am more than happy to meet him and look into the matter further.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_globalbritain/content_52.html": "We have some of the best research and development facilities in the world, so let us design British, build British, buy British and sell British.\nAll of us need to do what we can to support the British economy. So rather than simply rush to buy cheap imports, let's invest in British, build British, buy British and then sell British so that we maximise the benefit from our future free trade deals as an independent and sovereign nation.\nThere is much to be gained in the post-Covid-19 era and we must chase every global opportunity and I welcome recent signings of trade agreements with countries such as Japan and Ukraine.\nJames Sunderland raises concerns that whilst talks on reviving the joint comprehensive plan of action nuclear deal (JCPOA) continue, Iran is getting closer to a nuclear weapon thereby threatening peace in the Middle East.\nJames Sunderland welcomes the commitment to extra defence spending and urges the Government to ensure the extra money is spent responsibly and flexibly both to secure the best equipment for our armed forces and to support Global Britain by investing in the British defence industry and growing UK defence exports.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_article-bracknell-news-0/content_98.html": "I write this on the train as I head into Westminster. Now that the dust has settled after the evacuation of British nationals and entitled personnel from Afghanistan, I wanted to provide some form of perspective as someone who has spent much of his working life dealing with that troubled country and to commend those from the FCDO and MOD for their hard work.\nContrary to the nonsense published in the media, the ease with which the Taliban marched into Kabul was not foreseen. Many billions of pounds and dollars were spent propping up the Afghan Government and equipping the Afghan Army, so this is a failure of – and in – Afghanistan as much as anything else. Successive Labour and Conservative Governments have also invested huge political capital, blood, sweat, tears and lives in trying to establish a fair, democratic and peaceful nation so the fall of Kabul has come as a massive blow.\nAnd let's not forget our Armed Forces, our veterans, those who paid the ultimate price, and their families for their many sacrifices. I do not believe that we could have realistically done much more as a nation and once it became obvious that the US did intend to honour the promises made in 2020 at the Doha Agreement, it was just not possible for NATO to remain in any realistic posture. And as much as we may not wish to, it is necessary for the US, UK and their allies to have a meaningful dialogue with the Taliban to ensure that Afghanistan does not again become a haven to terrorism and that essential human rights are honoured.\nDomestically, I am clear that the Government will continue to crack on with its aggressive policy agenda and fulfil its manifesto promises. There are many challenges but rescuing the economy after Covid-19, tackling our national debt, paying back the additional £410 billion borrowed during the pandemic, fighting inflation, getting people back into work, supporting business and tackling poverty will be at the top of the agenda. Regrettably, there is no magic wand for any of this, as we have seen with the Social Care Levy, and I do not believe as a politician in dressing it up, but we do need to be prepared for a bumpy ride, take collective responsibility, and fulfil what is necessary to plan for our future. The fact remains that we are living beyond our means and fiscal pragmatism is needed. It is also right that we are honest with the electorate about our economic challenges. This has little to do with party politics but about statecraft, leadership, and the ability to make tough decisions.\nIn Bracknell, I continue to visit as many schools, businesses, activities, and events as I can to best represent local interests in Westminster. The Bracknell Half Marathon was superb and I recently enjoyed meeting apprentices at Bracknell and Wokingham College, the excellent team at BM Provision Alt Provider in Birch Hill, multiple residents associations, Thames Valley Police, the British Legion in Crowthorne, Wildmoor Heath, RMA Sandhurst, the Bracknell BID, Bohunt School, the superb new development at Gorse Ride and so much more. I am also pressing Bracknell Forest Council to address a number of local issues, not least blue badges, SEN provision, poor accommodation, nuisance driving, road noise and anti-social behaviour. Thankfully, the team at Time Square is working hard to deliver a good service on behalf of those to whom they are responsible. Unbelievably, my team has also just topped 30,000 individual items of casework since being elected and we continue to do what we can to assist with specific issues and problems. The run in towards Christmas promises to be very demanding and I look forward to meeting as many of you as I can.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-urges-government-simplify-testing-requirements-air-passengers/content_34.html": "James Sunderland questions the Government on efforts to simplify testing requirements for air passengers and travellers and to regulate the wildly varying and often exorbitant cost.\nInternational Travel: Covid-19\nJames Sunderland (Bracknell) (Con)\n3. What steps his Department is taking to help make international travel (a) easier and (b) less expensive during the covid-19 pandemic. (904015)\nThe Secretary of State for Transport (Grant Shapps)\nThanks to the successful vaccine roll-out, the Government have been able to open up international travel and help to make it cheaper to use, with 135 countries and territories now covered by our inbound vaccination policy.\nJames Sunderland\nThe aviation and travel sectors are pivotal for my constituents in Bracknell and right across the UK, sustaining many jobs and livelihoods. Will my right hon. Friend confirm what is being done to review testing requirements for passengers and travellers and to regulate the wildly varying and often exorbitant cost of testing?\nGrant Shapps\nAs the House will know, we have reduced the number of tests required to just one single lateral flow test on day two for everybody who is vaccinated, as well as for under-18-year-olds. My hon. Friend will be interested to hear that I spoke to the Health Secretary this morning about the site that it runs to ensure that the prices shown there are accurate for the traveller, so that people can travel as normally as possible as we come to this Christmas and new-year period.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_armed-forces-bill-committee/content_56.html": "James Sunderland raises concerns at substandard military accommodation at Sandhurst, highlights failings in the Pinnacle Service Families contract over Christmas last year and calls on the Government to use the summer period to plan ahead with the contractors to make sure the problems to not reoccur.\nIn March 2021, James was appointed Chair of the Select Committee on the Armed Forces Bill which was set up by the House of Commons to examine the Armed Forces Bill 2019-21.\nFollowing the Government statement about the decision to leave the UN’s MINUSMA peacekeeping mission in Mali earlier than planned, James Sunderland expresses his disappointment and seeks confirmation that force protection will be maintained in full accordance with the threat as we withdraw.\nJames Sunderland, who chaired the Armed Forces Bill Select Committee, speaks in the Committee Stage debate and whilst welcoming the draft statutory guidance to support the Armed Forces Covenant, calls on the Government to look again at the complaints process in respect of local councils.\nJames Sunderland, Chair of the Armed Forces Bill Select Committee, makes a statement to the House of Commons following the publication of the Committee’s special report on the new Armed Forces Bill.\nI write this on the early morning train into Westminster. Even at this ungodly hour, I am surprised by how many more people appear to be commuting into London, how much busier the trains are and the efforts that everyone is consciously making to ensure social distancing throughout the carriage.\nToday, the House of Commons launches the Select Committee on the Armed Forces Bill, chaired by James Sunderland MP. The Select Committee on the Armed Forces Bill 2021 has held its first meeting to agree its programme of scrutiny on the Armed Forces Bill 2019-21.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_articles/content_59.html": "Over the past three months, the All-Party Parliamentary Group (APPG) for Veterans has been running an unprecedented nationwide survey on the experiences of our ex-servicemen and women when claiming compensation, war pensions or wider financial support through Veterans UK.\nI write this on the train as I head into Westminster. Now that the dust has settled after the evacuation of British nationals and entitled personnel from Afghanistan, I wanted to provide some form of perspective as someone who has spent much of his working life dealing with that troubled country and to commend those from the FCDO and MOD for their hard work.\nI write this on the early morning train into Westminster. Even at this ungodly hour, I am surprised by how many more people appear to be commuting into London, how much busier the trains are and the efforts that everyone is consciously making to ensure social distancing throughout the carriage.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_football-nothing-without-fans/content_40.html": "English football is admired across the world and the sport its central to our national life. Football clubs form part of the lifeblood of Bracknell Forest and Berkshire. However, as we have seen recently with proposals for the European Super League or the troubles at @Reading Football Club and other clubs, not every owner has the interest of their club’s fans at heart.\nThat is why I have campaigned for the Government to introduce the Football Governance Bill, creating a new Independent Football Regulator to give fans a genuine voice, and ensure their interests are front and centre.\nThe Regulator will give fans a greater say in the running of clubs, including over key football heritage like club names, badges and kit colours. It will have comprehensive powers to safeguard fans from rogue owners, including requiring that fans are consulted on off-field decisions, being able to block rogue owners from owning clubs and requiring owners to have approval before relocating a stadium.\nThese measures are being taken after extensive consultation with fans, clubs and the already existing football authorities such as the Premier League and the FA. Whilst the Independent Football Regulator will have the power to take action to protect the interests of fans, will strike the right balance and make sure clubs aren’t wrapped up in needless red tape.\nThe Conservative Government is sticking to the plan by introducing the Football Governance Bill, making sure that fans are prioritised in the decisions that the club makes, giving them a say in the future of their club and putting fans first to create a brighter future for the game.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_house-commons-launches-new-select-committee-armed-forces-bill/content_80.html": "Today, the House of Commons launches the Select Committee on the Armed Forces Bill, chaired by James Sunderland MP. The Select Committee on the Armed Forces Bill 2021 has held its first meeting to agree its programme of scrutiny on the Armed Forces Bill 2019-21.\nThe Select Committee on the Armed Forces Bill 2021 may go through the Bill formally, clause by clause, and make amendments, it may also take formal oral and written evidence and make visits. As well as reporting the Bill to the House the select committee may make a Special Report to the House of its findings and recommendations. While this is a select committee, which functions largely under usual select committee procedure, it can also meet and function like a public bill committee.\nThe Committee welcomes written evidence submission on all the provisions within the Bill as well as any notable omissions and additionally on the state of Armed Forces pay. In particular, the Committee has called for evidence submissions in response to the following questions and on the following topics:\nArmed Forces Covenant\n- Is the ‘duty to have due regard’ the appropriate mechanism to further incorporate the Armed Forces Covenant into law? What alternative mechanisms could be used?\n- Is the focus on healthcare, education, and housing matters appropriate? Could this have a detrimental impact on other areas of the Armed Forces Covenant?\n- Are the specified persons and bodies proscribed in the Bill sufficient or should these be expanded?\n- An assessment of the Bill’s application to Scotland, Wales, and Northern Ireland in respect of the Armed Forces Covenant and the Secretary of State’s duty to consult the devolved administrations.\n- An assessment of the power of the Secretary of State to issue guidance on the duties imposed by the Bill.\n- An assessment of the power of the Secretary of State to make regulations to widen the duties in the Bill by specifying additional persons or bodies to be subject to those duties and to specify additional functions (areas other than healthcare, housing and education) in which the duty may apply.\n- An assessment of the enforcement of the ‘duty to have due regard’ and the impact on enforcement bodies such as relevant Ombudsmen.\n- What are the resource implications of these measures and how will success be measured?\n- Whether the provisions impact differently on Serving personnel (both Regulars and Reservists), veterans, and their families?\nService Justice System Reforms\n- What will be the impact of the changes to the constitution of Court Martial boards? Do these reforms go far enough, or should further changes be considered?\n- How far does the Bill address concerns about the handling of serious crimes committed by service personnel in the UK?\n- Will the duty to agree a new protocol on prosecution of the most serious crimes where there is concurrent jurisdiction ensure that the most appropriate route to justice is taken in these cases? Should there be an explicit protocol covering investigations as well as prosecutions?\n- Will the plans for independent oversight of the service police provide effective access to redress, and improve confidence that complaints will be handled fairly?\n- What lessons should be learned from the establishment of the Independent Office for Police Conduct and its predecessor the Independent Police Complaints Commission in establishing the new office of Service Police Complaints Commissioner?\n- Do the changes to the service complaint appeals process strike the right balance between ensuring fair access to appeals and ensuring complaints are handled efficiently, and are there enough safeguards in place to ensure those who cannot meet the new time limits get fair treatment?\nThe Committee reminds witnesses that it has resolved not consider individual cases.\nEvidence submissions will be accepted until midday on Sunday 21 March and earlier submissions are likely to be referenced during the Committee’s oral evidence proceedings.\nChair of the Committee on the Armed Forces Bill, James Sunderland, said:\n“I am delighted to be chairing the Select Committee on the Armed Forces Bill, which will undertake the important job of scrutinising the Armed Forces Bill, as well as providing an opportunity for Parliament to take a broader look at the some of the issues our Armed Forces face.\n“The Committee will work intensively, within the space of a couple of months, to explore not only the Bill itself, but also the current imperatives facing our Armed Forces, such as the efficacy of support available for service personnel, veterans and families as well as the structures in place that both safeguard and ensure accountability.\n“I look forward to working with colleagues, in Parliament and Government, on this unique select committee.”",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-supports-local-veteran-fundraising-military-charities/content_113.html": "2 September 2023\nJames Sunderland supports local veteran fundraising for military charities\nLocal MP James Sunderland visited Terry Stelling, RAF Regt and Sandhurst Veteran, 3 Forest End Road, GU47 8JT, who is displaying his collection of military models to raise money for the The Gurkha Welfare Trust and the RAF Benevolent Fund.\nJames said:\n“A fantastic display of military models. Here on Saturday 2nd and Sunday 3rd Sep. Please do pop in.”",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_user_password/content_54.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nPrimary tabs\nLog in\nReset your password\n(active tab)\nUsername or email address\nPassword reset instructions will be sent to your registered email address.\nSubmit",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-supports-childrens-hospice-week/content_29.html": "James Sunderland is helping promote Children’s Hospice Week this week (22-28 June).\nChildren’s Hospice Week is the only week of the year dedicated to raising awareness and funds for children’s hospice and palliative care services across the UK – and the seriously ill children and young people they support.\nIf you would like to find out how you can help, you can find out more on the Together for Short Lives’ website here.\nJames said:\n“This year has been particularly tough for many people, but many families caring for a seriously ill child have felt more alone than ever.\n“Children’s hospices offer an vital lifeline”.\nThe Government has made £200 million available to help children’s and adult hospices in England between April and June. This has enabled children’s hospices to play their part in responding to the coronavirus pandemic. They have made capacity available to help discharge seriously ill children who have needed palliative care from hospital – and ensure that they and their families could be cared for in their homes and in children’s hospices, reducing their risk of needing to be admitted to hospital.\nBut children’s hospices still need the public’s support to continue. Children’s Hospice Week is a chance to do something amazing by taking on a personal fundraising challenge or to come together with friends and family online to make a difference. Together for Short Lives’ Children’s Hospice Week Wheel of Fortune is helping people to find a fundraising challenge that’s right for them.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-calls-extra-investment-childrens-mental-health-services/content_33.html": "James Sunderland calls on the Government to invest in special educational needs and mental health provision for children as never before, for every local authority to review their SEND provision, and for a focus on reducing waiting times for an assessment by Child and Adolescent Mental Health Services (CAMHS).\nJames Sunderland (Bracknell) (Con)\nIt is a pleasure to serve before you, Ms Fovargue. I commend my constituency neighbour in Berkshire, my hon. Friend the Member for Newbury (Laura Farris), for securing the debate. I also pass on the best wishes of our right hon. Friend the Member for Maidenhead (Mrs May), who regrets that she cannot be here today. She asked me to point out that she fully supports every effort to increase the provision of mental health support for children in Berkshire and beyond. Finally, I want to welcome Dr Priya Singh, who is the new chief executive of the Frimley integrated care system and who I met yesterday to discuss this issue.\nTime is short but, in brief, local NHS CCGs spent £12 billion in 2020-21 on mental health support. NHS England spent a further £2 billion, making a total of just over £14 billion. That is great, but I was horrified to learn that CCGs spent 14 times more on adult mental health support than on services for children. We need to invest much more heavily in that area.\nEast Berkshire, where I reside, has £2.6 million in funding for children’s mental health, including £1.4 million for CAMHS and £200,000 for eating disorders. That is not enough, which is my opening contention to the Minister. The Berkshire Healthcare NHS Foundation Trust, based in Bracknell, does a fantastic job, but the demand for mental health assessment in children has gone up by 60% in the past five years. Since the pandemic, it has gone up by a further 27%. We have a problem. A constituent wrote to me only yesterday to tell me that the current wait for a child to be seen by CAMHS is 30 months; prior to the pandemic it was 18 months. Families are being left unsupported at this time.\nAs politicians, we spend lots of time admiring the problem, but perhaps not enough time thinking about the solution. What do we need to do? The first thing I would say to the Minister is that the SEND review is still awaited. It was promised last year and has failed to materialise. Will she please ensure that we get it as soon as possible? We also need to invest in our children with SEND as never before. That requires money, patience, determination and a much clearer Government strategy.\nWhy might that work? By providing the right care in the right settings we can give our children the focus they need to be productive, employable, law-abiding and responsible citizens. Prisons are sadly full of people who have made the wrong decisions or acted impulsively, perhaps because they were not diagnosed at an early age. Let us invest in more specialist educational settings, so that people’s needs can be addressed. Yes, that is expensive and resource-heavy, but the cost of not doing so will always be greater, and this is non-discretionary spending.\nI would like to see every local authority in the UK comprehensively reviewing its SEND provision, so that it becomes available in every area. Specialist and dedicated settings are the way forward for those who need them. We need to give our teachers better training with education, health and care plans. Those should not become a magic bullet—a passport for the lucky few—but a rightful passport for every child to get the support they need.\nLastly, CAMHS across the UK need 20,000 volts put straight through them. For families to wait two and a half years for a consultation is not only immoral but frankly inept. The irony will not have escaped anybody here that a GP cannot prescribe medication for ASD, ADHD, oppositional defiant disorder, Asperger’s or any other mental health condition, without a diagnosis from CAMHS. We have to focus on CAMHS right now.\nTo conclude, let us please get spending, diagnosing and treating, and let us give all our children, not least in Berkshire, the future they deserve.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_sunderland-welcomes-economic-progress-inflation-falls/content_13.html": "23 May 2024\nSunderland welcomes economic progress as inflation falls\nJames Sunderland spoke in Parliament yesterday to welcome news that the Government's economic plan is working with inflation down to 2.3% despite the global macro-shocks of the pandemic and Russian invasion of Ukraine. This is good for the people in Bracknell Forest who want low inflation, higher employment, higher wages and higher growth.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_james-sunderland-welcomes-approval-new-send-school/content_26.html": "6 March 2023\nJames Sunderland welcomes approval for new SEND school\nFollowing meetings with Minister for Children Claire Coutinho, local MP James Sunderland welcomes news that the Department of Education has approved 33 new special free schools to be built, including the successful bid by Bracknell Forest Council for a school with 100 places for pupils aged 4 to 19 with autistic spectrum disorder.\nHe said:\n“Having fought for improved SEND provision since becoming an MP, I know the importance of this announcement. I am thrilled and I thank the Department for Education for approving this bid. This will be massive for our pupils with ASD for Key Stage 1-5.”",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-calls-more-investment-special-educational-needs/content_37.html": "James Sunderland asks the Secretary of State for Education about progress on the special educational needs and disability review and calls for more investment in focused intervention for those who need extra support.\nDisadvantaged Students: Tutoring Support\nJames Sunderland (Bracknell) (Con)\nWill the Secretary of State please update the House on progress with the special educational needs and disability review and also confirm that we will be investing more in focused intervention for those who need extra support?\nGavin Williamson (Secretary of State for Education)\nI know that this issue is close to my hon. Friend’s heart. Yes, we have been making progress on the special educational needs review. Sadly, as a result of a pandemic, the speed at which we had hoped to bring it back to the House has been slowed, but we will be providing an update in the near future. It is incredibly important that our interventions for children with the most acute needs are specially tailored to address not only some of the challenges that covid has thrown up, but the continuing challenges that all children with special educational needs experience.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_armed-forces/content_101.html": "James Sunderland hosted the launch of the University of York’s research report entitled ‘No Homeless Veterans: A roadmap to end homelessness amongst veterans’.\nJames Sunderland is Chair of the All-Party Parliamentary Group on Veterans and of the All-Party Parliamentary Group for the Armed Forces Covenant.\nThe APPG on Veterans exists to represent armed forces veterans within Parliament and to ensure that the UK is the best place in the world to be a veteran.\nThe Armed Forces Covenant is a promise by the nation ensuring that those who serve or who have served in the armed forces, and their families, are treated fairly.\nJames Sunderland welcomes the inclusion of elements of the Desecration of War Memorials Bill into the Police, Crime, Sentencing and Courts Act 2022, and presses the Justice Secretary to complete the job and implement the remaining provisions.\nFollowing the Government statement on the work that the Government are doing to ensure that our welfare services for veterans are fit for the future, James Sunderland questions the Minister about his vision for what comes after Veterans UK.\nSpeaking in a debate on support for veterans, James Sunderland highlights help available from agencies, charities and organisations such as RBL and SSAFA and calls on the MOD to reach out more to those who have left with a single point of contact so people do not feel so isolated from the organisation they served.\nLocal MP James Sunderland visited Terry Stelling, RAF Regt and Sandhurst Veteran, 3 Forest End Road, GU47 8JT, who is displaying his collection of military models to raise money for the The Gurkha Welfare Trust and the RAF Benevolent Fund.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_remembrance-day-2023/content_112.html": "12 November 2023\nRemembrance Day 2023\nJames Sunderland attended the Remembrance Service in Bracknell today.\nAfterwards, he said:\n“Today's Remembrance in Bracknell was magnificent. The Lexicon Bracknell was packed and you could have heard a pin drop. Wonderful to see so many HM Forces, veterans, Police, cadets, scouts, guides, medics, councillors and so many local people paying their respects.\n“A special thank you to Bracknell Town Council for organising the event and to the Reading Scottish Pipe Band for your support throughout.\n“Thank you Bracknell!”",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_sunderland-seeks-security-assurances-following-mod-cyber-attack/content_50.html": "Following the Defence Secretary’s statement on the cyber attack where a malign actor hacked into the armed forces payment network, James Sunderland seeks assurances a diplomatic protest has been made, that firewall protocols given to defence contractors match those used by the MOD itself and that no malign actor can gain access to bank accounts.\nJames Sunderland (Bracknell) (Con)\nAs an affected veteran, I feel a responsibility for representing and championing my former colleagues in this matter. Will the Defence Secretary please assure me on three particular areas? First, will he assure me that an appropriate diplomatic protest has been made, or will be made, to the guilty party? Secondly, will assurance be given to the House in due course that the firewall protocols given to defence contractors will match or exceed those given to the MOD itself? Thirdly, will he assure me that the information that has been hacked, if indeed it has been hacked, will be sacrosanct so that no malign actor can gain access to bank accounts after this event?\nThe Secretary of State for Defence (Grant Shapps)\nI thank my hon. and gallant Friend. He makes three excellent points, and I absolutely assure him that the guilty party will be brought to book. I also assure him that the MOD was not responsible for failing to issue correct instructions, in terms of the contractual requirement to keep this data safe.\nMembers on both sides of the House have pushed this point hard, and I will make sure that it is not buried or lost in process. I will return to this House. I cannot promise to do that in the next few days, as the Butler process takes a while, but I will not allow it to drop. The House has my undertaking on that issue.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-calls-government-reduce-cost-covid-tests-travel/content_68.html": "James Sunderland welcomes the return of international travel and calls on the Government to do more to reduce the cost of covid testing.\nJames Sunderland (Bracknell) (Con)\nIt is great that international travel is now happening again, and I am absolutely clear that we must continue to do all we can for our aviation, travel, leisure and hospitality sectors. May I please draw the Minister’s attention to the high cost of covid testing? Our families returning from holidays are forking out lots of money for this, so may I ask him to consider the uniformity of the policy and also to get the costs down, please?\nRobert Courts (The Parliamentary Under-Secretary of State for Transport)\nMy hon. Friend raises a critically important point. We are working with industry and across Government to see how we can help with the cost of testing; the Government are aware of it. We seek to enable that information to be made available to consumers on the website, which shows the different providers, but he will have noticed that the cost of testing has been coming down over the past few weeks and months, and I am confident that, as we see more travel in a safe, sustainable way, the cost will come down even further.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-welcomes-cptpp-trade-deal/content_86.html": "James Sunderland welcomes CPTPP trade deal\nJames Sunderland praises the Government for signing up to the comprehensive and progressive agreement for trans-Pacific partnership which is “beyond question” the right thing for global Britain.\nJames Sunderland (Bracknell) (Con)\nI thank the Government for this excellent announcement and congratulate all of those who have made it possible. It is beyond question that joining the CPTPP is absolutely the right thing to do. May I please ask the Minister what message he has for the doomsters who think that Britain should not have a global role, who think that Britain is in permanent decline and who think that we would be better off back in the European Union?\nThe Minister for International Trade (Nigel Huddleston)\nThe message is quite simple: life is better with the Conservatives in charge.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_all-party-parliamentary-groups/content_22.html": "All-Party Parliamentary Groups (APPGs) are cross-party, informal groups of Members of Parliament with a common interest. They regularly carry out investigations, prepare reports and lobby Ministers on behalf of their interest sector.\nJames Sunderland is a member of the following APPGs:\nChair\nArmed Forces Covenant\nBritish Virgin Islands\nMotorsport\nVeterans (Joint Chair)\nVice-Chair\nAngling\nBahrain\nBritish Overseas Territories\nFalkland Islands (and Secretary)\nFormula 1\nKyrgyzstan\nMalaria\nNuclear Energy\nQatar\nRelocation\nSt Kitts and Nevis\nSEND\nSouth Atlantic\nSouth East\nSouth Western Railway\nSpecial Needs Education\nTaiwan\nTurks and Caicos Islands\nWar Heritage\nSecretary\nWestern Rail link to Heathrow\nMember\nAfghanistan\nAntigua & Barbuda\nArmed Forces\nBaby Loss\nCayman Islands\nEnding Homelessness\nGardening and Horticulture Group\nInternational Trade\nLoan Charge (IR35)\nMenopause\nMotor Neurone Disease\nRoad Freight and Logistics\nSouth East",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_homelessness-and-mental-health/content_55.html": "Having met homeless people locally, including some veterans, this is very personal to me and in my humble view, it is unforgivable that anyone should be living rough on our streets today when there is so much wealth around us.\nJames Sunderland campaigns on homelessness and mental health issues, in particular for veterans.\nFollowing meetings with Minister for Children Claire Coutinho, local MP James Sunderland welcomes news that the Department of Education has approved 33 new special free schools to be built, including the successful bid by Bracknell Forest Council for a school with 100 places for pupils aged 4 to 19 with autistic spectrum disorder.\nJames Sunderland intervenes in a debate on dementia research to pay tribute to the hidden army of about 6.5 million carers across the UK who save the Treasury billions and calls for an increase in the carer’s allowance.\nJames Sunderland calls on the Government to invest in special educational needs and mental health provision for children as never before, for every local authority to review their SEND provision, and for a focus on reducing waiting times for an assessment by Child and Adolescent Mental Health Services (CAMHS).\nJames Sunderland raises the importance of mental health support for people with skin conditions and calls on the Government to review spending on dermatology, ensure important face-to-face appointments are available to those who need them, and increase the range of psychological support.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_sunderland-raises-concerns-over-scope-and-timing-iccs-gaza-arrest-warrants/content_5.html": "James Sunderland raises concerns about the scope and timing of the International Criminal Court's arrest warrants for the Israeli Prime Minister, Hamas leader, and others. He worries that this timing might suggest a moral equivalence between Hamas and Israel, which could harm efforts to end the fighting in Gaza.\nJames Sunderland (Bracknell) (Con)\nThere is a danger that the scope and timing of the ICC’s arrest warrants might somehow imply moral equivalence, but it is quite clear that the fighting should stop. What does the Minister think will be the impact of those warrants?\nThe Deputy Foreign Secretary (Mr Andrew Mitchell)\nMy hon. Friend makes a most interesting point. This smacks of an unworthy, indeed ludicrous, sense of moral equivalence between a murderous, proscribed terrorist organisation and the democratically elected Government of Israel, who are seeking to protect their citizens and recover their 124 remaining hostages.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_user_login/content_42.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nPrimary tabs\nLog in\n(active tab)\nReset your password\nUsername\nPassword\nLog in",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_article-bracknell-news-wokingham-paper/content_94.html": "I write this on a beautiful day of sunshine and ambient heat. Summer is thankfully now here after weeks of poor weather and I am certainly looking forward to spending more time outdoors. Whilst the tempo in Westminster and constituency workload continue to be fierce, I do hope that we will soon be able to put Covid-19 behind us and capitalise fully on the success of the vaccination programme. But as ever, much will depend on the science and the Government’s appetite for risk. I do hope that common sense prevails quickly.\nI was asked recently to outline my position on the initial findings of the Boundary Commission. I do not profess to have all the answers as this is beyond the control or influence of most MPs, but I am happy to share a personal view. To start with, it has been suggested to me that the Government has attempted to drive its own outcome for political reasons, but this is just not the case as the Boundary Commission is entirely separate from any political party. While it is legitimised by central Government, it is actually independent of Government and its decisions are strictly subject to well-defined statutory criteria.\nTo start with, this is not about honouring or redefining extant battle lines but equalising all 650 Parliamentary constituencies so that they are of an equal size and ideally coterminus with existing borough boundaries. As the population has expanded in recent decades and new housing has sprung up everywhere, some constituencies have grown well beyond the mandated tolerance of circa 77,000 voters and some are well below it. This has benefited all political parties in different parts of the UK and it is right to redress the imbalance.\nThe fact that more people live in the South than the North is a key factor but it is the need to equalise the importance of every vote and regulate the size of each constituency so that no advantage is conferred on any party that ultimately drives change. Given too that the initial findings have been subject to rigorous stress-testing and independent review, I am comfortable that fairness has been employed and that the fundamental principles that underpin it have been robustly honoured. And before I am accused of nepotism, people who know me well will tell you that I am a man of integrity and I would soon call it out if I believed it to be unfair or politically biased. So this is an electoral not a political imperative.\nIn respect of Berkshire, the increasing population has ensured that there is a need for one new seat so this has mandated the re-drawing of boundaries and the reduction in size of the eight extant constituencies. Further details can be found at www.gov.uk but the upshot is that Bracknell is probably least affected, even though it sadly loses Finchampstead North, South and Wokingham Without. But all of the other Berkshire constituencies, namely: Wokingham, Windsor, Maidenhead, Newbury, Reading, Slough and the ‘new’ seats of Mid Berkshire and Earley & Woodley (both re-drawn from Reading West and East), will see more significant changes. The ‘Northern’ parishes of Binfield, Warfield, Winkfield and Ascot North also migrate from Windsor to Maidenhead, although part of Warfield comes into Bracknell.\nI am yet to conduct any rigour into how this might translate into votes but I believe that the new boundaries confer no particular advantage on any party in Berkshire. I also suspect that it’s ‘swings and roundabouts’ across the UK depending on where you look. Either way, constituents will still vote for who they want and it is up to politicians to earn these votes, rather than take any for granted.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-makes-statement-house-commons-armed-forces-bill-select-committee-report/content_104.html": "James Sunderland, Chair of the Armed Forces Bill Select Committee, makes a statement to the House of Commons following the publication of the Committee’s special report on the new Armed Forces Bill.\nArmed Forces Bill: Special Report\nSelect Committee on the Armed Forces Bill\nSelect Committee statement\n12.36pm\nJames Sunderland (Bracknell) (Con)\nToday, the Armed Forces Bill Select Committee publishes its special report on the new Armed Forces Bill. It is my privilege to present it to the House. Getting to this point has taken significant effort right across Westminster, so it is my duty to express my gratitude to several key stakeholders. I thank first the Backbench Business Committee for the opportunity to make this statement, and the Speaker’s Office and the Ministry of Defence for all their staff support and advice, notably on the content and scope of the Bill. I also thank the 16 right hon. and hon. Members of the Committee for their contribution, humour and hard work. We broke new ground as the first Committee of the House to conduct line-by-line scrutiny of a Bill by virtual means and worked intensively in the build-up to that before Easter and during recess to hear from many witnesses. I humbly thank them for putting their trust in me by electing a new MP as Chair. I am proud to represent the 2019 intake at this statement.\nI know that I speak for all Members by expressing my gratitude to those who contributed to our inquiry. Their depth of knowledge and professionalism was inspiring. Last but not least, I thank the Committee staff and wider technical teams for their support in the past few months, which has proved invaluable through both virtual and hybrid working. I make no apology for mentioning Ms Yohanna Sallberg and in particular, the presiding Clerk, Mr Matthew Congreve, whose contribution and guidance at the age of 24 have been truly outstanding.\nThe report, published earlier today, is the key output of the ad hoc Select Committee on the Armed Forces Bill. For those interested in the history, the requirement is a procedural anomaly harking back to the 1689 Bill of Rights. Every five years, a Bill must pass through Parliament thereby renewing the Armed Forces Act in statute and enabling the maintenance of standing forces in peacetime. Since 1961, the Bill has led to the creation of a unique hybrid Committee: technically a Select Committee with the power to summon witnesses and hear evidence, but also acting as a Public Bill Committee by scrutinising the legislation line by line. The Bill is not only essential to retaining and resourcing our armed forces but has come to serve as a checkpoint for what works and what is needed in statute.\nThe Committee was therefore appointed to scrutinise this important legislation. It has done so throughout the past few weeks, and it reported the Bill, unamended, back to the House last week. We inquired into specific areas of the Bill, focusing on the armed forces covenant, the service justice system and the service complaints system. We also explored additional areas, including diversity in the armed forces, healthcare and housing.\nFrom the outset, the Committee welcomed the requirement to incorporate the armed forces covenant into law and noted that this change is important for service personnel, veterans and their families. We recognised some concerns on how the duty to have due regard to the covenant will work in practice, the current lack of prescribed outcomes for those entrusted with delivering it, and how the visions in the Bill apply to some areas of the covenant but not others. We also heard concerns about it only applying to some public bodies but not others. We therefore look forward to seeing the statutory guidance, which will be essential for informing public bodies of what is expected of them in applying the duty of due regard. We recommended that the Government conduct a review after two years on how this duty is operating in practice and that the annual report for the armed forces covenant should review its effectiveness and comment on future scope. We also recommended that the Defence Committee, chaired by my right hon. Friend the Member for Bournemouth East (Mr Ellwood), should conduct post-legislative scrutiny.\nOn the service justice system, the Committee found that the Bill demonstrates a commitment to improving the system. This, combined with non-statutory measures being implemented following the Lyons review, should ensure that it has the confidence of those who are subject to it, and also the wider public. We therefore welcome the efforts to reform the service justice system but recognise that some concerns linger on concurrent jurisdiction. We recommended that the Ministry of Defence work quickly to introduce the defence serious crime capability and ensure that clear protocols are in place to allow effective co-operation with civilian police forces and to agree jurisdiction.\nTurning to the service complaints system, we welcome the efforts to speed up the process provided that the necessary safeguards remain in place to ensure fair and equal access to all. We found that the current processes do attract criticism, particularly in tackling delays to resolve cases, and we remain cognisant of the heavy workload being placed on individual officers and staff. We also supported the findings of the Wigston review and advised that the Ministry of Defence implement all of its policy recommendations.\nOn our additional areas of scrutiny, the Committee heard encouraging evidence that the experience of armed forces personnel with protected characteristics has vastly improved, but recognise that there is still more to be done. We welcomed the former Minister for Defence People and Veterans, my hon. Friend the Member for Plymouth, Moor View (Johnny Mercer), committing to\n“find a mechanism of restorative justice” ––[Official Report, Select Committee on the Armed Forces Bill, 31 March 2021; c. 94.]\nfor veterans dismissed due to their actual or perceived sexuality during the years of the ban on homosexuality in the armed forces. We asked that he report back to the House on progress within three months. We also support the important work of the Defence Sub-Committee on women in the armed forces, led by my hon. Friend the Member for Wrexham (Sarah Atherton).\nFurthermore, the Committee inquired into the provision of healthcare for veterans, particularly in mental health, and found it encouraging that the provision is getting better but recommended improvements in a number of areas and services. We sought to build on the important work of the Public Accounts Committee on service accommodation and found that the level of satisfaction for personnel and families living in service housing is still low. While work has been undertaken to improve this, we argued that better accommodation is an area that still needs prioritisation within the Ministry of Defence.\nOn the appointment and remit of our Committee, we found that the convention of committing the Armed Forces Bill to a Select Committee in addition to its usual Committee stage grants the Bill additional scrutiny. Our inquiry was, however, rather rushed due to compressed timelines, and we recommended that future Select Committees on armed forces Bills be given more time to complete their work. Overall, it was a real pleasure to work with hon. and right hon. Members from both sides of the House to deliver this important report. Consensus was achieved in most areas—no easy feat—and we recommended that the appointment of a Select Committee continues to be the convention for future armed forces Bills. I am grateful, again, to all my colleagues from all parties. Consensus is always persuasive and politics is far better for it.\nBefore I finish, I wish to remind Members of the underlying purpose of all this hard work. This House’s aspiration should be for Britain to maintain the best armed forces in the world and for this to be the best place in the world to be a veteran. Although there is much more to do, I believe we are getting there. We therefore pay tribute to our armed forces for their work, service and sacrifice, and this Bill is a vital part in our meeting our obligations to them. I look forward to working with all Members during later consideration of the Bill in this Chamber, and I commend this special report to the House.\nMr Kevan Jones (North Durham) (Lab)\nMay I begin by congratulating the hon. Member for Bracknell (James Sunderland), who, although he said he is new, chaired this Committee excellently? Like him, I pay tribute to the staff who supported the Committee, and I also pay tribute to the witnesses who came before us. He said that this is a unique Committee. It meets every five years, and I think I have served on every one of these Bills for the past 20 years. This was a difficult one because of covid, but it also was not helped by the attitude of the Ministry of Defence on the statutory guidance. Likewise, and I will put this on the record, it was not helped by the attitude of the then Minister, the hon. Member for Plymouth, Moor View (Johnny Mercer). Does the hon. Member for Bracknell agree that what needs to change is that in future—the report mentions the length of time the Committee sits—a set period, for example, six months, should be provided for, in order to ensure that detailed scrutiny, which I do not think we did this time, can be guaranteed?\nJames Sunderland\nFor me, achieving this outcome was about consensus; it was about all members of the Committee coming together. I pay tribute to the right hon. Gentleman, because I know that in the Command Paper of 2008 the covenant was first mooted; it is a combination of Conservative, Labour, Scottish National party and other MPs who have made it happen today, although of course a Conservative Government have brought it in. I am happy that the report, as it stands, provides some solid recommendations for the future. I agree that a more consensual approach to a Bill such as this in the future might pay dividends.\nBob Stewart (Beckenham) (Con)\nI congratulate my hon. Friend the Member for Bracknell (James Sunderland), a good friend of mine, on the way he chaired this Committee, which was a difficult one to chair. May I ask him why the Committee did not feel it fit to look at health problems and care problems with regard to Northern Ireland, and at vexatious claims made against Northern Ireland veterans?\nJames Sunderland\nI thank my very good right hon. Friend for his question. The simple answer relating to Northern Ireland is that the legacy issues, very much in the news at the moment, are subject to separate work being led by the Northern Ireland Office, and the Ministry of Defence made it clear to me and the other members of the Committee that that would not be within the scope of this Bill. We divided on that at the beginning of the session. For me personally, the wider issues relating to Northern Ireland and care, and the provisions of the covenant, are catered for in this Bill. I am pleased that the implementation of the armed forces covenant in statute is very much the core feature of this Bill and will happen, for the benefit of all those in Northern Ireland and elsewhere.\nMartin Docherty-Hughes (West Dunbartonshire) (SNP) [V]\nThe Armed Forces Bill is something of a whirlwind, and all on the ad-hoc Bill Committee will have learned so much over the past couple of months, as the Chair—the hon. Member for Bracknell (James Sunderland)—the Clerks and the digital support staff, to whom we owe a debt of gratitude for enabling the hybrid Committee to function, will know. It would be remiss of me not to congratulate the hon. Member for Aldershot (Leo Docherty) on his appointment to the Front Bench—Dochertys seem to get everywhere.\nIt should not come as a surprise to me, I suppose, after a good few years on the Defence Committee, but the armed forces have come on in so many ways in recent years in how they seek to recruit and retain personnel, for which they should be commended. It should also be said that all who were on the Select Committee on the Armed Forces Bill were resolved to ensure the process continues.\nHowever, while there was much for us to be positive about and agree on, as the Chair of the Committee has stated, I cannot help but feel that we are at a crucial inflexion point in the way the armed forces are perceived. The more I think about those of us in the Opposition who sought to make amendments to bring the armed forces closer to the society they seek to protect, the more I feel the Government favoured measures that keep them remote, discrete and unempowered. I and my hon. Friend the Member for Glasgow North West (Carol Monaghan) tabled common-sense amendments on a representative body, gender-neutral language and bringing the age of recruitment in line with that of our NATO allies. We supported other amendments on housing and on terms and conditions, and never really understood why the Government could not.\nWe use the language of heroes so often to describe those in the armed forces that sometimes we forget that almost all of them just want the simple pleasures of good pay, conditions and terms of service, or at least certainty, and certainly nothing worse than those of their fellow public servants in the NHS or a police force. Let me thank my fellow Committee members for their work, and the Chair and the Clerks for, over the last couple of months, writing this report—and here’s to more scrutiny of the work of the MOD on Third Reading.\nMadam Deputy Speaker (Dame Rosie Winterton)\nJust a quick reminder that the idea here is to ask fairly brief questions, rather than to make speeches. I do not know whether James Sunderland needs to respond.\nJames Sunderland\nI thank the hon. Member for West Dunbartonshire (Martin Docherty-Hughes) for his kind words, and also for the very positive way in which he and the hon. Member for Glasgow North West (Carol Monaghan) have engaged in the whole process. My simple response to his observation is that, in a very objective way, the Armed Forces Bill is notable for what is not in it. I say that because the report we submit today makes it absolutely clear where we feel—the Committee feels—further work is needed. I would refer him back to the report. I think I am with him on many of the areas he describes, and no doubt over the next five years the MOD will do its best to implement those issues.\nSara Britcliffe (Hyndburn) (Con) [V]\nMay I start by saying, on behalf of the 2019 intake, that we are all very proud that our hon. Friend was selected as the Chair of the Select Committee and of his making this statement to the House today, as he is the first of our intake to do this?\nAcross Hyndburn and Haslingden, we have tremendous respect and support for our armed forces both past and present, not least because we are the home of the famous Accrington Pals, so can my hon. Friend explain in what way the Bill makes life fairer and better for our armed forces?\nJames Sunderland\nI thank my really good friend from Hyndburn for her very generous words. The simple answer is that the Bill does two things. First, it increases and improves the offer to all service personnel and veterans through the armed forces covenant. It provides a statutory requirement on local councils, health authorities and education providers to improve those three areas to make sure there is no disadvantage by virtue of being in the armed forces and, of course, that special regard to disadvantage, injury, death or bereavement may be necessary for families. Secondly, the less well known part of the Bill is the fact that it improves the offer to service personnel in respect of the service justice system and courts martial. I believe that the Bill makes life in the armed forces a lot fairer and a lot better in many ways, and again, I would urge her to read the report.\nJim Shannon (Strangford) (DUP)\nI too congratulate the hon. Gentleman on setting the scene so well, and I thank him for all the hard work that he and his Committee did. I know the Armed Forces Bill contains the usual provision to deal with posthumous pardons, and I am looking to see if there is the possibility of providing for posthumous awards, such as for the legendary father of the SAS from my constituency of Strangford, Newtownards’s own Blair Mayne, whose courage, ability and leadership saw the award of the DSO on four separate occasions, yet the Victoria Cross was withheld. Is there scope in this Bill for the MOD, the Defence Committee or indeed the Minister for Defence People and Veterans himself to revisit this travesty, which should be rectified?\nJames Sunderland\nI thank my good friend from Strangford for his question, which is a good one with no ready answer. My simple view is that the honours and awards committee within the MOD provides that particular function. There is definitely a case for looking at what we can do on posthumous awards. There may be a time limit for some awards. Of course, Rorke’s Drift was famous many years ago for the fact that awards were given posthumously in many cases, due to public demand. I am sure that my good friend the Minister will take this forward, and no doubt we may see something in five years’ time with the next Armed Forces Bill or before.\nMr Philip Hollobone (Kettering) (Con)\nI commend my hon. and gallant Friend for his statement and congratulate him on chairing the 10 meetings of the Select Committee and on the publication of its 102-page report. I was pleased to note that the Committee says on page 48:\n“The level of satisfaction for personnel and families living in Service housing is still too low.”\nI congratulate him on including that as one of the main recommendations.\nI was very disturbed to read on page 10 that the Committee wanted to have a virtual visit with tri-service personnel to discuss single living and service family accommodation on 18 March, but that was cancelled the evening before because\n“the Secretary of State had refused authority for Service personnel to speak to the Committee.”\nMy hon. and gallant Friend wrote to the Secretary of State the next day, but according to the report, he has yet to receive a satisfactory explanation. Could he update the House on whether he has received any further correspondence about this matter from the Secretary of State?\nJames Sunderland\nI thank my good friend from Kettering for his question. It is recognised from continuous attitude surveys that members of the armed forces are not fully satisfied with service accommodation. As a former commanding officer, I was very fortunate with what we had in Aldershot—that is an exemplar—but there are other parts of the estate that need work and money, and I know that the Ministry of Defence has got that.\nIn respect of the request for a visit, I cannot comment on behalf of the Secretary of State as to why permission was refused. I can surmise that it was not a good time because of covid-19 and because it was just before the Easter recess, so units may have been on leave. We wrote to the Minister. We have had a response saying that he would look at it again, and my indications are that the opportunity of visiting service accommodation for members of the Committee who want to will be made available in due course.\nWendy Chamberlain (North East Fife) (LD)\nI thank the Chair of the Committee and its members for their work. The Armed Forces Bill does not directly reference enforcement mechanisms for ensuring that public bodies are held to account if a member of the armed forces community feels that they have not been treated correctly. What thought did he and the Committee give, if any, to setting it out in the legislation that existing ombudsmen or commissioners should have such a responsibility?\nJames Sunderland\nWithout giving a glib answer, I urge the hon. Member to look at the special report. I believe that there is an obligation on the ombudsman to keep the pressure on the Ministry of Defence. We discussed in great detail the need for independent, impartial pressure being brought to bear on the Ministry of Defence. We discounted the need for a union of troops and other such measures, but no doubt in time the spotlight will fall even more on this area. We also had some expert witnesses appear before the Committee who made similar suggestions, and I have no doubt at all that the MOD has got it.\nStephen Morgan (Portsmouth South) (Lab)\nMay I take this opportunity to thank the Chair, the Clerks and fellow members of the Committee for their dedication and hard work, as well as those who gave evidence to the Committee or responded to the survey? It was vital that the armed forces community had their say, to make this Bill better.\nService charities have pointed out that the narrow focus of the Bill on healthcare, housing and education could create a two-tier armed forces covenant that reduces provision in those areas outside the scope of the Bill. Does the Chair agree with Labour that the Bill must cover all areas of the covenant if it is truly to bring it into law and eliminate the postcode lottery that many veterans face in accessing services?\nJames Sunderland\nI thank my good friend from Portsmouth South for his question and for the very positive way in which he and his party—and, indeed, the SNP—engaged throughout the process. He raises a valid point. The implementation of the covenant in law is restricted at this point in time to the three areas that I mentioned earlier: health, education and accommodation. The report lists those areas in which we feel that more work is needed.\nMy sense is that the Ministry of Defence, over the next year or so and beyond, will be required to report on the effectiveness of implementation in those three areas. It will also be under increasing pressure to broaden the scope of the covenant in due course. Indeed, why should not social care and other aspects of public service provision be included? As a humble Back Bencher, I am sympathetic to the arguments that have been put forward, and I am sure the future rests with the Ministry of Defence as it take them forward.\nMadam Deputy Speaker (Dame Rosie Winterton)\nI thank the Chair of the Committee for his statement.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_sen_statement/content_11.html": "Since being elected in 2019, I have met over 70 families affected by children with Special Educational Needs (SEN). Many of these have been at my surgeries or on the doorstep. In most cases, I have been able to represent their interests with the Department for Education, Bracknell Forest Council, Frimley Health and GPs. In more acute circumstances, I have even managed to re-prioritise local children on waiting lists with Berkshire Child and Adolescent Mental Health Services (CAMHS) and secured earlier appointments. Some of these stories are heart-breaking and I empathise deeply with all those families who are waiting for solace.\nAs Vice-Chair of the All-Party Parliamentary Group (APPG) on SEN, this work is important to me and I continue to be a robust champion for neuro-diversity in Westminster. As your MP, I have regularly met and written to Ministers at the Departments for Health and Education. In the House of Commons, I have lobbied No.10, presented at seminars, spoken in debates and raised several questions to ensure that the Government’s approach to SEN is kept at the forefront of its agenda. This has been unrelenting and continues to be reported in Hansard, via social media and on my website.\nAlongside my cross-party MPs on the SEN APPG, we have worked hard to ensure that all children get a better deal and ready access to care. I have lobbied for GPs to be able to prescribe much needed medication on the basis of primary assessment, rather than having to wait for CAMHS to provide a diagnosis, and for the Department of Education to streamline the process for securing Education, Health and Care Plans (EHCP). I have also urged Ministers to focus on re-allocating resources within the NHS and to streamline recruitment and training schemes for new staff.\nEarlier this year, I was delighted when the Government published its new SEN Review as a direct result of the work being undertaken by the SEN APPG. A link to the document can be found below and I would urge all those affected by SEN to read it. Crucially, it paves the way for additional school places and specialist medical professionals, reduced waiting times for CAMHS, better SEND training and a further £2.6 billion to be invested in special school and alternative provision capacity. Whilst I accept that the Review has taken longer than anticipated, the Government needed to get it right. Over the past decade, the demand for CAMHS has spiralled beyond recognition so this is a big step forward: SEND and alternative provision improvement plan.\nLocally in Bracknell, I have visited the majority of primary and secondary schools and spoken at length to Head Teachers, SENCOs and staff about what needs to be done. I have also visited the impressive Kennel Lane School where the staff do a magnificent job. Importantly, all of this input has directly contributed to the SEN Review.\nLast year, I also visited Alt Prov in Birch Hill. Until that point, Bracknell Forest Council was unable to formally recognise it as an approved provider but I advised the team to register with OFSTED and that has now happened. Crucially, Alt Prov now receives improved funding and is able to work formally alongside schools, offering a vital lifeline for local children who may not be in class. Whilst it is not any kind of substitute for a regular school place, the team does an excellent job and should be congratulated.\nI was also thrilled to announce via social media in March 2023 that I have secured funding for a brand new SEN school in Bracknell following extensive lobbying at the Department for Education. This shows that sheer persistence and hard work can pay off. Not only will it make a huge difference for affected local families but it may also offer solace for those in neighbouring council areas too.\nLastly, it has been suggested that I am not doing enough to support local families in need of SEN provision but this could not be further from the truth. We know in Bracknell that all of our schools are graded GOOD or EXCELLENT but I am passionate too about giving every child the best possible offer, particularly those requiring SEN and those for whom mainstream education may not be the answer. Locally, Bracknell Forest Council ultimately remains responsible for providing this support but work is still needed within its own SEN Department. While I am confident that ongoing investment in new management, staff and processes will continue to enhance outputs since its last inspection report in 2022, I do not have a magic wand so can only continue to advise, assist and prioritise where I can.\nAs your MP, I am clear that we now need to throw our weight behind this locally. Councillor Mary Temperton has already announced her intention to do so, and whilst she will have to manage expectations for the simple reason that this will not be a quick or easy fix, I wish her and her new team at Bracknell Forest Council every success in delivering on this imperative. She will have my full support.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_if-foreign-aid-isnt-protected-next-week-millions-people-will-suffer/content_45.html": "James Sunderland writes a joint article with Derek Thomas MP for The Times.\nFew chancellors of the exchequer will have arrived at No 11 with quite as daunting an in-tray as Jeremy Hunt did last month. Among the decisions he will have to make before his autumn statement next Thursday is on Britain’s renewed support for the Global Fund to Fight Aids, Tuberculosis and Malaria.\nThat fund may not occupy the same amount of column inches as the other issues demanding his attention, but that’s not to say it isn’t still crucially important. A decision by the UK to reduce its support for the fund would put millions of lives in jeopardy over the next three years, and would risk backsliding in the struggle to finally defeat three of the biggest killers in human history.\nThe importance of this decision doesn’t stop there, however. The world is still learning the brutal lessons of the past two and a half years and the grim struggle against Covid-19.\nAs the MP for St Ives, West Cornwall and the Isles of Scilly, I (Derek Thomas) was honoured to host in my constituency the G7 Working Group on Vaccine Confidence, where partners celebrated the gargantuan efforts of scientists from around the world, particularly in the context of the Covid-19 pandemic. While their resilience was admirable, we owe it to them to do our very best to prevent any such disaster from happening again.\nOne of the clear lessons from the fight against Covid-19 was that to eradicate a disease a truly global effort is required. It took a matter of weeks for a virus first identified in China to wreak havoc in every corner of our planet.\nThere’s another important lesson in this context. As devastating as the pandemic was, it could have been worse had it not been for the decades of investment in global health that played a vital role in reinforcing vulnerable health systems and reducing the horrific fallout from the pandemic.\nThis is why organisations like the Global Fund are so critical. It was one of the unsung heroes of the pandemic, and now forms one of the cornerstones in our global efforts to ensure we are better prepared and better equipped to reduce the threat from future pandemics.\nWhile the Global Fund has been able to save 50 million lives since its inception across the three diseases, all of this progress could be at risk if the UK does not step up to the challenge. As vice-chairman of the all-party parliamentary group on malaria and neglected tropical diseases, I (James Sunderland) have seen first-hand the devastating impact that diseases like malaria continue to have on communities, including when I visited a health centre on the outskirts of Kigali, Rwanda, earlier this year. We just cannot risk losing any more lives to a disease that we know is entirely preventable, treatable and beatable.\nSince Hunt has taken the reins at the Treasury there has been serious pressure on him to cut spending, but our enduring commitment to the Global Fund should not be one of them. We are clearly at a time of need at home, and it is right that government priorities should be met by appropriate funding. Yet it is also important that we do not lose sight of the global communities that lie further afield, and that Britain has played a crucial role in supporting over many decades.\nOur closest allies, including the US, Germany, Canada, and Japan, have made ambitious commitments to the Global Fund. We should strive to demonstrate the same level of support, especially on issues that are truly life and death in nature. Without a strong financial commitment from the UK, all the hard-fought progress to date could be lost and millions of lives will be at risk. Our relationships with key allies may also be threatened at a time when British leadership is needed now more than ever.\nLastly, there can be few smarter investments the Treasury could make, and few better ways of showing we have learned the lessons of the past, by upholding the Global Fund. The prize of seeing malaria and other horrible diseases eradicated for ever is just too tantalisingly close to ignore.\nJames Sunderland is Conservative MP for Bracknell and Derek Thomas is Conservative MP for St Ives, West Cornwall and the Isles of Scilly",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-questions-veterans-minister-about-future-vision-welfare-services/content_110.html": "Following the Government statement on the work that the Government are doing to ensure that our welfare services for veterans are fit for the future, James Sunderland questions the Minister about his vision for what comes after Veterans UK.\nJames Sunderland (Bracknell) (Con)\nI thank the Minister for his statement. He will recall that last year the all-party parliamentary group on veterans did a survey on Veterans UK, and I hope that survey played a small part in the statement. What is his vision for what comes after Veterans UK?\nThe Minister for Veterans’ Affairs (Johnny Mercer)\nI pay tribute to my hon. Friend for all the work that he has championed over many years in the APPG, along with all its members. He has specifically focused on Veterans UK. The ambition is to make it far clearer and easier to navigate and understand the functions of Veterans UK, and simultaneously to improve outcomes. The quinquennial review into armed forces compensation, which will report by the end of the year, tied into the full response to the veterans’ welfare review and will go into detail about some of those issues.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_local-mp-attends-armed-forces-day-flag-raising-ceremony/content_114.html": "Skip to main content\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout James\nLatest News\nArticles\nNewsletter Archive\nIn Parliament\nAll-Party Parliamentary Groups\nCampaign Responses\nEarly Day Motions signed\nVoting Record\nArmed Forces Bill Committee\nProcedure Committee\nMy Plan\nSearch\nSurgeries\n22 June 2023\nLocal MP attends Armed Forces Day Flag Raising Ceremony\nJames Sunderland attended the Armed Forces Day Flag Raising Ceremony held at Sandhurst Town Council.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-seeks-confirmation-force-protection-will-remain-place-uk-withdraws-mali/content_72.html": "Following the Government statement about the decision to leave the UN’s MINUSMA peacekeeping mission in Mali earlier than planned, James Sunderland expresses his disappointment and seeks confirmation that force protection will be maintained in full accordance with the threat as we withdraw.\nJames Sunderland (Bracknell) (Con)\nI thank the Minister for his statement. Our withdrawal is disappointing, as I suspect it will exacerbate the very reasons for our deployment in the first place, but I clearly accept the political judgment. Will he confirm to the House that the UK force protection profile will be maintained in full accordance with the threat as we withdraw?\nThe Minister for Armed Forces (James Heappey)\nIt absolutely will. The long-range reconnaissance patrolling will stop almost immediately and, on the next rotation, the force that follows on to deliver the draw-down will have everything needed within it for full force protection.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_special-educational-needs/content_8.html": "James has been working with Ministers and lobbying for this additional £16m in dedicated schools funding to help the council to better use their resources and manage spending on special educational needs and disabilities (SEND).\nJames Sunderland has been campaigning for the Government to invest in SEN children as never before, to speed up diagnosis and open more dedicated SEN schools so that every local authority can provide focused intervention in a specialist and dedicated setting allowing children to fulfil their potential in the right environment, rather simply be excluded.\nJames has welcomed the news that schools in England are set to benefit from record funding as England’s core school budget reaches almost £60 billion in 2024-25 – its highest ever level in real terms.\nJames Sunderland welcomes the Government’s efforts to improve outcomes for children and young people with special educational needs and disabilities or in alternative provision and funding for a new SEND school in Bracknell in particular, but highlights the importance of diagnosis and the need to improve the Child And Adolescent Mental Health Service (CAMHS).\nFollowing meetings with Minister for Children Claire Coutinho, local MP James Sunderland welcomes news that the Department of Education has approved 33 new special free schools to be built, including the successful bid by Bracknell Forest Council for a school with 100 places for pupils aged 4 to 19 with autistic spectrum disorder.\nJames Sunderland calls on the Government to invest in special educational needs and mental health provision for children as never before, for every local authority to review their SEND provision, and for a focus on reducing waiting times for an assessment by Child and Adolescent Mental Health Services (CAMHS).\nJames Sunderland asks the Secretary of State for Education about progress on the special educational needs and disability review and calls for more investment in focused intervention for those who need extra support.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_news_we-should-consider-new-legislation-tackle-scourge-shoplifting/content_49.html": "James Sunderland, Parliamentary Private Secretary at the Home Office, writes on the issue of shoplifting for The House Magazine.",
  "https_www_jamessunderland_org_uk_/https_www_jamessunderland_org_uk_parliament_james-sunderland-raises-importance-mental-health-support-people-skin-conditions/content_103.html": "James Sunderland raises the importance of mental health support for people with skin conditions and calls on the Government to review spending on dermatology, ensure important face-to-face appointments are available to those who need them, and increase the range of psychological support.\nJames Sunderland (Bracknell) (Con)\nIt is a great pleasure to serve under your chairmanship, Mr Gray. I want to talk about mental health support for those with skin conditions, which is something that is often forgotten about by health providers across the UK and beyond. That is surprising, because 60% of British people currently suffer or have suffered from skin conditions at some point in their life. Those figures are comparable with cancer—it is a much bigger problem than we recognise. Some 98% of skin disease patients currently report that their condition affects their emotional and psychological wellbeing, yet only 18% have received any form of psychological support. That is a dichotomy that I want to explore very briefly—notwithstanding my sore voice, for which I am very sorry.\nA key reason why support for these conditions is so important is that recent studies have proven that there has been an increase in psychological distress, and in the last two years in particular. That applies in particular to adults over 18 and children aged between six and 16. For over-18-year-olds, there has been an increase of distress from 20.8% in 2019 to 24.4% in March 2021. That in my view is a reflection of the pandemic, from which we have all suffered.\nA study of adults over 18 also found that 26.1% of respondents reported self-harm thoughts at least once between March 2020 and May 2021. That is a hidden danger that we must all be aware of. It is even worse for those who are a bit younger. Among children aged six to 16, 39.2% have experienced some kind of deterioration in mental health since 2017—no doubt as a result of schools being closed and the isolation we all suffered from during the pandemic. For me, this debate is about the hidden dangers of the pandemic and the mental health cost on individuals.\nThat is made worse as young people emerge from the pandemic and their hibernation. How do they look? How do they feel? How low or high is their confidence? What about not having been in the sun for the last couple of years for those living in high-rise blocks in London and inner cities? What about skin conditions, such as acne? What about not going to school at that key age as a teenager? What about the lack of confidence that comes from having a skin condition? I want to raise these questions today. We can easily acknowledge the problem, but the solution is much more difficult.\nHaving discussed mental health, I want to move on to dermatology. The number of eczema sufferers in the UK has been steadily rising for the last 10 years. It stands currently at 1.3 million people. Interestingly, eczema is diagnosed much earlier. In around 90% of cases, it is children below the age of five. Psoriasis is much more of a problem for people that are slightly older. The prevalence of psoriasis in the UK today is a similar figure, at about 1 million to 1.3 million people. I am very familiar with it myself. Psoriasis is a problem that can affect how people look, and it is just one of many skin conditions, as we heard earlier from my right hon. Friend the Member for Gainsborough (Sir Edward Leigh). It is part of the whole panoply of skin issues that affect people so badly.\nSo what can we do? I want to raise three key points with the Minister. We need to improve the support for all those with skin conditions. We need to focus on the link between dermatology and mental health. First, I want to call on the Government to review their spending on dermatology to enable clinics to provide specialist mental health support for children and young people who suffer from skin problems. As we heard earlier, that may break the link between skin issues and mental health, which people are increasingly suffering from.\nSecondly, we should ensure that, whenever possible, face-to-face appointments are available to those who need them. That is really important. It is about human contact and touch. A Zoom call with a doctor is fine, if people can get an appointment, but it does not recognise the problem. The doctor cannot see it nor feel it. That, for me, is very important.\nSarah Olney (Richmond Park) (LD)\nThe hon. Gentleman is giving an excellent speech. I, too, pay tribute the right hon. Member for Gainsborough (Sir Edward Leigh). This is such an important issue. I have been contacted by a constituent of mine called Margaret who is a lifelong sufferer of psoriasis. To judge from his opening speech, I think that much of what she said in her email to me would be very familiar to the right hon. Member for Gainsborough. Does the hon. Member for Bracknell agree with me about the importance of first contact with the doctor and how important it is that sufferers of all kinds of skin conditions can feel confident about reaching out to their doctor? As the hon. Gentleman says, face-to-face contact is so important. I also want to emphasise to anyone, anywhere, who might be suffering from a skin condition that help is available and they should not hesitate to seek it.\nJames Sunderland\nI thank the hon. Lady for her intervention; I could not agree more. The simple answer is that doctors cannot see anything on a Zoom call. Also, people need to be able to see a doctor to get a prescription. If someone has a skin condition, they cannot just go to the chemist to get a prescription. They have to get an appointment first in order to get the prescription, and that is where face-to-face appointments come into it.\nMy third point is that we need to increase the range of psychological support for all those who need it. That is part of the panoply of health support that we need. A 2014 study showed that 94% of the patients who had completed psychodermatology treatment reported reduced stress, 92% reported increased confidence, and 90% reported that their skin condition was better understood. Wow. Those figures are amazing, but if someone asks for that treatment at this point in time, it takes up to a year for a referral, which is worrying.\nI want to commend the excellent services locally in my constituency. The Frimley integrated care system is one of the best in the country, if not the best. The treatment that I have had personally has been pretty good, notwithstanding the delay that we are all suffering form. Lastly, I ask the Minister to reinvest accordingly in this very important area so that young people and adults are not suffering."
}