{
  "https_www_lauratrott_org_uk_/https_www_lauratrott_org_uk_news_laura-trott-mp-shares-update-conversations-south-east-water-and-sdc/content_7.html": "Water bill increases have hit everyone, and whilst South East Water have social tariffs for those most in need, not everyone is aware of this, and many people were slipping through the net.\nTherefore, last year, I put South East Water in touch with Sevenoaks District Council to see if there was a way for the council to notify South East Water of those households which would be eligible for being placed on a social tariff.\nI am really pleased to say that an agreement has now been signed, and South East Water will be getting in touch with the households in most need to help. A huge thank you to everyone at South East Water and Sevenoaks District Council for making this possible.\nI will now be following up with Dartford Council, and other utility companies to see if we can widen out this approach.",
  "https_www_lauratrott_org_uk_/https_www_lauratrott_org_uk/content_1.html": "Sevenoaks and Swanley Latest News Laura Trott MP shares update on conversations with South East Water and SDC Water bill increases have hit everyone, and whilst South East Water have social… MP COLUMN: Protecting the Green Belt It was great to be out over the weekend, campaigning in support of our… MP COLUMN: Local decisions must be made with residents interests at the centre I love welcoming residents and owners of local businesses from across Sevenoaks… Laura Trott on Facebook Sign up to Laura's monthly Newsletter here. Leave this field blank Stay informed on the latest news. Your email First name Last name Postcode Address ID Address 1 Am I your Member of Parliament? Enter your postcode Postcode Contact Contact Details:House of Commons, London, SW1A 0AA020 7219 6898[email protected]FacebookInstagram\nLaura Trott MP shares update on conversations with South East Water and SDC Water bill increases have hit everyone, and whilst South East Water have social…\nMP COLUMN: Protecting the Green Belt It was great to be out over the weekend, campaigning in support of our…\nMP COLUMN: Local decisions must be made with residents interests at the centre I love welcoming residents and owners of local businesses from across Sevenoaks…",
  "https_www_lauratrott_org_uk_/https_www_lauratrott_org_uk_cdn-cgi_l_email-protection/content_12.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_lauratrott_org_uk_/https_www_lauratrott_org_uk_parliament/content_6.html": "You can find all my formal contributions to debates in Parliament here. I am working hard both inside and outside the House of Commons chamber to represent the interests of Sevenoaks & Swanley residents - so if there is something you’d like me to raise, please get in touch by emailing [email protected] - please be sure to include your full name and address.",
  "https_www_lauratrott_org_uk_/https_www_lauratrott_org_uk_cookies/content_3.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_lauratrott_org_uk_/https_www_lauratrott_org_uk_news_feed/content_10.html": null,
  "https_www_lauratrott_org_uk_/https_www_lauratrott_org_uk_about-rss/content_4.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_lauratrott_org_uk_/https_www_lauratrott_org_uk_events_feed/content_5.html": null,
  "https_www_lauratrott_org_uk_/https_www_lauratrott_org_uk_surgeries-0/content_8.html": "I regularly hold constituent advice surgeries to help local residents with a whole range of issues including housing cases, support with visas and access to the right healthcare.\nIf you have a case you would like to discuss with me, please email [email protected], and a member of my team will be in touch to arrange a suitable slot.\nMy team and I are continuing to do our utmost to support the people of Sevenoaks and Swanley, and please do get in touch if you feel that I can help.\nWith best wishes,\nLaura",
  "https_www_lauratrott_org_uk_/https_www_lauratrott_org_uk_news_laura-trott-mp-sworn-house-commons-following-election/content_11.html": "It was great to be back in the House of Commons yesterday for the election of the Speaker.\nThe process of swearing-in MPs began, with the Speaker, followed by the Father of the House Sir Edward Leigh, and the Mother of the House Diane Abbott. After this, the members of the Cabinet and Shadow Cabinet were sworn in and in this clip you can see me being sworn in. We were followed by other privy counsellors and Ministers and then other MPs ordered by length of service.",
  "https_www_lauratrott_org_uk_/https_www_lauratrott_org_uk_contact/content_2.html": "Skip to main content\nMain navigation\nAbout Laura\nIn Parliament\nContact\nNews\nChristmas Card Competition\nContact\nLeave this field blank\nContact Details:\nHouse of Commons, London, SW1A 0AA\n020 7219 6898\n[email protected]\nFacebook\nInstagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_lauratrott_org_uk_/https_www_lauratrott_org_uk_news_category_Speeches-in-Parliament/content_9.html": "Laura Trott MP is sworn in to House of Commons following election 9th July 2024 It was great to be back in the House of Commons yesterday for the election of the Speaker. The process of swearing-in MPs began, with the Speaker, followed by... Local NewsSpeeches in Parliament\nLaura Trott MP responds to Government announcement on support for energy bills 21st September 2022 Before we heard the sad news regarding the passing of the Queen, the Prime Minister set out in the House of Commons what support Government would be making... Local NewsSpeeches in ParliamentWestminster News\nLaura Trott MP speaking in debate on fly tipping 24th May 2022 Today I spoke in a Westminster Hall debate on the perennial issues of Fly Tipping. Sevenoaks District Council, alongside Kent County Council, are doing some... Local NewsSpeeches in ParliamentWestminster News\nLaura Trott MP makes speech on Cost of Living in Queen's Speech debate 17th May 2022 Most people reading this post will be worried about their energy bills. The Government is doing an enormous amount to try to help, including putting £22 billion... SpeechesSpeeches in Parliament\nLaura question to Schools Minister on possible future school and nursery closures 6th December 2021 I have received many emails over the last week from concerned parents about possible future school and nursery closures in light of the Omicron variant. Today I... SpeechesSpeeches in ParliamentWestminster News\nLaura's question to Health Secretary on children aged 12-15 and their vaccination status 6th December 2021 Many of you have been in touch with me recently to express your concern that children aged 12-15 cannot use the NHS COVID app to prove their vaccination status... SpeechesSpeeches in ParliamentWestminster News\nLaura Trott MP asks about face to face GP appointments 21st September 2021 As part of my role as a member of the Health and Social Care Committee, I today raised with Professor Martin Marshall, Chair at Royal College of General... Local NewsSpeeches in ParliamentWestminster News\nLaura's speech on planning in Queen's Speech Debate 18th May 2021 Today I spoke in the Queen’s Speech debate on the issue of planning reform. I urged the Government to ensure the targets allow us to continue to protect our... SpeechesSpeeches in ParliamentWestminster News\nLaura's question to Justice Minister on opening a Nightingale Court in Kent 16th March 2021 Today I asked the Justice Minister to provide an update on when a Nightingale Court in Kent, catering to those in Sevenoaks and Swanley, will be established... SpeechesSpeeches in ParliamentWestminster News"
}