{
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_debate-ceasefire-gaza/content_19.html": "It has been a truism across so many of today’s speeches that we have a universal desire for the violence to stop, and for it to stop immediately. The only question that exercises us in this Chamber today is, what is the most effective method to achieve that immediate cessation of violence?\nI will do the SNP the courtesy of addressing its motion. This is an SNP debate, and it is that party’s motion that is important. However, as has been referred to multiple times today, the SNP motion makes no reference at all to the Hamas attack on 7 October last year. It makes no reference to the stated intention of Hamas to repeat atrocities again and again, similar to and worse than that which was achieved on 7 October. We know that removing Hamas from Gaza—again, something that the SNP motion makes no reference to—is the only way to stop civilians, Israeli and Palestinian, from being killed. If we address only half of the issue, we will condemn any ceasefire to failure and bring about a renewed cycle of killing time and time again and a repetition of that appalling history of violence.\nThe most important thing for people in the region right now is an immediate cessation of violence, which will be achieved through a humanitarian pause. Such a pause would stop the fighting, get the aid in and allow for the hostages to come out. It is not delayed by the wider ceasefire negotiations—those are inevitable, because this is a complex matter—but it makes space for those negotiations to take place. Those negotiations are going to have to deal with the release of all hostages. A one-sided ceasefire is no ceasefire at all, nor is a ceasefire that leaves Hamas in possession of their hostages.\nThe negotiations will also have to deal with the recreation of a Palestinian Government for both the west bank and Gaza, freeing the people of Gaza from the terror of Hamas: they terrorise not just Israelis, but Palestinians too. Crucially, the negotiations have to lead to a credible and irreversible pathway to a two-state solution. That all takes time, but the fighting needs to stop now, so the Government are absolutely right to call in their amendment for an immediate humanitarian pause to give space for ceasefire negotiations but to stop the killing now.",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_inflation-falls-just-36-down-11/content_17.html": "I am delighted by the news that inflation has fallen to 3.4%!\nThe risk to our economy of high inflation becoming embedded, and prices continuing to rise significantly, has been averted and we're on track to get back to target inflation of just 2%.\nAlongside the Budget, this means:\nwe're cutting taxes\nwe're helping motorists\nwe're supporting families and children\nwe're keeping to our commitment of the 'Triple Lock'\nmost importantly, we're investing in Broadland and Fakenham -> the Queen Elizabeth Hospital Rebuild, the Norwich Western Link project, upgrading the A47, investing £6bn in mobile and broadband connection for rural communities and much more!",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_category_Speeches-in-Parliament/content_8.html": "Speech on Defence and Foreign Affairs 18th July 2024 There is a disconnect between the words and the actions of the new Labour Government - particularly in relation to defence and foreign affairs. We need to see... Speeches in Parliament\nQuestion to the Leader of the House on the Norwich Western Link Road 18th July 2024 🚨 They don’t have the answer! ❗️ During the election campaign, I warned that Labour would put many of Norfolk’s new investment and infrastructure projects at... Speeches in Parliament\nSwearing In - July 2024 18th July 2024 This week, I was sworn in as the Member of Parliament for Broadland and Fakenham. The hard work now resumes to deliver on our priorities for Norfolk - including... Speeches in Parliament\nQuestion on the Prison Building Programme 23rd May 2024 I am glad to hear that the contingency contained in the letter was not required. We can tell how tough this Government are being on crime and criminals by the... Speeches in Parliament\nQuestion on Improving Internet Connectivity in Broadland and Fakenham 22nd May 2024 Fast internet connections are just as important in rural areas such as Broadland and Fakenham as they are in the rest of the country. I welcome the Government’s... Speeches in Parliament\nQuestion on Improving the Competitiveness of the UK's Defence Sector 20th May 2024 This afternoon, I asked the Minister of Defence Procurement about how we use the integrated procurement model to accelerate and encourage new technologies such... Speeches in Parliament\nQuestion to the Department for Energy and Net Zero on Gas-fired Power Stations 14th March 2024 The independent Committee On Climate Change recognises that we will need unabated gas in the electricity market right up until 2035 and beyond, and more widely... Speeches in Parliament\nQuestion on Falling NHS Standards under the Welsh Labour Government 13th March 2024 Last month, fewer than half of red calls were answered by the ambulance service in Labour’s Wales within the necessary eight minutes. That is the Leader of the... Speeches in Parliament\nDebate on a Ceasefire in Gaza 21st February 2024 It has been a truism across so many of today’s speeches that we have a universal desire for the violence to stop, and for it to stop immediately. The only... Speeches in Parliament",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_question-improving-competitiveness-uks-defence-sector/content_22.html": "This afternoon, I asked the Minister of Defence Procurement about how we use the integrated procurement model to accelerate and encourage new technologies such as the radio wave drone killer.\nThis afternoon, I asked the Minister of Defence Procurement about how we use the integrated procurement model to accelerate and encourage new technologies such as the radio wave drone killer.",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_speech-defence-and-foreign-affairs/content_12.html": "There is a disconnect between the words and the actions of the new Labour Government - particularly in relation to defence and foreign affairs.\nWe need to see action from the new Labour Government and I'll be holding them to account if they fail to deliver on keeping our people safe.",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_visit-london-st-pancras-highspeed/content_14.html": "An interesting session with the board of London St Pancras Highspeed (formally HS1).\nThe track could carry twice as many trains as is currently used by Eurostar. So let’s get some competition in to drive down prices and increase services.\nCEO Robert Sinclair understands the importance of international open access and the vital role it plays in enhancing the UK economy. The government needs to support the challenger operators that are queuing up to get involved, even as they destroy competition everywhere else on the UK rail network.",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_news-update-nutrient-neutrality/content_11.html": "Finally some good news on Nutrient Neutrality and fixing planning delays in Broadland. For the last 18 months there has been a block in planning permissions for buildings with toilets in them, since any additional flush could increase the amount of nutrients in our rivers. So there has been a scramble to develop mitigation schemes so that home improvements and new houses can get going again.\nI have been lobbying the council for many, many, months to solve this problem by offering a free septic tank replacement service, which would provide a great upgrade for existing householders whilst also reducing nutrients in the rivers. Did you know that the upgrade of a single septic tank equals about 10 new homes!\nThe Conservative Government has come to the rescue and provided £9.6m to get the ball rolling and I am delighted that Norfolk Environmental Credits has just signed a deal to do exactly this. The first septic tank replacement will be on 10th June, unlocking the terrible planning backlog. If you have a septic tank, have a look at this link to see if you can benefit from the free upgrade.",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_category_Westminster-News/content_18.html": "Addressing Backlogs in the Legal System 27th March 2024 *COURT BACKLOGS* Residents often write to me about delays in the courts. These delays, which prevent justice from being served in a timely fashion and delay... Westminster News\nChairing the AGM for Financial Education for Young People APPG 12th February 2024 💷 I was pleased to chair the AGM for the Financial Education for Young People. We discussed various updates in the financial education space, looking ahead to... Westminster News\nBudget 2023 15th March 2023 Despite the enormous global headwinds, the U.K. economy is proving the doubters wrong. This Government has taken the measures needed to restore stability. We’ve... Westminster News\nLobbying the Chancellor Ahead of the Budget 2023 14th March 2023 This afternoon, I joined with other East of England MPs to lobby the chancellor ahead of the Budget. Growth pays for everything else, and we need a Budget that... Westminster News\nImproving Water Quality on our Streams and Rivers in Broadland 3rd February 2023 I have been contacted by a number of constituents who claim I voted to pump raw sewage into our rivers. I did no such thing. This is party political nonsense... Westminster News\nQuestion on Electric Vehicle Battery Production 19th January 2023 About 40% of the components of an electric vehicle are contained within the battery. That matters because of the definition of “British made” when we export to... Westminster News\nQuestion on the Menai Bridge Closure 18th January 2023 The Menai bridge supplies the lifeline of tourism to Anglesey and the wider region. Given Welsh Labour’s negligent handling of the maintenance of the bridge... Westminster News\nAll Party Parliamentary Group on Sustainable Finance 9th January 2023 As Chair of the All Party Parliamentary Group on Sustainable Finance, I launched our Introductory Guide to Green Finance - a layman's guide to explain what... Westminster News\nInterview with GB News on Prime Minister Liz Truss 18th October 2022 Interview with GB News on Prime Minister Truss, the Triple Lock and the economy. Westminster News",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_western-link-campaign-update/content_15.html": "🚗 WESTERN LINK - CAMPAIGN UPDATE\n✉️ I’ve written to the Leader of Broadland District Council to ask that she clarifies the position of her Cabinet Members in relation to the Western Link Road.\n🤝 As part of their deal to secure power at Broadland District Council, the Liberal Democrat’s have appointed a number of Cabinet Members that are against this project - despite the fact it is widely supported by residents and businesses in Broadland.\n💷 I’m proud to have lobbied to secure the cash for this road and I’m keen that the council clarify it remains 100% behind the delivery of this huge government investment in Broadland.\nRead my full letter below!",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_category_Articles/content_4.html": "Energy Security Questions 29th April 2025 Labour promised us time and time again that their policies would reduce your energy bills by £300 but since Labour got into power they have soared. It’s now... Articles\nVisit to HS2 24th April 2025 The shadow rail team has visited HS2 at Old Oak Common to see their plans for completion of the line under the leadership of new CEO Mark Wild. Mark is an... Articles\nVisit to London St Pancras Highspeed 24th April 2025 An interesting session with the board of London St Pancras Highspeed (formally HS1). The track could carry twice as many trains as is currently used by Eurostar... Articles\nBlickling Hall 19th April 2025 Come and enjoy the incredible grounds at Blickling Hall as well as the important library within the house. Articles\nWroxham Broad 18th April 2025 With just a few minutes tuition you can get right out onto the river. Articles\nPensthorpe Natural Park 17th April 2025 Although not the Serengeti, Pensthorpe Natural Park is a great spot to take the kids! They’ve even got pink flamingo’s and a brilliant Easter Egg Competition... Articles\nPop Up Stall at the Fakenham Market 11th April 2025 My pop up stall at the Fakenham Market was a huge success and something I will be looking to replicate at other market towns across Broadland and Fakenham. It... Articles\nWhittling Wednesday at Walled Garden Men’s Shed 9th April 2025 I was invited to the Men’s Shed at The Walled Garden in Little Plumstead, to meet some of the members of the Wood Whittling Club that meets every Wednesday... Articles\nVisit to St Peter's Church in Haveringland 9th April 2025 I just popped into the beautifully restored church at Haveringland to see how this festival church is re-establishing itself at the heart of the community. Why... Articles",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_energy-security-questions/content_3.html": "Labour promised us time and time again that their policies would reduce your energy bills by £300 but since Labour got into power they have soared. It’s now clear that Labour took us all for fools.\nThe shadow rail team has visited HS2 at Old Oak Common to see their plans for completion of the line under the leadership of new CEO Mark Wild. Mark is an experienced turnaround specialist.",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_swearing-july-2024/content_13.html": "This week, I was sworn in as the Member of Parliament for Broadland and Fakenham. The hard work now resumes to deliver on our priorities for Norfolk - including expediting the delivery of the new hospitals, diagnostic centres, GPs and dental practices; getting spades in the ground for the Norwich Western Link and the Fakenham Swimming Pool; pushing for better broadband and mobile coverage for rural homes and securing the funding for my campaign to get a dental school at the UEA.\nAs I've done for the last five years, I'll continue to work to deliver the very best for local people in Broadland and Fakenham.",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_privacy/content_16.html": "This document outlines how Jerome Mayhew processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Jerome Mayhew\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Jerome Mayhew.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Jerome Mayhew, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Jerome Mayhew via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_question-leader-house-norwich-western-link-road/content_20.html": "🚨 They don’t have the answer!\n❗️ During the election campaign, I warned that Labour would put many of Norfolk’s new investment and infrastructure projects at risk. Potentially the plug on hundreds of millions of pounds of funding for our county.\n🚗 I asked the Leader of the House of Commons for an urgent update on their plans for our new road. Listen to what she had to say …\n👍🏼 Hopefully I’ll have an answer soon.",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_whittling-wednesday-walled-garden-mens-shed/content_6.html": "I was invited to the Men’s Shed at The Walled Garden in Little Plumstead, to meet some of the members of the Wood Whittling Club that meets every Wednesday afternoon. This recently opened Men’s Shed is for all the community to use and offers a host of weekly groups such as jewellery making, singing club, yoga and a bike shed, where the emphasis is for self-repair rather than a repair shop. https://www.thewalledgardenshop.co.uk/",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_cdn-cgi_l_email-protection/content_21.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_my-annual-report-0/content_10.html": "ANNUAL REPORT LANDING ACROSS BROADLAND\n40,000 leaflets are being delivered across every home in Broadland and Fakenham - updating residents on my work over the last year in delivering the very best for Broadland.\nHaven't received it yet? Click here for the digital copy.",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news/content_7.html": "Energy Security Questions Tuesday, 29 April, 2025 Labour promised us time and time again that their policies would reduce your energy bills by £300 but since Labour got into power they have soared. It’s now clear that Labour took us all for fools. Articles\nVisit to HS2 24th April 2025 The shadow rail team has visited HS2 at Old Oak Common to see their plans for completion of the line under the leadership of new CEO Mark Wild. Mark is an... Articles\nVisit to London St Pancras Highspeed 24th April 2025 An interesting session with the board of London St Pancras Highspeed (formally HS1). The track could carry twice as many trains as is currently used by Eurostar... Articles\nBlickling Hall 19th April 2025 Come and enjoy the incredible grounds at Blickling Hall as well as the important library within the house. Articles\nWroxham Broad 18th April 2025 With just a few minutes tuition you can get right out onto the river. Articles\nPensthorpe Natural Park 17th April 2025 Although not the Serengeti, Pensthorpe Natural Park is a great spot to take the kids! They’ve even got pink flamingo’s and a brilliant Easter Egg Competition... Articles\nPop Up Stall at the Fakenham Market 11th April 2025 My pop up stall at the Fakenham Market was a huge success and something I will be looking to replicate at other market towns across Broadland and Fakenham. It... Articles\nWhittling Wednesday at Walled Garden Men’s Shed 9th April 2025 I was invited to the Men’s Shed at The Walled Garden in Little Plumstead, to meet some of the members of the Wood Whittling Club that meets every Wednesday... Articles\nVisit to St Peter's Church in Haveringland 9th April 2025 I just popped into the beautifully restored church at Haveringland to see how this festival church is re-establishing itself at the heart of the community. Why... Articles\nPublic Hearing on NNDC Local Plan 8th April 2025 Today Cllr Jo Copplestone and I spoke up for the residents of Coltishall and Horstead against North Norfolk District Council’s plans to build another 2,150... Articles",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_about-jerome/content_2.html": "I'm Jerome Mayhew, and it's an honour to be the Conservative Member of Parliament for Broadland and Fakenham!\nI'm married to Kate and we have three children.\nMy first job was as a Barrister and subsequently I went on to help build ‘Go Ape!’ into a successful tourism business in Norfolk and across the country. In more recent years I have worked in the constituency as a director of an agricultural company, learning about farming and the opportunities that green energy brings to our region.\nSince entering Parliament I have been using my position as your MP to raise the concerns of constituents with the Government and to argue their case. You can see a selection of my interventions and speeches in the Chamber of the House of Commons in the \"In Parliament\" section of the website.\nI am here to help all those that need it. Get in touch through my regular surgeries, via email or by letter. I want to be the voice of Broadland and Fakenham and work to hold the Labour Government to account on behalf of residents across Norfolk.",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk/content_1.html": "Latest News\nJerome on Facebook\nBroadland and Fakenham Constituency\nContact\nConstituency Office\nThe Old Smithy, Church Farm, Attlebridge, Norwich, Norfolk, NR9 5ST\n01603 865763\nI'm Jerome Mayhew, the Member of Parliament for Broadland and Fakenham. Here you can find my latest news, campaigns and more about me, including how to contact my office.\nI send out a regular e-newsletter for local residents. Fill in your details below to receive this monthly update straight to your mailbox.",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_map-locations/content_9.html": "Skip to main content\nMain navigation\nHome\nAbout Jerome\nNews and Speeches\nIn Parliament\nSurgeries\nContact\nMy map",
  "https_www_jeromemayhew_org_uk_/https_www_jeromemayhew_org_uk_news_category_Local-News/content_5.html": "NEWS UPDATE ON NUTRIENT NEUTRALITY 13th May 2024 Finally some good news on Nutrient Neutrality and fixing planning delays in Broadland. For the last 18 months there has been a block in planning permissions for... Local News\nINFLATION FALLS TO JUST 3.6% - DOWN FROM 11% 20th March 2024 I am delighted by the news that inflation has fallen to 3.4%! The risk to our economy of high inflation becoming embedded, and prices continuing to rise... Local News\nMeeting with Broadland District Council to Discuss Casework and Local Issues 12th March 2024 Great to visit @southnorfolkandbroadlandc to talk to the Managing Director and Director of Planning about a range of local issues across Broadland! Local News\nCampaigning for Better Postal Services across Broadland and Fakenham 19th February 2024 CAMPAIGNING FOR BETTER POSTAL SERVICES Residents have repeatedly contacted me about poor postal delivery to villages. In particular, some have identified... Local News\nWESTERN LINK - CAMPAIGN UPDATE 15th February 2024 🚗 WESTERN LINK - CAMPAIGN UPDATE ✉️ I’ve written to the Leader of Broadland District Council to ask that she clarifies the position of her Cabinet Members in... Local News\nMy NHS Dental Survey - Tell Me Your Views! 7th February 2024 I am delighted to see today’s NHS Dental Recovery Plan, delivering both a short term boost in access to NHS dentists as well as long term changes to increase... Local News\nDelivering My Annual Report for Residents 1st January 2024 View my Annual Report for Broadland and read all that I've been up to on behalf of local people in 2023! https://www.jeromemayhew.org.uk/my-annual-report-0 Local News\nOpening Barclays Local in Wroxham 15th December 2023 The new Barclays Local bank hub in Wroxham is OPEN! Great to officially open the new Hoveton and Wroxham Barclays Hub with my colleague, Duncan Baker MP. This... Local News\nUPDATE FOR PATIENTS AT TAVERHAM DENTAL PRACTICE 6th November 2023 UPDATE FOR PATIENTS AT TAVERHAM DENTAL PRACTICE Following the news that Taverham Dental Practice would stop seeing their NHS patients, I met with the Chief... Local News"
}