{
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_mps-brand-behaviour-british-airways-during-pandemic-national-disgrace/content_27.html": "As found in the Yorkshire Post:\nBritish Airways’ treatment of its workforce during the coronavirus pandemic “is a national disgrace”, MPs claimed.\nA report by the Commons Transport Select Committee accused the airline of a “calculated attempt to take advantage” of the crisis by cutting up to 12,000 jobs and downgrading the terms and conditions of the bulk of its remaining employees.\nThe carrier insisted it is doing everything it can to “sustain the maximum number of jobs”.\nOther aviation companies have also announced thousands of redundancies, including easyJet, Ryanair, Virgin Atlantic, Rolls-Royce and Airbus.\nThe cross-party committee of MPs acknowledged that job losses in the sector “may sadly be inevitable” due to the huge reduction in air travel as a result of Covid-19.\nBut it urged UK-based employers not to “proceed hastily” by making large numbers of people redundant while the Government’s furlough scheme is in place.\nUnions told the committee that British Airways is operating a “fire and rehire” approach by giving redundancy notices to most of its 42,000 workers with the intention of offering jobs to a proportion of them under worse terms and conditions.\nThis is in addition to up to 12,000 job losses.\nThe minimum 45-day consultation period for some workers ends on Monday.\nBA has had discussions with pilots’ union Balpa, including over the possibility of voluntary redundancies.\nBut the other two main unions representing its workers – Unite and GMB – are not engaging in talks.\nThe committee found that British Airways had received nearly £35m from the Government as of May 14 by furloughing 22,000 staff.\nIt noted that at the end of 2019, the carrier recorded profits after tax of £1.1bn and cash reserves of £2.6bn.\nUnions have argued that the airline could survive even if all its planes were grounded for 12 months.\nThe committee’s report stated: “The behaviour of British Airways and its parent company towards its employees is a national disgrace.\n“It falls well below the standards we would expect from any employer, especially in light of the scale of taxpayer subsidy, at this time of national crisis.”\nThe sentiment was echoed by Don Valley MP Nick Fletcher, who does not sit on the committee, but said: “Myself and many of my Parliamentary colleagues have been horrified that BA is using this Pandemic to restructure its firm; by carrying out many redundancies and forcing through what it tried to achieve in 2010. I'm afraid that this is not right.”\nHe said he was disappointed the airlines chief executive had initially not attended a roundtable discussion with the Home Secretary and Aviation Minister.\nAnd he suggested that “favouritism based on national lines is taking place right in front of our eyes” as IAG, the Spanish firm which owns British Airways, was not laying off staff in Spain.\nHe said: “I can only hope that British Airways will come to its senses and stop these heartless and unnecessary layoffs.\n“As it currently stands, therefore, one of the world’s iconic brands is sacking 12,000 employees and revising all of its existing employees' contracts at a time when there is uncertainty for everyone.\n“Doing this to your employees when they are at rock bottom emotionally and financially is hardly what you would call a good PR exercise.”\nHe added: “I am in no doubt that following this pandemic, we will see British Airways planes fly again. Yet if BA is not going to change course, both the consumers and their employees will lose out significantly.”\nThere have been calls from some MPs for British Airways to be stripped of some of its lucrative take-off and landing slots at Heathrow as punishment for the treatment of its workforce.\nTory MP Huw Merriman, who chairs the Transport Committee, said: “We will continue to bring pressure where we can, including the airport slot allocation process.\n“This wanton destruction of a loyal workforce cannot appear to go without sanction by Government, parliamentarians or paying passengers who may choose differently in future. We view it as a national disgrace.”\nBritish Airways said in a statement: “We find ourselves in the deepest crisis ever faced by the airline industry. A crisis not of our making but one which we must address.\n“We will do everything in our power to ensure that British Airways can survive and sustain the maximum number of jobs consistent with the new reality of a changed airline industry in a severely weakened global economy.”\nUnite general secretary Len McCluskey said: “The case the company makes for sacking 12,000 and trashing the wages of those who stay on the workforce is full of holes because it is a transparent effort to generate profits out of a crisis.\n“BA is fooling nobody. Never before has the country witnessed such wholesale mistreatment of a UK workforce and such brutal industrial thuggery.”\nThe committee’s report into the impact of the pandemic on the aviation sector urged the Government to abandon its 14-day quarantine rule at the end of June.\nIt called for a “more targeted and nuanced border control policy”, allowing people travelling from countries where the infection rate of Covid-19 is relatively low to enter the UK on a less restrictive basis.\nThe report also recommended that the Government and devolved administrations – where they have not already done so – provide support aimed specifically at the aviation sector, including a 12-month business rates relief for airlines and airports, and a six-month suspension of air passenger duty payments.\nA Government spokesman said: “We continue to work at speed to help protect the long-term future of the sector, however we will always put public health first, and we must not risk an extremely damaging second wave of the virus.\"",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_nick-fletcher-mp-supporting-businesses-and-individuals-through-coronavirus-crisis/content_13.html": "On 23rd February, I spoke at the opposition debate on the need to support businesses and individuals during and after the coronavirus pandemic.\nAs I set out in my speech, I strongly believe that the best way the Government can help individuals and businesses is by pushing forward with its levelling up agenda, keeping taxes low and encouraging a competitive, innovative economy. This will benefit our environment and economy while ensuring people have access to rewarding, good quality jobs.",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_category_Opinions/content_8.html": "Roadworks taking long? 10th February 2025 Should I be elected Mayor, I would want to see traffic moving freely in Doncaster once again. It’s critical for our local economy. There are lots of temporary... OpinionsReports\nAirport Milestone? 6th February 2025 Like everyone I am always delighted when positive progress is being made to reopen our airport. It is critical to the future of Doncaster that the airport... Opinions\nDoncaster Airport - Labour's Warm Words but No Money 30th January 2025 At first sight, it’s great news that the Government has declared its support for the reopening of the Airport. However what does that mean exactly? The... Local NewsOpinions\nMake Doncaster Great Again 28th January 2025 I've adopted the slogan \"Make Doncaster Great Again,\" which obviously echoes President Trump's successful campaign in the U.S. This has stirred some discontent... ArticlesLocal NewsOpinions\nGood Language not Poor Language 20th January 2025 I dislike bad language. If individuals have been blocked on my social media pages, 9 times out of 10 it will be because of bad language. I also despise hearing... Opinions\nGoing back to my small business has taught me what Conservatives need to focus on 16th January 2025 Nick Fletcher is the Conservative candidate for Mayor of Doncaster. He is the former MP for Don Valley. Experiencing the loss of my position as the MP for Don... Local NewsOpinions\nSocialism, Net Zero, and Social Care 15th January 2025 Socialism, Net Zero, and Social Care. You might think this title is too broad; allow me to elaborate. In the 1970s and 1980s, Wheatley Hall Road in Doncaster... Local NewsOpinions\nAPPRECIATION 1st May 2024 APPRECIATION I am often criticised but am also occasionally complimented. Here are some examples of the latter from social media. Great support from our local... Opinions\nNick Fletcher appears on Tim Farron’s ‘A Mucky Business’ Podcast 21st April 2021 It was great to talk to Tim Farron MP yesterday about my life before entering politics, how my Christian faith has helped me in my role as an MP and what it... Opinions",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_manifesto/content_15.html": "My manifesto (see download) to Make Doncaster Great Again is based on bringing hope and delivering real change for the great people of Doncaster and its surrounding towns and villages.\nWe need a new approach, a new start and a new broom. A new approach based on our common values of Faith, Flag and Family.\nPlease do download it, read it and share with your friends, family, neighbours and your work colleagues.\nDoncaster is my home\nI was born here, I live here and I work here.\nMy family all live here too.\nSo I know we have challenges and importantly, opportunities too.\nOur city is in decline. We see it. We feel it. We know it.\nLabour has run this city and area for nearly 50 years. Their MPs, councillors and elected Mayor have not only caused it, they refuse to do anything about it. They sit on their hands whilst our money is spent in Sheffield. We see it. We feel it. We know it.\nNow is the time for change. There is hope.\nA break with the policies that have brought our Doncaster to where it is.\nWe need truth and honesty once again in Doncaster. Free parking of two hours in all council car parks.\nA firm but fair approach to clear the beggars from our streets and pavements.\nOpening up Doncaster for businesses to thrive. We cannot afford to let Doncaster suffer another day under Labour.\nI have a strong vision and plan. I am asking you for your trust as together I know we can put Doncaster on its feet once again.\nWe will bring back common values we all share and especially that Yorkshire virtue of common sense. Faith, Flag and Family.\nWe can Make Doncaster Great Again.\nI hope you will give me your vote so we can start this difficult but exciting transition to a better future.\nYours faithfully,\nNick Fletcher\nConservative Party Mayoral Candidate for Doncaster",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_week-lets-make-doncaster-great-again/content_4.html": "I have been speaking to residents and businesses across the whole of Doncaster - from Mexborough to Thorne, Tickhill to Askern and everywhere in-between - and of course, Doncaster itself.\nI am told the same message time and again. We need change. Someone from the area who knows what they are doing and will make difference - not the same old failures that we have for the last 12 years - no new hospital, airport still closed, rising anti-social behaviour, high streets struggling and car drivers treated as cash cows.\nThat's why I have committed to Making Doncaster Great Again\nMy manifesto is clear on what I will do.\nMy commitment to the area - its people and businesses is clear from so many I have spoken to (see my Facebook).\nWe need change and only I will deliver it - as local people know (see below).\nIf you lend me your support on Thursday, I will not let you down.\nNick",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_category_Articles/content_11.html": "Make Doncaster Great Again 28th January 2025 I've adopted the slogan \"Make Doncaster Great Again,\" which obviously echoes President Trump's successful campaign in the U.S. This has stirred some discontent... ArticlesLocal NewsOpinions\nACHIEVEMENTS AS YOUR MP 23rd May 2024 ACHIEVEMENTS AS YOUR MP I am often asked “Nick, what have you achieved as an MP?” I thought it might be helpful to list some of the main achievements here. I... Articles\nWe need a Minister for Men to support everyone 18th September 2023 by Nick Fletcher MP Last week, the debate on whether we should have a Minister for Men really took off. It all started with my Radio 4 Women’s Hour interview... Articles\nEducation Select Committee member asks teachers why they think there are so few male teachers 11th April 2023 Nick Fletcher MP, a member of the Education Select Committee and Chair of the All-Party Parliamentary Group on Men and Boys, has issued a short anonymous survey... Articles\nMen need their own health strategy | by Nick Fletcher MP 22nd February 2023 As found in: HSJ Since it was created just under a year ago, the All-Party Parliamentary Group on Issues Affecting Men and Boys continually heard that there was... Articles\nYorkshire MP Nick Fletcher fears repeat of Grenfell disaster if no register is brought in for electrical appliances 8th September 2020 As found in the Yorkshire Post: Don Valley MP Nick Fletcher, a former electrical engineer and owner of an electrical company, proposed the changes to the... Articles\nNick Fletcher MP Responds to Freeport Consultation 13th July 2020 On 13 July, I submitted a briefing on why a Freeport in Don Valley would be a great idea in response to the Government's Freeport Consultation. The... Articles\nNew think-tank the Northern Policy Foundation hopes to help Boris Johnson \"rebuild and reshape the North\" 24th June 2020 As found in The Yorkshire Post: A new centre-right think-tank for the North of England, backed by a number of recently-elected Yorkshire Conservative MPs, has... Articles\nMPs brand behaviour of British Airways during pandemic a 'national disgrace' 13th June 2020 As found in the Yorkshire Post: British Airways’ treatment of its workforce during the coronavirus pandemic “is a national disgrace”, MPs claimed. A report by... Articles",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_kind-words-penny-mordaunt-mp/content_22.html": "KIND WORDS FROM PENNY MORDAUNT MP\nIt is nice to be appreciated by my colleagues and especially so by the Leader of the House. To be described by a seasoned and skilled Cabinet Minister such as Penny Mordaunt as …. “One of the most determined champions for his local community” …. in Parliament, referring not just to my fight for our airport but other campaigns I have run, were words that I truly appreciated.",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_my-manifesto-doncaster/content_7.html": "My manifesto (please click link) to Make Doncaster Great Again is based on bringing hope and delivering real change for the great people of Doncaster and its surrounding towns and villages.\nWe need a new approach, a new start and a new broom. A new approach based on our common values of Faith, Flag and Family.\nPlease do download it, read it and share with your friends, family, neighbours and your work colleagues.\nDoncaster is my home\nI was born here, I live here and I work here.\nMy family all live here too.\nSo I know we have challenges and importantly, opportunities too.\nOur city is in decline. We see it. We feel it. We know it.\nLabour has run this city and area for nearly 50 years. Their MPs, councillors and elected Mayor have not only caused it, they refuse to do anything about it. They sit on their hands whilst our money is spent in Sheffield. We see it. We feel it. We know it.\nNow is the time for change. There is hope.\nA break with the policies that have brought our Doncaster to where it is.\nWe need truth and honesty once again in Doncaster. Free parking of two hours in all council car parks.\nA firm but fair approach to clear the beggars from our streets and pavements.\nOpening up Doncaster for businesses to thrive. We cannot afford to let Doncaster suffer another day under Labour.\nI have a strong vision and plan. I am asking you for your trust as together I know we can put Doncaster on its feet once again.\nWe will bring back common values we all share and especially that Yorkshire virtue of common sense. Faith, Flag and Family.\nWe can Make Doncaster Great Again.\nI hope you will give me your vote so we can start this difficult but exciting transition to a better future.\nYours faithfully,\nNick Fletcher\nConservative Party Mayoral Candidate for Doncaster\nPromoted by Jane Cox on behalf of Nick Fletcher of 9A High Street, Penistone, SHEFFIELD S36 6B",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk/content_1.html": "I am Nick Fletcher, the Conservative Candidate for Mayor of Doncaster and the former MP for Don Valley (2019-2024). Here you can find my latest news, campaigns and more about me, including how to contact my campaign team.\nRemember to sign up (further up the page) to hear regular news from Nick on why he will be a fantastic new Mayor for Doncaster. We need change to Make Doncaster Great Again and only Nick can deliver that.",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_appreciation/content_18.html": "APPRECIATION\nI am often criticised but am also occasionally complimented. Here are some examples of the latter from social media.\nGreat support from our local MP. Good to meet you Nick. Markham Main Colliery Band (Hatfield gala 2022)\nNick Fletcher is the only person trying to save DSA, rest of councillor’s just make the number up absolutely useless. Doncaster Councillor’s are a waste of breathing space. Useless. (Lynda Taylor 31.08.22)\nThanks, Nick Fletcher MP , for all your hard work in trying to save DSA. Sadly I think it's a political decision to exclude you from the working parties, but I sincerely hope I'm wrong. This is too big for anyone to be playing games. (Brenda Bennett 31.08.22)\nNick Fletcher is the only person trying to save DSA, rest of councillor’s just make the number’s up absolutely useless. Doncaster Councillor’s are a waste of breathing space. Useless (Lynda taylor 31.08.22)\nIf this all goes pear shaped, I doubt anyone can say that Nick did not try his best - he deserves a medal for his perseverance! (Geraldine Shaw 31.08.22)\nKeep going Nick Fletcher MP . As a non tory through gritted Teath I am applauding you. Just shows how local MPs really care regardless of their politics. (Linda Lancaster 04.09.22)\nThanks for your update and summer efforts whilst other MP’s appear to have had an extended summer holiday. Whilst we don’t share all the same politics your determination and commitment for not only Doncaster but the wider region going beyond South Yorkshire is admirable. I hope that you have a productive time down in Parliament. Do you consider you will be able to add any more MP’s to your cross party list of those already confirmed. I’m sure with some clarity from you and Oliver Coppard you could sign up Yvette Cooper and Kim Leadbeater MP (04.09.22. Adam Fletcher)\nRefreshingly nice to read comments that don't automatically blame one side or the other.\nWell done NF and I wish you success in parliament 👍👍 (04.09.22 Christopher Proctor)\nThank you for all your updates , Nick. The best MP we have ever had in this area (5.9.22 Margaret Bratby)\nEven though I hate #Brexit, you will get my vote for your dedication to Doncaster Sheffield Airport alone (Peter Scott 06.09.22)\ntbh Mr Fletcher you are the first Doncaster MP that’s shown any interest in what’s going on here. Now we are the city of Doncaster we need to rebuild the place back into a place to be proud to be from. Donny has an abundance of talent and caring folk . The Airport unites us it’s needed for our growth and our future.(Paul Wagstaff 06.09.22)\nWell done Nick finally an MP who actually has his constituents interests at heart (Gareth Baxter 07.09.22)\nWell done Nick if it wasn’t for you Doncaster airport would be doomed , xx (Rachel Sutcliffe 07.09.22)\nFantastic job Nick Fletcher MP. You are a credit to your constituents, Doncaster and surrounding areas. A refreshing change to see a politician with drive and fight for those they serve (John Prestwich 07.09.22)\nWell done Nick 👍 you seem to be the only MP in Doncaster working tirelessly night & day to keep this airport open 👏🏻👏🏻 (lesley Wright 07.09.22)\nNick Fletcher is the best Tory mp out there I'll never vote again because I don't particularly like politicians how ever hats off to Nick for trying to save our airport he gets my vote (Scott Parry 08.09.22)\nNick Fletcher our Jack Russell terrier. When he's got his teeth stuck in he doesn't let go. (Carol Collins save dsa 15.09.22)\nGreat work Nick! Keep going the North of England are right behind you! Hardest working MP I’ve ever seen!! (Ian Barlow 15.09.22)\nI’ve never known any MP fight for something that meant so much to a community. I thank you for everything you are doing and if it doesn’t work out you can rest assured that you tried your hardest 👏👏👏 (Wendy Cupitt 15.09.22)\nFantastic input. No one could ask for more from their M.P. (Sandra Knowles 15.09.22 save dsa)\nThank you for all your efforts, we're so lucky to have you as our MP (Anne Raine 15.09.22)\nNick Fletcher MP a man who actually works for the people. Thanks. (Phil Storer 21.09.22)\nNick Fletcher MP, you deserve every shred of praise that comes your way, sadly I’m not a constituent but thank you for all your work for South Yorkshire, Doncaster and DSA (Charles Stuart 21.09.22)\nSpeaking as a Socialist… thank you for doing your job with such passion. Keep up the good work! (Paul Davenport 21.09.22)\nGreat work Nick - one fine effort in restoring faith in our politicians - you really do care! (Len Hodgkiss 21.09.22)\nYou really are the epitome of what MPs should be, you put your heart & soul into your work thank you 😊 (Viv Murphy 22.09.22)\nIf the airport remains open it will primarily down to your hard work Nick. You’re a credit to our town. If it doesn’t you’re still a champion 👏👏 (Richard Tucker 23.09.22)\nThank you Nick Fletcher MP you are a credit to Doncaster. Let's hope it's good news. 🤞🤞🤞 (Sharon Clark 23.09.22)\nHopefully a good outcome but I must say whatever the outcome you have worked so hard great to see thank you. (Katie Smith 23.09.22)\nHere's hoping it's good news 🤞🤞 if it's not, certainly not for want of trying, you have been just brilliant, absolutely sterling work on this Nick Fletcher MP , huge thank you again 🙂 (Yvonne o Gorman Heaney 23.09.22)\nU r amazing and thank you so so much for all your help and if it wasn't for you we would not stand a chance x (Sally Bullman 23.09.22)\nAll power to you, Nick Fletcher MP. No-one has ever tried as hard as you are doing to help Doncaster reach its full potential. (Brenda Bennett 24.09.22)\nPaul Swift He has done everything in his power to get the people that matter in the background to make it difficult for Peel to get the better of everybody so less of the He’s not done much story If we hadn’t had him to help we would be in a Sorry State. (Judy Bowers 24.09.22)\nThank you for your efforts, no matter the results and central politics you have done your best for constituents and hopefully this will be remembered come the elections. Its certainly made me think more about our local politicians and how they count when needed. X (Racheal Emma Turner 24.09.22)\nWell done Nick ,,,,best Doncaster MP bye a mile ,,,,edd in the shed,,,, (Tony King Sr 24.09.22)\nDoncaster as a whole appreciate all the hard work you do Nick Fletcher MP ... Constantly working hard to promote and support what is needed In Doncaster... A breath of fresh air ..\nThankyou.... (mark hunston day 73)\nWell done again Nick .Doncaster Airport is fortunate to have you as there MP as is Doncaster. (Joan Scaife day 73)\nYou've done all you can Nick. Never been more impressed by a local MP. I hope that if the outcome is positive for securing the future of our airport that you get full credit for this. (Stephen Gates Day 73)\nThank you so much Nick for all of your hard work It’s so much appreciated to see an MP working selflessly for their constituents 👏 (Jennifer Holbrook save thank 24.09.22)\nIf the airport's saved, it's all on you. The Labour party will jump on any successes as they always do, but it's your doing. If it fails you can't have done any more than you have. (Al Copeland 25.09.22)\nWhat ever your political leanings and whatever the outcome this has to be a massive thank you to Nick for all his hard work\nThank you (James Molloy 25.09.22)\nNick Fletcher MP you’ve done a fantastic job, you’ve put confidence in us all with the belief and knowledge what we know of our airport, fingers crossed good news, if not pretty much a ‘disaster’ for the city and region but can honestly say you’ve done brilliant (Luke Chambers 25.09.22)\nNo one could have done more, a resounding well done to you Nick Fletcher. Grateful thanks from this constituent. (Pauline Gilliver 25.09.22)\nI’m not gonna lie, my upbringing, background and personal political beliefs have always meant that a conservative vote was a no from me, however, and I mean this with sincerity, I am very impressed with the way you Nick Fletcher MP, have championed DSA and the campaign to keep our airport open.\nRegardless of political alignment, as our MP you have done a brilliant job, well done and thank you.\nFingers crossed for a favourable outcome tomorrow. (Andy Glaves 25.09.22)\nNick no one has fought harder for DSA than you, thank you for your commitment to us. (Dave Halliwell 25.09.22)\nCrossing everything I can , and hope Sincerely Peel will play ball Nicely .\nYou’ve done so Much more To secure Doncaster Airport than most and kept positive from Day 1\nI’m sure In your lifetime you will achieve great things Thank You Nick (Judy Bowers 25.09.22)\nDoncasters loudest voice, keep going Nick.\nI as most people really appreciate your commitment to our City and County. (Dave Halliwell 08.10.22)\nI have to say I am a member of the labour party, but I wish you were my local representative, you work harder than any political for your community. It is a serious pity, your colleagues DO NOT BACK YOU UP..(Sharon Schofield 14.10.22)\nI do not vote conservative but I like you Nick Fletcher MP. You are worth your salt 🧂 (TRacey Sinnott 14.10.22)\nNeed more like you Nick, please keep up your good work. (Michael dore 22.11.22)\nI reported the disgusting state of the A1 warmsworth junction months and months ago to DMBC. Never got a reply.\nI emailed your office at 11.30am and had a reply by dinner time and you got a response from DMBC straight away. Thankyou for being on the case of our useless council 😡 (Jorden Slack 10.03.23)\nIn common with #Doncaster’s other MPs, I enjoy a strong but sometimes robust relationship with @NickFletcherMP. We don’t always agree but I have to say he has been at his absolute best at #DWN2023. Passionate, candid & #Doncaster clearly running through him like a stick of rock. https://twitter.com/dan_fell/status/1666045069009338368?s=21&t=qaHWLfXI…\nNot a Tory but Nick Fletcher is a good un. He is of course saying what most decent people think and he’s fought tooth & nail to reopen Donny Airport after the callous Mayors let it close. @fightyfelix 26.04.24\nFor defending kids and young people from a dangerous ideology? We need more politicians like Nick Fletcher. @annettehood13 24.04.24\nNick Fletcher has done a good job. By comparison to Ed, he’s a breath of fresh air. Donny is nothing more than a safe seat access to Parliament for Ed.\nTerrible representation @brexitdoncnorth 22.04.24\nNick Fletcher MP if any MP can help it is yourself and I appreciate your help for our complaint . The mayors office sadly ignored the complaint and we got no replies from her :( 29.04.24 Cathie Rainbow",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_going-back-my-small-business-has-taught-me-what-conservatives-need-focus/content_21.html": "Nick Fletcher is the Conservative candidate for Mayor of Doncaster. He is the former MP for Don Valley.\nExperiencing the loss of my position as the MP for Don Valley in July 2024 was undoubtedly tough.\nHowever, returning to my business after 4.5 years in Parliament has proven to be a refreshing change for two main reasons: reconnecting with colleagues and clients, and reacquainting myself with the realities of running a small business.\nInstead of slipping back into the daily operation, I’ve taken a step back to assess what it truly takes to operate as electrical contractors. This involved reviewing our workflow, company policies, employee training, and the ever-increasing layers of bureaucracy and tax obligations. I began by focusing on how to secure more projects; after all, we now have another mouth to feed.\nOur website was outdated, as were our service vans. The promotional materials were old, and even our employees’ uniforms needed an upgrade. Historically, I haven’t had much luck with grants, largely due to time constraints, but with time on my hands back in July, I decided to pursue this avenue.\nWhether or not you believe in grants (perhaps we should just reduce taxes instead), winning a grant gives a sense of accomplishment. With a grant secured, a new website in development, vans being rebranded, and new uniforms on order, it was time to tackle policy matters.\nThe sheer volume of policies we must maintain, even as a relatively small business, is overwhelming. Here’s just a glimpse: Health and Safety Policy, Whistleblower Policy, Bullying Policy, Environmental Policy, Anti-Bribery Policy, Tax Evasion Policy, Corporate Responsibility, GDPR, Equal Opportunity, Emergency Planning, Mental Health, Modern Slavery, Quality Policy, Fire Risk Assessment—the list goes on and on.\nAfter updating our policies, I shifted focus to customer retention. I began visiting clients; some were very pleased, and a few even provided testimonials for our new website. While we strive to satisfy everyone, delivering a face-to-face service can be tricky. The key is investing in employee training and fostering a sense of belonging within the team.\nIn our field, training is extensive. After completing a 4-year apprenticeship, which culminates in a 3-day exam, our employees then have to be trained in testing – a further week’s course at a £1000 course cost (plus the time off work). Sadly, lights are not ever installed on the floor, so there’s safe use of ladders, PASMA for scaffolding, and IPAF for cherry pickers.\nThen there’s a CSCS card for site work, asbestos awareness every year, first aid every three years, online training on slips, trips, and falls, writing risk assessments and method statements, correct use of PPE, and monthly toolbox talks. Abrasive wheels, manual handling, and noise – again, the list goes on. The list of training requirements is exhaustive.\nTo operate as electricians, we must be members of organisations like NICEIC, CHAS, and Constructionline. If we want to install fire alarms and emergency lighting, further training and examinations are necessary. One common complaint about tradespeople is their driving, so we’ve implemented measures like vehicle trackers, bi-weekly checks, and the usual maintenance requirements. However, our vans are also subject to scrutiny from less-than-reputable individuals in the community, leading to lost income. Which brings me to insurance.\nInsurance is another significant concern: covering our vehicles, employees, premises, and additional services. Our building requires countless inspections and certifications, including PAT, Fixed Wire, Thermal Imaging, Fire Alarm, Emergency Lights, and Fire Wardens, among others. Thankfully, we can handle many of these in-house.\nDespite all these precautions and responsibilities, we face a burden of National Insurance contributions, VAT, fuel and road taxes, waste carrier licenses, PAYE, pensions, corporate tax, and business rates, which often come without adequate services, such as bin collection. To manage these expenses, we rely on payroll software, accounting systems, and an office manager, not to mention an accountant.\nAll of this effort is compounded when a Labour government decides to increase employer NI contributions by approximately £1000 per employee while proposing to grant additional workers’ rights, including sick pay from day one and no probation period. This approach undermines productivity and growth, contributing to a decline in business confidence.\nReturning to my business has been enlightening. It has served as a stark reminder of the challenges faced before we can even begin trading. If given the chance to return to Westminster, I hope the electorate supports me, but they only will if we, as Conservatives, commit to alleviating some of this burden. If we cannot cut down on red tape, we must at least reduce taxes.\nWe use tax to reduce something: sugar tax to reduce sugar intake, fuel tax to reduce car use, alcohol tax to reduce alcohol consumption, and tobacco tax to reduce smoking. So why would we tax businesses so much when what we all want is growth?\nWe want people to move home, but we have stamp duty. Couldn’t we at least remove this when someone is downsizing? Why should it cost you £50k in stamp duty to downsize and allow a growing family to move to a larger property? We want people to invest in business, but we tax their gains. We want people to save, but we tax their savings. We want people to go to the pub, but we put 20% VAT on their food and beer. Again, as before, I could go on.\nI am the Conservative candidate for Mayor of Doncaster, and although my tax-raising/lowering powers will be limited, I will immediately introduce periods of free parking. Why? Because I want to increase footfall in our city, and parking fees are just another tax.\nI will also work with our small businesses; they are the backbone of this country and should be treated with the respect they deserve. If the Conservatives are ever going to return to government, they must not just say they will not put up taxes; they must set out an agenda of continual reduction.\nOtherwise, I am afraid not just the electorate will think, “What’s the point?” but I am afraid so will many businesses too.\nUnfortunately, the current Labour government seems intent on increasing taxes and the burden of employment. I therefore fear we may be heading for a financial crisis reminiscent of 2008—a time when these socialists were last in power.\nAs we enter the New Year, I want to end on a hopeful note.\nI operate in what I believe is the best part of the country, the North, alongside some of the finest individuals. Even though those currently making the rules may lack an understanding of business operations, I am confident we will persevere. Through resilience and determination, we will not allow the elite to bring us down.\nSo keep smiling, and with a fair wind, I will be Doncaster’s new Mayor, and I can then show the country what can be achieved when you work with business as opposed to against them. Happy New Year, all.",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_educational-attainment-boys/content_20.html": "Today I had the privilege to lead a debate in Westminster Hall on a topic very near to my heart, that topic being the educational attainment of boys. Please find the text to my speech below:\nI beg to move.\nThat this House has considered the educational attainment of boys.\nIt is a pleasure to serve under your Chairmanship, Mr Paisley\nI would like to thank the Backbench Business Committee, which agreed to the debate.\nThe Government has been improving the overall standards of education in this Country.\nWe can see that with 88% of our schools being Good or Outstanding.\nWe have been rising up the international rankings on maths, reading and science.\nYet today, boys are not still doing as well at school as they should be.\nThey are underperforming.\nAnd it cannot go on any longer.\nAs well as with their own results, they are also behind girls at every single stage of education.\nThis gender attainment gap is an expression of their underperformance.\nThis is because there is no biological or other intrinsic reason why boys should be behind girls.\nJust as they have been for the past thirty years.\nIt is of course not a competition or a battle of the sexes.\nBecause we all want our girls to learn, to do well , to reach for the stars.\nWe must as a Parliament and as a society want our boys to do the same.\nThe figures are Stark.\nAs is the lack of interest or action which I come onto later.\nI will run through a few of the facts.\nAt 11.\nIn reading, writing and maths, 56% of boys meet the expected standard compared to 63% of girls.\nAt 16.\n43.0% of boys and 47.2% of girls received a grade 5 or above in GCSE English and maths.\nAt 18.\n34,000 fewer British 18 year old boys go to university every year than girls of the same age.\nBoys are also behind girls in terms of exam performance in A Levels, T Levels and vocational education.\nAt 16-24.\nOver 400,000 young men are NEETS – Not in Education, Employment and Training.\nFewer young men than young women are going into the majority of our professions.\nWe should also mention exclusions.\nAnother sign of boys not doing so well.\nThe last figures I have seen show 4,677 boys were excluded from school in one year.\nThese figures are hidden in plain sight.\nThe Government, education research bodies, think tanks, trade unions and social mobility organisations all know this.\nYet there is a silence.\nA silence of inaction.\nA silence of acknowledgement.\nA silence of care.\nWe continually have research papers from academics, research bodies and think tanks.\nThey highlight the facts but there is precious little on what should be done.\nOne published in January focused on how girls were outperforming boys.\nYet the main recommendation was to ask why so few girls study stem subjects.\nThe plight of the boys were made invisible.\nSimilar research reports recently give a scant nod to the gender attainment gap but do not seek to explain why.\nLet alone try and put forward ideas on what to do.\nBoys’ educational underperformance is a truth that no one dare speak its name.\nSilence across the education establishment.\nSome have though and Mr Chair, my honourable friend, the Member for Worcester, the Chair of the Education Select Committee cannot be here this morning because he is Chairing the Committee at this precise time.\nBut he reminded me recently that the committee has made a number of recommendations about the need to support boys in school.\nHe told me that he believes it is a matter of concern that boys are disproportionately represented amongst many groups.\nThat he wants schools to be inclusive and to unleash the potential in every pupil\nThat understanding the best ways for them to support boys and drive forward their academic attainment is important.\nAnd Mr Chair, I know he welcomes this timely debate and will be following it closely.\nI chair the All Party Parliamentary Group on Issues Affecting Men and Boys.\nOur fourth policy report this Parliament focused on boys’ educational underperformance.\nAs in all of our reports, we asked experts in the UK and across the world to speak to us.\nCrucially, this included six brilliant headteachers from across the UK who have closed the gender attainment gap.\nFrom Dorset, London, Cheltenham, Birmingham, Sussex, and Rochdale.\nAll in a way that has also supported their female students too.\nWe also heard from a national network of educators led by Dr Alex Blower, the Access and Participation Development Manager at Arts University Bournemouth.\nThey are implementing an educational framework based on the Taking Boys Seriously Principles, developed at Ulster University.\nI recommend it highly as a starting point alongside how the six headteachers are actually succeeding at a practical level.\nFrom what the successful school leaders told us, there were four main pillars, which need to adopted.\nFirstly, schools and trusts need to recognise the gap and collect the data.\nThen commit themselves throughout the school to address it continuously.\nFrom the board down to teaching assistants.\nIt is a whole-school cultural approach.\nThere has to be institutional will from top to bottom.\nThe schools found that the problem is not with the boys: it’s with the way the adults treat them.\nThey found, for instance, that some teachers were sanctioning boys more harshly than girls for the same offence.\nThat they had lower expectations for boys and were inadvertently rewarding them for lower effort.\nOnce the teachers recognised this, improvements were immediate.\nThey found that many of the disengaged teenage students were also those with low literacy skills.\nWhich they had when they arrived at secondary schools aged 11.\nThe successful schools put in place careful monitoring and interventions.\nTo ensure language and reading skills enable the student to understand the lesson.\nIt’s basic stuff.\nIt’s not rocket science.\nYou cannot expect students to learn if they cannot access the curriculum because they do not have the basics.\nI will happily send the Minister a summary of what the successful schools have done.\nSecondly, they create a boy-positive school environment.\nOne which is inclusive.\nFair, including with respect to discipline.\nRelational and aspirational.\nIt is important that boys and their parents recognise this includes them too and parents are supported if needed.\nWhere boys are not seen as a problem.\nIt’s just that they need encouragement, understanding, being believed in, given self-esteem and they need pushing.\nThey need high expectations, their successes celebrated and to understand the point of what they are being taught.\nThirdly, there needs to be some tactical interventions.\nEspecially on literacy, oracy, and study skills.\nPlus, role models and mentors.\nThe successful schools did not see role-models and mentors as being necessarily outside of school or in the media.\nThey simply made sure that older boys were visible succeeding in all subjects.\nNot just the traditional physics and football, but also in drama, music and history.\nThese are not needed for all boys but are needed for some boys.\nEspecially for boys with no father or positive male role models at home or in their community.\nMore male teachers are needed to show boys that learning is for them too.\nIt is telling that 80% of teachers told me that not having enough male teachers in school is a problem.\nMore so given 30% of primary schools have no male teachers at all.\nYet as we know the Department for Education and teaching training organisations fail to specifically promote teaching as a career for young men.\nWe have asked, but it is ignored.\nLastly, as a society we need to simply better care for our boys and support them when they need it.\nThe schools identified attitudes which harm boys’ progress are not limited to the school environment.\nWe, as a society, have inadvertently developed a culture which the boys experience as being hostile to them.\nWe have developed the belief that boys’ underachievement is somehow natural and normal.\nIt’s because “boys will be boys.”\nThe negative narrative on boys and the indifference that boys face, especially those with problems, has to change.\n41% of sixth form boys and girls have been told in school lessons that boys are a problem.\nTwo in five boys have been told by schools or outside organisations invited into schools that they are a problem.\nLet that sink in.\nTwo in five.\nThat is a shameful statistic and those schools need to take responsibility.\nBecause what do we feel the impact will be?\nIt’s hardly going to be positive is it?\nToo many feel ignored, marginalised or unsupported.\nBecause they are boys.\nWe also need to deal with other problems the adult world causes them.\nFamily dysfunction.\nA lack of community aspiration and opportunity .\nGangs and criminal pathways.\nSocial media’s so-called influencers.\nSo what to do?\nAs well as the points above which are aimed at all involved in education, the APPG asks the Government to do a number of things.\nA few of these are below:\nProvide political leadership and a narrative.\nThat publicly acknowledges that the gender attainment gap exists.\nAnd that boys’ relative underperformance is a problem the whole education community has to solve.\nLaunch or fund a sector-wide Task and Finish Group and a summit of head teachers to find and promote solutions.\nInvite the successful heads to guide the task force and the Government’s thinking.\nA ringfenced research programme on understanding and addressing the gender attainment gap.\nLaunch a “This Boy Can” campaign similar to its “STEM is for girls” campaign and other initiatives.\nTo specifically promote careers in teaching and other professions including in health and social care.\nThis would also put pressure on careers services as well.\nTell Ofsted to include the gender attainment gap in their assessment of schools.\nAnd give a positive assessment to schools that have policies and initiatives in place to address it.\nMore encouragement of mentoring schemes for boys.\nWhether from current or former students or community leaders.\nAnd vital for boys with no fathers or positive male role models are home.\nI urge the Government but also the wider educational community to take action.\nAs a society, a government and Parliament that believes in inclusion and equality – this cannot continue.\nWe must not and can not tolerate our boys not doing as well at school as they should.\nThe time to stop the inaction and for ignoring this issue has come.\nWe have to come together and tackle the underachievement of boys in our schools.\nThank you.",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_contact/content_6.html": "If you wish to contact Nick, please use the details below, and, of course, please do follow Nick on social media too - and find our how he will Make Doncaster Great Again!\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_category_Speeches-in-Parliament/content_17.html": "KIND WORDS FROM PENNY MORDAUNT MP 23rd May 2024 KIND WORDS FROM PENNY MORDAUNT MP It is nice to be appreciated by my colleagues and especially so by the Leader of the House. To be described by a seasoned and... Speeches in Parliament\nSMOKING BAN 16th April 2024 SMOKING BAN I voted against the ban as reported on GB News: https://www.gbnews.com/politics/sunak... I did so because adults should be free to make their own... Speeches in Parliament\nEaster and Christian Culture 21st March 2024 On Thursday 21st March 2024 I opened a debate in Westminster Hall debate on the topic of ‘Easter, Christian culture and heritage.’ Please find the text to my... Speeches in Parliament\nEducational Attainment of Boys 5th March 2024 Today I had the privilege to lead a debate in Westminster Hall on a topic very near to my heart, that topic being the educational attainment of boys. Please... Speeches in Parliament\nCHRISTMAS DEBATE 19th December 2023 I led the debate today on Christmas, Christianity, and the Community. It was an interesting discussion and one that I hope will become an annual event. Please... Speeches in Parliament\nRWANDA BILL 12th December 2023 RWANDA I voted for the Rwanda Bill tonight and spoke in the debate. I spoke about why immigration has to be controlled. It is hardly Christian to encourage... Speeches in Parliament\nINTERNATIONAL MEN’S DAY 21st November 2023 INTERNATIONAL MEN’S DAY Today I had the privilege of giving the opening and closing speeches on this debate in Parliament. I explained why we need a Minister... Speeches in Parliament\nA Disgrace!! Why we need a Register of Derelict Buildings 25th October 2023 I spend all my time Speaking Up Doncaster. However, not all is rosy. Sometimes we need to call out the things that are wrong. That’s how we improve. My Derelict... Speeches in Parliament\nROAD CHARGING MUST BE STOPPED PART 2 3rd July 2023 ROAD CHARGING MUST BE STOPPED I gave the opening speech in the debate in Westminster Hall on 26th June 2023 explaining why these schemes kill enterprise and are... Speeches in Parliament",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_ever-voted-tory-lets-makedoncastergreatagain/content_19.html": "EVER VOTED FOR A TORY?\nThis Tory was born in a council house on Mercel Avenue in Armthorpe a mining village in Doncaster.\nThis Tory went to Armthorpe Comp.\nThis Tory left school just before his 16th birthday.\nThis Tory did an apprenticeship at The Plant.\nThis Tory became a sparky.\nThis Tory was made redundant and couldn’t find a job.\nThis Tory went self employed.\nThis Tory has never left Doncaster.\nThis Tory wants the best for you, your kids and their future generations.\nThis Tory is asking for your vote so that we have a town centre that’s safe again.\nThis Tory was a kid (12) in a mining village in the strike.\nThis Tory gets how you feel.\nThis Tory keeps his word.\nThis Tory wants to be your Mayor.\nThis Tory hopes you will put party politics to one side.\nThis Tory hopes you will vote for the candidate who is the best for Doncaster.\nThis Tory is #theonlycandidatewithaplan.\nThis Tory is called Nick Fletcher.\nNick\nLet’s #MakeDoncasterGreatAgain. Doncaster deserves better. I’m Doncaster through and through. We can do this.",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_category_Local-News/content_3.html": "Vote Nick Fletcher Today - Let's Make Doncaster Great Again! 1st May 2025 This is it folks! Today is polling day (7am to 10pm) and you have a chance to give Doncaster and its surrounding towns and villages a fresh start by lending me... Local News\nRemember to lend me your support tomorrow and vote for a fresh start for our community 30th April 2025 Tomorrow is polling day (7am to 10pm) and you have a chance to give Doncaster and its surrounding towns and villages a fresh start by lending me your support. Local News\nThis Week - Let's Make Doncaster Great Again! 28th April 2025 I have been speaking to residents and businesses across the whole of Doncaster - from Mexborough to Thorne, Tickhill to Askern and everywhere in-between - and... Local News\n\"Put party politics aside, put Doncaster first\" - I hear you! 22nd April 2025 On the campaign trail, I hear time and time again the need to put party politics aside and people know that is true with me - all I care is about is doing right... Local News\nEver Voted for a Tory? Let’s #MakeDoncasterGreatAgain. 14th April 2025 EVER VOTED FOR A TORY? This Tory was born in a council house on Mercel Avenue in Armthorpe a mining village in Doncaster. This Tory went to Armthorpe Comp. This... Local News\nDoncaster Podcast: What I will achieve as Mayor of Doncaster 7th April 2025 A few days ago, I was interviewed by Jordan Smith from the excellent Seven Studios, Yorkshire's leading podcast & content studio - based right here in Doncaster... Local News\nDoncaster needs faith, flag and family! 31st March 2025 Doncaster is famous for many things: the oldest flat race in the world, the St Leger; one of only three mansion houses in the UK; the once-thriving Doncaster... Local News\nIT'S OFFICIAL - LETS GET IT ON! 27th March 2025 IT'S OFFICIAL - LETS GET IT ON! I have now been accepted as a candidate. Thank you Cllr Jane Cox from Finningley Ward for coming with me to the Council Offices... Local News\nMy Manifesto for Doncaster 24th March 2025 My manifesto (please click link) to Make Doncaster Great Again is based on bringing hope and delivering real change for the great people of Doncaster and its... Local News",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_cdn-cgi_l_email-protection/content_24.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_day-life-mp/content_14.html": "Recently, I decided to make a video showing what a day in the life of an MP is like. Join me as I take you through a typical day in Westminster.\nRecently, I decided to make a video showing what a day in the life of an MP is like. Join me as I take you through a typical day in Westminster.",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_privacy/content_23.html": "This document outlines how Nick Fletcher processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Nick Fletcher\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Nick Fletcher.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Nick Fletcher, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Nick Fletcher via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_about-nick/content_5.html": "I was born and raised in Armthorpe and attended Armthorpe Comprehensive School.\nFollowing an apprenticeship at Doncaster Plant Works, I took a leap of faith and started my own electrical business in 1994.\nAfter tying the knot with my wife, Gail, in 1995, we had two children.\nThroughout the years, we moved to various places, including Wheatley, back to Armthorpe, and eventually settling in Bawtry in 2002.\nIn a significant milestone, I made history as Don Valley’s first Conservative Member of Parliament and the first Conservative MP in Doncaster in six decades.\nAside from my professional endeavours, I am an avid runner completing both the London Marathon and the Great North Run raising funds for cancer charities. I also have a strong commitment to working with local prisons to help prevent reoffending and support individuals seeking a fresh start.\nMy journey into politics was driven by need to serve and help the people of Doncaster and to make a difference in the lives of young individuals across our great nation.\nAs a Christian, my core values revolve around faith, love for my country, and the importance of family. Faith, Flag, and Family are the guiding principles that shape my approach to life and leadership, driving me to work tirelessly for the betterment of our community and the future of the United Kingdom.\nNick Fletcher",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_my-values-conservative-mp/content_12.html": "MY VALUES\nI gave the opening speech on 9 June 2023 at the second NRG Conference held in Doncaster. I outlined my values and where we can go as a region, not just in the North, but in South Yorkshire.\nWe need to smash the shackles of socialism. We need to reject Labour’s victim mentality that has held us back for so long. We should believe in ourselves and that we can achieve great things.\nI look forward to the future with a sense of optimism. We can change our city and our future for the better. Thanks to devolution, the powers and funds are in our hands. Labour has held power locally now at Doncaster Council for some years. Over 55 years in fact.\nIt is time for a change. We can do so much better.",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_road-charging-must-be-stopped-part-2/content_26.html": "ROAD CHARGING MUST BE STOPPED\nI gave the opening speech in the debate in Westminster Hall on 26th June 2023 explaining why these schemes kill enterprise and are bad for all. We need a win win not a lose lose.\nThey are a Labour policy. We all need to remember that when the elections come.\nULEZ? Never.\nCAZ? Never.\nNo, no, no. We must resist these at all costs. They don’t create clean air. They are a device to extract money from you. They deter enterprise and are simply bad in every respect.\nI lay out in my speech some simple steps that local councils like Doncaster can take to revitalise their town centres.",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_rwanda-bill/content_25.html": "RWANDA\nI voted for the Rwanda Bill tonight and spoke in the debate. I spoke about why immigration has to be controlled.\nIt is hardly Christian to encourage people to pay criminals and put their lives at risk, to tell these illegal immigrants that they will have a future here and to encourage professionals and carers from other countries to legally come here when they are needed in their own homelands.\nUncontrolled immigration has an impact on us all. If your child needs urgent medical treatment you would go to A&E only to find the waiting room full of people whose first language is not English. Huge waiting times. Unacceptable.\nI have met today with the Prime Minister to discuss this Bill. I asked for and was given his promise that this Bill will tighten the law to prevent further abuse of our country. I have voted for the Bill on that basis.\nI will continue to press and do all that I can to ensure that immigration is controlled far more than has been the case.\nPlease find the transcript to my speech below:\nI have said it before and I will say it again: Doncaster is full. I often get challenged, as I just was from the Opposition Benches, when I say as a Christian that Doncaster is full, but I do not think it is very Christian to put people in boats who will, sadly, sometimes fall. I do not think it is Christian to promise people a life in this country when we do not have the services for them. I do not think it is Christian to take the best people from developing countries because we do not train our own in this country. I do not think it is Christian when my constituents have to put up with immigration at the level it is at.\nWe have heard the lawyers in this House speak so eloquently, as they often do. We hear the left-wing lawyers do the same, but at least the lawyers in this place are probably trying to help—at least those on the Government side of the House. Unfortunately, outside, we have left-wing lawyers making six-figure salaries calling me and people like me awful. We have TV pundits on seven-figure salaries, paid by my constituents through TV licences, again calling me awful. Well, I ask the people on those huge salaries to sell everything they have and give it all away, and come and get a job in Doncaster, probably on £25,000 or £30,000 a year. I ask them to find themselves a partner and then go and buy their dream house.\nThose people buy that dream house—a three-bedroom semi or mid-terrace—and they make the garden nice so their kids can play in the garden. There is a couple next door who have kids themselves, and everything is rosy. Then all of a sudden the neighbour decides to move on—he gets a different job or moves somewhere else—and that house is turned into a house in multiple occupation. Then we have nine people who do not speak English bedhopping. That is what is happening. It is no good saying it is not happening; it is happening. If anyone wants to come and have a look, then please come and have a look, because I am sorry, but you are burying your head in the sand trying to make yourselves look good in front of people to get votes. This is happening. It is happening in Doncaster and in places throughout the country. We are turning parts of our community into a ghetto. This is what is happening.\nAll of a sudden, you are living next door to an HMO and there are comings and goings at 2 or 3 o’clock in the morning, with people outside smoking. The grass does not get cut any more, the windows do not get cleaned any more and, unfortunately, you feel too scared to let your child play out in the garden any more. There are no gated communities here to make people feel safe, because, remember, you are not on a seven-figure salary now; you are earning £30,000 a year. The only protection is a lock on the door. The council might introduce a public spaces protection order, but would probably not enforce it. This is what is happening.\nYou cannot sell your house, or if you can, you have to sell it at a discount. Your little child falls over in the street and you have to go to A&E, and there is a 12-hour waiting list. The reason the waiting lists are so long is that people do not speak English in these places any more. This is what is happening! In the schools, the classes are all oversized—[Interruption.] This is what is happening. Members can shout me down. They can say what they want—I really do not care—but this is what is happening.\nWe have to tackle immigration, including illegal immigration, because it is not fair. The couple I am talking about are paying their taxes week in, week out. They expect to live in a nice street, and to benefit from the services that they pay for week in, week out. They do not expect to be called racist or xenophobic for saying, “We liked it as it was.” If we are going to have immigration, which I do not completely believe is a bad thing, it needs to be controlled, and that is what I was sent down here to do.\nI am only here because of Brexit. The people of Doncaster have had enough. They wanted control of their borders, and I say to Ministers that unless we get control of our borders, I will not be coming back down here again. Members may cheer, but the people of Doncaster are not cheering. This is the first time they have had a Conservative MP to hold to account one of the socialist Labour councils that have been left to get away with murder for the last 60 years. It is absolutely atrocious.\nI will back the Bill today, but I have friends on this side of the House who want it to be stronger, and I am going to work with them, and hopefully with Ministers, because we must make this work. We have to stop the boats: that is what the Prime Minister has said, and I will back him until we do. We must stop the boats.",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_freeport/content_16.html": "On 13 July, I submitted a briefing on why a Freeport in Don Valley would be a great idea in response to the Government's Freeport Consultation.\nThe transformation of Doncaster Sheffield Airport (DSA) would be great news for Doncaster and would make the most of DSA and the iPort. It could bring thousands of jobs to the area and give the young people of Don Valley a wonderful future.\nPlease find below a digital copy, which you may wish to download.\nYours faithfully,\nNick Fletcher MP",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_category_Speeches/content_9.html": "MY VALUES AS A CONSERVATIVE MP 9th June 2023 MY VALUES I gave the opening speech on 9 June 2023 at the second NRG Conference held in Doncaster. I outlined my values and where we can go as a region, not... Speeches",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_parliament/content_2.html": "My question in Parliament today to Jacob Reece-mogg about future funding for Doncaster in aerospace research. Doncaster Sheffield Airport is currently working with The AMRC and AirVehicles Airlander.\nOn 23rd February, I spoke at the opposition debate on the need to support businesses and individuals during and after the coronavirus pandemic.\nAs I set out in my speech, I strongly believe that the best way the Government can help individuals and businesses is by pushing forward with its lev",
  "https_www_nickfletcher_org_uk_/https_www_nickfletcher_org_uk_news_nick-fletcher-mp-business-question/content_10.html": "My question in Parliament today to Jacob Reece-mogg about future funding for Doncaster in aerospace research. Doncaster Sheffield Airport is currently working with The AMRC and AirVehicles Airlander. The AMRC and AirVehicles will hopefully both hugely help towards our net zero goal and employ and train many local people. The levelling up agenda is my agenda. Jobs and prosperity for Doncaster. This is so our future will be as exciting as its past."
}