{
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_intervention-debate-me-1-may-2024/content_14.html": "Tweet Wednesday, 1 May, 2024 Speeches in Parliament Today I intervened in a debate on ME. You may also be interested in In Parliament On this page, you can read Danny Kruger's latest speeches and appearances in Parliament (provided by Parliamentlive.tv):\nIn Parliament On this page, you can read Danny Kruger's latest speeches and appearances in Parliament (provided by Parliamentlive.tv):\nNewsletter - 28 April, 2025 Monday, 28 April, 2025 Happy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_marlborough-benefit-ps950k-football-pitch-thanks-lionesses-futures-fund-10-april-2025/content_60.html": "I am very pleased to hear that the Excalibur Academies Trust is set to receive £950k from the Lionesses Futures Fund for a new 3G football pitch at St John's school. The project will enable local grassroots club Marlborough Youth FC to establish an additional nine women's and girls' teams within five years of the pitch opening, and will also be used to host training sessions for the local rugby club. I hope in years to come we will see players from Marlborough joining the Lionesses and representing England!",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_category_Westminster-News/content_6.html": "Coronavirus meetings and surgeries update 24th March 2020 This post is to confirm that all my scheduled/proposed face-to-face local meetings and surgeries are being postponed indefinitely, in line with Government... Westminster News",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_westminster-hall-debate-eating-disorders-1-april-2025/content_33.html": "The NHS is one of the foundations of our society. We depend on it at every stage of our lives. The Government has made the biggest investment in the NHS in its history, increasing its budget by 45% since 2019.\nHappy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_speech-medical-regulation-antidepressants-and-covid-vaccines-16-january-2025/content_37.html": "The NHS is one of the foundations of our society. We depend on it at every stage of our lives. The Government has made the biggest investment in the NHS in its history, increasing its budget by 45% since 2019.\nHappy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_solar-farms-wiltshire-and-developing-strategy-9-march-2025/content_58.html": "As the sun shines brightly over East Wiltshire this week, my thoughts turn to solar investment. I am concerned that a more strategic approach in Wiltshire is needed, so that these industrial investments go where they make sense and are strategically aligned with the needs of the grid. Too much prime agricultural land is being lost, threatening our national food supply.\nNot only that, but I worry with the system as it stands we are wasting huge amounts of public resources in having to deal with poorly prepared applications. There is a backlog on the grid and much clutter in the planning system, which impacts negatively on communities and needs to be addressed.\nTalks with Wiltshire Council prove they share my frustrations. When I suggested developing a strategic map for solar in the county, building on the new land-use framework, I was reassured to learn that the council is actively undertaking various projects to purposively plan renewable energy sites in the county. Part of this work is being conducted with local communities who will house the developments and benefit directly from the energy generated. This avoids the issue of large-scale solar farms which have no positive benefit to local residents and see energy shipped off elsewhere.\nA reset of the national planning process is still needed though, with revisions to take account of the financial incentives behind large solar development and better protection of our agricultural land and the communities living around it. I will continue to lobby Government to tackle holes in national policy which, if addressed, will allow local planning authorities to more robustly defend against problematic applications.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news/content_2.html": "Newsletter - 28 April, 2025 Monday, 28 April, 2025 Happy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend. Before the break I spoke in Parliament about the persecuted church abroad, and referenced my work as chair of the All-Party Group for Christians in the Holy Land (see here ). I wasn’t aware until the obituaries... Articles\nUpdate to rail service to Paddington - 15 April, 2025 15th April 2025 GWR has been in touch to alert me to the fact that Network Rail will be carrying out essential upgrades to the track in the Acton area between Friday 18 April... Local News\nSupport your Conservative Wiltshire Councillors in the May 1st elections! - 15 April, 2025 15th April 2025 https://youtube.com/shorts/ed7LIgASuE0 Articles\nLetter to Home Office regarding Wiltshire Police's funding - 14 April, 2025 14th April 2025 Very pleased to join forces with my fellow Wiltshire MPs to send this important letter regarding police funding, and how the way it is calculated puts Wiltshire... Articles\nUpdate to safety at Pewsey level crossing - 10 April, 2025 10th April 2025 Following a recent meeting with Network Rail’s Level Crossing Manager at the site of the tragic incident involving a lady attempting to cross the track, I am... Articles\nMarlborough to benefit from £950k football pitch thanks to Lionesses Futures Fund - 10 April, 2025 10th April 2025 I am very pleased to hear that the Excalibur Academies Trust is set to receive £950k from the Lionesses Futures Fund for a new 3G football pitch at St John's... Articles\nThe impact of cuts to funding for children and young people with eating disorders - 10 April, 2025 10th April 2025 I have been contacted by parents of patients with eating disorders who are deeply worried about the impact of potential spending cuts to children and young... Articles\nA meeting with the CEO of Great Western Hospital - 10 April, 2025 10th April 2025 I met with GWH chief exec to catch up on waiting lists (still too high) and hear about the support they give to people leaving hospital into social care. They... Articles\nWestminster Hall debate on Persecution of Christians - 8 April, 2025 8th April 2025 https://youtu.be/FGPIZGdv_ec Articles\nA visit to Marlborough Youth Club - 8 April, 2025 8th April 2025 So inspired by Lisa and the team at Marlborough Youth Club - dozens of young people from the town and villages playing football, pool, karaoke, eating pizza and... Articles",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_category_Local-News/content_18.html": "Update to rail service to Paddington - 15 April, 2025 15th April 2025 GWR has been in touch to alert me to the fact that Network Rail will be carrying out essential upgrades to the track in the Acton area between Friday 18 April... Local News\nDriving to walk your dog or exercise during lockdown 1st April 2020 A lot of people have been in touch to ask about the rules on taking exercise - and specifically whether it's ok to drive a short distance to the open country to... Local News\nCoronavirus: Constituents stranded abroad 24th March 2020 I am working with a number of Constituents who are currently abroad who want to return to the UK and I am continuing to raise specific details with Foreign &... Local News",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_traffic-a346-3-march-2025/content_20.html": "The A338/A346 is dangerous, because of the HGVs I so often write about, and also because of speeding. In November a gentleman was turning out of his daughter and son-in-law’s farm onto the road near the Ogbournes when he was hit from behind; he is still in hospital now. I met his family and other neighbours to hear tales of accidents and near-misses on this stretch where blind dips make it lethal when people speed, as they do on this open, straight Roman road.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_pmq-labours-cuts-benefits-disabled-people-19-march-2025/content_41.html": "The NHS is one of the foundations of our society. We depend on it at every stage of our lives. The Government has made the biggest investment in the NHS in its history, increasing its budget by 45% since 2019.\nHappy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_danny-kruger-reacts-desecration-stonehenge-just-stop-oil-protesters-19-june-2024/content_39.html": "The vandals who desecrated Stonehenge today should be denied bail.\nIt is completely unacceptable for people to damage one of our most important national monuments and try to justify it as political activism.\nI'm pleased arrests were made quickly by Wiltshire Police and, if found guilty, the perpetrators must be punished with the full force of the law. We must send the strongest possible signal that people cannot desecrate national monuments in pursuit of a political agenda.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_parking-and-funding-issues-kamp-surgery-marlborough-28-march-2025/content_48.html": "I met with Sally-Ann Vesey-Thompson, Finance Manager at the KAMP Surgery in Marlborough to talk about the problems they are having trying to accommodate their patients while being limited by their small carpark. The surgery is looking into how they can best support their elderly patients on a limited budget, while also having to absorb the increases in National Insurance Contributions (£50k!) and other costs - not an easy task. I will see what funding is available to help them continue to provide the best service they can.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_speech-spring-budget-7-march-2024/content_11.html": "Yesterday’s budget had some important and useful measures. I welcome the cut in National Insurance contributions, the (limited) rise in the VAT threshold, the extension of the Household Support Fund for vulnerable families, the new incentives to save and invest, and the plans to boost productivity in the public sector.\nInflation is down, wages are up, mortgage rates are falling and the economy is coming out of recession. All good.\nIn my speech in the budget debate today I praised the new measures while also expressing my deeper concern about the economic model of the UK, which began under Labour but continued since 2010. This century we have built an economy on cheap money (low interest rates and money printing, which has radically exacerbated asset inequality), cheap labour (low wage migration, depressing wages and putting unsustainable pressure on housing and public services) and cheap imports (imposing costs on our producers while we import products made with lower standards and more carbon emissions from abroad).\nWe need profound reform, which will take years. But in my speech I set out four things I think we need immediately:\n1. Tax cuts for small businesses\n2. More housing where it’s needed\n3. Welfare reform to get some of the millions of economically inactive people into work\n4. Defence spending to make us safe and boost the domestic supply chain.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_cdn-cgi_l_email-protection/content_45.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_campaigns_wiltshire-economy-skills-jobs-and-housing/content_46.html": "The glory of Wiltshire is its antiquity, the beauty of its landscape and the old-fashioned charm of its villages and market towns. But as the ancient monuments and the settlements show, this tranquil landscape has been used by human beings - farmed, worshipped, lived in - for all these long years. It is not a museum. It is a place of habitation and of work, and must continue as such.\nThe secret to Wiltshire’s prosperity over the centuries is innovation in agriculture and in other industries - most notably, in our day, in the new sectors of high-tech defence and cyber. We are perfectly situated on the road and rail line between London, Reading, Swindon and Bristol. Porton Down and Corsham are globally significant hubs of science and technology, and GCHQ is up the road in Cheltenham.\nAt its best Wiltshire is the ideal of modern life: somewhere to ‘live local, work global’. You can be part of the community and also part of the national and international economy. It’s somewhere that traditional trades, particularly farming, can thrive and benefit from innovation. It’s somewhere young people can aspire to a good life for themselves and their children in due course. And it’s somewhere with the prosperity and the amenities for older people to enjoy a comfortable retirement.\nBut a lot more needs to be done to make this a reality for everyone who wants it. We need more and better skills training, more support for the businesses that create the jobs, and more affordable housing for local families.\nOn skills, I support a transfer of public money from the universities sector to Further Education and apprenticeships. The Government has introduced modern apprentices which are creating real opportunities for many young people; but we need to do more. University should not be the default option for all school leavers. Many young people would do better - earn more, more quickly, with greater satisfaction and a lot less debt - if they were helped into a vocational course and a trade when they left school.\nThe Chancellor’s 2023 Autumn Statement included the biggest business tax cut in modern British history. This included a £4.3 billion package to help small businesses with the cost of their business rates, saving an average shop £1,650, and extending the Retail, Hospitality and Leisure relief, benefitting 230,000 properties. The Government has also raised the VAT registration threshold to £90,000. Over 28,000 businesses will benefit in 2024-25 from no longer being VAT registered.\nI’d like to go a lot further, substantially raising the VAT threshold, reforming business rates and scrapping the planning laws that stop businesses expanding. And we need to do more to help individuals and families keep more of the money they earn, to encourage enterprise and ensure more money circulates in our local economy.\nOn housing, like everywhere in the South of England we are experiencing an acute shortage of homes for families on ordinary incomes. I support the building of new houses, especially in the west of the county where land is cheaper; but all our villages and towns are capable of a modest expansion. I find most people supportive of incremental, organic growth in our settlements to help house our growing population. What most people, including me, object to are large-scale, often ugly, developments being imposed on local communities against their wishes.\nI have successfully lobbied the Government to reform the planning rules to stop developers gaming the system to do this; but more must be done to get the right sort of housing in the places and the quantities that communities need. I am a particular fan of community-led housing, such as the proposal for a Community Land Trust in Pewsey, which will create affordable housing for local families with the full consent of the neighbourhood.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_campaigns_getting-around-and-getting-online/content_4.html": "Connectivity is key to a place like Wiltshire. Our market towns and villages, and our outlying farms and cottages, depend on decent transport and decent broadband.\nI probably get more correspondence about potholes than any other subject. Driving around Wiltshire, especially when there is water on the roads, is a high-risk venture for tires. The Government has recognised the problem, which is nationwide, by committing an additional £8.3 billion to fixing potholes.\nI always take complaints about specific road issues straight to the council, and I will continue to fight for faster and more permanent fixes to the craters that pockmark our roads if re-elected.\nI'm pleased that rural travel in Wiltshire is improving. I lobbied Government for a grant to invest in an innovative new bus system, which I'm glad to say we won - so there is now a 'demand-responsive' bus service, called Wiltshire Connect, in the Vale of Pewsey and Marlborough area. Rather than large, and largely empty, buses trundling up and down the same routes every day, Wiltshire Connect responds to the need for travel by picking a route each day that suits the passengers - like a taxi. You can find out more and book your trip here. I will continue to campaign for better public transport across the county.\nBroadband coverage has increased markedly since I was elected in 2019, with 94% of homes in the constituency now having superfast broadband availability (capable of receiving download speeds of at least 30 Mbps). But we still have too many areas where the internet is slow or non-existent, either because broadband is still routed through old copper wires or because there's no mobile signal - or both. I will continue to push for a faster roll-out of the gigabit programme, and to raise particular cold spots with BT Broadband.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_visit-three-trees-farm-shop-and-cafe-swindon-13-september-2024/content_26.html": "With Ian, farmer and entrepreneur - Lovely local produce at Three Trees Farm shop including meat from the farm - processed locally, but only so long as the abattoirs can keep going. We need to ensure local producers can process and sell more of their food in the area",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_campaigns_nhs-and-social-care/content_34.html": "The NHS is one of the foundations of our society. We depend on it at every stage of our lives. The Government has made the biggest investment in the NHS in its history, increasing its budget by 45% since 2019. 40 new GPs and primary care nurses have been recruited to work in our constituency in that time.\nBut it is much too hard to see a doctor or a dentist. Waiting times for hospital appointments remain far too long. And too often the NHS struggles to provide the flexible, timely, cost-effective and compassionate care that people need.\nThe NHS is rightly popular because of its commitment to deliver healthcare for free, based on need not ability to pay - and because of its heroic staff. The funding it has received has enabled it to invest in new equipment and medicines that have been of huge benefit to millions of people, and enabled more of us to live longer despite serious health conditions.\nAneurin Bevan’s dream of providing all the healthcare needs of the whole population via a single Government department was always going to be difficult to achieve. But it was easier in an age when people only needed a doctor occasionally and for short periods - before we had an ageing population, before widespread obesity, before one in four working-age people had long-term chronic health conditions.\nThe future model of the NHS should not be a topic for political warfare. We need a conversation as a country about how to fund and deliver the core aspiration we all believe in: top quality care for everyone, regardless of their ability to pay. And alongside this we need to organise a far better system of social care - the non-medical help given to people recovering from ill health, with disabilities, or in old age - that doesn’t disproportionately penalise people who have worked hard and saved for their retirement.\nMy sense of what the NHS should be like was confirmed by the conversation I had with a famous Marlborough doctor, Dr Nick Maurice, who is himself the last in a long line of Dr Maurice’s in Marlborough going back to the 1790s. Nick explained to me what local family doctoring was like when he was a young GP in the 70s and 80s. There was less demand, so he could spend proper time with patients. Patients themselves took more responsibility for their health - partly because diet and ‘natural exercise’ (walking more) were so much better. And front-line health professionals were trusted to get on with their jobs without a vast bureaucracy overseeing, and second-guessing, their every move. You can watch the recording of our conversation in Marlborough Town Hall here.\nThe future NHS will look very different from the one we made in the 1940s. But some of the old ideas - the human-shaped health service, and one available equally to everyone - need to be recovered.\nThe same goes for the social care system. The council spends 60% of its income supporting people in their homes, and in residential care. But too many people struggle to get the support they need; family carers are not supported enough by the benefits system; care workers are underpaid (which partly accounts for our high immigration numbers); and people who have worked hard and saved money to buy a house or investment, are penalised by care costs while the taxpayer looks after everyone else. The whole system needs reform and following extensive conversations locally, I have written and spoken about what a better care system would look like (see here).",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_westminster-hall-speech-use-foodbanks-19-november-2024/content_50.html": "The glory of Wiltshire is its antiquity, the beauty of its landscape and the old-fashioned charm of its villages and market towns. But as the ancient monuments and the settlements show, this tranquil landscape has been used by human beings - farmed, worshipped, lived in - for all these long years.\nHappy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_questions-welfare-minister-cost-labours-inactivity-3-february-2025/content_56.html": "Tweet Monday, 3 February, 2025 Articles https://youtu.be/ujWdAd9m9uE You may also be interested in In Parliament On this page, you can read Danny Kruger's latest speeches and appearances in Parliament (provided by Parliamentlive.tv):\nIn Parliament On this page, you can read Danny Kruger's latest speeches and appearances in Parliament (provided by Parliamentlive.tv):\nNewsletter - 28 April, 2025 Monday, 28 April, 2025 Happy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_westminster-hall-debate-international-health-regulations-friday-december-22/content_43.html": "On Monday I spoke in a debate in Parliament about the proposed World Health Organisation treaty and the amendments to the International Health Regulations. I was encouraged that the Minister responded by stating clearly that the UK will never sign an agreement that gives the WHO the power to mandate lockdowns or other interventions without the consent of Parliament.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_improvements-wiltshire-police-22nd-may-2024/content_47.html": "It's great news that Wiltshire Police this week were taken out of 'special measures' - the state they entered under the previous leadership of the force. The new Police and Crime Commissioner Philip Wilkinson and Chief Constable Catherine Roper have done great work prioritising the crime that blights the lives of Wiltshire residents and streamlining their internal procedures, including the previously very poor system for responding to enquiries and complaints from the public. Since the last election the Government has delivered its pledge on police numbers and we now have more than 200 new coppers in Wiltshire. We have seen real improvements on rural crime, organised crime, violence against women and girls, and car crime, and I look forward to working with them to ensure further improvements.\nSee here for more information.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_parliament/content_15.html": "Tweet On this page, you can read Danny Kruger's latest speeches and appearances in Parliament (provided by Parliamentlive.tv):\nWestminster Hall debate on Persecution of Christians - 8 April, 2025 Tuesday, 8 April, 2025 https://youtu.be/FGPIZGdv_ec\nWestminster Hall debate on eating disorders - 1 April, 2025 Tuesday, 1 April, 2025 https://youtu.be/8wy8tcCOHIs\nPMQ on Labour's cuts to benefits for disabled people - 19 March, 2025 Wednesday, 19 March, 2025 https://youtu.be/fjJrvlk-LMo\nWestminster Hall debate on compensation for WASPI women - 17 March, 2025 Tuesday, 18 March, 2025 https://youtu.be/9hjbsQHCeWA\nQuestions on the Winter Fuel Payment - 17 March, 2025 Monday, 17 March, 2025 Given the scandalous failure of the pension credit campaign, the Government must release all available data on the impact of the Winter Fuel Payment cut\nQuestions to the Welfare Minister on the cost of Labour's inactivity - 3 February, 2025 Monday, 3 February, 2025 https://youtu.be/ujWdAd9m9uE\nWestminster Hall debate on the Listed Places of Worship Grant Scheme - 22 January, 2025 Wednesday, 22 January, 2025 https://youtu.be/6lLVbjxBxr0\nSpeech on medical regulation (antidepressants and COVID vaccines) - 16 January, 2025 Thursday, 16 January, 2025 https://youtu.be/xDinHPJOIoE\nSpeech on financial support for adoptive parents - 14 January, 2025 Tuesday, 14 January, 2025 https://youtu.be/kxJ56mSmgVI",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk/content_1.html": "Newsletter - 28 April, 2025 28th April 2025 Read full article Website search Search your keywords: Filter by type - Any -CampaignEventNewsPagePerson Update to rail service to Paddington - 15 April, 2025 15th April 2025 Read full article Am I your MP? Enter your postcode Postcode Support your Conservative Wiltshire Councillors in the May 1st elections! - 15 April, 2025 15th April 2025 Read full article\nSupport your Conservative Wiltshire Councillors in the May 1st elections! - 15 April, 2025 15th April 2025 Read full article",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_campaigns_crime/content_28.html": "Crime is the great scourge of a civilised society. The cost of crime is not just the damage done by criminals but the huge expense and effort we have to put into protecting ourselves from it.\nI was elected in 2019 on a manifesto promise to recruit 20,000 more police officers in England and Wales. That target has been met, with over 210 new officers in Wiltshire.\nCrime is coming down overall but that’s no comfort to individual victims. And for too long the police in Wiltshire failed to deter or detect crime properly. Fittingly the force was placed in special measures.\nSince the election of the Conservative Police and Crime Commissioner Philip Wilkinson in 2021 the management, culture and performance of Wiltshire Police has started to improve markedly. Action on sexual assault and domestic abuse has increased sixfold. All burglaries are now attended and investigated by the police, and 999 response times have halved. Wiltshire Police is now the top performing force in the country for responding to car crime and for drug and county line disruptions. 86% of victims report they are satisfied by the actions of the police.\nI am particularly concerned about rural crime. People living in isolated communities, and dependent on expensive assets - cars, farming machinery - for their livelihoods, are especially vulnerable to burglary. And like rural communities across the country we suffer from the damage done by the appalling crime of illegal hare coursing, perpetrated by organised criminal gangs who make large sums of money from people watching their hunts and gambling online.\nAs Philip told me in the video above, he is leading the national effort to combat hare coursing and we are seeing robust action here in Wiltshire.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_immersed-community-chapter-1-six-generations-dr-maurices-marlborough/content_40.html": "\"Immersed in the community”: Interview with Dr Nick Maurice, the 6th generation of family doctors in Marlborough, Wiltshire - discussing the spirit of healthcare in a local neighbourhood, how we’ve gone wrong and how to put it right.\n\"Immersed in the community”: Interview with Dr Nick Maurice, the 6th generation of family doctors in Marlborough, Wiltshire - discussing the spirit of healthcare in a local neighbourhood, how we’ve gone wrong and how to put it right.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_campaigns_british-army-wiltshire/content_27.html": "I am proud to represent the constituency with the largest number of British soldiers in the country. 20,000 serving personnel are stationed in the camps and garrisons at Tidworth, Netheravon, Bulford, Larkhill, Perham Down and Upavon.\nIn recent years the armoured brigades have been successfully repatriated from Germany and I'm glad that the military and civilian communities around the Plain have integrated so happily.\nArmy accommodation in our area continues to improve. Nevertheless there is still not enough high-standard housing, or housing big enough, for Army families. I have campaigned for improvements here and I am hopeful that the new accommodation offer that the Government is planning will see real progress.\nMy overall concern - perhaps the most important issue we face as a country - is that our national defence is simply not strong enough for the tasks we may require of it in the years ahead. After the Cold War we thought we had a 'peace dividend', and steadily defunded the Armed Forces. Now we are scrambling to rearm, and I commend the Government for the very significant additional investment we have seen, with the defence budget growing by 30% since 2019 - from £38 billion to £51 billion. We are now spending around 2.25% of GDP on defence, which is a lot more than most of our European allies.\nBut it is still not enough.\nI have campaigned vigorously for additional spending - as well as for reform of the MOD procurement process which sees so much of the current budget waste - and I will continue to do so.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_urgent-question-who-treaty-14-may-2024/content_24.html": "Tweet Tuesday, 14 May, 2024 Speeches in Parliament Today I asked an Urgent Question on the WHO Treaty. You may also be interested in In Parliament On this page, you can read Danny Kruger's latest speeches and appearances in Parliament (provided by Parliamentlive.tv):\nIn Parliament On this page, you can read Danny Kruger's latest speeches and appearances in Parliament (provided by Parliamentlive.tv):\nNewsletter - 28 April, 2025 Monday, 28 April, 2025 Happy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_discussing-potholes-speeding-and-rural-crime-councillor-stuart-wheeler-11-june-2024/content_52.html": "Tweet Tuesday, 11 June, 2024 Articles Discussing potholes, speeding and rural crime with Councillor Stuart Wheeler - 11 June, 2024 You may also be interested in Crime Crime is the great scourge of a civilised society.\nNewsletter - 28 April, 2025 Monday, 28 April, 2025 Happy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_update-rail-service-paddington-15-april-2025/content_9.html": "GWR has been in touch to alert me to the fact that Network Rail will be carrying out essential upgrades to the track in the Acton area between Friday 18 April and Monday 21 April. This, no doubt, means a degree of inevitable chaos over Easter, with reduced timetables between Reading and Paddington.\nWhile I accept essential upgrades are needed in the interests of both safety and reliability, I am acutely aware of the frustrations many of my constituents have with the current train services. There are too many tales of trains being cancelled and delays. Added to this, trains are crowded, prices are high and the reduced service between London and Great Bedwyn remains a thorny issue.\nFollowing on from the work I did on this with Laura Farris in the last government, I met recently with neighbouring MP Lee Dillon, and the tenacious team at Bedwyn Trains Passenger Group. Between us, we intend to keep the pressure on to restore the timetable to how it was pre-pandemic.\nTo this end, I was pleased to learn that GWR has been given permission by the DfT to look at securing additional rolling stock, although these new trains will take a while to come into service as a substantial number of drivers and guards need to be trained. This is good news as it will ultimately allow GWR to review its future timetable provision, including potentially for Kintbury, Hungerford and Bedwyn.\nThe preferred long-term solution would be further electrification of the line through to Westbury and the restoration of an additional platform at Westbury station, but there seems little prospect of funding for these schemes at the moment. GWR also tell me they are looking at the long-term replacement of their local diesel trains with battery-electric trains. Again, this would allow a review of timetabling but is subject to securing funding and unlikely to be in service until at least the 2030s.\nI will continue to do all I can to improve the commute for the large number of constituents who work in or regularly travel to London - many of whom moved to the area in recent years in order to make use of the train service into Paddington!",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_question-inheritance-tax-farmers-4-december-2024/content_31.html": "We have an absolute moral obligation to steward the natural environment that we live in, and to ensure a good living for the people who look after the land.\nIn the 20th century farming pulled off a miracle of productivity, generating huge yields to feed our growing urban population.\nHappy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_sunflowers-nursery-east-grafton-after-theft-two-minibuses-11-june-2024/content_38.html": "Tweet Tuesday, 11 June, 2024 Articles At the Sunflowers nursery in East Grafton, after the theft of two minibuses - 11 June, 2024 You may also be interested in Crime Crime is the great scourge of a civilised society.\nNewsletter - 28 April, 2025 Monday, 28 April, 2025 Happy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_category_Articles/content_7.html": "Newsletter - 28 April, 2025 28th April 2025 Happy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning... Articles\nSupport your Conservative Wiltshire Councillors in the May 1st elections! - 15 April, 2025 15th April 2025 https://youtube.com/shorts/ed7LIgASuE0 Articles\nLetter to Home Office regarding Wiltshire Police's funding - 14 April, 2025 14th April 2025 Very pleased to join forces with my fellow Wiltshire MPs to send this important letter regarding police funding, and how the way it is calculated puts Wiltshire... Articles\nUpdate to safety at Pewsey level crossing - 10 April, 2025 10th April 2025 Following a recent meeting with Network Rail’s Level Crossing Manager at the site of the tragic incident involving a lady attempting to cross the track, I am... Articles\nMarlborough to benefit from £950k football pitch thanks to Lionesses Futures Fund - 10 April, 2025 10th April 2025 I am very pleased to hear that the Excalibur Academies Trust is set to receive £950k from the Lionesses Futures Fund for a new 3G football pitch at St John's... Articles\nThe impact of cuts to funding for children and young people with eating disorders - 10 April, 2025 10th April 2025 I have been contacted by parents of patients with eating disorders who are deeply worried about the impact of potential spending cuts to children and young... Articles\nA meeting with the CEO of Great Western Hospital - 10 April, 2025 10th April 2025 I met with GWH chief exec to catch up on waiting lists (still too high) and hear about the support they give to people leaving hospital into social care. They... Articles\nWestminster Hall debate on Persecution of Christians - 8 April, 2025 8th April 2025 https://youtu.be/FGPIZGdv_ec Articles\nA visit to Marlborough Youth Club - 8 April, 2025 8th April 2025 So inspired by Lisa and the team at Marlborough Youth Club - dozens of young people from the town and villages playing football, pool, karaoke, eating pizza and... Articles",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_cookies/content_21.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_discussing-a303-and-traffic-berwick-st-james-21-september-2024/content_13.html": "It was great to meet residents of Berwick St James this morning. As expected, the cancellation of the Stonehenge tunnel scheme was a key issue. Now the tunnel isn’t happening there must be road improvements made around the A303 to relieve traffic that jams the villages whenever there’s an accident or delays on the main roads. I will be visiting other villages affected and continuing to push Wiltshire Council and the Government for solutions.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_category_Speeches-in-Parliament/content_8.html": "Urgent Question on the WHO Treaty - 14 May 2024 14th May 2024 Today I asked an Urgent Question on the WHO Treaty. Speeches in Parliament\nIntervention in Debate on ME - 1 May 2024 1st May 2024 Today I intervened in a debate on ME. Speeches in Parliament\nSpeech on Assisted Suicide - 29 April 2024 29th April 2024 Today I spoke in a Westminster Hall debate against legalizing Assisted Suicide. Speeches in Parliament\nSpeech on Excess Deaths - 18 April 2024 18th April 2024 Today I spoke in a debate on excess deaths. Speeches in Parliament\nQuestion on High Income Child Benefit Charge - 13 March 2024 13th March 2024 Today I asked the Chancellor about the High Income Benefit Charge. Speeches in Parliament\nSpeech on Spring Budget - 7 March 2024 7th March 2024 Yesterday’s budget had some important and useful measures. I welcome the cut in National Insurance contributions, the (limited) rise in the VAT threshold, the... Speeches in Parliament\nDebate on the future of horseracing and affordability checks - 28 February, 2024 28th February 2024 This week I attended the debate on the future of horseracing, which is threatened by the new affordability checks on gambling. The arguments against these... Speeches in Parliament\nMy Vote Against the Safety of the Rwanda Bill - Danny Kruger MP 17th January 2024 Last night I voted against the Third Reading of the Safety of Rwanda Bill. It passed, however, and now proceeds to the House of Lords. I spoke briefly in the... Speeches in Parliament\nWestminster Hall debate on the International Health Regulations - Friday, December 22 22nd December 2023 On Monday I spoke in a debate in Parliament about the proposed World Health Organisation treaty and the amendments to the International Health Regulations. I... Speeches in Parliament",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_campaign-military-families-be-exempt-vat-school-fees-28-october-2024/content_51.html": "Thank you to all who have written to me to share their views on the addition of VAT to school fees, and for those who were able to attend my drop in in Larkhill earlier this month to give their own perspectives/experiences. It was excellent to have more than 50 people attend, but the overarching message of the day was that many people will have to consider whether to remain in the Armed Forces if their children's school fees are taxed. I'm unable to respond to everyone who has written individually, or who spoke on the day, but all comments have been gratefully received and have informed my campaign.\nI have been lobbying the Government to consider an exemption for military families from this tax. These parents use use boarding schools because their jobs mean they move home almost annually, or are posted abroad at short notice, and day schools simply can’t provide the continuity of education they need. I wrote to the Department for Education earlier this month to raise my concerns and to request an exemption for military families. I received a response at the end of last week, which you can read below, although I'm afraid it did not directly address my request.\nThat said, there were encouraging hints in the Sunday papers that the Government will offer military families a reprieve from the planned taxation on education, as I had suggested. This is good news, if true, but the relief must cover ALL military families with children in independent schools, not just those who currently get support from the government.\nThis tax is wrong in itself, wrong in principle; but it is particularly bad in its effect on our armed forces personnel, who have to move home frequently and for whom boarding school is the only way to give their children any continuity in their education. I very much hope to receive a positive update on this issue in the Budget this week.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_category_Opinions/content_5.html": "The Grooming Gangs Scandal 13th January 2025 The appalling scandal of the grooming gangs in English towns - well known already, but brought to attention once again thanks to Elon Musk - demands a proper... Opinions",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_m4-dorset-coast-strategic-study-and-what-it-really-means-east-wiltshire-7-march-2025/content_16.html": "I'm very pleased that after many years of waiting, the M4 to Dorset Coast strategic study which was undertaken by National Highways has now concluded, and I have read their final report.\nThe study was started in 2020 after the Government's roads investment strategy highlighted the need for a main strategic route connecting the ports on the Dorset coast with the M4. Wiltshire falls in between the two, and as a result our roads are used daily to transport products and services, provide access to jobs and facilitate trade and investment across the country. This is right and unavoidable, but there is a very real need to separate local and strategic traffic - large HGVs and freight traffic should not be using local roads as part of this route when it isn't absolutely necessary. The existing strategic route is relatively indirect for journeys between the M4 and Dorset Coast, meaning long journeys or the use of more local roads when this is not necessarily appropriate.\nI'm delighted, after years of campaigning on this subject, that the proposed corridor (see map above) between the M4 and Dorset coast does not intend to route traffic along the A338 and A346, through Marlborough and villages. This route is currently a favourite of HGV drivers, causing havoc in our villages that are not designed to accommodate such large vehicles, and leading to huge congestion issues around Marlborough.\nThe report acknowledges that, while the Government can recommend a strategic route for long-distance traffic, it is not always possible to stop drivers from using them. Because of this there will be some local recommendations made 'to improve safety and access to public transport, and to reduce noise and make roads easier to cross' on the A338/A346 through East Wiltshire. I welcome the commitment to avoid Marlborough and the surrounding villages, and the indication that improvements to the road will be coming, but much more clarity will be needed. It is my view that there is still an opportunity to divert even more non-local traffic away from these roads by engaging with the Satnav companies which work with HGV and freight transport providers to agree that local roads should not be shown as a suitable alternative to the main routes.\nIt's also been recognised in the report that the existing strategic route via the A36 through Salisbury and up into Warminster has a 'relatively high number of collisions', particularly between Stapleford (in my constituency) and Salisbury, and that a higher than average proportion of the collisions on this section also result in death or serious injury.\nI have serious concerns about what improvements (if any) will be made to help the villages along the A36 out of Salisbury which will be impacted by increased HGV traffic. The report suggests a de-trunking of the A36 north of Warminster, but does not explain how villages like South Newton, Great Wishford, Stoford and Stapleford will be considered.\nThese villages are also regularly impacted by the ongoing traffic issues on the A303 around Stonehenge. To suggest they also accommodate higher numbers of larger vehicles without addressing the existing issues they face on a regular basis is not enough. The Government has cancelled a multi-billion pound improvement to the roads in Wiltshire by scrapping the A303 tunnel scheme. For many years, necessary improvements to the local road network have been pushed back to be addressed when the tunnel was built, but this is now not happening and as such Wiltshire should receive some of the money saved to address the problems which have been put off for so long. While not in my constituency, the report's preferred route relies heavily on a proper traffic system for HGVs around Salisbury - a long-running and contentious goal that has not been achieved to date. Without this, there'll only be more rat-running through villages.\nThe study's recommendations will now be considered further by Government and by local stakeholders, such as Wiltshire Council, and a programme of further development work will be undertaken to develop more detailed options for investment in our roads. I hope the issues I have raised above for East Wiltshire will be addressed in the next stage. If the East-West route through the constituency (the A303 tunnel) isn't going ahead, we urgently need improvements to the North-South roads. This study is broadly welcome but the investment MUST come.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_speech-terminally-ill-adults-end-life-bill-committee-21-january-2025/content_55.html": "The NHS is one of the foundations of our society. We depend on it at every stage of our lives. The Government has made the biggest investment in the NHS in its history, increasing its budget by 45% since 2019.\nHappy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_question-policing-minister-organised-rural-crime-25-november-2024/content_35.html": "Tweet Monday, 25 November, 2024 Articles https://youtu.be/uDD8LF7NRxo You may also be interested in Crime Crime is the great scourge of a civilised society.\nNewsletter - 28 April, 2025 Monday, 28 April, 2025 Happy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_speech-assisted-suicide-29-april-2024/content_19.html": "Tweet Monday, 29 April, 2024 Speeches in Parliament Today I spoke in a Westminster Hall debate against legalizing Assisted Suicide. You may also be interested in In Parliament On this page, you can read Danny Kruger's latest speeches and appearances in Parliament (provided by Parliamentlive.tv):\nIn Parliament On this page, you can read Danny Kruger's latest speeches and appearances in Parliament (provided by Parliamentlive.tv):\nNewsletter - 28 April, 2025 Monday, 28 April, 2025 Happy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_category_Holyrood-News/content_49.html": "Newsletter - 22 September, 2024 22nd September 2024 Parliament is in recess, for the Party Conferences. Ed Davey, of the Liberal Democrats, has endeared himself to me with his relentless absurdity; I honour him... Holyrood News",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_campaigns_farming/content_12.html": "We have an absolute moral obligation to steward the natural environment that we live in, and to ensure a good living for the people who look after the land.\nIn the 20th century farming pulled off a miracle of productivity, generating huge yields to feed our growing urban population. But it did so by means of techniques - especially fertilisers and pesticides - that harm the soil and the water. The revolution in food production and processing also saw additives go into our diet to make it last longer and taste more delicious - but at a real cost to our health. The result is an environment and a population that are unhealthy.\nBrexit means the UK no longer has to pay landowners simply to own land - a bad and wasteful system that did nothing for the environment or human health. The challenge now is to bring in a system that supports farmers to do the costly business of environmental stewardship without causing them to sacrifice land needed for food production (especially vital in an age of global insecurity). The new system also needs to be as simple as possible, and to give farmers long-term visibility of the money they can expect to receive. And we need to incentive - and where necessary compel - food processors to make affordable, nutritious food.\nI am glad that following campaigning by me and others, the Government has recognised food production as the primary objective of farming, and ruled that stewardship schemes can only be used for a portion of a farm's land. We still have a way to go to get the farming economy right, however. I am particularly troubled by the incentives in the system to turn agricultural land in our beautiful county over to vast solar farms, and I am campaigning vigorously to change the rules on this.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_events_feed/content_25.html": null,
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_impact-family-farm-tax-8-november-2024/content_59.html": "We have an absolute moral obligation to steward the natural environment that we live in, and to ensure a good living for the people who look after the land.\nIn the 20th century farming pulled off a miracle of productivity, generating huge yields to feed our growing urban population.\nHappy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_visiting-st-marys-primary-school-marlborough-14-march-2025/content_53.html": "The glory of Wiltshire is its antiquity, the beauty of its landscape and the old-fashioned charm of its villages and market towns. But as the ancient monuments and the settlements show, this tranquil landscape has been used by human beings - farmed, worshipped, lived in - for all these long years.\nHappy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_talking-about-bovine-tb-5-march-2025/content_22.html": "Bovine TB remains endemic in English cattle herds and it’s not clear whether the badger cull is definitively helping or not. Either way there is the tragedy of poor testing producing ‘false positives’, namely uninfected (or ‘innocent’ as farmer Jim Butler put it when we spoke) animals that have to be put down, and then inadequate compensation from Defra; all on top of a farming economy that is beset from every angle, including from the government. I discussed all this with Jim and his team, and the vet, at Manor Farm in All Cannings (see here).",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_letter-home-office-regarding-wiltshire-polices-funding-14-april-2025/content_29.html": "Very pleased to join forces with my fellow Wiltshire MPs to send this important letter regarding police funding, and how the way it is calculated puts Wiltshire at an unfair disadvantage.\nWiltshire Police is an improving police force, but this is not reflected in the funding awarded to them.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_question-defence-spending-14-october-2024/content_54.html": "Tweet Monday, 14 October, 2024 Articles Question on Defence spending - 14 October, 2024 You may also be interested in British Army in Wiltshire I am proud to represent the constituency with the largest number of British soldiers in the country.\nBritish Army in Wiltshire I am proud to represent the constituency with the largest number of British soldiers in the country.\nNewsletter - 28 April, 2025 Monday, 28 April, 2025 Happy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_overnight-closures-m4-23rd-january-2025/content_44.html": "From next Monday, between junctions 14 and 15, the eastbound carriageway of the M4 will be shut for a series of nights while resurfacing takes place. Over the course of six(!) weeks, National Highways will be fully closing the eastbound carriageway between 9pm and 6am on the following nights:\nExit from Membury Services will remain open:\n- Monday 27 January\n- Thursday 30 January\n- Thursday 6 February\n- Monday 3 March for two nights\nEntry and exit from Membury Services will be closed:\n- Friday 31 January\n- Friday 2 February\n- Monday 10 February for five nights\n- Monday 24 February for four nights\n- Wednesday 5 March\n- Thursday 6\n- Friday 7 March\nAmongst these dates, there will be regular night time lane closures, but with one or two lanes remaining open. Please check before you leave.\nMarlborough, unfortunately, is going to take the brunt of the HGV traffic during this period. HGVs are to be routed south along the A346 to Marlborough, and onto Hungerford along the A4. Smaller traffic will be diverted, via the A4192, through Aldbourne and Chilton Foliat, and again on to Hungerford. Satnav will, of course, lead to weeks of frustration and traffic chaos around Marlborough, as everyone tries to get about their daily lives.\nWiltshire Councillors have fought this hard and had hoped to route all of the traffic north of the M4. My thanks to our Councillors for making the case for our towns and villages to be spared the potential chaos. Unfortunately, this was not deemed possible by the powers that be. However, I am reassured that Wiltshire Council will do what they can to mitigate the worst of the effects, as best they can.\nWe also continue to wait for the results of the M4 to Dorset Coast study which will help those in charge to define appropriate routes for the appropriate traffic. Both Wiltshire Council and I have been asking for this, I am ashamed to admit, for years! This study has the potential to help with a lot of the traffic issues we face here in Wiltshire by investing in strategic routes such as the A303, A350 and A34. Conservative Councilors locally, have pushed Wiltshire and Marlborough Town Councils undertake the Marlborough Congestion study which showed that the A346 will be at capacity before 2040. We badly need investment into our roads to make them safer, and fit for the future.\nUnfortunately, this also comes at a time when concerns are growing about the A346, itself. The accident rate does appear higher than usual, and having been in contact with our PCC, Phil Wilkinson, earlier in the year, I understand that Wiltshire Police's Road Safety Officer has requested a traffic survey at either end of the road to help them ascertain what is happening.\nI am also looking into diversionary routes more generally to see what can be done to push back when these diversions cause chaos in our villages. Whilst they are (technically) spared this time, villages like Baydon and Chiseldon, are often left gridlocked when M4 diversions are in place or when motorway traffic is bad. As is often the case, getting information from large, slow moving, government agencies can take a while, but we will keep pushing.\nThe ever efficient, AI driven satnav will, no doubt, see all manner of ludicrous routes being suggested to unknowing travellers, and evening and nighttime journeys may take a little longer than usual, so please leave a little extra time and care. Unfortunately, this situation has been pushed upon us, so lets try to get through it as painlessly as we can!",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_visit-marlborough-youth-club-8-april-2025/content_3.html": "So inspired by Lisa and the team at Marlborough Youth Club - dozens of young people from the town and villages playing football, pool, karaoke, eating pizza and generally mucking about in a safe and encouraging environment. Lisa is a phenomenon - as is Caroline Thomas, local Wiltshire Councillor for Marlborough East who helps out every week and has made a huge difference raising money and doing the office work for the club. This is a great community institution, giving huge value.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_driving-walk-your-dog-or-exercise-during-lockdown/content_57.html": "A lot of people have been in touch to ask about the rules on taking exercise - and specifically whether it's ok to drive a short distance to the open country to walk your dog (or yourself).\nI just joined the other Wiltshire MPs on a conference call with Kier Pritchard, Chief Constable of Wiltshire Police, to discuss this and other policing issues.\nMr Pritchard confessed to the difficulty of implementing a national rule that doesn't specify exactly what is and isn't allowed - for the natural reason that it’s complicated. He also said he had got it wrong with his initial step, which was to issue posters telling people not to drive anywhere for exercise under any circumstances. This was heavy-handed and didn’t take enough account of the different circumstances in which people might need to travel. Some new posters are on the way.\nThe rule is that people should only drive if necessary. This means going to work or to the shops if they are too far to walk, and for exercise if it is simply not possible to exercise satisfactorily by walking to and from your home.\nFor most people, they can take a stroll round the town or village, or get to open country easily from their front door. A small minority, however, need to drive a short distance to reach the fields, and from what we heard today I’m confident that officers will exercise discretion and judgement in policing this. That doesn’t mean heading to the local beauty spot in Savernake Forest or the Ridgeway, and it doesn't mean the police won’t stop you to ask if you really need to be in your car.\nI am also aware that the Ministry of Defence Police have been advising people not to drive to Salisbury Plain. I am personally of the view that this is excessive - people living close to the Plain, who cannot walk there directly, should be allowed to make a short drive for exercise and dog walking. Mr Pritchard will raise this with MoD Police and see if they can align their advice and tactics.\nWiltshire Police’s vision is ‘policing by consent’. The Government’s approach to self-isolation and social distancing is ‘common sense’. Between these two principles it should be possible for people to work out what’s safe, and the police to monitor us without being heavy-handed.\nIn other news, crime is down! The lockdown is affecting criminals just like the rest of us. That said, we should be very concerned about domestic violence. If you are worried about anyone, please tell the police or social services.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_danny-kruger-farming/content_23.html": "We have an absolute moral obligation to steward the natural environment that we live in, and to ensure a good living for the people who look after the land.\nIn the 20th century farming pulled off a miracle of productivity, generating huge yields to feed our growing urban population.\nHappy Easter! But what a sad day after. ‘Ha muerto el Papa’, I told our taxi driver (thanks to Google Translate) on the way out of Seville on Monday morning, after a very Catholic weekend.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_about-rss/content_10.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_privacy/content_32.html": "This document outlines how Danny Kruger processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Danny Kruger\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Danny Kruger .\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Danny Kruger , or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Danny Kruger via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_afghan-families-living-east-wiltshire-13-february-2025/content_30.html": "I met with the Defence Minister a couple of weeks ago to discuss the relocation of Afghan soldiers and interpreters from the British Army, to whom we have offered a home so they can escape the Taleban in their own country. Note these are not asylum seekers, nor illegal immigrants (as a Reform UK leaflet falsely states). But there are a lot of them here: Wiltshire takes a large proportion of the Afghans because we have military accommodation which serves as transitional housing until they can be permanently settled in their own homes.\nThe process has not been easy and I firmly believe that existing communities have a right to complain about the pressure and impact on local schools, on housing, and on the atmosphere and culture of our area.\nI was pleased to hear there will be a rationalisation of the multiple schemes currently in place to bring these men and their families to the UK. But most of all I was pleased to hear the Minister confirm that local authorities will not be expected to arrange permanent accommodation for them, and that they are not expected to stay in the area where they are temporarily housed. Indeed we know that most of the Afghans, very understandably, wish to live in cities, not in rural Wiltshire.\nThe Minister promised that the use of the defence estate for temporary accommodation for Afghan families will reduce this year; and I will hold him to this promise.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_new-dementia-clinic-opening-swindon-24th-january-2025/content_42.html": "I'm delighted to hear that Dementia UK and Nationwide have joined forces to offer help and support to anyone affected by dementia. The Marlborough Branch of Nationwide will be hosting a Dementia Clinic on the 11th to 13th March. Anyone can book free 45-minute appointments with specialist dementia nurses who can offer help and advice on a range of issues, or simply provide emotional support to carers.\nIf you, or anyone you know, would like to talk through any aspect of this disease, you can contact the Nationwide Admiral Nurse clinics to book your appointment on:\n- Visit www.dementiauk.org/nationwide\n- Email [email protected]\n- Send a text message with the word: APPOINTMENT to 0747 872 4000, to receive a call back\n- Follow the QR Code on the attached document",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_meeting-ceo-great-western-hospital-10-april-2025/content_36.html": "I met with GWH chief exec to catch up on waiting lists (still too high) and hear about the support they give to people leaving hospital into social care. They have an excellent system for managing 'out flows' as they rather hygienically call it, though one problem they have is lack of capacity in care homes in the Marlborough, Burbage, Pewsey area. I'm pleased to hear that Wiltshire Council works well with GWH to support patients needing social care.",
  "https_www_dannykruger_org_uk_/https_www_dannykruger_org_uk_news_danny-kruger-policy-post-farming/content_17.html": "As we enter the final stretch of the campaign I’ll write some posts on key policy topics for the election. First up, our rural economy - namely farming, and all the other businesses which employ people in Wiltshire.\nThe farming economy has altered significantly because of Brexit. Agriculture was one of the main reasons to leave the EU - the Common Agricultural Policy was a racket maintained by and for French farmers, to the exclusion of exporters in the developing world, and it simply subsidised landowners for holding land. The new UK system pays farmers to deliver public goods, including environmental stewardship and food security.\nNevertheless, any transition is uncomfortable and this one hasn’t been easy. The shift to ‘public money for public goods’ remains too clunky and bureaucratic for farmers. New rules are not made in time for farms to decide on future investments.\nI fully recognise how new frictions with the European market have damaged some food and farming businesses in the UK. We now have positive trade deals with other countries, with vast new export markets available to British farmers, but we still need better access to the massive (but still sadly protectionist) market right on our doorstep.\nAnd the old problems of the British farming model remain: a cartel of supermarkets dictate prices and terms to farmers, and we lack a proper regional food processing and distribution system (the glory of the French model).\nAll that said, we are on our way to making a far better system than the old one, and this election is an opportunity to decide which way we go. Some commitments my Party is making:\n- An investment plan and a legally binding target for food security, so that the primary purpose of farming remains food production\n- Streamline permissions for new agricultural buildings and capital improvements to farms\n- 50% of the public sector food procurement budget to be spent on high quality local food\n- Keep the Agricultural Property Relief i.e. exemption from death duties, so children can inherit farms\n- An additional £1bn for the farming budget\n- Continued focus on rural crime, including more investment in rural policing (already improving in Wiltshire with our Conservative Police and Crime Commissioner).\nNone of these commitments are echoed by the other parties. Labour’s manifesto has a total of 87 words on their plans for farming, which mostly consist of promises to end the badger cull and trail hunting (both of which we would keep). As for Reform - my particular headache, given their appeal to former Conservative voters - I note that Nigel Farage has argued for trade deals that would import food made to lower standards than ours (chlorinated chicken, anyone?) which we would absolutely not do.\nBeyond agriculture the opportunities for the Wiltshire economy are huge. I am enormously optimistic for young people growing up here - if we can get the infrastructure right. We live in proximity to some world-class centres of the new economy - London, Reading, Swindon and Bristol - and we have some amazing pockets of innovation right here in Wiltshire, particularly clustered around the agritech and cyber industries.\nConservatives are introducing a major shift in funding and support towards Further Education and vocational training, with 100,000 new apprenticeships in our manifesto. We have cut taxes on R&D, on employment and on self-employment - with further cuts to come, including the abolition of NICs for the self-employed. We believe unashamedly in wealth creation, unlike Labour and the Lib Dems who would - by their own admission - increase taxes on savings, investment and property.\nFinally, a word on pubs, perhaps the archetypal rural business. We have already cut business rates on pubs by 75% and slapped higher duties on supermarket beers to protect pubs from being undercut. We will not introduce any more beer or cider duty, and we will continue to support community-owned pubs (like the brilliant Silks on the Downs in the Ogbournes, winner of a big grant from Government a few years ago and now thriving).\nTomorrow’s post: Protecting our rivers!"
}