{
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_age-uk-offer-advice-older-constituents/content_14.html": "Age UK have offered ways we can all help older people without leaving the house:\n1. Phone friends or relatives to check in and chat - particularly those who live alone\n2. Share ideas of crafts, activities or recipes that you have tried out\n3. Get together virtually from quizzes to book club discussions\n4. Support friends or neighbours to get online\n5. Join the Big Knit\nAge UK also runs a telephone befriending service, Call in Time, which allows you to sign up for a free weekly friendship call.\nContact the Oxfordshire branch by visiting their website or calling 0345 450 1276",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_campaigns_justice-aeat-pensioners/content_15.html": "There is a group of pensioners living in my constituency who were affected when the commercial arm of the UK Atomic Energy Authority was privatised in 1996 and a company called AEA Technology was created. At the time, they were given assurances that their pensions would be protected, but when the company later went bankrupt, their pensions lost 35% of their value. The AEAT Pension Campaign Group was formed of pensioners affected and I was the founder and Chair of the AEA Technologies All Party Parliamentary Group (APPG), which campaigns on this issue in Parliament.\nI created and Chaired the first Parliamentary group to campaign on behalf of these local pensioners, have introduced a 10 Minute Rule Bill and have met with Ministers and DWP to raise their case.\nIn 2022, I secured the first ever independent investigation of their case after a decade of trying, from the National Audit Office - who agreed to my request to look at the AEAT Pension case and publish a report setting out their findings. This followed me writing to and meeting with the Head of the NAO to present him with evidence from the Campaign and argue that this case should be looked at by them.\nIn 2023, I then got Parliament’s powerful Public Accounts Committee to hold an inquiry and produce its own report making recommendations to the Government following the NAO Report - which I met with the then Pensions Minister, Laura Trott, to push for.\nI also met with the new Pensions Minister, Paul Maynard, to make the case again.\nYou can see more about my campaign by clicking on the links below.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news/content_18.html": "Thank You Wednesday, 10 July, 2024 I loved being the MP for Wantage and Didcot and wish I was still MP for the constituency now, but I wish my successor all the best for representing this wonderful constituency. You've all had enough leaflets from me to mean I don't need to recite what I think we achieved during my time so this is just to say a few thank yous. There are far too many people I owe thanks to to name them all... Opinions\nDavid sends the results of his Local Roads Survey to Oxfordshire County Council 29th May 2024 Today I sent my Local Roads Survey to Oxfordshire County Council to highlight the things you've told me we need fixing on our roads and to urge that they use... Local News\nDavid visits Harwell Feast 28th May 2024 There are only 2 times you'll find me with red on - at Liverpool games and for Play2Give, as one of its patrons. Great time at Harwell Feast, including catching... Local News\nDavid hosts SEND Fair for local children with special educational needs 28th May 2024 My SEND Fair for local families of children with special educational needs was a great success and I am very grateful to all the organisations who attended... Local News\nDavid's Herald article about Merv 22nd May 2024 A couple of years ago I wrote my article for the Herald on Merv, a then 86-yr-old I visited each week through the great Didcot Good Neighbour Scheme. Under the... Opinions\nDavid speaks at the Oxfordshire Apprenticeship Awards 16th May 2024 It was great to be back at Williams Racing in Grove to attend the Oxfordshire Apprenticeship Awards. There were many worthy winners, including Grace from... Local News\nDavid speaks to the Wantage Chamber of Commerce 16th May 2024 It was good to talk to and take questions from the Wantage Chamber of Commerce about issues affecting local businesses, including pedestrianisation, empty shops... Local News\nDavid meets with the Alzheimer's Society 15th May 2024 Dementia is a devastating disease. I have had family members who have suffered from it, so I know how serious it is. I became a Dementia Friend with the... Westminster News\nDavid hosts second annual Wantage and Didcot Science and Technology Forum 13th May 2024 Today I hosted my second annual Wantage and Didcot Science and Technology Forum and it was great to see a strong turnout from our local science and technology... Local News\nDavid welcomes Wallingford Beach receiving bathing water status 13th May 2024 I am delighted that Wallingford Beach has officially been designated as a bathing water site by the Government. This is something that residents have long been... Local News",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_davids-herald-article-delivering-free-childcare-2-year-olds/content_26.html": "A very happy new year to all Herald readers. I hope you had a nice Christmas.\nFrom today until the 31st March, working parents can get an HMRC code that will entitle them from this April to the first 15 free hours of childcare for their 2 year olds. It's part of the Government's latest expansion of free childcare which, by September 2025, will allow working parents to claim 30 hours of free childcare a week from when their children are 9 months old until they start school.\nYou can expect to hear about this a lot from me for 3 reasons. Firstly, now I'm the Children's Minister I am responsible for delivering this expansion. Secondly, it's the single largest investment any government has ever made in childcare. Thirdly and most importantly, the cost of childcare is one of the biggest cost pressures families are currently facing and it's important those who can benefit from this know it exists.\nJust as the Government stepped in with furlough and business grants during the pandemic to protect people's jobs and livelihoods, then paid half of people's energy bills when energy prices spiked with the war in Ukraine - as well as launching a cost of living payment scheme to help people with their increased costs - so the Government is stepping in to help working families with the cost of childcare. When the scheme is fully rolled out, it will save the average family up to £6,500 a year.\nAlongside this, we're launching a national recruitment campaign to get more people to consider working with children in their early years.\nThose who work in childcare regularly complain to me that some people see them as babysitters. While it's true that the expansion of childcare we're launching will help more people return to work - and help an estimated 1.5 million people increase the number of hours they work - the first 5 years of a child's life are crucial for their development as adults.\nAs someone who worked to improve social mobility in my pre-politics life, I was already familiar with how important it is to get those years right.\nBut having visited early years settings all over the constituency and now, in my new role, all over the country, the skill and dedication it takes to educate children in their first few years always hits you as soon as you walk in the front door.\nSo as well as recruiting more people to the profession, I'm keen we see more recognition for the vital role they play.\nSo do please spread the word. And encourage parents you know to visit www.childcarechoices.gov.uk to see the range of childcare support available to them.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_campaigns_fighting-infrastructure-we-need/content_12.html": "by launching my Health Services Survey and calling on Ministers and the Council to ensure our local infrastructure (especially GP surgeries) keeps pace with new housing.\nby launching my Health Services Survey and calling on Ministers and the Council to ensure our local infrastructure (especially GP surgeries) keeps pace with new housing.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_david-announces-applications-are-now-open-government-funded-childcare-9-month-olds/content_7.html": "From today until 31 August, working parents of children aged between 9 months and 23 months (as of 1st September) can apply for the first 15 hours of funded childcare from the Government.\nThis is stage 2 of our 3-stage expansion of childcare, the biggest investment ever made in this country into childcare.\nAs of 1st April, parents were able to get the first 15 hours of childcare for their 2 year olds - and more than 210,000 are now benefitting from this.\nFrom 1st September, parents will be able to get the first 15 hours for their 9 month olds.\nTo make things easier, we've changed the '31 day rule' that meant if you were on parental leave or starting a new job you had to wait until 31 days before 1st September - parents in these situations can apply from today like everyone else.\nWhen stage 3 is delivered in September 2025, parents will be able to claim 30 hrs a week from when their children are 9 months old until they start school - saving families on average £6,900 every year on their childcare costs.\nVisit www.childcarechoices.gov.uk now to see what you are entitled to.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_cookies/content_23.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_cdn-cgi_l_email-protection/content_29.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_campaigns_championing-young-and-old/content_2.html": "Since being elected in 2019, I am proud to have delivered for all my constituents – young and old.\nTo support young people, in 2022 I started a campaign to lean on companies and other organisations to provide work experience placements to young people at local state schools in the constituency after the pandemic significantly reduced work experience placements as more people worked from home, yet they are vital - particularly for disadvantaged young people who lack connections and need to develop the skills employers look for. I asked schools to put forward the young people - ensuring at least some are from disadvantaged backgrounds - and I matched them to employers. I was delighted that we secured over 40 offers of placements with many employers across the constituency taking part including Hachette UK, Rebellion, Astroscale, ELS and Oxford Sigma.\nI was happy to lead by example and have hosted many local young people for work experience in my Parliamentary office throughout my time as an MP. In 2023, I welcomed local young people to do work experience in my office for every single month that Parliament was sitting.\nIn 2023, I hosted an Apprenticeship Fair in Didcot which featured many local and national employers and welcomed 400+ local young people from schools across the constituency to understand the apprenticeship opportunities available to them.\nI visit a school almost every week to hear from pupils and take their questions, am proud to be a patron of great local charities like Team Mikayla and SecretSanta365 (both founded by young people) and have supported young people like Niamh Dernie from Wantage.\nI am also proud to serve as Children’s Minister under this Conservative Government which is delivering the largest ever investment in childcare. Thanks to this Government’s reforms, English primary school children are the best readers in the Western World and 88% of schools are now rated good or outstanding - up from 68% in 2010 under Labour.\nFor older people, I hosted a Pensioners Fair in Wantage to bring together some of the key local and national organisations such as Age UK Oxfordshire, the October Club and Vale Community Impact which provide advice and support to older people. I have been fighting for our AEAT pensioners and secured an investigation by the National Audit Office, which led to a Parliamentary Inquiry. Ahead of all this, I met with the Chair of the Committee to push for redress.\nI was proud to secure a new Government trial to promote Pension Credit in the Vale of White Horse, which can provide a significantly amount of additional money to those on lowest incomes. I also regularly visit organisations that support older people including Grove Day Centre and volunteer with the Didcot Good Neighbour Scheme almost every week.\nThanks to this Conservative Government, the State Pension was increased by the largest amount ever last year and the second largest amount ever this year.\nI keep fighting for all my constituents in Parliament.\nYou can see more about my campaign by clicking on the links below.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_campaigns_improving-our-roads/content_25.html": "The A420 and the A34 need considerable improvements. There are far too many tragic accidents and near misses, and some residents have now taken to avoiding these roads altogether.\nWe need the A420 re-established as a local road with good bus stops, crossings, walkways, and the lorries diverted elsewhere. We also need urgent safety upgrades on the A34.\nI have met with the Roads Minister and National Highways multiple times to discuss this and have led a debate in Parliament focusing on the safety issues with the A420 and A34. I continue to regularly raise it.\nThere is also a more general need for investment to improve roads across the constituency, some of which remain blighted with potholes and poor road surfacing. I have regularly raised this with the Council and Highways England, who have responsibility for this - but I strongly welcome that the Government has given Oxfordshire County Council more than £27 million in 2023/24 to help improve our roads and fix our potholes and we need to see this money used effectively.\nI also regularly raise speeding and pothole complaints with the local council, which has frequently led to speeding measures being introduced and repairs being completed.\nI launched my Local Roads Survey to give you the opportunity to tell me exactly where you are seeing issues on our roads that need to be resolved – including potholes, congestion, speeding and other safety concerns.\nI then wrote to Oxfordshire County Council to share your thoughts and push for change. Together, we can work to secure much-needed road improvements for our area.\nYou can see more about my campaign by clicking on the links below.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_david-meets-alzheimers-society/content_20.html": "Dementia is a devastating disease. I have had family members who have suffered from it, so I know how serious it is. I became a Dementia Friend with the Alzheimer's Society to help raise awareness of the support that is available.\nWith this in mind, I was pleased to meet with the Alzheimer's Society at their drop-in in Parliament to discuss the great work they do. Lots of constituents emailed me asking me to attend and I am glad to have done so.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_campaigns_fighting-infrastructure-we-need-0/content_21.html": "We all know we need for more infrastructure (from schools to shops to GP surgeries) in the constituency to keep pace with all the new housing that has been built. I have made this one of my top priorities in Parliament.\nNowhere is the need for infrastructure better seen than in the lack of new GP surgeries. By 2027, Didcot will be 42% larger than it was a decade earlier and Wantage and Grove will be 59% larger. There are thousands more houses being built in Wallingford, Faringdon and all the villages I represent. However, despite this growth, we have not seen a single new GP surgery.\nI am taking action and have:\nRaised this problem countless times in the House of Commons and with Ministers in various meetings, including the Prime Minister and the Housing Minister.\nLed a debate focusing on the concerns constituents have with housebuilding and the lack of infrastructure at the start of this year, where I again put these concerns directly to the Housing Minister.\nJoined forces with other MPs facing similar problems, and spoke in a debate alongside them about the need for more GP surgeries.\nCarried out a constituency-wide Health Services Survey to give everyone the opportunity to share their thoughts about the improvements we need to our health services, especially GP surgeries, which thousands of local people responded to.\nSecured a debate on our local health services during which I shared the results of my survey to make the case directly to the Health Minister that we need more and better local health services - and secured a meeting with the Minister to discuss this in more detail.\nCarried out a constituency-wide Childcare Survey to give local parents, grandparents, guardians and carers the chance to share their views on how they find accessing childcare locally and what they'd like to see more of, which I shared with the Department for Education.\nBacked the Prime Minister's plan to end the 8am rush for GP appointments by making sure patients are either given an appointment immediately when they call, or signposted to a more appropriate service such as NHS 111 or their local pharmacy - and the investment and extra powers for pharmacies which will free up an estimated 2 million extra GP appointments\nBacked the Government's plans for a new Infrastructure Levy which will be non-negotiable and locally set in order to ensure we always have the funding we need for local infrastructure\nWelcomed the progress that is being made including the fact that there were 50.9 million more GP appointments in the year to October 2023 compared to October 2019, more than 50,000 more nurses recruited since 2019, and an extra £6.6. billion being invested in the NHS over the next 2 years - but always being clear that there is more to do\nYou can see more about my campaign by clicking on the links below.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_category_Westminster-News/content_13.html": "David meets with the Alzheimer's Society 15th May 2024 Dementia is a devastating disease. I have had family members who have suffered from it, so I know how serious it is. I became a Dementia Friend with the... Westminster News\nDavid announces applications are now open for Government funded childcare for 9 month olds 12th May 2024 From today until 31 August, working parents of children aged between 9 months and 23 months (as of 1st September) can apply for the first 15 hours of funded... Westminster News\nDavid welcomes Didcot childminder to reception at Number 10 Downing Street 1st May 2024 I had the absolute pleasure of hosting a reception at Number 10 Downing Street for people working in our great early years sector and was pleased to bring Julie... Westminster News\nDavid welcomes increased defence spending 23rd April 2024 Delighted to see this announcement which will be welcome news to all of the veterans and member of the armed forces that I am proud to represent. I take a... Westminster News\nDavid welcomes launch of a call for evidence into barriers to community energy projects 8th April 2024 Before I was made a Minister, I was Chair of the Community Energy APPG and lead sponsor of the Local Electricity Bill. In this role, I was proud to have helped... Westminster News\nDavid presents his Grove Station Petition to Parliament 7th February 2024 Today I officially presented my petition to re-open Grove Station to Parliament. It now goes straight to the Department for Transport. Thank you again to the 2... Westminster News\nDavid marks Holocaust Memorial Day 27th January 2024 Today is Holocaust Memorial Day and, on behalf of my constituents, I signed the Holocaust Educational Trust's Book of Commitment this week, honouring the memory... Westminster News\nDavid welcomes constituents to Parliament and encourages everyone to visit 19th January 2024 It’s always a pleasure to welcome constituents to Parliament. In the past few months alone, it has been great to welcome staff from the Shrivenham Defence... Westminster News\nDavid welcomes second largest ever increase in the State Pension 22nd November 2023 “I welcome the State Pension increasing by the largest every amount last year and the second largest amount ever this year. Our committment to the triple lock... Westminster News",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_david-supports-community-energy-debate-energy-bill/content_27.html": "I am a passionate campaigner on the environment, a member of the Conservative Environment Network and one of their Net Zero Champions; formerly vice-chair of the Chalks Streams APPG; and was the lead sponsor of the Local Electricity Bill which would allow local groups to sell renewable energy to the\nI loved being the MP for Wantage and Didcot and wish I was still MP for the constituency now, but I wish my successor all the best for representing this wonderful constituency.\nYou've all had enough leaflets from me to mean I don't need to recite what I think we achieved during my time so this is j",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_parliament/content_9.html": "Special Educational Needs | Department for Education | Written Answers Since January 2023, schools have been required to comply with strengthened provider access legislation, offering at least six opportunities\nChildcare | Department for Education | Written Answers The department expects to provide over £4.1 billion by 2027/28 to facilitate the expansion of funded childcare and to be spending in excess\nSpecial Educational Needs: Finance | Department for Education | Written Answers High needs funding for children and young people with complex special educational needs and disabilities (SEND) is over £10.5 billion in 202\nEducation: Mental Health Services | Department for Education | Written Answers Mental Health Support Teams (MHSTs) are now in place in around nearly 8,500 schools and colleges across the country, with 498 expert teams\nNurseries: Government Assistance | Department for Education | Written Answers It has not proved possible to respond to the hon. Member in the time available before Prorogation.\nSpecial Educational Needs: Finance | Department for Education | Written Answers The Safety Valve programme supports the local authorities with the highest Dedicated Schools Grant (DSG) deficits.\nCarers | Department for Education | Written Answers It has not proved possible to respond to the hon. Member in the time available before Prorogation.\nPre-school Education | Department for Education | Written Answers The Early Years Foundation Stage (EYFS) statutory framework sets the standards that all early years providers must meet to ensure that child\nChildren in Care: Schools | Department for Education | Written Answers The needs of the child are paramount when deciding the right care placement.\nChildcare: Wellingborough | Department for Education | Written Answers It has not proved possible to respond to the hon. Member in the time available before Prorogation.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_david-visits-harwell-feast/content_3.html": "There are only 2 times you'll find me with red on - at Liverpool games and for Play2Give, as one of its patrons.\nGreat time at Harwell Feast, including catching up with Play2Give, Jeanette Howse of Well Preserved, White Horse Soap Company and trying for the first time a delicious cake from Bless You HOME Kitchen.\nOh, and seeing some Stormtroopers.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_david-host-send-fair-didcot/content_4.html": "I am holding a SEND Fair to bring together all the local and national organisations that provide support to SEND children and young people and their families.\nIt is free to attend, children are welcome, and it will feature local and national organisations that support SEND families including Clear Sky Children’s Charity, Autism Family Support Oxfordshire, Family Action, Vale Community Impact, KEEN Oxfordshire, My Vision Oxfordshire, SOFEA and more!\nIt will take place at Didcot Civic Hall on Tuesday 28 May from 12:30pm to 4:30pm.\nSign up below!",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_david-presents-his-grove-station-petition-parliament/content_22.html": "Today I officially presented my petition to re-open Grove Station to Parliament. It now goes straight to the Department for Transport.\nThank you again to the 2,127 local people who signed it!\nI will be meeting with the Rail Minister again shortly to make the case and will let you know how that goes.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_campaigns_protecting-environment-0/content_24.html": "I am a passionate campaigner on the environment, a member of the Conservative Environment Network and one of their Net Zero Champions; formerly vice-chair of the Chalks Streams APPG; and was the lead sponsor of the Local Electricity Bill which would allow local groups to sell renewable energy to the community.\nI was a supporter of the Sewage (Inland Waters) Bill which aimed to stop water companies from releasing untreated sewage into our waters, voted for legally binding targets as part of the largest ever programme to tackle sewage discharges, successfully pushed Thames Water to invest in Wantage Sewage Treatment Works, backed the requirement for water companies to invest £56 billion on environmental infrastructure improvements and have held Thames Water to account by raising constituent concerns with them regularly since I was elected.\nIn Parliament, I regularly talk about environmental issues and started a campaign to ensure that new housing is built to the latest environmental standards, rather than the standards in place at the time permission was given.\nI also served as Chair of the Community Energy APPG and helped secure the landmark £10 million Community Energy Fund after several months of working with the Government, specifically the Minister for Energy Networks, Andrew Bowie, to get support for community energy into the Energy Bill.\nI also hold an annual Climate Summit for constituents so that they can put forward thoughts and suggestions – you can watch 2021’s here, 2022’s here and 2023's here.\nYou can see more about my campaign by clicking on the links below.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_campaigns_improving-our-roads-0/content_28.html": "by raising safety issues with the Roads Minister, launching my Local Roads Survey to push for change, and leading debates in Parliament on this.\nby raising safety issues with the Roads Minister, launching my Local Roads Survey to push for change, and leading debates in Parliament on this.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_help-those-suffering-loneliness/content_19.html": "Let's Talk Loneliness\nThe Government's #Let’sTalkLoneliness public campaign has been rolled out to get people talking openly about loneliness, which includes new public guidance offering useful tips and advice on what to do to look after yourself and others safely.\nFind out more about this campaign here.\nThere is local support available for anyone in Oxfordshire struggling with loneliness:\nOxfordshire TalkingSpace Plus: visit their website here or call 01865901222.\nOxfordshire Mind: visit their website here or call 01865 263730",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_category_Articles/content_5.html": "Coronavirus Community Support Fund 29th May 2020 To ensure that our charities and social enterprises can continue to step up to respond to the crisis, the government has made available an unprecedented package... Articles\nAge UK offer advice for older constituents 15th May 2020 Age UK have offered ways we can all help older people without leaving the house: 1. Phone friends or relatives to check in and chat - particularly those who... Articles\nHelp for those suffering from loneliness 6th May 2020 Let's Talk Loneliness The Government's #Let’sTalkLoneliness public campaign has been rolled out to get people talking openly about loneliness, which includes... Articles\nDavid Johnston - An MP's welcome to Westminster 24th January 2020 Although I imagine I will use this column to talk about local or national issues most of the time, I thought it might be interesting for this first one for me... Articles",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_surgeries-0/content_11.html": "David holds regular surgeries by appointment throughout his constituency, or via phone, Zoom or Teams if preferred.\nPlease email [email protected] for more information and to request an appointment.\nDavid holds regular surgeries by appointment throughout his constituency, or via phone, Zoom or Teams if preferred.\nPlease email [email protected] for more information and to request an appointment.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_what-constituents-say-about-david/content_6.html": "\"Thank you for getting back to me and for your personal note which is truly heart warming to feel that my local MP is currently following up closely on a community member.\"\n\"I'm writing to express my sincere gratitude for your swift action in following up on my application... Your willingness to assist and keep me informed is greatly appreciated. The uncertainty of this process has been quite stressful, and your support gives me hope for a favourable outcome.\"\n\"Thank you for sending a copy of your newsletter and for fighting for us. I was particularly pleased to read about your effort with regard to Thames Water and potholes.\"\n\"Thank you so much for all your prompt help and assistance in this matter. I have now received an email from the Council, confirming all that you described in your letter, which has brought significant relief on my part and can only thank you beyond words for your intervention. With genuine gratitude.\"\n\"On another note, I was sorry to find out about the boundary change at the next election. You have been a great MP for us, really responsive and efficient and actually seem to care, which is great to find in an MP. Thank you for being ours.\"\n\"I'm I quite gobsmacked that you have responded. I receive your newsletter which is very informative and I sincerely appreciate the contributions you make and your campaigns I have signed them all as they are very worthy causes... I thank you again for your reply, I do hope that you continue as our MP, it would be such a shame to see the things you are doing be lost. Take care Mr Johnson fight the good fight with all your might you deserve to carry on as our MP.\"\n\"We had a fascinating day at Parliament and thoroughly enjoyed our trip... David has proved an excellent constituency MP and I wish him well for the upcoming election - whenever that may be.\"\n\"As always, thank you for listening and showing your support.\"\n\"Myself, my son and his family are extremely grateful to you and dread to think what position my son would otherwise be in.\"\n\"Thank you for taking the time to reply to the generic email, to which I added my name, regarding the above subject. It is good to know that, in your busy life, you take a serious interest in the concerns of all of your constituents.\"\n\"Many thanks for your intervention with the Land Registry which has brought about our title finally being registered. Your support in this matter has been greatly appreciated.\"\n\"I am so grateful to you. You clearly understand where I'm coming from.\"\n\"I am indebted to you for your support and very glad that you fought my cause.\"\n\"As always, we are extremely grateful for your intervention, which once again proves that “writing to your MP” really does work!\"\n\"Thank you again. It's so good to know that you will help and advice your Constituents when you can.\"\n“Thank you for listening and for taking the time to try and help. I really do appreciate it and you have changed my feelings about local MP’s and politics for the better!”\n\"Without your intervention this would simply not have happened. Given your workload and responsibilities I realise that this would have added to an already large in-tray at an incredibly busy time for the Government and the Party.I cannot express the words well enough to thank you for your help and assistance.\"\n\"Thank you for your swift response. Your active involvement has set off a chain of reactions with the potential to bring about substantial changes to our situation... I want to express my gratitude by informing you that your actions have had a significant impact. Your support means a great deal to us.\"\n\"I would like to take this opportunity to express my gratitude for your advocacy on behalf of your constituent and for your dedication to ensuring that all members of our community receive fair and equitable treatment. Your efforts have played a crucial role in facilitating this positive outcome, and we are immensely thankful for your support.\"\n\"Please accept my sincerest appreciation for your assistance with my driving licence. This is the outcome I had hoped for. I can’t express in words the weight you have removed from me. It is a wonderful Christmas present for sure.\"\n\"You have been so helpful. This is the first time in my life I have contacted my MP – and I am so impressed. Thank you and bless you.\"\n\"Thank you so much for your email , I cannot thank you enough for this... It would seem that an email from yourself did the trick very quickly and we honestly cannot thank you enough.\"\n“I just want to say a huge thank you for all the help and support you have given over the past few weeks with chasing up our visa applications. We are all super quick to complain when our politicians get things wrong but I am happy to say you have restored my faith in the system.”\n\"I would like to extend our deepest gratitude for your assistance in the matter. You acted promptly to our request and you have been very proactive in updating us with what needs to be done. I am very aware that your involvement in this matter is key to the success of this request.\"\n\"Many thanks David I very much appreciate you taking the time to reply thank you so much. The road was opened this weekend so the village are very grateful that the matter has now been resolved. I can only imagine the pressures on your time so do very much appreciate your attention on this matter - thank you so much.\"\n\"I would like to express my infinite gratitude to you for taking up the mantle and championing this campaign... It is fantastic that when the usual routes to get heard closed that you found different avenues to explore and your tenacity and support with it has been so much appreciated. Without you on side I don’t think we would have achieved this... People are very good at complaining to MPs and not very good at thanking them, so I’m sending a very big thank you for having faith that this case is a valid one and for helping us get some justice.\"\n“I honestly cannot thank you enough, I really don’t think this would have happened without your effort and help. Thank you so much, I am beyond grateful!!”\n\"I would like to thank you and your team for following up on my behalf. I do believe it was your efforts that got my query heard and resolved.\"\n\"I cannot thank you enough for your support and help.\"\n\"Thanks for being a huge help and providing support to expedite the process.\"\n\"Once again thank you for your intervention, two grateful constituents.\"\n\"Thank you ever so much with your help and support in helping me with my issues at my dental practice. They have contacted us and allowed both myself and husband back on their books. So we are very pleased and grateful for your help.\"\n\"As always it was a pleasure to receive your post, Wow you really are a busy man 👏👏👏👏 we in Wantage are very lucky to have such a dedicated MP thank you for all your good work. 👍\"\n“I have been meaning to write you for the last few weeks. In short, the message is fairly simple: as an MP I could not wish for any more. We would probably never see eye to eye on the politics of the Conservative party, but you have been most helpful any time I have written to you; this has been much appreciated.\"\n“It is obvious that you are a very industrious, hard working, compassionate and dedicated MP trying to make a difference, not only to your constituents, but the wider public at large. As one of those constituents a sincere thank you for all your efforts and one who I am pleased to say is someone we should be proud.\"\n“Thank you for your support David and for taking the time to listen to an issue important to my family. We genuinely appreciate it.”\n“Thank you as always for all that you are doing, it is appreciated and much valued by so many people in the community - it’s great to see you so engaged and visible with local business, organisations and worthy causes.”\n“Just a short email to say thank you for responding to my email concerns over the last months.”\n“I am writing to thank you from the bottom of my heart for standing up for me trying to resolve this matter when I was being completley ingored by DWP. It will make a huge difference to my finances in the future... Once again thank you.\"\n“I think that you personally do your best to help our community & other have also commented on this.\"\n“David, I really think you are a very caring man and someone we can actually trust to try and help us where possible. You have given us more time and help than anyone else... I am so thankful you listened to us and spoke to the minister on our behalf.”\n“Thank so much for your help. You can not believe the pain you have lifted from are family thank you so much thank you xxx”\n\"I have dealt with many elected people over many years with this, you stand alone David. You truly do stand alone, and above, them all. Thank you.\"\n“Thank you so much for your email - I must admit to being very pleasantly surprised by your speedy response and concern.”\n“Thank you so much for organising the tour for me and all the family and meeting this morning. We all had a lovely and very spoiling time.”\n\"I wish to thank you for your letter of reply and leaflet which I had previously received. I do believe you have been a good local MP to Wantage and Didcot.\"\n“I am impressed by the record of your activities in parliament and the constituency - and even more by the Speaker's evident astonishment at your ability to reel off your co-sponsor's names for some proposal without checking you notes. You are creating exactly the right impression for a new MP - sensitive to his constituents' needs and an outstanding new performer in the Chamber.\"\n“Just heard from DVLA and should now receive my licence in the next few days. I'm so sorry I had to involve you but you have worked a miracle!!”\n“Thank you very much for visiting us the other day. I’m really pleased that you’re interested in agricultural issues that are very important to us”\n“Thank you very much for this and for taking the time to follow-up. It is very much appreciated. In part due to your efforts we are starting to see momentum and interest growing.”\n“Thank you a million times! Your support makes me feel stronger.”\n“I wanted to write to say a huge thank you and to let you know that you have not necessarily restored my faith in politics but you have restored my faith in humanity. You recently helped my friend... She has told me that within 3 hours of your email to her saying that you were taking action, the passport office phoned her to say the passport was being printed and I heard that the courier arrived with the passport this morning. I have been very impressed watching you stand up for our constituency.\"\n“Your piece in the Advertiser, is in my view an important method of informing us on your views, activity and plans. It shows the effort you are going to, to help not only the local area, but regionally and across the UK. Something I have never experienced with a local MP. Thank you once again, please keep up your efforts, good luck with your annual Cop summit and do continue to keep us informed.”\n“Keep up the good work.”\n“You have been a breath of fresh air and are an extremely hard-working MP.\"\n“Thanks for your reply. Please do keep up your great work on the environment and in our community.\"\n\"I always enjoy reading your newsletter but I think today's newsletter has been the best, showcasing all your initiatives and how hard you have been working to support your constituents.\"\n\"Your doing a wonderful job and love seeing your local posts... Just sort out Westminster and we're all good!\"\n“I follow your facebook and get your newsletters so see you are still getting around and standing up for us all.\"\n\"I think we are lucky to have you as our MP.\"\n“Thank you for having my back. I am a happy and grateful constituent this evening.”\n\"Busy, busy, busy. Good work David. Hope your colleagues at Westminster are listening. Keep up the good work.\"\n“Thank you for sharing with us in your newsletter about all that you do for our constituency. I read with delight every time about your discussions at the PMQs, your time in various schools and businesses, and your rounds across the constituency. I simply wanted to thank you for all this, and to encourage you in all you do.\"\n“I would like a quiet thank you to David Johnston for being a fantastic constituency MP - he appears to be covering all areas of the constituency - not easy with such a varied demographic, and being heard by the right people in the right places.\"\n\"David, thank you sir, you must be very proud to have such an amazing team alongside you and for that I’m extremely appreciative and grateful.\"",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk/content_1.html": "David's Latest Updates\nSince 2019, I have:\nDealt with 47,000+ constituent cases and queries\nVisited 650+ local organisations\nSpoken in Parliament 239 times.\nFormer MP for Wantage and Didcot\nI loved being the MP for Wantage and Didcot and wish I was still MP for the constituency now, but I wish my successor all the best for representing this wonderful constituency.\nThere are far too many people I owe thanks to to name them all individually but thank you to my fab parliamentary team and those who worked for me and moved on; thank you to the local association for all their support along the way and help in trying to get me re-elected; thank you to all those who came to volunteer from all over to help during the election campaign.\nThank you to all of those who voted for me. Thank you to everyone right the way across the constituency who was friendly, sometimes challenging, and helpful as I tried to help local people with problems.\nThank you too to everyone who supported me in my other role as Minister for Children, Families and Wellbeing. Having been born on a council estate, both roles have been more than I could have imagined.\nI've received hundreds of kind emails since the election result and I am hugely grateful to everyone who has sent one. Many are asking if I will stand for election again and at this stage it's just too early for me to know - but I'm very touched by the support and encouragement.\nThank you everyone.\nDealt with 47,000+ constituent cases and queries\nVisited 650+ local organisations\nSpoken in Parliament 239 times.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_davids-herald-article-reforming-send-system/content_8.html": "Before I became Children’s Minister, parents and teachers being unable to get the support they needed for children with special educational needs (SEND) in Oxfordshire was one of the top casework issues that I was written to about – alongside housing and planning issues.\nIt remains a controversial topic, not least with the Labour Party having walked away from their coalition with the Liberal Democrats at Oxfordshire County Council after the Ofsted report into local provision.\nI will stay away from that argument for obvious reasons but now that I am responsible for reforming the SEND system nationally, I thought I would tell Herald readers what we are doing in Government to change the national system.\nSome of the issues are not about money - and parents and teachers regularly say this to me - but the Government has rightly increased the higher needs budget. In the coming financial year it will be £10.5 billion, which is 60% higher than it was in 2019-20. Not many budgets, under any Government or in any area, have increased by 60%, which shows the Government’s support for and commitment to fixing this problem.\nPart of the problem is a lack of spaces in specialist schools, and we are investing £2.6 billion in funding new places and improving provision – with 106 special free schools already open and a further 78 approved to open in the future.\nWe are reforming the SEND system, which has too much local variation, to a national system with national standards, one which supports every child and young person with SEND from birth to age 25. As part of this, we are testing an Education Health Care Plan (EHCP) template that we hope can be used nationally and delivered digitally, which will improve the timeliness and quality of EHCPs.\nWhile some children will always need specialist provision and/or an EHCP, we are working to get parents the support they need for their child at an earlier stage so that they do not always need an EHCP to get that support – and, where possible, can instead have their needs met early at a mainstream school.\nSupporting teachers in mainstream schools is very important in delivering this and more than 11,000 staff have already accessed support to improve their SEND knowledge and skills. We are also funding the training of 7,000 early years staff with a level 3 special educational needs coordinator (SENCO) qualification to identify needs as early as possible – with 5,200 staff registering for that training.\nThis area was already a key priority for me, and I am proud to be overseeing these reforms for the Government.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_news_david-welcomes-constituents-parliament-and-encourages-everyone-visit/content_16.html": "It’s always a pleasure to welcome constituents to Parliament.\nIn the past few months alone, it has been great to welcome staff from the Shrivenham Defence Academy, schools, work experience students, charities like SOFEA, and several constituents who I was pleased to arrange PMQs tickets for.\nIf you didn't know, MPs are able to arrange free tours for their constituents. If you would like me to arrange a free tour for you or your group, or free tickets to watch a debate, please email me at [email protected].\nI try my best to meet with everyone who visits. I look forward to seeing you soon!",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_campaigns_campaigning-grove-station/content_17.html": "by mentioning it every chance I get in Parliament and launching a petition that secured over 2,100 signatures, after already successfully getting it on a list of stations to be considered for Government funding for the first time ever.\nby mentioning it every chance I get in Parliament and launching a petition that secured over 2,100 signatures, after already successfully getting it on a list of stations to be considered for Government funding for the first time ever.",
  "https_www_david-johnston_org_uk/https_www_david-johnston_org_uk_about/content_10.html": "David was born on a council estate and went to a comprehensive school where only 21% passed any 5 GCSEs during his time there. His mother left school at 16 and got a job as soon as she could and his father left school at 14 and joined the army as soon as he could.\nDavid was therefore the first in his family to go to university and he then spent the next 16 years before politics running organisations that help disadvantaged young people to get a better education and a good job. This included being Chief Executive of the Social Mobility Foundation, which he grew from a team of 3 people to a national charity with 7 offices across the UK serving around 7,000 young people. In 2018, David received an OBE for services to social mobility and education.\nDavid was elected as MP for Wantage and Didcot in December 2019. He decided to enter politics as – although he voted to Leave in the EU referendum – he felt the issues he cared about were being neglected whilst the arguments over Brexit dominated everything. He lives in the Didcot area with his partner, Charlotte.\nDavid was a Parliamentary Private Secretary at the Department for Education between 2021 and 2022, Parliamentary Private Secretary at the Department for Work and Pensions in 2022 and Parliamentary Private Secretary to the Secretary of State for Levelling Up, Housing and Communities between 2022 and 2023. He previously served on the Education Select Committee between 2020 and 2021.\nDavid currently serves as Minister for Children, Families and Wellbeing at the Department for Education.\nBefore entering Government, David served as the Chair of the Community Energy APPG, Chair of the AEAT Pensions APPG, Chair of the Social Mobility APPG and Vice-Chair of the Chalk Streams APPG.\nHe is standing for re-election on July 4 to represent Didcot, Wantage, Wallingford and our villages."
}