{
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_category_Local-News/content_44.html": "Andrew welcomes Post Office’s commitment to the ‘Coldwaltham model’ 23rd April 2025 Andrew Griffith MP has thanked the Post Office for their agreement to continue their support for the Coldwaltham Post Office after he brokered a meeting between... Local News\nMP says heads must roll 22nd April 2025 Arundel and South Downs MP Andrew Griffith has responded to the planning inspector’s reasons for cancelling the Horsham Local Plan and sending it back to the... Local News\nMP commends police action on illegal rave 22nd April 2025 Andrew Griffith MP has praised Sussex Police for taking prompt action over an Easter weekend to close down an illegal rave near the village of Cocking, between... Local News\nAndrew Griffith meets with Sussex Police 15th April 2025 Keeping our communities safe is a priority which is why I regularly meet with Sussex Police to discuss rural crime and the many issues that matter most to my... Local News\nAndrew Griffith MP speaks at Milland Annual Parish Assembly 10th April 2025 Andrew Griffith, the Arundel and South Downs MP, spoke to an audience in Milland at their Annual Parish Assembly on Wednesday evening The MP spoke in his... Local News\nAndrew Griffith MP hosts Farm to Fork meeting to discuss the challenges farmers are facing 9th April 2025 Andrew Griffith, Arundel and South Downs MP, held one of his regular Farm to Fork meetings today (Wednesday 9 April) at Fitzleroi Barn, Fittleworth, kindly... Local News\nAndrew welcomed to Lurgashall's annual parish meeting 4th April 2025 Andrew Griffith was given a warm welcome by residents of Lurgashall village on Thursday evening (4th April) at their Annual Parish Meeting that was hosted... Local News\nMP shares relief that Midhurst bridge is repaired and fully re-opened 4th April 2025 Midhurst's MP Andrew Griffith has shared his relief at news that North Mill Bridge is fully reopen after weeks of being under traffic controls following a... Local News\nSustainable strawberries are the taste of Summer says MP 21st March 2025 Andrew Griffith, Arundel and South Downs MP, took a tour of The Glasshouse at Wicks Farm near Arundel on Friday (21st March) to see how innovation is supporting... Local News",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_parliament/content_49.html": "Tweet Click here to read about what an MP can do Click here to read about School Visits to Parliament Click here to read about organising trips to Westminster\nAndrew calls on Health Secretary to protect weddings and motorsport events Monday, 14 June, 2021 Andrew calls on the Secretary of State for Health and Social Care Matt Hancock to work with the Culture Secretary to ensure weddings and motorsport events can proceed over the summer.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_local-government-changes-mayor-sussex/content_36.html": "The Labour government have decided to cancel the 2025 West Sussex County Council elections and impose a Sussex-wide local authority on West and East Sussex with a new 'Mayor of Sussex'.\nSussex needs a mayor like a fish needs a bicycle.\nIt is firmly my view that top-down imposed reforms – just like housing numbers - are completely wrong and lack democratic consent.\nA new elected Sussex mayor will have to represent 1.5 million residents living in wildly different communities dominated by urban Brighton, Crawley and they will then serve under the Sussex banner.\nIt will starve many residents in rural West Sussex of the representation at local government which they deserve, and ultimately lead to a focus on the urban areas of the county such as Brighton and Crawley – whilst stealing the voices of residents at the ballot box this May. This decision is democratic larceny.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-speaks-queens-speech-debate-2021/content_17.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_sustainable-strawberries-are-taste-summer-says-mp/content_59.html": "Andrew Griffith, Arundel and South Downs MP, took a tour of The Glasshouse at Wicks Farm near Arundel on Friday (21st March) to see how innovation is supporting the production of sustainably grown strawberries for supermarkets.\nThe Glasshouse at Wicks Farm is a 5.6 hectare unit housing vertical hydroponic systems to grow some of the very best varieties of strawberries. This patented innovation in berry growing is led by David Moore, managing director of Berry Growing Ltd, who is an engineer with a passion for making berry crops sustainable all year round.\nThe MP toured the site to see how new thinking and technology is helping to increase yields and deliver a source of food that is locally grown and sustainable – meeting the previous government’s challenge of producing more home grown food through the National Food Strategy. The Glasshouse’s method grows strawberries on A-frames and uses 50 per cent less water than traditional methods, producing more fruit per square metre. The company have also demonstrated their ability to grow strawberries outside of the traditional summer season by adapting light and heat levels.\nAs a major supplier to Tesco and Marks and Spencer, the quality of their fruit has to be bee kept consistent, and each berry is hand-picked. ‘Wicks Farm’ is printed on the label alongside the LEAF Marque and Red Tractor logos for certifying the supply chain and environmental assurances. They are then sold onto stores mainly in the South of England.\nAndrew Griffith was impressed by David Moore’s hydroponic system that cultivates the plants in water and reduces the risks of weeds and pests. He also saw how bumble bees housed in the greenhouses are used to naturally pollinate the plants.\nAndrew Griffith MP said:\n“I enjoyed a fascinating tour of Wicks Farm and was very interested to see how they are innovating berry production to deliver greater yields of home-grown strawberries all year round, reducing our nation’s reliance on fruit that is imported from other countries. Currently, the UK only grows around 15% of the fruit we consume, so we must do more to improve production.\n“I think customers would much prefer to eat food that is locally grown to the highest standards, and is sustainable having done very little mileage to get to the shelves.”",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-hosts-debate-british-wine/content_75.html": "Andrew Griffith MP, Arundel & South Downs, hosted an Adjournment Debate in the House of Commons on Wednesday 23rd June to celebrate the outstanding success of the Great British wine industry.\nThis debate comes as the United Kingdom celebrates English Wine Week.\nAndrew is the chairman of the All-Party Parliamentary Group for Great British Wine.\nYou can watch the speech using the link on this page.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-calls-urgent-improvements-henfield-pharmacy/content_70.html": "“The situation at Lloyds Pharmacy in Henfield is completely unacceptable,” said Andrew Griffith, MP for Arundel and South Downs, following a visit to the village on Friday (11th November).\nThe pharmacy in Henfield has recently reduced its opening hours and this has led to customers queueing for their prescriptions, sometimes in bad weather, for more than an hour. The pharmacy is now only open from 9 to 5, closed at lunchtimes, and will no longer be open on a Saturday.\nThe pharmacy have blamed the deteriorating situation on the lack of a permanent pharmacist, with the branch relying on locum pharmacists who often travel from as far as London to provide cover. The MP emphsied that the issues being experienced were not the fault of the staff working in the branch.\nDozens of frustrated residents have complained to the pharmacy and shared their views with Andrew Griffith as their local MP. The parish council and Henfield Medical Centre have also weighed in with their support to seek improvements for residents.\nAfter seeing the scenes of the long queues, including many elderly and frail customers, Andrew Griffith spoke about the action he is taking. Having already written to the Chief Executive of LloydsPharmacy, Kevin Birch, the MP has now advised government ministers of the situation. He will be meeting with the Health Minister and the Director of NHS Primary Care in Sussex to discuss the urgent short-term help needed, as well looking for a longer-term plan.\nAndrew Griffith also met with Dr Karen Crawford-Clarke, GP Partner of the Henfield Medical Centre, to discuss the impact that this is having on the GPs, nurses and staff. The GPs are supporting patients by re-issuing prescriptions for collection at alternative dispensaries, but recognise that this is not a solution for all patients.\nAndrew said:\n“The situation of Lloyds Pharmacy in Henfield is completely unacceptable. Yesterday, whilst holding my weekly surgery in Henfield, I visited and talked to those queuing outside on a number of occasions. Short opening hours, weekend closures and long handling times meant that residents are queuing for hours and often join the queue only to be turned away unseen at the next closing times. This presents an insufferable burden on those in work, those who are frail or vulnerable or simply those juggling busy commitments.\n“This is not fault of the staff working in Lloyds. But the system has not worked as it should in Henfield for far too long and with the cold days and dark evenings approaching it needs to be fixed fast.”\n“I have previously raised this with the CEO of Lloyds and will do so again. Yesterday I also met with Dr Karen Crawford Clarke and Dr Gordana Ninkovic-Chapman of the Henfield Medical Centre, Councillor Josh Potts and the Chairman of the Henfield Parish Council.\n“I will also be meeting with the Health Minister responsible for the laws around the licensing of Pharmacies to see if exceptions can be made to the rules preventing a surgery dispensing to those living near a pharmacy and I will seek a call with the Director of NHS Primary Care in Sussex who has the responsibility for the provision of pharmacy services.”",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_what-can-mp-do/content_78.html": "Members of Parliament are elected to the House of Commons to represent the interests and concerns of all the people who live in their constituency, whether they voted for them at the General Election or not. They are only able to deal with issues raised by people who live in their constituency, called constituents.\nTo check if you are one of my constituents, please enter your postcode on the Parliament website.\nMPs consider and vote on legislation and use their position to ask government ministers questions about current issues.\nWe split our time between working in Parliament and working in the constituency. In Parliament, I spend my time fighting for the interests of all my constituents, attending debates, scrutinising and voting on legislation, and attending meetings. I hold advice surgeries for my constituents (where they can come and talk to me about any local issues and problems), attend meetings and community events, as well as visiting local organisations and businesses across the constituency.\nWhen a constituent writes to me, I will write to the relevant department or official or the Minister involved. Many problems are solved in this way and I always aim to respond within 10 working days although sometimes more complex cases may take slightly longer.\nWhat I cannot do, however, is have any jurisdiction over local Council decisions. I can write to on your behalf to the council and ask them to look into a problem or to reconsider an issue. In the first instance though, constituents should contact their local council or councillor directly.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_campaigns_my-campaign-save-south-downs/content_12.html": "Our countryside is under threat.\nLiberal Democrats and Greens who run our local councils have published plans to allow developers to build more homes in Ashington, Cowfold, Henfield, Partridge Green, Steyning, Pulborough, West Chiltington, Storrington, Sullington and Thakeham. They also plan to allocate gypsy and traveller sites to Codmore Hill, Thakeham, Storrington, West Chiltington, North Heath and Small Dole.\nMany of our communities have already taken more than their fair share of development and local services and infrastructure are feeling the strain. Together, we can fight back and push local councils to scrap these plans, stop building on new greenfield sites, and instead focus on existing brownfield land.\nFill in my survey below and join my campaign to save the South Downs.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-coldwaltham-post-office-and-immigration-debate/content_65.html": "I was very pleased to learn that the Post Office in the village of Coldwaltham has been saved as the result of an active campaign by the local community.\nSimon Berry, Chairman of Sandham Hall told me: “This is a huge achievement. We’ve moved from an abrupt closure which lasted for 9 months - and Post Office Ltd stating that our post office would not re-open - to having a working post office in our community again.”\nAs local MP I had twice met with senior Post Office executives and in the end, it was data from a trial that won the day as we were able to prove the part-time service was much used.\nIt was a big day in Parliament on Monday with a vote on the government’s Border Security, Asylum and Immigration Bill. This is a significant topic as the level and type of immigration impacts upon everyone: the cost and shortage of affordable housing, pressure on the NHS or GPs and the competition for well-paying jobs.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-thanks-health-workers-and-volunteers-arundel-south-downs/content_11.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-hosts-farm-fork-meeting-discuss-challenges-farmers-are-facing/content_66.html": "Andrew Griffith, Arundel and South Downs MP, held one of his regular Farm to Fork meetings today (Wednesday 9 April) at Fitzleroi Barn, Fittleworth, kindly hosted by owners Julia and Mark McDavid.\nIt was great to see so many local farmers, landowners and producers from across the constituency attend, especially during the busy lambing and planting period.\nOne of the many issues raised was the abrupt closure of the Sustainable Farming Incentive (SFI) from 11 March 2025 without notice, despite the government assuring farmers they would be given six weeks’ notice. This has left farmers shocked. The decision to close the current SFI has come at a time when farmers are facing an increasing uncertain landscape. Without clarity on what comes next farmers are left in limbo; they need a clear long-term plan and support from the government.\nAnother key issue raised was the Family farm and business “death” tax. The government do not understand the delicate tapestry of rural communities and the implications that this is going to have. Andrew pledged to continue to oppose this in Parliament. It affects a small number of people in a very large way and will cause immense damage. Food security needs to be one of the most important priorities for the government, we need to support our farmers, not keep hitting them with additional taxes and cancelling incentive schemes when they are already dealing with broader economic pressures.\nSouthern Water were invited to speak at the meeting, to give the farmers an update and a chance to ask direct questions. Tom Ormesher, Catchment Delivery Manager for Southern Water explained the investments Southern Water are making and the work they are doing with farmers and landowners to reduce contaminants at source.\nAndrew Griffith MP said:\n“Food security is vital. The farming industry is facing major challenges, and I will continue to fight for farmers across my constituency. The farming community needs o continue to use their voice against the proposed changes and to be ‘heard’.”",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_wrong-scheme-wrong-place-andrew-griffith-mp-supports-steyning-residents-views/content_24.html": "A proposed housing development on greenfields in Steyning was the main topic of discussion at a Steyning Parish Council meeting where South Downs MP, Andrew Griffith, was a guest speaker on Thursday evening (11th April).\nThe MP was invited to take part in a Questions and Answers session as part of Steyning’s Annual Parish Meeting which around 80 residents attended.\nAndrew Griffith fielded questions from residents about local concerns, but it was the proposed development on Glebe Farm which sparked the strongest passions - a farmland site which has applied to Horsham District Council for an astonishing 265 houses which would increase the size of the community by more than 10% at a single stroke. Having been rejected by the Neighbourhood Plan and previous Horsham administrations, the site was suddenly included in the Draft Horsham Local Plan which was voted on by Councillors late in 2023.\nResidents shared their shock and dismay that development is being considered for this historic farmland at the top of Kings Barn Lane, on land which teams with local wildlife and rare species, regularly floods, has poor road access to the already dangerous A283 and would heap pressure on already stretched school places, GP’s and other facilities.\nThe number of houses proposed far exceeds the number needed in Steyning and would not be of the type and price to meet the much smaller volume of genuinely local demand.\nAndrew Griffith stated that he is “unequivocally against” the site being developed which received a round of applause from the audience. He vowed to fight the application all the way with an impromptu show of hands from those present indicating unanimous opposition by attendees.\nThe MP stated that brownfield development is the preferred route for building sustainable communities, saying “we recycle everything else in life, so why not recycle the most valuable commodity – land?”. He contrasted the hypocrisy of Horsham Council “declaring a ‘climate emergency’ one minute and giving the green light to build on precious nature and farmland the next.”\nOther areas of concern raised with the MP in the meeting included Southern Water’s management of storm overflows, potholes on roads and footpaths, the desire to protect access to cash, and improving mobile and broadband signal in the town.\nThe meeting also included a presentation from Horsham District Council about their recent acquisition of 34 acres of a wildlife-rich site known as Bramber Brooks. Peter Cranford, Head of Parks and Countryside, presented the council’s plans for the site and the work to be undertaken by the Environment Agency to improve the habitat.\nAndrew Griffith said:\n“I am grateful to the Steyning Parish Council Chairman, Joanna Norcross, for inviting me to join this well attended meeting. As MP, I am always happy to support our communities and to hold myself publicly account to the residents whom it is my privilege to represent in Westminster.\nIt’s sad that a vibrant community such as Steyning finds itself under siege from development in Horsham’s local plan. It’s a special place to live and residents have my support in trying to keep it that way.”",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-easter-and-safe-road-survey/content_51.html": "The sun is out, bank holiday weekends are back, and many residents will have their peace disturbed by anti-social road users. Improving road safety and reducing the impact of anti-social drivers is one of my top priorities as your Member of Parliament. I meet regularly with the local police leadership and Police and Crime Commissioner, Katy Bourne, to raise this matter with them and I am glad that once again Sussex Police’s Operation Downsway is back and live, aimed especially at our rural roads.\nHowever, it is vital that they receive all the information that they need to target the right locations. That’s why I have launched my South Downs Safe Roads survey to hear directly about anti-social hotspots and when and where the nuisance is felt. I will share the results of this survey at my next meeting with Sussex Police. You can respond at www.AndrewGriffith.uk/SafeRoads\nThis week, I’m urging residents to have their say in Chichester District council’s Local Plan consultation which has recently reopened for a final say. Whilst most of us agree new homes for young people living locally are needed, in rural areas like ours there is careful balance to be struck. The council plans to build 10,000 homes in the district between now and 2038. That could be up to 40,000 more people – it’s simply mad.\nI was disappointed to see the dismissal of valid comments made by residents of Loxwood, Plaistow, Kirdford, Ifold and Wisborough Green. Putting – as proposed – 370 homes in these quiet and remote villages makes a complete mockery of the councils’ policy that ‘new development will be in accessible locations linked by high quality active travel, walking and cycle routes that also link to bus stops and, where available, rail stations’. Anyone waiting for public transport in the northern part of the district has a very long wait! Whilst we suffer, it is not right or serious that the government has cut housing targets for big cities such as London.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_CommunityPayback/content_41.html": "Communities blighted by vandalism and fly-tipping are now being be cleaned up by offenders as part of the Government's plans to crackdown on anti-social behaviour.\nRapid Deployment teams - made up of offenders serving Community Payback sentences – will be on call to swiftly deal with notorious instances of anti-social behaviour across the country after a successful pilot.\nMembers of the public are being invited to nominate projects in their local area which will see offenders carrying out hard graft such as picking litter from roadsides, scrubbing graffiti from underpasses or shopfronts, and maintaining neighbourhood beauty spots within 48 hours of cases being reported to the Probation Service.\nYou can nominate a local project to be cleaned up by offenders by clicking here.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_sign-up/content_31.html": "Tweet My regular newsletter has been designed to keep you up to date with the work that I do as the Member of Parliament for Arundel & South Downs. By signing up to my newsletter, you will receive information about what I have been up to in the constituency and in Westminster. To sign up, just complete the form on the left hand side of this webpage, or below if you're on a mobile phone.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-speaks-covid-19-roadmap/content_29.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_my-priorities/content_21.html": "Living in this South Downs constituency with my family, its always been easy for me to understand what matters to local people as we use the same roads, high streets and public services.\n1) Tackling rural crime and anti-social behaviour in our towns:\nNationally, the Government has recruited more than 20,000 new Police Officers – delivering on a commitment made in 2019.\nThat means that Sussex Police has recruited an additional 679 Police Officers since 2018 and the force now has more officers on our streets than 10 years ago.\nThis positive news has meant that we’ve seen neighbourhood crime fall by 33% since 2019 – a bigger reduction than the national average – and an expansion of our local Rural Crime Team who are expert specialists in tackling the crime that impacts our more isolated countryside communities.\nI am also a proud and prominent supporter of Sussex Police’s ‘Operation Downsway’ to target those who use our West Sussex rural roads in an anti-social and dangerous manner.\n2) Improving our local healthcare services:\nI have conducted one of the biggest ever local NHS Surveys in the area and regularly share the results with local NHS leadership and Ministers to try to shape priorities and fix issues where they arise. I've also worked closely with communities to support GP surgeries and save the local pharmacies which are often a fragile part of our High Streets but vital to residents.\nI’m especially pleased that the Government’s new Primary Healthcare Plan will end the 8am rush for GP appointments with a new system to book appointments immediately or signpost appropriate care elsewhere and extending funding for pharmacists to allow for a wider range of prescriptions – freeing up millions of GP appointments.\n3) Protecting our environment:\nFrom the top level of Government down to the most local consultations, I am an advocate against unsustainable rural over development in our community which harms the countryside. We do need new homes, and so it's exceptionally frustrating that the Government has reduced housing targets in our biggest city, London, so instead of utilising former commercial property and developing upwards not outwards to take a lot of pressure off the precious South Downs naturescape where we live, disproportionate numbers of homes are to be built under Labour in rural West Sussex.\nAnyone who has visited rural South Downs and seen the narrow roads, rural railway provision and relatively minor infrastructure will know that if we're going to massively increase housing supply, the middle of nowhere in West Sussex is not the place to start.\nSome people in our constituency have understandable concerns about the impact of the recent decision to lift the moratorium on shale extraction. I do not support fracking locally, as our as our transport infrastructure would be unsuitable for the extra traffic volumes, but I am glad that local communities will now be able to pursue these opportunities if they so wish.\nI also understand how important tackling sewage discharge is for many people. Indeed, this is the first Government to take steps to address storm overflows.\nIn August 2022, the Storm Overflows Discharge Reduction Plan was launched, setting out stringent targets to protect people and the environment, backed up by up to £60 billion capital investment, which is the largest infrastructure programme in water company history. Legally binding through the Environment Act 2021, the plan prioritises storm overflows that could cause the most harm while balancing the impact on consumer bills.\n4) Better broadband:\nFor those working from home, living in our most isolated areas, or indeed for our rural businesses, slow broadband can be a complete obstruction.\nThat’s why victory over the ‘battle for bandwidth’ is one of my top priorities.\nAfter working closely with Ministers, we’ve secured brilliant news for the most rural areas in West Sussex.\nIn addition to the many local Gigabit Broadband Voucher Scheme projects successfully delivering ultrafast broadband to South Downs community, work will start this year on £100 million worth of investment for broadband in the most ‘hard-to-reach’ areas.\nThis project, funded by the Government, means that for over 68,000 homes and businesses in the South Downs will see speeds shoot right up to 1,000mbps (depending on their broadband contracts).\nThe most recent figures from Building Digital UK, the Government organisation task with improving broadband speeds, show that 41.7% of residents in Arundel & South Downs now have access to ‘gigabit’ broadband (1000+ mbps download speeds) – representing a 618% increase in coverage since 2019. A total of 94.5% of residents now have access to superfast broadband (30-300 mbps download speeds), up from 91.2% in 2019.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-we-cannot-take-our-precious-and-delicate-nature-landscapes-granted/content_58.html": "After a long January, February passed in a flash and here we are in the first week of March. In meteorological terms at least, spring is here. Enjoy the sunshine though it would still be good if someone could tell the thermometer!\nAs one of the last areas in the southeast where we still get a good dark sky, it has also been wonderful to try to see all seven known planets aligned in the night sky.\nSpring is a great time of year to enjoy nature. On Friday I visited the RSPB Pulborough Brooks at Wiggonholt near Storrington. With beautiful views across to the South Downs, this reserve is set in one of the richest areas for nature in the country. At this time of year there are a fantastic array of birds: lots of aerobatic Lapwings and wintering wildfowl, such as Wigeon and Teal. The RSPB also looks after neighbouring Amberley Wildbrooks.\nWe cannot take these precious and delicate nature landscapes for granted which is why it is important that we make our rivers even cleaner and invest in the infrastructure to cope with the population influx in the southeast of England. I share residents’ concerns about the increases in our water bills, but the hard truth is that many of us spend more on a cup of coffee than a whole day of clean water and our sewage taken away. Since 2014 the average water and wastewater bill increased by just 0.5% compared with inflation of 33%.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-welcomes-community-victory-kithurst-hill-car-park/content_28.html": "Andrew Griffith, the Member of Parliament for Arundel & South Downs, welcomed the news that Kithurst Hill car park has been saved from closure.\nThe car park, a privately-owned rural car park at Kithurst Hill near Storrington, was set to close as it came close to the end of an existing contract.\nFollowing extensive conversations with the community and third-party organisations, Horsham District Council has agreed to take on responsibility for the car park for a minimum of two years. The campaign to keep the car park open was widely supported by the community and local elected leaders, with a petition supporting the vital South Downs link receiving thousands of signatures.\nCommenting, Andrew Griffith MP said:\n“It is brilliant news that Horsham District Council has stepped in to save this vital community asset.\nKithurst Hill Car Park is a lifeline for thousands of people who rely on the link to access the outstanding natural beauty around us on the South Downs and I am pleased the community’s voice has been heard.\nThe campaign has had my full support since the start, and this victory is a testament to the community who put their full weight behind it.”",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_mp-commends-police-action-illegal-rave/content_46.html": "Andrew Griffith MP has praised Sussex Police for taking prompt action over an Easter weekend to close down an illegal rave near the village of Cocking, between Midhurst and Chichester. The rave disturbed residents throughout the night and resulted in the closure of the A286 between Midhurst and Chichester.\nOn behalf of residents, the South Downs MP raised the incident with the Sussex Police Chief Constable early on Sunday and the police stood up an operation involving resources from multiple forces which closed down the event, arrested the organisers, confiscated equipment and arrested many drug drivers.\nRaves, or Unlicensed Music Events (UMEs), may seem like harmless gatherings of music lovers, but they are far from victimless. These unauthorized events take place on private land without safety regulations, putting attendees, farm animals, nature and surrounding communities at significant risk.\nWithout fire safety checks, emergency medical services, or crowd control measures, people are vulnerable to injury, overdose, or even death. Drug use is often widespread at these events, contributing to medical emergencies that organisers make no provision for – on site first aiders or even clear access for ambulances to get to young people overdosing for example.\nThis event took place in a remote, agricultural location. Not all livestock will yet have given birth, and the stress induced could lead to still births as well as the litter and destruction of habitats.\nRave organizers profit from ticket sales and drug distribution without contributing to the local economy or paying for necessary licenses. This creates unfair competition for those venues that do follow legal guidelines and invest in safety, staff, and infrastructure.\nAndrew Griffith MP, Member of Parliament for the rural location where the illegal rave took place said:\n“I commend Sussex Police on the way they dealt firmly with this illegal rave in a remote rural area, sending a message about their willingness to keep West Sussex free of such criminality. The organised criminal gangs behind such events try to fool people that these are harmless fun, but the damage is very real from supporting drug trafficking to environmental harm. Licensed venues in cities like Brighton, Chichester and Portsmouth provide safe places for people to enjoy themselves and they need all the business they can get.”",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_cookies/content_9.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-thanks-staff-henfield-medical-centre/content_19.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_About-Andrew/content_6.html": "Personal life\nAndrew has been married to wife, Barbara, for 27 years and they have two children – both now at University – a black labrador and an energetic cocker spaniel. Home is in the heart of the constituency near Petworth in West Sussex.\nCareer before Parliament\nAndrew had an unusual route into politics and wouldn't consider himself a 'career politician'. He spent over 25 years working in business and joined Sky where he spent most of his career - eventually serving its customers as the youngest FTSE 100 Chief Financial Officer, and Chief Operating Officer.\nDuring Andrew's time at Sky, the business grew its customer base from 3 million to 30 million viewers. Andrew also served as a Non Executive Director and then interim Chairman of Just Eat for which he was awarded Non-Executive Director of the Year in 2018 by The Sunday Times.\nParliamentary career\nAndrew was first elected as the Member of Parliament for Arundel & South Downs at the December 2019 general election after being selected in a competitive process by local members.\nFollowing boundary changes which added Midhurst and other rural communities in the north of the Chichester District to the constituency, Andrew was re-elected at the 2024 general election with one of the largest majorities of any Conservative Member of Parliament.\nIn Parliament, Andrew has served on the Science & Technology Select Committee, the House of Commons Procedure Committee and is the founder and Chairman of cross-party groups on Dark Skies and the Wines of GB.\nIn 2021 he introduced a Private Members Bill which aimed to attract driving record penalty points for offences under the Vehicle Excise and Registration Act 1994.\nIn 2022, he also introduced a Private Members Bill to require dog keepers to register a dog’s DNA on a database to support investigations into dog theft.\nMinisterial service\nAlthough his most important role is working to represent his constituents, Andrew has been proud to be asked to serve his country in a number of important Ministerial roles:\n- Minister for Policy and Head of the 10 Downing Street Policy Unit\n- Parliamentary Under Secretary in the Department for International Trade (Exports Minister)\n- Economic Secretary to HM Treasury (City Minister)\n- Minister of State for Science, Innovation and Research\nIn opposition, Andrew currently serves in the Shadow Cabinet as Shadow Secretary of State for Business and Trade.\nFind out more about Andrew\n- West Sussex is lucky to still be served by independent local journalism. You can find their coverage and articles by Andrew here:\nhttps://www.sussexexpress.co.uk/topic/andrew-griffith\n- Watch Andrew discuss his career and being Science & Innovation Minister on the top podcast, ‘Jimmy’s Jobs’ on YouTube (or your podcast provider).\nhttps://www.youtube.com/watch?v=vX2gI9umLm0\n- You can read about Andrew's life and music choices in this 'Desert Island Disc' style interview with Graffham Parish News (Page 12)\n- Read about Andrew's transition from business to politics in his interview with the Arundel Bell\n- Listen to a BBC Radio Sussex audio interview by Ben Weisz with Andrew as they walked about Stopham\nAndrew works hard to promote our area and build our community's brand - especially by sharing news with the local press. See what he's been up to by clicking here.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-meets-children-slindon-and-petworth-primary-schools-parliament/content_82.html": "Arundel and South Downs MP, Andrew Griffith met children from Slindon Church of England Primary School and Petworth Church of England Primary School during their visit to Parliament on Thursday (2nd February).\nThe schools took part in a free educational tour which gives young people a unique learning experience about how Parliament works. They toured the historical buildings at the heart of UK democracy. The children received an interactive session and learned how laws are made.\nTheir constituency MP, Andrew Griffith, joined the children on the tour for a questions and answers session.\nAndrew Griffith said:\n“It was a pleasure to welcome the schools to the Houses of Parliament where they had an opportunity to learn more about UK Parliament.\n“It was a brilliant opportunity to hear from some of my youngest constituents, and I cannot understate how impressed I was by the interest and passion around the issues facing the UK - from climate change to tackling bullying in our schools.\"",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_fighting-keep-south-downs-special/content_38.html": "I am very concerned to learn of plans to allow a ‘free-for-all’ wild camping in the South Downs National Park. Plans which I oppose.\nWild camping should be just that – reserved for the truly wild areas of the UK. I love our special countryside and want people to enjoy access but allowing anyone to set up camp anywhere they liked here in the South Downs would be a disaster for nature, be a trespassers charter and another headache for farmers and livestock owners.\nIt would also undermine the many existing South Downs campsites who work hard to provide regulated sites to keep our green spaces clean from human waste and our heathland safe from wildfires. The South Downs National Park authority has a reputation for being meticulous in applying its rules and regulations. You can’t have that approach to the law abiding and then the next minute support a wild camping free-for-all.\nIn contrast with the UK’s other designated National Parks which are located far from population centres, the South Downs is within easy reach of Greater London and the whole South East of England – one of Europe’s most densely populated regions - with 20 million people on its doorstep.\nThe plans were announced by shadow environment minister, Alex Sobel MP, who promised a future Labour-led government “would legislate so that people visiting national parks have the right to wild camp, as well as expanding public access to woodlands and waterways.”\nCamping is a wonderful experience and as the founder of the Dark Skies All Party Parliamentary Group no one could be a bigger fan of getting away from it all with just the countryside and night sky for company. However, the South Downs already has many licensed camp sites with the UK’s leading campsite website, PitchUp.com, listing more than 50 legal sites within 20 miles of Petworth alone.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_prime-minister-joins-andrew-congratulating-wscc-recycling/content_64.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_mp-shares-relief-midhurst-bridge-repaired-and-fully-re-opened/content_71.html": "Midhurst's MP Andrew Griffith has shared his relief at news that North Mill Bridge is fully reopen after weeks of being under traffic controls following a significant bridge strike because of a drink drive accident.\nThe MP had previously visited the bridge just hours after the accident to see the damage for himself and discuss with West Sussex County Council how to expedite the specialised repairs needed. He has been closely monitoring progress since.\nWhile the delays have been frustrating for local residents, commuters and visitors, it has also impacted footfall in the town. The county council prioritised the acquisition of the specially quarried stone to rebuild the listed bridge. Once the stone was delivered, a specialist stonemason and his apprentice were able to replace the missing section fairly swiftly. The bridge is now fully re-open and the temporary 3-way traffic lights have been removed.\nAndrew Griffith said:\n“The damaged bridge was something that Midhurst town simply did not need after navigating the impacts of the Angel Inn fire. I am hugely relieved to know the specialist repairs were completed quickly once the stone had arrived. It’s great to know that Midhurst is fully re-open, and I hope people will support the many shops and businesses and see everything the town has to offer.”",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_help-households/content_50.html": "As your Member of Parliament, I understand the pressure on everyone caused by inflated global energy prices. The Government has stepped in provide unprecedented support to households this winter and other organisations have also set out help that they have made available to those in need.\nYou can find details of support relating to all of the schemes below.\nSupport for Households:\nGovernment:\nIn May 2022, the Government announced £15 billion of support in the Energy Bill Rebate Package. Please see some of the measures listed below:\n- Energy Bill Discount - £400 off energy bills for households in Great Britain from this October. This automatic, non-repayable discount will be applied in six instalments between October 2022 and March 2023 to help households through winter.\n-\nEnergy Bill Relief Scheme - Discounts will be applied to energy usage initially between 1 October 2022 and 31 March 2023. For all non-domestic energy users in Great Britain this government supported price has been set at: £211 per megawatt hour (MWh) for electricity and £75 per MWh for gas.\n-\nCost of Living Payment - Households on means tested benefits, including Universal Credit, Pension Credit and Tax Credits, will receive a payment of £650 this year. This will be made automatically in two instalments, one in summer and another in the autumn, and is in addition to the £400 discount on energy bills.\n- Disability Cost of Living Payment - Individuals on disability benefits will receive a one-off £150 payment in September to help with extra costs, such as for specialist equipment or transport. This is in addition to the £650 Cost of Living Payment for disabled people who also receive means tested benefits.\n- Pensioner Cost of Living Payment - In the winter months pensioners can get between £100 and £300 to help pay heating bills. This winter, they will also receive an extra one-off £300 Pensioner Cost of Living Payment, which will be paid as an automatic top-up to the Winter Fuel Payment.\nFor further information on the Government’s measures to support with energy bills please click here.\nEnergy Companies:\nMany suppliers are also providing a variety of support to help people struggling with energy bills.\nWest Sussex County Council:\nWest Sussex County Council has set up a Community Hub. To request support from the Hub, including accessing the Household Support Fund, and where to get advice, click here.\nFurther support from other organisations:\n- Citizens Advice can assist people with a wide range of matters from financial advice to smart ways to reduce their cost of living.\n- Money Helper is a service which provides an extensive guide on money managing strategies and their guide contains budgeting tips for dealing with the energy price increase.\n- Other Services which may be able to support people who are struggling include the Money Advice Service, National Debtline and StepChange Debt Charity\n- AgeUK has useful information on the support you may be eligible for, see https://bit.ly/3yz3ErK. They also have a free advice line on 0800 055 6112. Lines are open 8am - 7pm, 365 days a year.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_surgeries-0/content_32.html": "I offer regular surgeries for constituents to raise specific issues where I may be able to assist. In order to ensure that I have time to deal with each case properly these are by appointment and obviously they are reserved for residents living in the Arundel & South Downs Constituency which you can check here.\nThe locations of my surgeries are rotated across my large rural constituency and if your town or village would like to host one of my surgeries, please get in touch to let me know. They are usually held in a Village Hall or similar community facility but I have held them in a Pub and I would be open to being hosted anywhere that there is the chance to sit in some privacy with constituents.\nSurgery appointments are prioritised for those in direct need of help or advice on issues affecting them that I can conceivably help with. These might typically be problems that you or a loved one are having with National Government Departments, the NHS, the Department of Work and Pensions, HMRC or something specific that you might like me to raise in Parliament or a Minister on your behalf. Please see my website page 'How I can help you' to understand what an MP can or can't do for constituents.\nWhilst a face to face meeting is often useful – and I do personally enjoy meeting my constituents and hearing their stories – sometimes an issue can be dealt with faster via an email or telephone call and this should usually be your first point of call.\nThere are also some matters such as local planning applications, potholes, neighbour disputes or the Criminal Justice System that I am unable to deal with. On many subjects relating to County or District Council matters your Local Councillor may be better able to help and you can find their details here.\nOn broader policy topics it is more appropriate to write to me to share your views as my post box will give me a good sense of the balance of opinion within my constituency. Again, I very much welcome this interaction with constituents and will endeavour to respond personally to all but the impersonal ‘standard template’ style correspondence which some lobby groups resort to.\nTo request an advice surgery appointment, please email [email protected].",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_DLsignup/content_57.html": "Tweet Please fill in the form on the left hand side, or below if you're on a mobile phone, to subscribe to my regular update newsletter.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-speaks-about-online-anonymity-and-anonymous-abuse/content_16.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_campaigns_campaign-save-rural-loxwood/content_22.html": "The draft local plan put forward by the Liberal Democrat-run Chichester District Council forces a minimum of 220 extra houses on Loxwood (on top of the 90 already in development).\nThis would mean years of noisy construction, less access to local GPs and Schools, and more pressure on local roads and sewage infrastructure. The only layer of government responsible and accountable for selecting or rejecting sites for development is the district council.\nIf you disagree with their decision, please sign this short petition and join my campaign to make your voice heard.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_GlebeFarmDevelopment/content_3.html": "I am 100% opposed to the proposed housing allocation for Steyning which is in the Lib Dem run Horsham District Council local plan. This is the wrong type of development in the wrong place. This speculative application to build at least 265 houses on land at Glebe Farm, off Kings Barn Lane, is now included IN the Draft Horsham District Local Plan.\nIt is disappointing to know that this site was voted for by Steyning’s current Green Party District Councillors (though it had always been opposed by their Conservative predecessors) and was even rejected as a potential site because it was classed as not-developable (SHELAA Housing Land Assessment,). This site was never even in Steyning’s neighbourhood plan.\nThere is no evidence at all that this site is supported by Steyning residents. They are far from being ‘NIMBYs’ and there are better development sites – such as the former Steyning Grammar School site – in Steyning which are ‘brownfield’ and would attract local support if redeveloped well.\nHistory teaches us two things. First, if this site is developed it is likely to open the door to even more development on adjacent sites to the north of the A283 – potentially thousands of additional homes. Second, these are unlikely to be genuinely affordable homes for genuinely local people. What a developer and the planners deem ‘affordable’ just means a discount to a market price that only looks attractive to buyers from Brighton or London.\nThe lane floods regularly, the field is rich in bio-diversity and natural habitats, it proposes vehicular access onto the busy A283, and such a huge increase in residents (an 11% growth for Steyning!) would certainly overwhelm local facilities.\nI will support residents who are opposed to this application and I hope that the following information is helpful so that you can share your views as widely as possible.\n** NEW ** I have submitted my own response to the planning application, a copy of which is below.\nWhat can you do?\n1. Sign my petition - https://www.andrewgriffith.uk/kings-barn-lane-development-have-your-say\n2. Join your local campaign group who are meeting on 15th May at 7pm. See their Facebook page Glebe Farm Steyning Objection. Email: [email protected].\n3. Add your comments to the planning portal on Horsham District Council’s website\nhttps://www.horsham.gov.uk/planning/planning-applications\nClick on ‘View and comment on planning applications’\nType in the planning application reference – DC/21/2233\n4. Write to your Steyning District Councillors:\n- Cllr Victoria Finnegan (Green Party) - [email protected]\n- Cllr Nicholas Marks (Green Party) - [email protected]\n5. Write to the Leader of Horsham District Council:\n- Cllr Martin Boffey (libDem) - [email protected]\n6. Write to your West Sussex County Councillor:\n- Cllr Dr Paul Linehan (Conservative) - paul.linehan@wessussex.gov.uk\n7. Write to your Steyning Parish Council:\n- Joanna Norcross (Chair) [email protected]\n8. Write to the following groups and organisations to ask them for their support:\nThe Steyning Society - https://steyningsociety.org.uk/contacts-and-grants/\nCPRE Sussex - http://www.cpresussex.org.uk/ - Email: [email protected]\nThe Sussex Wildlife Trust - Email: [email protected]\nGreening Steyning - https://greeningsteyning.org/contact/\nOuse & Adur Rivers Trust - https://oart.org.uk/contact-us/\nSteyning Downland Scheme - https://steyningdownland.org/\nThe Knepp Estate (rewilding projects) - Email: s[email protected]\n9. ** NEW ** List of bird species recorded at Glebe Farm\nStorks - Grey wagtail - Green Woodpecker - Bull Finch - Chaffinch - Sparrow Hawk - Goshawk - Kestrel - Peregrine Falcon - Cettis Warbler - Jackdaws - Storks (from Knepp Estate?) - Green Finches - Red Kite - Buzzard",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_local-mp-introduces-dog-dna-bill/content_72.html": "Local MP, Andrew Griffith, presented a Bill in Parliament to create a national register of ‘doggie DNA’ as a long term alternative to microchipping, creating a more modern solution to combat the growing scourge of dog theft as well as lost pets, ownership disputes and ‘puppy mills’.\nThe Bill was introduced in a high-profile slot straight after Prime Minister’s Questions on Wednesday 7th July.\nAs well as seeking to make DNA collection mandatory, the Bill seeks to unify the various existing microchip databases, which hold data in inconsistent formats as they are administered by a variety of commercial entities. A standardisation of these databases has been supported by The Dogs’ Trust, Battersea Dogs Home and the Royal College of Veterinary Surgeons. The DNA database would be achieved by a ten-year-long phasing in, allowing the DNA database to build up via the natural registration of new puppies, the costs of tests to reduce, and the existing chip registers to be formatted more consistently ahead of unification and the mandatory registration.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_SafeRoads/content_8.html": "Skip to main content\nAndrew Griffith\nMember of Parliament for Arundel & South Downs\nMain navigation\nAbout Andrew\nNews\nMy Campaigns\nMy Priorities\nSign up to my newsletter\nAnti-Social Road Use Survey\nArticles\nContact Me\nLocal government changes - Mayor of Sussex?\nMy position on Assisted Dying\nAndrew Griffith\nMember of Parliament for Arundel & South Downs\nTake my Anti-Social Road Use Survey\nTweet\nTo take my survey,\nclick here\nor go to\nhttps://www.surveymonkey.com/r/VY8XDWK",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-asks-about-eligibility-governments-levelling-fund/content_80.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-banning-phones-classrooms-correct-measure/content_67.html": "In recent weeks, I have received many letters from parents and teachers urging me to endorse the Safer Phones Bill which I then committed to do.\nThis was a private members bill which initially aimed to ban smartphones in schools, raise the online data-sharing age from 13 to 16, and prevent social media companies from exposing children to addictive apps. Unfortunately, the Labour government last Friday effectively ‘gutted’ the bill and it was passed with a mere commitment to conduct further studies and no firm actions. I still agree the original bill’s firm stance on banning phones in classrooms is the correct measure. In an age where digital devices dominate our lives, schools must be safe spaces with no distractions.\nWith my background in business, I keep a close eye on Westminster from the perspective of how things will help or damage firms – particularly the small enterprises of which West Sussex has many. This week in Parliament sees a particular ‘horror show’ with the Employment Rights Bill which is over 220 pages of new red tape and that is a blatant favouring of trade unions and employment lawyers over British businesses and employees. It will create a rigid labour market, killing economic growth and making it much harder for businesses to take a risk on hiring anyone. It will hurt the most young people trying to get their first foot on the ladder as without a track record that is the point at which someone took a chance on all of us. ‘Day one’rights to sue an employer may sound good to some but will see unemployment rise.\nWith the sun out at the weekend, I was pleased to join the team at Duncton Speed watch for a shift. Sussex Police’s Operation Downsway against noisy and speeding motorists starts again soon. ‘Thank you’ to all the speed watch volunteers and,motorists, please use our roads safely and with consideration for residents.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_how-i-can-help-you/content_2.html": "There are many ways in which I seek to support the roughly 90,000 constituents whom I represent. When it comes to casework for constituents, I often wish I had a magic wand but I can really only help you with those matters for which Parliament or central government is directly responsible. Good examples of this are:\n- Department for Work and Pensions – questions about benefits and pensions\n- Home Office – issues with immigration or passports (please see my dedicated passports page)\n- Department for Transport – Driving and vehicle licences\n- DEFRA – Rural payment schemes or supporting applications for grants.\nI support the UK approach of decisions and accountability being taken as close as possible to where the outcome will be most felt. That usually means they are based on the most detailed information and should lead to the best outcomes. So, for example, decisions on non-national highways are made locally by West Sussex County Council whose elected councillors and officers will (like me!) use them to travel around daily. In Education, we have a national exam system and a curriculum which Ministers make decisions on in Whitehall – but the allocation of school places and decisions on transport are made entirely locally (again in this case by West Sussex County Council). It often surprises people how many important matters are decided in local town halls – the UK has a much more devolved and democratic system of government than is often portrayed by the media which tend to over emphasise their coverage of Westminster.\nYou can find the contact details for your local council representatives by entering your postcode here. If it is a matter dealt with by their authority, they should be willing to help you.\nIn general, be assured that so long as there is not another elected tier of government or a complaints body that you should have previously tried, I will do my best to help!\nWhat can’t I do?\nThere are some clear areas I cannot help with. In essence, I have no ability to intervene with legal matters, interfere with court decisions, assist in settling private disputes with neighbours, employers or consumer law matters (such as parking tickets) or provide financial or legal advice.\nMembers of Parliament can never get involved in operational policing or court decisions. This is a constitutionally an important safeguard and most of us wouldn’t want to live in a country where politicians were able to direct the police or judges how to apply the law in specific individual cases. (This is different from Parliament itself democratically making the laws which is one of its core functions). Anything to do with crime must be raised directly to Sussex Police, or if you are dissatisfied about the Police themselves, then the Office of the Police and Crime Commissioner for Sussex is a separate, democratic elected position which does scrutinise the police force. I can – and regularly do – of course get involved in lobbying to make sure the police deploy their resources to serve the priorities of our rural community but never in a case-specific way or reference to any individual.\nFinally, as an MP, I have no jurisdiction whatsoever on individual planning applications or compliance with planning conditions. That’s something which you should engage exclusively with the local planning authority and your District Councillors (you can find your district council from the details on your Council Tax bill). Again, I do try to be as helpful as I can and where an elected community body such as a Parish Council seeks my support on a large scale ‘strategic’ planning proposal then it can be appropriate for me to use my voice on their behalf. National Planning Policy set by central Government does have a big impact locally and I do certainly weigh in very heavily on this subject in Parliament and in private discussions with Ministers.\nWhat do I need when you contact me?\nStrict Parliamentary protocols means that Members of Parliament can only deal with issues raised by their own constituents. That means you must include your address whenever you write to me (and apologies but with 88,000 constituents that means not just the first time but every time). Include any relevant details to your case including any reference numbers you may have been given. I and my team work very hard to help process cases and it can be very time consuming if you fail to provide the details needed. In a complex case it can be helpful to describe the outcome you seek.\nIf you need a matter taken up with the Ombudsman (of which there are in fact several), you can take your case up with them yourself except for the Parliamentary and Health Services Ombudsman (PHSO) who can only take up cases supported by an MP. Please send me your completed Ombudsman form and any background for consideration. I can’t automatically support these but I will be supportive wherever I can.\nFinally, if the matter is not something which I am able to take up on your behalf, and if you are unsure who to go to or you have a problem of a more general nature then your nearest Citizens' Advice Bureau will be able to guide you. They receive government and usually local funding too in order to help individuals.\nhttps://www.advicewestsussex.org.uk\nYou can also speak to a webchat adviser or access Citizens Advice Help Pages 24 hours a day.\nI and my team are here to help you. Many of the matters I deal with are sensitive, emotional and I understand constituents can be in frustrating circumstances. I must ask that your communications are polite and courteous at all times. I have a duty of care to my staff who are professional and employed by me via the parliamentary authorities. They are not themselves elected politicians. Harassment and abuse will not be tolerated in any form and will result in your case file being closed.\nFinally, for my staff at least, when we have been able to help resolve a matter to your satisfaction, a note of thanks is always appreciated!",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk/content_1.html": "A map of Arundel & South Downs\nMy action locally\nAm I your MP?\nEnter your postcode\nWelcome to my website. Here you can find out about my latest news and campaigns. I'm here to help with any local problem or concern, so please don't hesitate to contact me.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_campaigns/content_26.html": "Our campaign against the Glebe Farm Development I am 100% opposed to the proposed housing allocation for Steyning which is in the Lib Dem run Horsham District Council local plan. This is the wrong type of...\nMy campaign to save the South Downs Our countryside is under threat. Liberal Democrats and Greens who run our local councils have published plans to allow developers to build more homes in...\nThe campaign to save rural Loxwood The draft local plan put forward by the Liberal Democrat-run Chichester District Council forces a minimum of 220 extra houses on Loxwood (on top of the 90...",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_kings-barn-lane-development-have-your-say/content_10.html": "An impromptu meeting in Steyning was called by the Arundel and South Downs MP on Friday afternoon (26th) so that he could hear directly from residents who are against plans to build 265 new houses on a green field located off Kings Barn Lane.\nAround 80 residents turned up to hear from Andrew Griffi",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_category_Westminster-News/content_37.html": "Statement on the death of HM Queen Elizabeth II 9th September 2022 I am deeply saddened by the news of the death of Her Majesty Queen Elizabeth II. Her Majesty dedicated herself in service to our nation and the Commonwealth... Westminster News",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_events_feed/content_35.html": null,
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_accessibility/content_27.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_category_Speeches-in-Parliament/content_45.html": "Andrew Griffith MP opposes Heath Common development in Parliament 20th July 2021 Local Member of Parliament, Andrew Griffith, last week spoke in a Westminster Hall debate on Planning Reform. During the debate, Andrew drew Rt Hon Chris... Speeches in Parliament\nLocal MP introduces Dog DNA Bill 8th July 2021 Local MP, Andrew Griffith, presented a Bill in Parliament to create a national register of ‘doggie DNA’ as a long term alternative to microchipping, creating a... Speeches in Parliament\nAndrew Griffith MP hosts debate on British Wine 24th June 2021 Andrew Griffith MP, Arundel & South Downs, hosted an Adjournment Debate in the House of Commons on Wednesday 23rd June to celebrate the outstanding success of... Speeches in Parliament\nAndrew asks FCDO to promote and showcase British wines 15th June 2021 In questions to Foreign, Commonwealth and Development Office Minister Nigel Adams MP, Andrew asks if British embassies and high commissions will promote and... Speeches in Parliament\nAndrew calls on Health Secretary to protect weddings and motorsport events 14th June 2021 Andrew calls on the Secretary of State for Health and Social Care Matt Hancock to work with the Culture Secretary to ensure weddings and motorsport events can... Speeches in Parliament\nPrime Minister joins Andrew in congratulating WSCC on recycling 21st April 2021 During Prime Minister's Questions, Andrew congratulates West Sussex County Council on recycling 53% of their household waste. Speeches in Parliament\nAndrew asks about eligibility for government's Levelling Up fund 16th March 2021 In questions to the Parliamentary Under Secretary of State for Rough Sleeping & Housing Eddie Hughes, Andrew asks whether Arun, Chichester, Horsham and... Speeches in Parliament",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-please-try-buy-british/content_68.html": "After promising readers progress on the Midhurst North Mill Bridge last month, I am pleased to say that good progress has indeed been made. The specially quarried stone arrived at the start of last week. I have popped along to monitor progress a few times and repairs and repointing are coming along well. Hopefully just a few more days until the road fully re-opens.\nAs the days lengthen and the growing season starts, please try to buy British food where possible. Last week I visited a West Sussex grower whose greenhouses are already delivering fresh strawberries to major supermarkets. A close look at the raspberry and blackcurrants on the shop shelves still reveal other countries of origin like Morocco, Egypt and even Peru. Let’s support our farmers and growers.\nLast week saw the Chancellor unveil her Spring Statement. The accompanying OBR forecasts confirmed what independent commentators have been saying for a while – that the economy is flatlining and corrective action in the form of cuts to public spending were necessary. I am certainly not against tough choices and the number of people on welfare in our country is too high but as a former finance director, I also know that it is only business that creates truly sustainable growth and jobs. I would have liked to see measures like the jobs tax, family farm death tax, rise in business rates or the red-tape Employment Bill ditched or reduced.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_privacy/content_30.html": "This document outlines how Andrew Griffith MP processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Andrew Griffith MP\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Andrew Griffith MP.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Andrew Griffith MP, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Andrew Griffith MP via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_westminster-trips/content_69.html": "Free guided tours of Parliament are available to constituents. The walking tour of the Palace of Westminster includes -\n- Westminster Hall, the ancient hall at the heart of the Palace where Parliament first sat and where many historic events have taken place\n- The House of Commons, including the Speaker's Chair and the famous green benches and the 'lobbies' where MPs actually vote\n- The House of Lords, including the Royal Throne\n- The Queen's Robing Room, Royal Gallery and many other fascinating parts of the Palace of Westminster\nPlease note that tours are very popular and places are limited so generally have to be booked about six months in advance.\nPlease contact us to enquire about a visit to Westminster.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_category_Articles/content_40.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day 28th April 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next... Articles\nAndrew Griffith MP: Easter and safe road survey 23rd April 2025 The sun is out, bank holiday weekends are back, and many residents will have their peace disturbed by anti-social road users. Improving road safety and reducing... Articles\nAndrew Griffith MP: Communities, Easter and Christianity 17th April 2025 Representing the largest part of the South Downs National Park in West Sussex, I would like to congratulate all involved on the 15th anniversary of its official... Articles\nAndrew Griffith MP: Please try to buy British 3rd April 2025 After promising readers progress on the Midhurst North Mill Bridge last month, I am pleased to say that good progress has indeed been made. The specially... Articles\nAndrew Griffith MP: concerns over proposed government powers on seizure of land 20th March 2025 Last week the government finally published the 167-page Planning and Infrastructure Bill with its plans to reform the planning system. This impacts every single... Articles\nAndrew Griffith MP: Banning phones in classrooms is the correct measure 13th March 2025 In recent weeks, I have received many letters from parents and teachers urging me to endorse the Safer Phones Bill which I then committed to do. This was a... Articles\nAndrew Griffith MP: We cannot take our precious and delicate nature landscapes for granted 6th March 2025 After a long January, February passed in a flash and here we are in the first week of March. In meteorological terms at least, spring is here. Enjoy the... Articles\nAndrew Griffith MP: we do need to spend much more on defence 27th February 2025 For all the focus on President Trump and what he has said in recent days, he is surely right that the UK and other NATO nations need to spend much more on... Articles\nAndrew Griffith MP: Coldwaltham Post Office and immigration debate 13th February 2025 I was very pleased to learn that the Post Office in the village of Coldwaltham has been saved as the result of an active campaign by the local community. Simon... Articles",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-meets-sussex-police/content_54.html": "Keeping our communities safe is a priority which is why I regularly meet with Sussex Police to discuss rural crime and the many issues that matter most to my constituents.\nI met with Superintendent Andy Saville & Chief Inspector James Davidson to discuss local policing and their priorities moving forward and very much look forward to working with the team over the coming months.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-asks-business-secretary-focus-green-steel-production/content_39.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-speaks-importance-getting-students-back-universities/content_15.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-pleased-see-so-many-towns-and-villages-preparing-80th-anniversary-ve-day/content_4.html": "I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May. Across the country, the anniversary will be marked with official national events such as parades, commemorative church services, and an anniversary concert in Westminster Hall of Parliament. Her late Majesty The Queen would have loved the events which would have been so personal to her own experiences.\nLocally there is plenty for residents to take part, starting from this weekend. In Bury village, the parish is hosting a 'celebration picnic' on the 5th of May to include a special toast paying tribute to all those who served in the Second World War and to reflect on the values that they were fighting for. In Arundel, a proclamation will be made in the town square, and later in the evening, there is a beacon lighting and music in Jubilee Gardens. Midhurst has a programme of events including a special talk at the Old Library from the West Sussex archivist about the very significant role our county played in the second world war. In Upper Beeding, they have taken a novel approach of using augmented reality artwork projected onto local buildings which can be viewed through a smartphone whilst Steyning is holding a historical reenactment in the town centre, bringing to life the experiences of those who lived through the war. In Pulborough, a vintage car parade will showcase vehicles from the era, adding a nostalgic touch to the celebrations. There will be lots more besides – these are just the events I am aware of at the time of writing.\nFinally, remember, for any resident that wish to stay connected with all things that I am up to in West Sussex and Westminster, please do subscribe to my monthly newsletter for insights into local issues, upcoming events, and important announcements. Just head to my website to sign up.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-every-sign-government-going-make-planning-issues-worse/content_60.html": "There could not be a subject more important to get right for residents of West Sussex than planning. Unfortunately, all the signs are that this government are about to make it worse. I am expecting that Angela Rayner will this week confirm her plans to ride roughshod over local communities which will result in a vast increase in housebuilding in Sussex. Sixty per cent more in Chichester and 40 per cent more in Horsham – that’s 2,500 additional homes every single year in just these two districts alone.\nThis is the same government whose first act was to cancel any improvements to reduce congestion on the A27 which leads to rat-running and HGV’s through our communities. They have got this completely wrong. The homes that the nation needs are in places full of brownfield sites, and places which are well supplied with infrastructure such as 24/7 public transport, hospitals, universities and the broadest set of shopping. We call these places ‘cities’ and only last week the respected Centre for Cities produced a report confirming that whilst West Sussex has absorbed more than its fair share of new houses, London has fallen catastrophically short. For purely political reasons, the government is lowering the housing targets for London whilst imposing higher ones elsewhere. This is not to absolve local councillors of their responsibility.\nWhatever the national targets may be, individual site selection is wholly up to them, and the scale of development being proposed around Barnham, Loxwood, Storrington or in Steyning is completely inappropriate when brownfield sites within the same districts lie unused. Having recently given evidence at hearings against the Chichester Local Plan, I will be doing the same at Horsham Town Hall this week. There is literally no point councillors declaring ‘climate and nature emergencies’ and then the very same councillors and their political parties giving the green light to destroy ancient hedgerows, important habitats and create water run off that overflows sewers and is polluting our rivers.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_passports-new/content_83.html": "I am receiving a disproportionate number of enquiries from constituents regarding passports. Due to COVID-19, HM Passport Office saw a significant drop in the number of people applying for passports, with over 5 million people delaying their applications throughout 2020 and 2021. But with international travel returning to normal, more and more people are applying for a new passport. People are being urged not to leave their application for a British passport to the last minute, with demand at an all-time high. Since April 2021 HM Passport Office has been advising people to allow up to ten weeks when applying for their passport. This remains the case.\nWith the help of my small team, I can help expediate cases only where there is genuine and urgent need to do so. Please note there is no escalation process available to MP’s offices for passports associated with holiday or business travel within the 10 week processing time.\nBelow are the answers to the most frequently asked questions which I will keep updated;\nQ. What is the current service standard for passport applications (new and renewals)?\nWhilst there is much in the news at present suggesting a backlog at the Passport Office (HMPO) as passports are not being renewed within 3-6 weeks, the HMPO have recommended allowing 10 weeks for routine in-country (UK) applications since April 2021.\nIf you are applying by post, rather than online, please note that the details of the application will need to be manually loaded by the HMPO - this will add to the processing time and you may find that this means the application takes longer to process. The HMPO receive an extremely high amount of post everyday and this may take several weeks to be added to the system. Applicants are encouraged to apply on online where possible.\nQ. Is there a faster route to getting a new passport or renewing one?\nYes, the HMPO offer two other routes – an online premium service and a 1 week fast track process. More details are available here: https://www.gov.uk/get-a-passport-urgently.\nIt is important to note that these routes/appointments are very popular at this time and whilst the HMPO have increased capacity we have received reports that constituents have not always been able to access local availability.\nQ. What if I need a passport for urgent travel for compelling and compassionate grounds?\nThe HMPO recommend you contact their Passport Adviceline https://www.gov.uk/passport-advice-line if you need a passport to travel urgently for medical treatment, because a friend or family member is seriously ill or has died, or for urgent government business. Please also see below ‘How can my casework team help for urgent travel?’\nQ. What enquiries can the MP’s office assist with?\nThe HMPO are only accepting and escalating enquiries from MP’s offices for the following types of applications:-\n- those for urgent travel for compelling and compassionate reasons\n- those for non-urgent travel where the application date was 10 weeks or more ago ie outside of their recommended 10 week processing time.\nPlease note there is no escalation process available to us as an MP’s office for passports associated with holiday or business travel within the 10 week processing time. Please also see Q. I am due to travel in the next 2 weeks - what can I do?\nQ. How can my casework team help if you applied more than 10 weeks ago?\nIf you applied more than 10 weeks ago, please email me on [email protected] with the following details:\n- Name of the applicant\n- Home address\n- Date of birth\n- Application ref (PEX number)\n- Application date\n- Type of passport – adult first/adult renewal/child first/child renewal\n- Details of how you applied – online or by post?\n- If you have posted any documents (including application) please provide tracking reference number(s)\n- If this is a child application – which parent applied? Please provide full name of parent.\n- Your travel date\nOnce this detail is received we can escalate the application to the HMPO – please note that there is no guarantee of how long this matter will take to resolve, my team will do their best to assist you. Please also see Q. I am due to travel in the next 2 weeks - what can I do?\nQ. How can my casework team help for urgent travel?\nWe may be able to assist if you need to travel urgently for compelling and compassionate grounds, for example, one that relates to medical reasons (eg a person needs to travel for urgent essential medical treatment not available to them in the UK) or personal matters (eg a person needs to travel to visit a close family member or friend who is not expected to survive or for their funeral).\nTo be able to raise this with the HMPO we will need to provide independent evidence of the need to travel. This could be a letter from a hospital/doctor regarding the friend/relative’s condition and life expectancy or details of a funeral from the funeral director.\nIf you need to travel urgently, please email me at [email protected] with the following details:\n- Name of the applicant\n- Home address\n- Date of birth\n- Application ref\n- Application date\n- Type of passport – adult first/adult renewal/child first/child renewal\n- Details of how you applied – online or by post?\n- If you have posted any documents (including application) please provide tracking reference number(s)\n- If this is a child application – which parent applied? Please provide full name of parent.\n- Details of the urgent need to travel – my casework team can liaise with you on what types of evidence is required.\nEnquiries relating to urgent travel needs for compelling and compassionate grounds will be prioritised by my casework team.\nQ. I am due to travel in the next 2 weeks - what can I do?\nIf you applied online at least 6 weeks ago you are able to approach the HMPO to request an upgrade when you are 2 weeks before the travel date. Please note there is likely to be a charge for this. As an MP’s office we are not permitted by the HMPO to make this request for you. Please note - if you applied by post the 6 weeks is counted from when the application is loaded to their system.\nTo request an upgrade you will need to call the HMPO adviceline on 0300 222 0000 (https://www.gov.uk/passport-advice-line), they will provide you with an email address which you can then send details of your application and booked travel.\nNOTE: Even if you apply for, and are accepted for, an upgrade there is no guarantee that the Upgrade Team will be able to process the applications in time for travel. If they are they will contact you around 48hours prior to travel to make arrangements with you.\nIn the subject line of your email please use the date of travel followed by the application number eg Date of Travel 22nd July 2022 - PEX 123 456 7890 (NB Paper applications may start with a PASS reference or other code).\nIn your email you should include the following details:\n- The date of travel\n- The application number\n- The lost reference number (if applicable)\n- The name of the applicant\n- The date of birth\n- Home address\n- The type of application (eg adult/child plus first/renewal)\n- A screen shot showing the confirmation of date of travel (eg flight tickets etc)\n- Where you could travel to, to collect the passport if you want it to be printed locally (the closest to us is the London Office which is a short walk from London Victoria station)\nLondon HM Passport Office\nGlobe House, 89 Eccleston Square,\nLondon,\nSW1V 1PN\nThe London office is on Eccleston Square/Belgravia Road. To get to the office from Victoria Station, take exit 1 via Hudson Place, which is next to Platform 1. Turn right, walk to the top of the road and cross at the traffic lights on your left. The London Customer Service Centre is on the corner.\nENDS",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_contactme/content_18.html": "How you can contact me\nBefore contacting me, you should check that this is a matter your Member of Parliament can actually deal with. There are some details here.\nIf you are a constituent – please check here first – please write to:\nAndrew Griffith MP\nHouse of Commons\nWestminster\nLondon\nSW1A 0AA\nAlternatively, you may wish to send me an email: [email protected]\nYou MUST include your full name, full address and postcode in every email as Members of Parliament may only correspond with their own constituents.\nDo check the spelling carefully – a misspelt email address is the most common reason why constituents occasionally say they have not had a reply.\nNote - do not include links in your email as I will not open these for security and your message is highly likely to end up in the Parliamentary spam filtering system. Small PDF attachments (under 1Mb) generally are ok.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_category_Speeches/content_7.html": "Andrew asks Business Secretary for focus on green steel production 25th March 2021 In questions to the Secretary of State for Business, Energy and Industrial Strategy Kwasi Kwarteng, Andrew calls for the government to work with industry to... Speeches\nAndrew speaks about online anonymity and anonymous abuse 24th March 2021 In a general debate about online anonymity and anonymous abuse, Andrew spoke about his support for a petition started by his constituent Katie Price. Speeches\nAndrew speaks on Covid-19 roadmap 22nd February 2021 Following a statement by the Prime Minister on the Covid-19 lockdown roadmap, Andrew welcomed the certainty it provided for businesses and welcomed the... Speeches\nAndrew thanks staff at Henfield Medical Centre 9th February 2021 In questions to the Secretary of State for Health and Social Care Matt Hancock, Andrew thanks the 'Henfield Heroes' of Henfield Medical Centre, who have already... Speeches\nAndrew speaks on importance of getting students back to universities 3rd February 2021 In questions to the Universities Minister Michelle Donelan, Andrew says that as vaccines are now being rolled out, nothing is more important than getting... Speeches\nAndrew thanks health workers and volunteers in Arundel & South Downs 2nd February 2021 In questions to the Secretary of State for Health and Social Care Matt Hancock, Andrew expressed his thanks to health workers, GPs, NHS Sussex and all the... Speeches\nAndrew Griffith MP pays tribute to teachers 29th January 2021 In questions to Schools Minister the Rt Hon Nick Gibb, Andrew pays tribute to the hard work of teachers and school heads during the crisis. Speeches",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_my-position-assisted-dying/content_20.html": "Updated - Friday 29th November\nWe debated and voted on the Assisted Dying of Terminally Ill Adults Bill in the House of Commons today.\nThe debate was emotive with powerful speeches from Members across the House. I was in Parliament to hear the debate in person. Many speakers recounted personal stories of end-of-life moments as well as the experiences and views of their constituents and of medical and legal professionals.\nOver the last few months, I have fully engaged in correspondence with thousands of constituents, conducted a dedicated local survey and held my own well-attended meeting which any constituent who wished to could have attended. In short, I have listened diligently and made up my mind only after a thorough process.\nThe upshot is that whilst trying to remain open minded on the principle, I was convinced that this Bill was rushed in its drafting, has been afforded too little Parliamentary time for real scrutiny or to amend and it has too many deficiencies even to achieve its own objectives. When changing the law, it is right to apply the precautionary principle and to put the burden of proof on those seeking to make the change. For these reasons my vote today was against the Bill.\nI fully sympathise with those who wish to see a change in the law, especially to provide relief from suffering that no palliative care can entirely eliminate. However, on something of such great magnitude I looked for the most rigorous safeguards and narrowly defined use cases. The legislation presented to the House for debate contained only limited safeguards, and those it does contain have been found by many experts to be severely lacking.\nThe legislation asked for each case to be overseen by the High Court. However, it does not even specify which division of the High Court should be assessing these cases. Leading members of the judiciary, including the former president of the Family Division, have highlighted that if it is limited to the Family Division, where only 19 judges currently sit, it will result in a large backlog and significant delays in a system that is already under significant pressure.\nMoreover, the Bill does not mandate that any legal hearings be conducted in person, and leaves open the likelihood that most are decided remotely as a paper exercise with no actual investigation as to whether there may have been coercion or suggestion. A decision and then the subsequent death itself could be conducted without any next of kin or close relatives being informed. The issue of coercion is one I give great weight to, and it seems to me entirely probable that if this Bill passed, we would see some cases where at best individuals felt their death was ‘relieving loved ones of a burden’.\nMany of the arguments in favour of the Bill, seemed to me to overlap significantly with legal issues around end-of-life care pathways and access to palliative care. I have heard many heart-rending cases about end-of-life experiences but many upon close investigation were failings of compliance with existing procedures which this Bill would not have helped with. I have learned for example that, post-Shipman, there would be benefit to all for better legal and medical clarity around the administration of pain relief. I hope that this now happens.\nOn palliative care, it is common ground in today’s debate that it would benefit from greater and more certain forms of funding. I strongly support this much as I also support the Dilnot reforms on long term care. The fact that palliative care is often delivered outside of the NHS is a strength: hospices and charity nurses seem to find it easier to deliver genuinely patient centric care at these moments than the busy and NHS might be able to. There is no reason why much greater public funding could not follow the patient, thus preserving the independence of the sector and choice for the patient and their family. In terms of funding, I would rather that the government properly fund palliative care for all than some other areas of public spending. There are choices to be made.\nFinally, the rushed timetable of this significant legislation did not give Parliament sufficient time to debate something of such magnitude. As a private members bill, it was allocated only five hours to consider. In today’s debate alone more than 160 Members of Parliament sought to speak, and many others would have liked to but recognised there was little chance of being called. For a piece of legislation that changes the entire approach of the legal system and the NHS this in my view was wholly insufficient. No impact assessment has been conducted to reveal the impact on our courts and GP’s and identify the practical challenges to be overcome. Notably the current Health Secretary, Wes Streeting, who is well placed to assess the impact upon the NHS, has been vocal in his opposition. It would also be wrong to ignore the fact that so many newly elected MPs voting have barely weeks of experience in how Parliament works and the proper legislative process. It would be far better for the advocates of this Bill to come back in a future session and for the government to have allocated proper time for Parliament to do its job properly.\nI’d like to thank every constituent who has contacted me on this issue and who attended my consultation. Whether or not they agree with my ultimate position, I hope all feel that I engaged properly, and that all were given their chance to have their say and to be heard respectfully.\nAndrew",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-calls-health-secretary-protect-weddings-and-motorsport-events/content_53.html": "Click here to read about what an MP can do\nClick here to read about School Visits to Parliament\nClick here to read about organising trips to Westminster\nI am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-pays-tribute-teachers/content_33.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_mp-says-heads-must-roll/content_74.html": "Arundel and South Downs MP Andrew Griffith has responded to the planning inspector’s reasons for cancelling the Horsham Local Plan and sending it back to the drawing board.\nThe planning inspector who had been appointed to the examination of the Draft Horsham Local Plan, paused the hearings abruptly in December citing concerns that the Plan was unsound.\nIt is understood that the inspectorate’s reasons for this were because the draft plan fell short of meeting housing needs and meeting its ‘duty to cooperate’ with Crawley. Most importantly, the council has failed to do enough to explore alternatives, especially water-neutral schemes. Water neutrality is a unique issue impacting Horsham, and some parts of Crawley and Chichester, and means that housebuilding must not place any new burdens on the water supply network where water is extracted from Hardham, near Pulborough.\nAndrew Griffith said:\n“Few will be surprised that the planning inspector has ordered the whole plan to be withdrawn.\n“There were concerns from the very beginning that this Plan simply wasn’t going to work. It was rushed through by the LibDems with Green Party support in an attempt to paper over their dysfunctional councillors.”\n“Other councils with exactly the same constraints are progressing with their plans, including in Chichester which is also a water-neutrality district. The fallout from this will mean many more months, maybe even years, of uncertainty for communities and the plan-making process. If the Lib Dem councillor leadership had an ounce of integrity, resignations would now follow.”",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-meets-steyning-residents-against-horsham-district-plan/content_23.html": "An impromptu meeting in Steyning was called by the Arundel and South Downs MP on Friday afternoon (26th) so that he could hear directly from residents who are against plans to build 265 new houses on a green field located off Kings Barn Lane.\nAround 80 residents turned up to hear from Andrew Griffith and to share their shock and dismay about the housing plans, declaring the fields as flood prone and rich in biodiversity. Traffic access onto the A283 and the strain on local facilities, such as the GPs, were other reasons given by residents in their objections.\nAndrew Griffith shared his deep concern that rural parts of West Sussex are increasingly on the frontline of all new development in the country. This, he said, is a tractable problem if residents and their elected representatives can work together to help to defend farmland and green fields from unnecessary development.\nDistrict councils are a separate tier of elected government for planning decisions, and the MP has encouraged residents to make their view known to Horsham District Council.\nThe proposal to build on Glebe Farm has also been included in the Draft Horsham Local Plan which went out for public consultation earlier this year.\nAndrew Griffith once again stated that he is “unequivocally against” the site being developed and vowed to keep up the fight alongside residents who oppose it.\nAndrew Griffith said:\n“This was an excellent example of residents rallying together to protect a part of their village from unwanted, unnecessary and unsustainable development. It should not be the case that planning authorities waive through developer-led proposals when there are already neighbourhood plans in place which plan for sustainable development.”\nSee Andrew’s news release of 12th April - https://www.andrewgriffith.uk/news/wrong-scheme-wrong-place-andrew-griffith-mp-supports-steyning-residents-views",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_cdn-cgi_l_email-protection/content_48.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_category_Opinions/content_14.html": "Andrew Griffith MP: Every sign the government is going to make planning issues worse 9th December 2024 There could not be a subject more important to get right for residents of West Sussex than planning. Unfortunately, all the signs are that this government are... Opinions\nFighting to keep the South Downs special 17th August 2023 I am very concerned to learn of plans to allow a ‘free-for-all’ wild camping in the South Downs National Park. Plans which I oppose. Wild camping should be just... Opinions\nAndrew Griffith MP welcomes community victory on Kithurst Hill Car Park 17th January 2023 Andrew Griffith, the Member of Parliament for Arundel & South Downs, welcomed the news that Kithurst Hill car park has been saved from closure. The car park, a... Local NewsOpinions\nLocal MP reiterates opposition to unsustainable development 25th May 2021 On May 20th, Andrew Griffith MP joined Phil Hornby on ITV Meridian's The Last Word to discuss an array of issues, including unsustainable levels of development... Opinions",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-celebrates-kithurst-hill-car-park-lifeline/content_79.html": "Andrew Griffith, the Member of Parliament for Arundel & South Downs, has congratulated community campaigners on winning a lifeline for Kithurst Hill car park.\nLast week, it was announced that the possible closure of Kithurst Hill car park would be deferred until January 2023 to allow time for community organisations to properly explore options to ensure that the popular car park can stay open permanently.\nThe car park is regularly used by locals and visitors as a gateway to the South Downs, but was under threat from closure after the costs of keeping it open mounted.\nA huge community campaign to save the car park, including a petition signed by thousands of local residents, was joined by local elected representatives in a bid to save the much-loved community facility.\nThis weekend, the local Member of Parliament met with Cllr James Wright, Cabinet Member for Environment and Rural Affairs at Horsham District Council, at the car park to celebrate the success of the campaign.\nAndrew Griffith MP said:\n“It is excellent news that the community campaign has secured a lifeline in the campaign to keep this crucial asset open, ensuring we can all enjoy what the South Downs has to offer.\nThe campaign has my full support and I have been in touch with all parties involved to encourage a solution to be found.\nWe hear a lot from the National Park Authority about ‘inclusion’, yet the closure of this facility would hit the disabled, the elderly and those with young children the hardest.”\nCllr James Wright said:\n“I am encouraged that WSCC has agreed to keep the car park open until the end of January 2023.\nThis extra time will allow several organisations who are negotiating with the landowner to secure the long-term future of the car park.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_about-rss/content_13.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-speaks-milland-annual-parish-assembly/content_47.html": "Andrew Griffith, the Arundel and South Downs MP, spoke to an audience in Milland at their Annual Parish Assembly on Wednesday evening\nThe MP spoke in his introduction about how he has lived locally with his family for the past 20 years and discussed the type of issues that he spends his time on that derive primarily from the small parishes, villages and towns that make up this unique constituency. He discussed the landscape which is intrinsically linked to the farming community and our roads which statistically are some of the most dangerous in the Southeast of England largely due to the infrastructure that was not built to support such a variety of road users and the increase of traffic. He also spoke of the many challenges that our high street businesses are currently facing and how important it is that we all support them in our towns and villages. He was joined by parish and district councillor Brett Burkhart.\nThe MP moved on to his role in Westminster as a legislature in the House of Commons and mentioned the new Planning and Infrastructure Framework bill and the work that is going on around the devolution agenda, key to his role is holding the government to account on policies that will affect his constituents.\nThere was time for the audience to ask the MP questions, mainly on planning and devolution, unitary authorities and the impact this will have on the community and what responsibility a Sussex Mayor would be accountable for.\nFollowing the Milland Annual Parish Assembly event Andrew Griffith said:\n“Thank you to everyone for their time last night, it was wonderful to have such a great turnout and range of questions- I am always surprised at how engaged people are and the depth of interest there is on so many subjects. It is important to me that I am able to visit or the rural communities and speak directly to my constituents and I hope that I will be invited back in the future!’’",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_statement-death-hm-queen-elizabeth-ii/content_61.html": "I am deeply saddened by the news of the death of Her Majesty Queen Elizabeth II.\nHer Majesty dedicated herself in service to our nation and the Commonwealth over seven decades - providing strength, inspiration and continuity to generations. Her guidance has led us through times of trial and success, happiness and sadness.\nMy thoughts are with the Royal Family. A Mother, Grandmother and Great-Grandmother, and a Queen, her life has touched us all.\nOn behalf of the constituents of Arundel & South Downs, I thank Her Majesty for her lifetime of service.\nGod Save the King.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-speaks-debate-advanced-research-and-invention-agency-bill/content_52.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_feed/content_25.html": null,
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_school-visits/content_62.html": "Every year, MPs welcome hundreds of schoolchildren to Parliament and I am always tries to meet visitors from the constituency to talk about the politics and history of Westminster, the work of an MP and about local issues.\nIf you would like to book a tour of the Palace of Westminster, please contact my office.\nTours can be booked for groups of 20 people and repeated tours from the same school are acceptable. Unfortunately, I cannot meet travel costs.\nFor more details, such as the best times to arrange a tour of Parliament, please visit www.parliament.uk/visiting/visiting-and-tours/ukvisitors. Please be aware that tours do need to be booked months in advance.\nThere are also free educational visits which, in addition to a tour of the Palace, offer children and students the chance to learn more about Parliament through interactive workshops. There is also a travel subsidy available to state schools which could cover up to 75% of your travel costs.\nAll bookings are made by phone, one school term in advance, on a given date. To make a booking for an educational visit, please visit www.parliament.uk/education/visiting-parliament.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-we-do-need-spend-much-more-defence/content_73.html": "For all the focus on President Trump and what he has said in recent days, he is surely right that the UK and other NATO nations need to spend much more on defence.\nIt was a privilege as MP to participate a few years ago in the Armed Forces Parliamentary ‘shadowing’ scheme but one take-away for my time with front line units is how thinly stretched our armed forces are across different territories and types of warfare. On top of the army, navy and air force, these days must be added space and cyber. Challenges have been amplified by our support for the war in Ukraine where for example almost the whole of the British Army’s AS90 self-propelled 155 mm shell artillery units were given to Ukraine.\nIn the UK we spend around 2.3% of GDP on defence – far less than the US at more than 3.4% and fellow European NATO member, Poland at 4.1%.\nThe already highly taxed UK has no more potential to put taxes up, and borrowing would simply leave a bigger burden for our children, so I am prepared to support this Labour government on a cross-party basis in taking tough decisions in cutting other budgets, including welfare, to boost spending on our military to the levels required.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-welcomes-post-offices-commitment-coldwaltham-model/content_5.html": "Andrew Griffith MP has thanked the Post Office for their agreement to continue their support for the Coldwaltham Post Office after he brokered a meeting between top Post Office boss Neil Brocklehurst, and Coldwaltham community representatives, Simon Berry OBE of Sandham Hall, and Iain Dreger of Coldwaltham parish council.\nThe group met in Andrew’s offices in Westminster to discuss a sustainable future for the service which had previously been saved from closure by the community.\nThe service will now move in time to be open for 3 hour sessions on two days a week, part funded by the community through the parish council precept and community donations, and part by the Post Office. Neil Brocklehurst described this as an interesting model which could be a test bed for future services and enable more rural communities to retain a Post Office service.\nThe original Post Office was closed suddenly on September 2023 following the retirement and ill-health of the former postmistress who sadly passed away soon after. The Coldwaltham post office is an important community hub, and after some considerable work by the parish council and residents, supported by their MP, Andrew Griffith, the Post Office Limited agreed to trial a re-opening.\nThe success of their trial - which delivered an increased number of transactions over fewer hours - led to the Post Office agreeing to formally re-open the service in February 2025.\nSimon Berry OBE said: \"We are delighted that our efforts and huge community support have led to an equitable and sustainable funding model with the Post Office, and we look forward to sharing lessons with other communities that would like to keep their post office open. We are very grateful to Andrew and his team for their vital support.\"\nAndrew Griffith MP, Member of Parliament for Coldwaltham, Watersfield and Hardham, the parishes that will benefit the most from the saved Post Office, said:\n“I wish to thank Post Office CEO, Neil Brocklehurst, for this commitment on behalf of the local community who have campaigned valiantly for their post office counter to be reinstated. After our meeting in Westminster I know that Simon and Iain were keen to get back to the parish to share the good news.”",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_local-mp-reiterates-opposition-unsustainable-development/content_42.html": "On May 20th, Andrew Griffith MP joined Phil Hornby on ITV Meridian's The Last Word to discuss an array of issues, including unsustainable levels of development in West Sussex.\nAndrew Griffith reiterated his opposition to this level of development in West Sussex and addressed the possible alternatives, including brownfield development and a renewed focus on housing growth in urban areas.\nSince his election, Andrew has raised the inappropriateness of development at a number of sites in West Sussex, including at his very first speech in Parliament as MP for Arundel and South Downs. The local Member of Parliament also held an Adjournment Debate on the topic in late 2020 in the House of Commons.\nAbove is a clip of Andrew's statements on overdevelopment in West Sussex, and the full programme can be found here: https://www.itv.com/news/meridian/2021-05-20/the-last-word-may-2021\n(Video credit: ITV Meridian)",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news/content_43.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May. Across the country, the anniversary will be marked with official national events such as parades, commemorative church services, and an anniversary concert in Westminster Hall of Parliament. Her late Majesty The... Articles\nAndrew welcomes Post Office’s commitment to the ‘Coldwaltham model’ 23rd April 2025 Andrew Griffith MP has thanked the Post Office for their agreement to continue their support for the Coldwaltham Post Office after he brokered a meeting between... Local News\nAndrew Griffith MP: Easter and safe road survey 23rd April 2025 The sun is out, bank holiday weekends are back, and many residents will have their peace disturbed by anti-social road users. Improving road safety and reducing... Articles\nMP says heads must roll 22nd April 2025 Arundel and South Downs MP Andrew Griffith has responded to the planning inspector’s reasons for cancelling the Horsham Local Plan and sending it back to the... Local News\nMP commends police action on illegal rave 22nd April 2025 Andrew Griffith MP has praised Sussex Police for taking prompt action over an Easter weekend to close down an illegal rave near the village of Cocking, between... Local News\nAndrew Griffith MP: Communities, Easter and Christianity 17th April 2025 Representing the largest part of the South Downs National Park in West Sussex, I would like to congratulate all involved on the 15th anniversary of its official... Articles\nAndrew Griffith meets with Sussex Police 15th April 2025 Keeping our communities safe is a priority which is why I regularly meet with Sussex Police to discuss rural crime and the many issues that matter most to my... Local News\nAndrew Griffith MP speaks at Milland Annual Parish Assembly 10th April 2025 Andrew Griffith, the Arundel and South Downs MP, spoke to an audience in Milland at their Annual Parish Assembly on Wednesday evening The MP spoke in his... Local News\nAndrew Griffith MP hosts Farm to Fork meeting to discuss the challenges farmers are facing 9th April 2025 Andrew Griffith, Arundel and South Downs MP, held one of his regular Farm to Fork meetings today (Wednesday 9 April) at Fitzleroi Barn, Fittleworth, kindly... Local News\nAndrew welcomed to Lurgashall's annual parish meeting 4th April 2025 Andrew Griffith was given a warm welcome by residents of Lurgashall village on Thursday evening (4th April) at their Annual Parish Meeting that was hosted... Local News",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-communities-easter-and-christianity/content_63.html": "Representing the largest part of the South Downs National Park in West Sussex, I would like to congratulate all involved on the 15th anniversary of its official designation in 2010. Over the past fifteen years, it has helped to promote and preserve a cherished landscape attracting millions of visitors annually, supporting local communities and wildlife conservation efforts. To celebrate, a series of special events and guided walks have been organised, highlighting its natural beauty, historical landmarks, and cultural heritage.\nIt was a pleasure to speak to an audience in Milland at their well-attended Annual Parish Assembly last Wednesday evening, discussing the type of issues relating to the small parishes, villages and towns like Midhurst which make up this unique constituency. I was joined by local district councillor Brett Burkhart and together we talked about road safety, reducing speed limits, supporting local farmers and food producers and the work I have been doing in Midhurst to support the town and its high street businesses.\nAn apology, albeit it not for something I actually said. Philosophically, I am supportive of adults’ freedom to choose. It’s why I’ve voted against things like the ban on smoking in pub gardens and opposed making the covid vaccine mandatory. On the BBC on Sunday, I said I was against councils using taxpayers’ money to promote veganism as many are sadly doing. That’s different from being against anyone’s individual choice of diet! I’m happy to clarify this.\nFinally, I would like to wish all readers a very happy Easter this coming weekend. Despite a regrettable decline, Christianity is still the UK’s largest religion with just under half the population identifying as such in the most recent consensus. It is right that we celebrate this most special of Christian moments whether from the perspective of faith or tradition. Every community is blessed with a church, many of which are full of character and history. I know that whatever your faith, all will be welcome.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-concerns-over-proposed-government-powers-seizure-land/content_76.html": "Last week the government finally published the 167-page Planning and Infrastructure Bill with its plans to reform the planning system.\nThis impacts every single community and, since West Sussex has taken far more than its fair share of development, planning has always been a topic I have studied closely.\nWe all know that the current set up is inexcusably slow and reform is necessary to speed up building on brownfield sites and in cities which unlike rural areas, have infrastructure in abundance. The reforms copied from the previous government’s Banner Review are good and should slightly reduce the cost and the endless delays created by judicial review.\nHowever, this government is not to be trusted. Like many, I am very concerned by powers the government intend to give themselves for the compulsory seizure of land – even farmland or green spaces. Governments take such powers by illustrating a few extreme cases but then before we know it, are interfering on the flimsiest pretext. It’s a bit like snooping powers which were talked about for fighting terrorism and ended up with local councils using them to see if households had put the wrong items in their recycling bin. Many councils already use rate-payers money in their own speculative development schemes and can even give themselves planning permission. This could be a charter for climate obsessed councils to build solar panels all over local farmland at your expense.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_local-mps-ask-secretary-state-call-cobwood-solar-farm-decision/content_34.html": "Andrew Griffith MP, with the full support of Horsham MP Jeremy Quin, has written to the Secretary of State for Housing and Communities to ask that he ‘calls-in’ a decision from Horsham District Council who last night (21st May) granted permission to build a large solar farm at Cowfold.\nBy asking the Secretary of State to call-in the decision, Andrew Griffith is asking for the government to assess and determine the application for themselves, pointing out that the councils’ decision had not considered the Written Ministerial Statement from the Energy Secretary Claire Coutinho, which states that agricultural land must be protected from development, including solar farms, for the purposes of food security.\nHorsham District Council’s planning committee south – made up of councillors led by the Liberal Democrats in coalition with the Green Party – approved the application by 11 votes to 4, with one abstention. Conservative councillors did not support the application.\nTheir decision has granted permission for Low Carbon UK – an investment firm – to build on 45 hectares of farmed land owned by the Camelia Botnar Foundation, displacing the tenant farmer who farms 17 of the fields with crops and dairy cattle. One of the last remaining dairy farmers in the area.\nThe significant development would stretch across three large parcels of land in beautiful countryside, located north of the A272 Cowfold Road, and includes a solar photovoltaic farm, associated infrastructure, substation, transformers, and security fencing.\nAndrew Griffith is sceptical of the investment company’s goals and has pointed out to the Secretary of State, Michael Gove, that Low Carbon UK proposed production levels to a maximum of 49.9MW. Any site that proposes production of 50.0MW or more would have to be dealt with as a Nationally Significant Infrastructure Project (NSIP) and therefore be determined by the Planning Inspectorate on behalf of the Secretary of State.\nThe MP points out that careful calibration of this application appears to be a calculated manoeuvre to ensure the planning application was determined at a local level.\nAndrew Griffith says that he echoes the concerns of local residents and nature groups are alarmed at the scale and location of the proposal which is on fields which are farmed with crops and dairy cattle. It is an area rich in bio-diversity, located close to the Knepp Estate and the Weald to Waves project area.\nHorsham MP, Jeremy Quin, is supporting the appeal to the Secretary of State. He commented:\n“The focus of solar should be rooftops and non-productive land. The recent Government statement has made quite clear the importance of agricultural land. Even as we improve our energy mix protecting and enhancing the natural environment is of critical importance.”\nAndrew Griffith MP said:\n“Horsham’s approval of this application declares ‘open season’ for solar speculators and their financial backers of the few unspoiled areas which Horsham’s LibDem Green coalition don’t already plan to build houses on! There is nothing green or sustainable in foreign built solar panels displacing local food production or nature recovery. This is why I have written to the Secretary of State, because I feel strongly that this cynical application flies in the face of what the government are doing to protect food and energy security.”",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_ladybirds-henfield-welcomed-westminster-their-parliamentary-tour/content_77.html": "Andrew Griffith organised a Parliamentary visit and tour for the Ladybirds of Henfield – a community-focused women’s group based in the village of Henfield.\nThe visit and tour were headed by group leader Jeanette Fiander, who made a personal thanks to Andrew for being helpful and accommodating those members with mobility issues by organising an accessible route.\nJeanette Fiander said:\n“We found the whole thing a joy and one we will all remember for a very long time. Everyone was so courteous, the tour went like clockwork, the tour guide knew the history and explained the decor and the workings of both Houses.”\nThe group had contacted Andrew to organise a guided tour of Parliament and to discover the histories and heritage of the Palace of Westminster and to learn about the work of the UK Parliament.\nAs the Member of Parliament of Arundel and South Downs, Andrew can provide free tours of the Palace of Westminster to any constituent that contacts and requests a visit. Tours can be organised for individuals as well as groups, with mobility impairments or other disabilities being accommodated, to ensure that every resident has the opportunity to see the place synonymous with democracy and a centre of power for over nine hundred years.\nTo organise your visit and tour of Parliament write to Andrew at [email protected].",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-asks-fcdo-promote-and-showcase-british-wines/content_81.html": "Andrew Griffith MP: Pleased to see so many towns and villages preparing for 80th anniversary of VE Day Monday, 28 April, 2025 I am pleased to see so that many villages and towns in Arundel & South Downs are getting ready to mark the 80th anniversary of Victory in Europe (VE) Day next week on Thursday the 8th May.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-griffith-mp-opposes-heath-common-development-parliament/content_56.html": "Local Member of Parliament, Andrew Griffith, last week spoke in a Westminster Hall debate on Planning Reform. During the debate, Andrew drew Rt Hon Chris Pincher MP's attention to the 556 residents who signed his petition against development at Heath Common, Storrington.\nAndrew also presented a five-point alternative plan to resolve the UK's housing crisis.\nYou can watch the full speech by clicking the video above.",
  "https_www_andrewgriffith_uk_/https_www_andrewgriffith_uk_news_andrew-welcomed-lurgashalls-annual-parish-meeting/content_55.html": "Andrew Griffith was given a warm welcome by residents of Lurgashall village on Thursday evening (4th April) at their Annual Parish Meeting that was hosted especially so that they could hear directly from their MP on issues that matter to them.\nThe evening included an informal meet and greet over canapes prepared by Sarah who also cooks the lunches for Lurgashall's monthly village lunch.\nAndrew was welcomed to the meeting by long standing resident and Parish Council Chair Anthea Martin-Jenkins. The MP spoke about rural and national matters and why he chose to become a Member of Parliament. He described how he works with local councils and agencies to help on local issues. The evening was then dedicated to an enthusiastic questions and answers session chaired by parish and district councillor Brett Burkhart, covering a variety of topics including the very topical 10 per cent US tariffs on UK goods.\nThe parish meeting was one of several that Andrew Griffith has attended with more scheduled, and is just one of the ways he can represent the rural communities in his constituency.\nFollowing the Lurgashall meeting, Andrew Griffith said:\n“I am grateful to all the residents who turned out for the Annual Parish Meeting, for their warm welcome and great questions. This is one aspect of the work I do as a Member of Parliament that I thoroughly enjoy and I place a great importance on meeting with the parish councils and the local people. My thanks to Anthea Martin-Jenkins for the invitation.\""
}