{
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_campaigns_investment-schools-and-education/content_20.html": "At the 2019 General Election, the Government pledged a £14 billion increase in schools funding, including a minimum funding guarantee per pupil. I committed to fighting for a bigger share of the increased funding for schools given that Staffordshire is an area that has historically been underfunded due to previous funding formulas. This issue is even more critical now following the coronavirus pandemic and the amount of education every child will need to catch up on.\nI will also continue to back the Government’s plans to reorientate the education sector to provide more skills-based and technical education opportunities.",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_according-kates-burton-mail-column-060423/content_6.html": "Kate writes a bi-weekly column for the Burton Mail. This column was originally featured in the 7th April print edition.\nBurton’s story, and its success, is built on its natural assets. The River Trent, and the quality of the local water, with its natural properties, is why people first choose to brew beer here.\nSignificant investment is being made through the Town Deal to enhance the washlands area and ensure the River Trent is an integral part of our town centre once again. However, residents will share my concerns about the recent discolouration of the River Trent and what may have caused this. I wrote to the Environment Agency on this matter and they told me that they had identified the company responsible for what was silt pollution and they are now considering enforcement action.\nLast year, I was proud to vote for the Government's Storm Overflows Discharge Reduction Plan. This week, the Government announced that it was speeding up the implementation of this plan, which requires water companies to upgrade their systems and treat sewage before discharging it. This is the largest ever environmental infrastructure investment, costing £56 billion over the next 25 years, with initial targets for improvement across England by 2025.\nResidents can be assured that the Government is clamping down on shareholder pay-outs and making sure water companies put customers first, the first Government to put this requirement on the sector.\nIncreased monitoring, driven by the Government, has also led to The Environment Agency and Ofwat launching the largest criminal and civil investigations into water company sewage discharges ever. Ofwat can fine companies up to 10% of annual turnover and the Environment Agency will act against non-compliance, which can include criminal prosecution for which there can be unlimited fines. Courts also have legal powers to prosecute CEOs and company directors where there is evidence against those individuals and where it is in the public interest to prosecute.\nUpgrading the Victorian-age sewage systems to meet modern needs and environmental targets is a big task, and it won't happen overnight. It's essential that we address this issue, but we must do so in a way that doesn't put the burden on billpayers.\nAny residents who witness any environmental incidents should report these to the Environment Agency by calling their 24-hour hotline on 0800 807 060.",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_privacy/content_3.html": "This document outlines how Kate Kniveton processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Kate Kniveton\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Kate Kniveton.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Kate Kniveton, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Kate Kniveton via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_category_Westminster-News/content_11.html": "Kate Kniveton MP statement on the passing of HM The Queen 9th September 2022 As the sad news unfolded yesterday, I like many of her subjects felt a deep sense of loss. Having had the good fortune to attend a reception given by Her... Westminster News\nKate Kniveton MP congratulates Liz Truss 5th September 2022 Photo: Liz Truss visit to Molson Coors as International Trade Secretary in September 2021 Burton and Uttoxeter’s Member of Parliament, Kate Kniveton, has... Westminster News\nNext Prime Minister Survey 20th July 2022 The process of electing a new Leader of the Conservative Party, who will ultimately become Prime Minister, is well underway. The Parliamentary Conservative... Westminster News\nStatement from Kate Griffiths MP on the resignation of the Prime Minister 7th July 2022 Statement from Kate Griffiths MP: “I am pleased that the Prime Minister has taken the decision to resign. “It was clear that he no longer commanded the support... Westminster News\nStatement from Kate Griffiths MP 6th July 2022 As constituents know, I have supported the Prime Minister over recent months because I believe that he had got all the big decisions right, and his leadership... Westminster News\nStatement on today's vote of confidence 6th June 2022 \"As an MP elected in 2019, I know many people voted for me because they wanted to see a Conservative government led by Boris Johnson; and the Prime Minister was... Westminster News\nKate Griffiths MP raises pothole funding with the Chancellor 1st February 2022 Burton and Uttoxeter’s Member of Parliament, Kate Griffiths, has today (Tuesday 1st February) raised the issue of central Government funding for road... Westminster News\nVote on Standards Report 3rd November 2021 Today, I voted against the Government whip on an amendment to change the process which looks into complaints about the conduct of Members of Parliament. As many... Westminster News\nKate raises support for pubs during winter months 23rd November 2020 Today, the Prime Minister announced his COVID-19 Winter Plan. In the Commons, MP for Burton, raised necessary support for pubs and breweries that rely on good... Westminster News",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_kate-kniveton-mp-visits-eton-park-junior-school/content_22.html": "The Member of Parliament for Burton and Uttoxeter, Kate Kniveton MP, visited Eton Park Junior School on Friday 15th September.\nMs Kniveton met with Claire Shaw, the newly appointed Executive Principal of Lansdowne Infants and Eton Park Juniors, along with Kathy Hardy, Chief Executive Officer of The de Ferrers Trust, and Ali Bickle, Principle at The de Ferrers Academy.\nThe local MP and school leadership team held positive discussions about what more could be done to support local residents within the school’s catchment area and increase links with the local community and community leaders. Discussions were also had about some exciting project ideas for Early Years and how it might be possible to display the school children’s artwork around the local area.\nAs part of the meeting, the local MP toured the school, visiting pupils in their classrooms and seeing how they had settled in at the start of the new academic year. Ms Kniveton extended an invitation to the Eton Park pupils to come visit her in Parliament and to see where important decisions are debated and made.\nCommenting, Kate Kniveton MP said:\n“It was great to visit Eton Park Junior School and to meet with Claire, Kathy and Ali at the start of the new academic year. It is so encouraging to hear the School and Trust’s leadership so excited about the coming months and how Eton Park can play its part in the local community.\n“I very much enjoyed seeing the pupils and wishing them well as they begin a new year. I hope to welcome them to Westminster sometime in the future!”",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk/content_1.html": "Featured News Kate Kniveton welcomes the Conservatives’ clear plan to invest £20 million in Burton as part of action to level up East Staffordshire and secure a brighter future The Conservatives are investing £15 billion into levelling up the country,… Kate Kniveton says ‘only the Conservatives have a clear plan for pensioners’ and welcomes new Triple Lock Plus to cut taxes for pensioners across Burton and Uttoxeter The Conservative Government have cut tax for working people by reducing… Kate Kniveton MP meets with carers at Burton’s Brewhouse Local Member of Parliament, Kate Kniveton, has today (28/05/24) visited Carers… Find me on Facebook Follow me on Instagram My map\nKate Kniveton welcomes the Conservatives’ clear plan to invest £20 million in Burton as part of action to level up East Staffordshire and secure a brighter future The Conservatives are investing £15 billion into levelling up the country,…\nKate Kniveton says ‘only the Conservatives have a clear plan for pensioners’ and welcomes new Triple Lock Plus to cut taxes for pensioners across Burton and Uttoxeter The Conservative Government have cut tax for working people by reducing…\nKate Kniveton MP meets with carers at Burton’s Brewhouse Local Member of Parliament, Kate Kniveton, has today (28/05/24) visited Carers…",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_kate-kniveton-mp-meets-carers-burtons-brewhouse/content_21.html": "Local Member of Parliament, Kate Kniveton, has today (28/05/24) visited Carers Plus Café in Burton to meeting with residents who preform caring responsibilities for loved ones.\nThe Café and support group, meet at the Brewhouse in Burton every Tuesday offering help and a friendly ear to local carers. The group provides tea, coffee and biscuits and the opportunity for a friendly chat as well as offering a number of activities and days out.\nThe group is the brainchild of Rod Gent, a former President of the Rotary Club, and is still supported by the organisation which helps with volunteering and facilitating each meeting.\nDuring the MPs visit, Kate met with carers along with Rod Gent and other voluntary Rotarian staff to listen to their experiences and what attending the café means to them. The support team have also set up similar carers’ groups in Repton and Uttoxeter as well.\nCommenting, Kate Kniveton MP:\n“Carers make a valuable contribution providing support to family members, friends and neighbours. Being a carer can sometimes feel lonely which is why it is important to be able to meet others with similar caring responsibilities.\n“I was delighted to meet with local carers at the Plus Café in Burton. They are a really lovely group, friendly and welcoming.\n“I applaud Rod and his team, for their initiative and providing the support they do each week to carers in our area. I look forward to visiting again soon.",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_according-kates-burton-mail-column-090324/content_9.html": "Kate writes a bi-weekly column for the Burton Mail. This column was originally featured in the 9th March print edition.\nThis June marks the 80th anniversary of the D-day landings on the beaches of Normandy. This battle marked the beginning of the liberation of France and western Europe by the Allies from the Nazis and Hitler’s dictatorship. Democracy is precious and each November we pay our respects to the fallen and the sacrifice they made to protect our freedoms and way of life.\nRecently, we have seen a shocking increase in extremist disruption and criminality – including on the individuals and institutions that serve our democracy. A central pillar of any free society is that change can only come through peaceful, democratic process.\nLast week, the Prime Minister gave a speech on the steps of Downing Street, tackling head on the unacceptable rise in extremism and threats to our democratic representatives we have seen in the UK and across the world. As an MP, I and my colleagues see this up close. But we will not be deterred or discouraged by fear from fulfilling our duty and ensuring we are available to our residents.\nWe must not allow a minority to destroy our national self-confidence, and we must stand up for our shared values in all circumstances, no matter how difficult. The Prime Minister has made it clear to the police that they must take a zero-tolerance approach to extremist tactics. The Government will also ensure that if anyone here on a visa is spewing hate or seeking to intimidate people, they will lose their right to be here.\nThis is our home, our nation, our set of shared values and our future. We will stand together to combat any who wish to sow seeds of division or pose a threat to our democracy.",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_category_Opinions/content_5.html": "According to: Kate's Burton Mail column 18/05/24 19th May 2024 Kate writes a bi-weekly column for the Burton Mail. This column was originally featured in the 18th May print edition. New figures have revealed that there are... Opinions\nAccording to: Kate's Burton Mail column 04/05/24 5th May 2024 Kate writes a bi-weekly column for the Burton Mail. This column was originally featured in the 28th April print edition. A key measure of any society is how it... Opinions\nAccording to: Kate's Burton Mail column 09/03/24 10th March 2024 Kate writes a bi-weekly column for the Burton Mail. This column was originally featured in the 9th March print edition. This June marks the 80th anniversary of... Opinions\nAccording to: Kate's Burton Mail column 30/06/23 30th June 2023 Kate writes a bi-weekly column for the Burton Mail. This column was originally featured in the 30th June print edition. Whilst we have been enjoying some warmer... Opinions\nKate's Uttoxeter Echo column 21/06/23 22nd June 2023 Kate writes a bi-w eekly column for the Uttoxeter Echo. This column was originally featured in the 21st June print edition. With the warmer weather now... Opinions\nAccording to: Kate's Burton Mail column 21/04/23 22nd April 2023 Kate writes a bi-w eekly column for the Burton Mail. This column was originally featured in the 21st April print edition. Collecting a parcel from the Post... Opinions\nAccording to: Kate's Burton Mail column 06/04/23 7th April 2023 Kate writes a bi-w eekly column for the Burton Mail. This column was originally featured in the 7th April print edition. Burton’s story, and its success, is... Opinions\nKate's Uttoxeter Echo column 29/03/23 30th March 2023 Kate writes a bi-w eekly column for the Uttoxeter Echo. This column was originally featured in the 29th March print edition. I was pleased to hear the... Opinions\nAccording to: Kate's Burton Mail column 10/03/23 11th March 2023 Kate writes a bi-w eekly column for the Burton Mail. This column was originally featured in the 10th March print edition. It doesn’t matter where you are in the... Opinions",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_category_Local-News/content_12.html": "Kate Kniveton welcomes the Conservatives’ clear plan to invest £20 million in Burton as part of action to level up East Staffordshire and secure a brighter future 1st June 2024 The Conservatives are investing £15 billion into levelling up the country, as part of their clear plan to ensure talent and hard work, not geography, determine... Local News\nKate Kniveton says ‘only the Conservatives have a clear plan for pensioners’ and welcomes new Triple Lock Plus to cut taxes for pensioners across Burton and Uttoxeter 29th May 2024 The Conservative Government have cut tax for working people by reducing National Insurance from 12 per cent to 8 per cent. Now they will cut tax for pensioners... Local News\nKate Kniveton MP meets with carers at Burton’s Brewhouse 28th May 2024 Local Member of Parliament, Kate Kniveton, has today (28/05/24) visited Carers Plus Café in Burton to meeting with residents who preform caring responsibilities... Local News\nKate Kniveton MP visits completed Burton towpath improvements 17th May 2024 Kate Kniveton, Member of Parliament for Burton and Uttoxeter, recently (10/05/2024) visited a section of the Trent Canal, to see the completion of the new... Local News\nKate Kniveton MP hosts flooding meeting in Marchington and Draycott in the Clay 10th May 2024 The Member of Parliament for Burton and Uttoxeter, Kate Kniveton, last night (09/05/24) held a meeting in Marchington Village Hall for residents to hear from... Local News\nKate Kniveton MP meets with Winshill Co-op staff to discuss new measures to tackle retail crime 26th April 2024 Member of Parliament for Burton, Kate Kniveton, visited Winshill Co-op today (26/04/24) to meet with staff and to hear about the issues they have been facing... Local News\nKate Kniveton MP visits Barclay’s new Burton banking hub 25th April 2024 Member of Parliament, Kate Kniveton, today (25/04/24) visited Barclays new banking hub in Burton following their commercial decision to close the previous High... Local News\nKate Kniveton MP to host two public meetings on flooding issues 25th April 2024 Local Member of Parliament, Kate Kniveton, is set to host two public meetings on flooding to give residents the opportunity to hear what local authorities are... Local News\nAccording to: Kate's Burton Mail column 20/04/24 22nd April 2024 Kate writes a bi-weekly column for the Burton Mail. This column was originally featured in the 20th April print edition. On May 2nd, Staffordshire will be going... Local News",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_Bintax/content_2.html": "Thank you for your support in stopping Labour's unfair Bin Tax. You can sign the petition here.\nAs the prospective parliamentary candidate for Burton and Uttoxeter, I work every day alongside your Conservative Local Councillors on behalf of residents and for the benefit of our local communities.\nWhilst you're here, we would like to hear from you about the local issues you care about and hope you will take a few minutes to complete our survey.",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_cookies/content_7.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_kates-uttoxeter-echo-column-210623/content_16.html": "Kate writes a bi-weekly column for the Uttoxeter Echo. This column was originally featured in the 21st June print edition.\nWith the warmer weather now certainly here with long evenings, many of us look forward to getting home after work and making the most of the lighter evenings. However, sadly for residents in Burton and Uttoxeter that have to use the A50 as part of their commute, this is not guaranteed with regular delays to their journey.\nResearch undertaken by Midlands Connect last year found that these regular delays on the A50 and A500 in morning and evening peak periods amount to 2,760 hours per day, meaning almost 700,000 hours a year are lost due to delays on the whole A50/A500 corridor.\nThis is just one of the reasons that improvements to the A50 are a top priority for me and why, as Project Champion of the North Midlands Manufacturing Corridor, we must see the fruition of plans which would see the removal of the McDonald's and Derby Road roundabouts with new slip roads to separate local traffic and ease congestion, improve road safety and reduce air pollution. These plans, if enacted, would bring substantial local benefits to Uttoxeter and to commuters right along the A50/A500 corridor.\nI am delighted therefore that National Highways have announced that they will be undertaking studies to assess the viability and reward of making this investment into the A50/A500. National Highways is undertaking this exercise ahead of the Government’s third iteration of its Road Investment Strategy (RIS3), which will make clear what major road investment schemes the Government intends to build between 2025 to 2030.\nThe fact that these proposals are now being actively assessed by National Highways highlights the level of seriousness with which they are being taken by Government and the strong case we have made already for them to be included in RIS3 – this is a positive step forward in our campaign for a better A50 and for all who use this vital trunk road.",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_statement-kate-griffiths-mp/content_19.html": "As constituents know, I have supported the Prime Minister over recent months because I believe that he had got all the big decisions right, and his leadership had steered us through some difficult times both home and abroad. I had hoped that following the confidence vote, we would be able to move ahead and tackle the crucial issues affecting us all.\nHowever, like many colleagues, I have had to reassess my position after events of the past couple of weeks. It is clear, that under the Prime Minister, we are not making the progress the country, and crucially, my constituents expect. The ambulance service, and health service, is not able to provide the level of care we rely on it for, our roads and local services are not receiving the investment they need, the Passport Office and Home Office are in disarray, and the cost of living crisis is hitting residents hard and more support is going to be needed.\nFinally, as someone who has been the victim of abuse, at the hands of an MP who told me his position would mean no one would believe me over him, I am furious that it has now come to light the Prime Minister was aware of the allegations against Chris Pincher, and promoted him to a Government position anyway. I promised I would be a voice for victims in Parliament, and I cannot do that when the Prime Minister does not take these allegations seriously.\nI remain committed to the Party, and to the election promises I made to constituents. I will continue to fight to secure the investment Burton and Uttoxeter deserves, to level up our towns and invest in our local area, and I hope the Prime Minister will do the right thing and allow the Party to move forward and deliver what we set out to do.",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_kate-griffiths-mp-backs-teachers-commons-debate-returning-schools/content_13.html": "This afternoon Kate Griffiths MP spoke in a debate about the importance of getting our children back to schools and recommencing face-to-face teaching.\nYesterday, Kate met virtually with local headteachers to hear from them how the planned return for March 8th is going and to thank them and their staff for all they have been doing.\nIn the debate Kate also urged the Minister to ensure the funding to ensure the attainment catchup can begin as soon as possible and teachers have sufficient time to tailor this support for their pupils.",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_human-rights-adjournment-debate/content_10.html": "I was pleased to take part in last week’s debate called by Debbie Abrahams MP to mark the UN’s Human Rights Day and the final day of the 16 days of activism against gender-based violence. Every campaign, every debate and every story of domestic abuse that becomes public gives strength and hope to other women, and perhaps the courage that they need to seek help.\nSupport from others is a crucial role in addressing gender-based violence and I am pleased that both nationally and locally we have a network of assistance for those facing domestic abuse.\nFreephone 24-Hour National Domestic Abuse Helpline: 0808 2000 247 or visit www.nationaldahelpline.org.uk",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_according-kates-burton-mail-column-300623/content_18.html": "Kate writes a bi-weekly column for the Burton Mail. This column was originally featured in the 30th June print edition.\nWhilst we have been enjoying some warmer and drier weather of late, it is hard to think about downpours and flooding which we would typically associate with the winter months. However, it is important that those who are responsible for keeping communities safe from extreme weather events, work all year round to find and implement mitigations against such situations.\nI recently met with the West Midlands Environment Agency (EA) on several matters related to Burton and the surrounding villages. As part of this, I received an update on the work being undertaken by the EA to combat flooding in Rolleston along with how the £100,000 awarded to the village from the Government’s Frequent Flooding Fund would be utilised.\nThe EA stated to me that Rolleston is a ‘relatively complex’ case, affected by several sources of flooding including surface water, the Rolleston Brook and associated impacts of the River Dove. Earlier this year, the EA removed a bank of silt at the end of Riverside in Rolleston which had built up where the river turns sharply, and silt has also been removed from the Brook Hollows Lake at the top of the village in liaison with the local community.\nThe main Flood Alleviation Scheme is awaiting detailed modelling, but the EA is expecting options for change shortly. However, they have already specified that there might be potential for a small flood bund up around Brook Hollows Lake to prevent a flood flow route northwards across The Lawns. The EA has also already identified three potential locations for flood reduction facilities upstream of the village and it is also expected there will be an offer of measures to improve the flood resilience of properties that are predicted to be ‘at risk’ from flooding.\nI have received assurances from the EA that they will continue to engage with the local community, and I will ensure that this work remains a focus for them so that we can secure positive outcomes for the benefit of Rolleston and its residents.",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_vote-standards-report/content_14.html": "Today, I voted against the Government whip on an amendment to change the process which looks into complaints about the conduct of Members of Parliament.\nAs many of you may be aware, this was brought about due to a decision on a report on the behaviour of the Member of Parliament for North Shropshire.\nSerious concerns have been raised about the fairness of the process followed in this matter, and the case for potential reform to this Committee was well-made.\nHowever, I did not feel it was appropriate for the process to be altered now, in a way that would conflate the two issues.\nWhen the executive has such a significant majority, it is important to stick to the established process to ensure we are all properly held to account, and any future changes should only be made after consensus between parties has been properly built.\nThat is why I voted against the Government today.",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_category_Speeches-in-Parliament/content_8.html": "Human Rights Adjournment Debate 21st December 2021 I was pleased to take part in last week’s debate called by Debbie Abrahams MP to mark the UN’s Human Rights Day and the final day of the 16 days of activism... Speeches in Parliament\nJustice Questions 14/12/21 14th December 2021 When I stood for election as Member of Parliament for Burton & Uttoxeter, I promised I would be a strong voice for those who have been a victim of domestic... Speeches in Parliament\nKate Griffiths MP backs teachers in Commons debate on returning to schools 25th February 2021 This afternoon Kate Griffiths MP spoke in a debate about the importance of getting our children back to schools and recommencing face-to-face teaching... Speeches in Parliament\nNo video provider was found to handle the given URL. See the documentation for more information. Kate Griffiths MP raises quality of new built homes with Secretary of State 10th February 2021 Since elected, Kate has heard cases from many unhappy and worried constituents that their newly-built homes are not built to the standards anyone would expect... Speeches in Parliament",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news/content_23.html": "Kate Kniveton welcomes the Conservatives’ clear plan to invest £20 million in Burton as part of action to level up East Staffordshire and secure a brighter future Saturday, 1 June, 2024 The Conservatives are investing £15 billion into levelling up the country, as part of their clear plan to ensure talent and hard work, not geography, determine people’s life chances. That is why the Conservatives have set out a clear plan of bold action to regenerate towns and villages across the country with an additional £20 million each for 30 towns as part of the newly expanded Long Term Plan... Local News\nKate Kniveton says ‘only the Conservatives have a clear plan for pensioners’ and welcomes new Triple Lock Plus to cut taxes for pensioners across Burton and Uttoxeter 29th May 2024 The Conservative Government have cut tax for working people by reducing National Insurance from 12 per cent to 8 per cent. Now they will cut tax for pensioners... Local News\nKate Kniveton MP meets with carers at Burton’s Brewhouse 28th May 2024 Local Member of Parliament, Kate Kniveton, has today (28/05/24) visited Carers Plus Café in Burton to meeting with residents who preform caring responsibilities... Local News\nAccording to: Kate's Burton Mail column 18/05/24 19th May 2024 Kate writes a bi-weekly column for the Burton Mail. This column was originally featured in the 18th May print edition. New figures have revealed that there are... Opinions\nKate Kniveton MP visits completed Burton towpath improvements 17th May 2024 Kate Kniveton, Member of Parliament for Burton and Uttoxeter, recently (10/05/2024) visited a section of the Trent Canal, to see the completion of the new... Local News\nKate Kniveton MP hosts flooding meeting in Marchington and Draycott in the Clay 10th May 2024 The Member of Parliament for Burton and Uttoxeter, Kate Kniveton, last night (09/05/24) held a meeting in Marchington Village Hall for residents to hear from... Local News\nAccording to: Kate's Burton Mail column 04/05/24 5th May 2024 Kate writes a bi-weekly column for the Burton Mail. This column was originally featured in the 28th April print edition. A key measure of any society is how it... Opinions\nKate Kniveton MP meets with Winshill Co-op staff to discuss new measures to tackle retail crime 26th April 2024 Member of Parliament for Burton, Kate Kniveton, visited Winshill Co-op today (26/04/24) to meet with staff and to hear about the issues they have been facing... Local News\nKate Kniveton MP visits Barclay’s new Burton banking hub 25th April 2024 Member of Parliament, Kate Kniveton, today (25/04/24) visited Barclays new banking hub in Burton following their commercial decision to close the previous High... Local News\nKate Kniveton MP to host two public meetings on flooding issues 25th April 2024 Local Member of Parliament, Kate Kniveton, is set to host two public meetings on flooding to give residents the opportunity to hear what local authorities are... Local News",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_category_Articles/content_15.html": "Access to dentists in Burton and Uttoxeter 29th January 2024 I know residents are concerned about the challenges many of us are experiencing trying to access NHS dental care and I wanted to provide you with an update on... Articles\nAccording to: Kate's Burton Mail column 30/12/23 31st December 2023 Kate writes a bi-weekly column for the Burton Mail. This column was originally featured in the 31st December print edition. 2023 has been an incredibly busy... Articles\nKate's Uttoxeter Echo column 05/07/23 6th July 2023 Kate writes a bi-w eekly column for the Uttoxeter Echo. This column was originally featured in the paper's final edition on 5th July 2023. It is the greatest... Articles\nAccording to: Kate's Burton Mail column 26/08/22 27th August 2022 Kate writes a bi-w eekly column for the Burton Mail. This column was originally featured in the 26th August print edition. The warm weather we have been... Articles\nKate's Uttoxeter Echo column 17/08/22 18th August 2022 Kate writes a bi-w eekly column for the Uttoxeter Echo. This column was originally featured in the 18th August print edition. There is a lot of negative news... Articles\nAccording to: Kate's Burton Mail column 13/01/22 14th January 2022 Kate writes a bi-w eekly column for the Burton Mail. This column was originally featured in the 13th January print edition. I know many of us are looking... Articles\nAccording to: Kate's Burton Mail column 21/10/21 22nd October 2021 Kate writes a bi-w eekly column for the Burton Mail. This column was originally featured in the 21st October print edition. Fridays for Members of Parliament... Articles\nAccording to: Kate's Burton Mail column 07/10/21 8th October 2021 Kate writes a bi-w eekly column for the Burton Mail. This column was originally featured in the 7th October print edition. The new James Bond film, No Time To... Articles\nAccording to: Kate's Burton Mail column 23/09/21 24th September 2021 Kate writes a bi-w eekly column for the Burton Mail. This column was originally featured in the 23rd September print edition. This week (18–26 September) is... Articles",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_NextPM/content_17.html": "The process of electing a new Leader of the Conservative Party, who will ultimately become Prime Minister, is well underway.\nThe Parliamentary Conservative Party have whittled down the field to two remaining candidates, Rishi Sunak and Liz Truss. I had previously been supporting Penny Mordaunt who narrowly missed out on a place in the final two.\nI am very interested to know your thoughts on who should be the next leader which is why I have made this survey to find out your views and who you want to be your next Prime Minister.\nPlease fill in my survey so I can listen to your ideas and I would be grateful if you could share it with your friends and family.",
  "https_www_katekniveton_org_uk_/https_www_katekniveton_org_uk_news_kate-kniveton-welcomes-conservatives-clear-plan-invest-ps20-million-burton-part-action-level/content_4.html": "- The Conservatives are investing £15 billion into levelling up the country, as part of their clear plan to ensure talent and hard work, not geography, determine people’s life chances.\n- That is why the Conservatives have set out a clear plan of bold action to regenerate towns and villages across the country with an additional £20 million each for 30 towns as part of the newly expanded Long Term Plan for Towns, building on yesterday’s announcement that the Community Ownership Fund will be extended for three years.\n- This bold action will give local people the investment they need to breathe new life into their area through locally-led regeneration, securing a brighter future for previously overlooked towns across the country.\nKate Kniveton, Burton and Uttoxeter’s Conservative Party parliamentary candidate, has welcomed the Conservatives’ clear plan of bold action, investing a further £20 million into Burton over 10 years, building on the £22.8million Ms Kniveton helped secure from the Towns Fund during her time as the local MP.\nThe Conservatives’ long-term plan for towns is putting local people in charge, giving them the tools and funding to change their towns future. Each town will receive a £20 million endowment-style fund to spend over 10 years on transformational projects that deliver local people’s priorities and powers to revive lagging high streets and bring new housing to town centres. This will mean local communities, not politicians in Westminster, will get to decide the town improvements that will level up the place they call home over years to come.\nThis news follows the confirmation that the Conservatives will extend the successful Community Ownership Fund for three years, helping communities across the UK to take ownership of beloved community assets such as pubs, music venues and sports clubs at risk of closure.\nThe choice is clear: stick with the Conservatives under Rishi Sunak who are levelling up towns and villages across the UK, securing the future of previously left-behind communities. Or go back to square one with Labour, who would cancel the levelling up agenda, leaving communities without the support they deserve.\nKate Kniveton said:\n“I am delighted the Conservatives have announced Burton as one of the 30 towns which would benefit from an additional £20 million funding under a future Conservative Government. This funding would see communities decide which investments to prioritise in their area, fulfilling our commitment to level up every corner of the UK.\n“This builds on the £22.8million I secured already through the Towns Fund to regenerate Burton town centre and enhance the Washlands. I hope that this would allow ESBC to focus more on delivering the promised upgrades in Uttoxeter, using previously secured funds.\n“However, all of this would be at risk under Labour, who would cancel the levelling up agenda, taking us back to square one. Only the Conservatives, with me as an experienced constituency MP, have a clear plan to deliver a brighter and more secure future for communities in Burton and Uttoxeter\nRishi Sunak, Prime Minister said:\n“The Conservatives have a plan for towns because we know they are the beating heart of our country. This bold action will transform 30 more towns – reviving their high streets, growing their local economies and making people feel proud of the place they call home.\n“Labour’s record in government shows they don’t care about towns – neglecting their needs, allowing them to decline and focusing instead on cities. Sir Keir Starmer has no plan to unlock opportunities in towns and would take us back to square one.\n“Building on our strong track record of levelling up in Teesside and the Midlands, we will go further across the country to build a secure future for our children and grandchildren.”\nMichael Gove, Levelling Up Secretary said:\n“This bold action will be transformational for towns around the country. It will allow local people to take back control - creating better jobs, improving transport and generating more investment.\n“The Conservatives have a clear plan to spread opportunity so that talent and hard work, not geography, determine people’s life chances.\n\"Sir Keir Starmer has no plan and no idea how to help people help themselves, just patronising platitudes that would take us back to square one.\""
}