{
  "https_newcitycitizen_co_uk_/https_newcitycitizen_co_uk_2024-general-election-flyer-for-chelmsford/content_3.html": "Elected Monarchy:\nA monarchy represents a stable point between the anarchy of the extremes of the Libertarian Right and the Socialist Left.\n25-year appointment elected by The Upper House (currently known as the House of Lords (and Ladies).\nTo represent the UK as Head of State and Defender of the Rights of the People.\nMay abdicate if unable to perform duties.\nMay be executed if found to have committed treason.\nReform and Empowerment of The Upper House:\n15-year appointment – Candidates put forward by the Lower House and consisting of those considered to have made outstanding contributions to the cultural fabric of society – to be elected by the people. One third of members to be retired every five years but may again be put forward as a candidate.\nA definition of British Values (leading to a binding Constitution), the Rights of the People and the Role of the Monarch to be agreed and passed into Law.\nVarious titles to be awarded such as Sir and Madam, Lord or Lady, Baron or Baroness, Duke or Duchess, Prince or Princess. Gender appropriate pronouns(thee, thou, thy, thine?) to be developed.\nMay be stripped of their titles if found to have dishonoured their position.\nReform of the Lower House:\n5-year appointment – elected by the people. Two possible formats: Either solely by Proportional Representation or by a combination of First-past-the-post & Proportion.\nNew members to undergo compulsory induction/training.\nAll members to be bound by a clear set of rules and procedures.\nAlso consider banning all political parties\nMay be jailed if found to have acted unlawfully or with disregard for the Rights of the People.\nReview of the Enfranchisement of the People:\nVoting age for the Lower House to be raised to 25 and for the Upper House to 35. Voting age for Borough, County, City and Unitary Councils to remain at 18. For Parish to be lowered to 16. Inclusion of the category ‘None of These’ to appear on voting proformas. Removal of an individuals’ right to vote to be considered.\nEducation:\nA school curriculum that encourages Critical Thinking.\nCompletion of a year-long Community Service element as a prerequisite for the right to vote\nDefence:\nDefensive NOT Offensive provision as indicative of peaceful intention.\nAcknowledgement of the probable existence of and subsequent engagement(friendly) with ET’s and their technology.Reset Values: Replace GDP (Gross Domestic Product) with GNH (Gross National Happiness). Reinstatement of limited Sunday trading and the re-introduction of Archery practice (see Defence",
  "https_newcitycitizen_co_uk_/https_newcitycitizen_co_uk_the-truth/content_2.html": "“I’m not strange, weird, off, nor crazy, my reality is just different from yours.” Alice in Wonderland, Lewis Caroll, 1865.\n“We’re not really here – just a collection of atoms in the once-was-will-be” Ethel Grunt, 1975\nTo have a philosophy is to have a particular view of the world – from which vista we derive that which we consider of value – the primary of which inform our principles – these then guide our practice (daily life).\nMost of us will be aware of The Matrix (the film) within which one pill ties you to an illusory material world and the other which frees you to explore another dimension. Lost in a purely material existence, confusion arises between that which Is and that which Is-Not whereas those freed, through acknowledgement of evidence for, or actual experience of, an existence beyond that which is the material/corporeal reality, realise a truly liberating world view.\nConsider then, as Artificial Intelligence, Quantum Mechanics, CERN and the James Webb telescope will reveal (if they haven’t already), a greater reality of an infinite existence of which consciousness is a fundamental part. Then, everlasting life is that which Is and that which Is-Not is corporeal form.\nConsider then, the possibility that we have everlasting life within an Eternal and Infinite Universe (Were we dead before we were born and remain alive after we die?). With such a view informing our perception and understanding of Reality (what Is and what Is-Not) a fundamental change in behaviour in our corporeal existence emerges.\nThe currently ascendant hedonistic/nihilistic and full-on only one-life-live-it with no repercussions attitude, develops into a more realistic many-lives-live-them-well point of view, which recognizes and understands that the actions of one life will inform the next life and will have been informed by the previous life (or lives!). Such a philosophy and change of perspective makes sense of an otherwise nonsensical and seemingly unjust world. If we are creatures then surely it follows that there must be a Creator (even if that is only conceived of as an aspect of nature)?\nIn the words of that Enlightened Soul who lived, worked and died here in Chelmsford and who healed, rescued and taught many:\n“What is Truth? Truth is an undeniable, unchangeable, everlasting fact, such as the Laws of Creation: as they were in the Beginning, so they are now and will be for ever more. Truth, then, is that which changes not.\nMost people believe that the existence within the physical body – the instrument through which the five senses function – is the real life, and that what comes after is what only appears to be – rather nebulous, a dream state, or at most, a complete state of rest and sleep.\nThe first step to freedom is inner knowledge, and the first steps to inner knowledge are the understanding and coming to terms with the natural laws that surround you, mastering them and putting them to use for the betterment of all mankind.\nPrelude to Truth (1988) by A. Lamb (1920-2014)\nIn its next incarnation, our website (newcitycitizen.co.uk) will be publishing further excerpts from this book.",
  "https_newcitycitizen_co_uk_/https_newcitycitizen_co_uk_mark-citizen-lawrence/content_4.html": "Mark CitiZen Lawrence\nIn 1972, aged 20, I came to Chelmsford taking various manual labouring jobs and where, in 1975, I bought a corner of a field, so as to explore an organic lifestyle; during which time I studied for a Commercial Horticulture qualification from Writtle Agricultural College.\nIn 1977 I set up the first of several market stalls, selling wholefoods, which eventually formed the basis for the establishment of a Workers Co-operative in 1978 in which I was one of seven founding members. Bramble Wholefoods Co-operative ran a wholesale warehouse in Braintree and delivered to many of the independent health-food shops and buying groups throughout East Anglia.\nDuring this period I became a member of Chelmsford Morris men for a time and also began a 20 year relationship with the study and practise of Aikido and later with that of Tai Chi.\nIn 1981 I began a six-year part-time training programme in Osteopathy, during which time I spent some years as a ‘house-husband,’ looking after my daughter, working part-time and studying.\nIn 1983 I initiated the establishment of Essex Co-operative Development Agency which was formally launched in January 1985, funded in part by Bramble, Chelmsford Star Retail Society (Co-op) and NALGO (Essex Region). By 1988 substantial funding had been raised from Essex County Council and the EEC Social Fund, leading to the appointment of a full-time worker based at the Essex Business Centre, Church St, Chelmsford.\nFor a time, I was involved with Chelmsford Green Party and in 1987 stood as a Green candidate for Great Baddow Parish Council, gaining some 10% of the votes cast.\nDuring the period 1972 -1992 friends and I performed, on occasion, as a small music/theatre group(Ethel Grunt) in various folk clubs and events in Essex. I also had several poems published.\nFrom 1988 I spent the next 30 years practising as an Osteopath, during which time I undertook a four-year part-time training in Naturopathy and also gained various teaching qualifications, culminating in 2010 with a Masters in Medical Science. I was, for a while, Principal of The College of Osteopaths and Chair of the Council of Osteopathic Institutions.\nI retired from Osteopathic practice in May 2019 having purchased another piece of land so as to further explore the organic way of life and to enjoy spending time with the grandchildren.\nPlease visit our Facebook page: –\nNewCityCitizen\nNote that Facebook is the only social media site linked to Newcitycitizen",
  "https_newcitycitizen_co_uk_/https_newcitycitizen_co_uk/content_1.html": "-\nValues\nIn Chelmsford, since 1950, only those people who have voted Conservative have had their wishes represented in Parliament. The losing votes predominantly being for the Labour or Liberal candidates, those votes are effectively thrown in the bin and carry no weight whatsoever in the final make up of Parliament. This situation is typically repeated throughout the UK, the result being that the majority of people in the UK are effectively disenfranchised as the winning party in Parliament rarely receives the majority of the votes which have been cast. Much of the debate in parliament is meaningless – parties do not negotiate or compromise with each other – being mostly focussed on winning points against other members or parties. What is preferable – Confrontation & Coercion or Co-operation & Consensus? There’s much to be said for a complete reform of our current democratic system because, as it stands, you might just as well vote for the Monster Raving Loony Party – crazy though it sounds!\nA Statement of Principles\n1.We want to live in a place guided by empathy, respect, justice, generosity, courage, fun and love.\n2.We want to live in a place governed by judgements that are honestly made, supported by evidence, accountable and transparent.\n3.We want to live in a place in which everyone’s needs are met, without harming the living world or the prosperity of future generations.\n4.We want to live in a place in which the fruits of the work we do and the resources we use are fairly and widely distributed, in which shared prosperity is a general project, and the purpose of economic life is to enable universal well-being.\n5.We want to live in a place in which all people have equal rights, in practice as well as in theory.\n6.We want to live in a place in which all people can feel secure, confident, safe and cared for.\n7.We want to live in a place in which, regardless of where they were born, everyone has a neighbourhood of which they feel proud, where they can freely participate in the life of the community.\n8.We want to live in a place which, proudly and consistently, supports people in need of help, including those fleeing from danger and persecution abroad.\n9.We want to live in a place in which a thriving natural world provides a refuge both for rich and abundant wildlife and for people seeking relief from the clamour of daily life.\n10.We want to live in a place whose political system is fair and fully representative, in which everyone has a voice and every vote counts, and whose outcomes can neither be bought nor otherwise engineered.\n11.We want to live in a place in which decisions are taken at the most appropriate level, to enhance democratic participation and connection.\n12.We want to live in a place in which everyone has access to the information needed to make meaningful democratic choices, and in which political debate is honest, accessible and inclusive.\n13.We want to live in a place in which education is a joyful process, encouraging children of all abilities to engage with enthusiasm, and adults to continue learning throughout their lives.\n14.We want to live in a place in which good housing, fast and effective healthcare and a healthy, sufficient diet are available to everyone.\n15.We want to live in a place that helps to build a safe, prosperous and resilient community of nations.\n16.We want to live in a place that is open to new ideas and information, and that values creativity, research and discovery.#\nThanks to – George Monbiot “Out of the Wreckage” Published by Verso Books 2017\nGDP versus GNH(Gross National Happiness\nWhat is Gross National Happiness\n- Gross national happiness (GNH) is a measure of economic and moral progress that the country of Bhutan introduced in the 1970s as an alternative to gross domestic product.\n- The “four pillars” of GNH are good governance, sustainable development, preservation and promotion of culture, and environmental conservation.\n- The Bhutanese government takes the four pillars of GNH into account when deciding to pass laws.\nSee links below for more detail: –\nGDP vs GNH Rethinking what a healthy economy means\n5 ways GDP gets it totally wrong as a measure of our success"
}