{
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_campaigns_supporting-families-and-young-people/content_16.html": "I spent a good chunk of my career before entering Parliament working with children and young people. I was incredibly proud to serve as Children’s Minister at the Department for Education, where I launched the largest ever expansion of childcare provision, worth £6,500 a year for the average family.\nLocally, Surrey is experiencing unprecedented demand for SEND provision and education, health and care plans (EHCPs). When I was at the Department for Education, I took forward reforms to fix some of the most common problems families of children with SEND face, including by cutting down the mountains of paperwork and introducing digital EHCPs. I regularly take up cases on behalf of SEND parents in my surgeries and raise their concerns with Surrey County Council directly.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_claire-joins-hindu-families-celebrate-durga-puja-festival/content_25.html": "It was a joy to join Hindu families at Herons Bonsai in Lingfield to celebrate the Durga Puja festival - thank you to Kaustav Dey, Peter Chan and everyone who helped to organise such a wonderful celebration for the community.\nOne of the fathers recounted a conversation he’d had with his young son when he said I would be joining them. “Is she bringing Rishi?” ‘No, just her.’ Cue considerable disappointment.\nWhen asked why he wanted to meet Rishi, the son replied “because when I grow up I want to be Prime Minister like Rishi”. As the PM has said himself, it’s a sign of how welcoming this country is that the fact that he’s Hindu or of Indian heritage is simply not a big deal to most people. But this was a touching reminder that it is a big deal to some.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_claire-acts-protect-food-securty/content_18.html": "Our energy security must not come at the expense of our food security, and I’m concerned at the increasing number of solar farms proposed on good quality farmland instead of brownfield land and on rooftops.\nToday I’m making clear that:\n1. Applications prioritise previously developed, brownfield land.\n2. Developers avoid the best quality farmland.\n3. The overall impact of lots of applications in the same area is considered.\nThis is effective immediately and applies to all current and future applications.\nWe do want to see more solar panels installed where appropriate, so we have also made it easier and cheaper to install solar on top of warehouses, farm buildings, factories and car parks.\nRead my full statement here: https://questions-statements.parliament.uk/.../hcws466",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_update-talks-gtr-about-potential-reinstatement-caterham-london-victoria-rail-service/content_8.html": "We wanted to share an update on our ongoing talks with GTR about the possible future reinstatement of the Caterham to London Victoria rail service.\nThe key factor in these talks is the planned onward transfer of trains from GTR’s newly upgraded Great Northern fleet to both Southern and Southeastern. Once these additional carriages become available – expected from May 2026 onwards – one potential option is to bring back direct peak time services between Caterham and London Victoria.\nWhile GTR have highlighted other potential uses for the extra trains, we have made it clear – thanks to feedback from Claire’s rail survey – that East Surrey residents see this service as a priority.\nAs a result of our conversations, GTR has agreed to include the findings of Claire’s rail survey in their discussions with the Department for Transport.\nWe will keep up the pressure on both GTR and the Department for Transport to bring this important service back.\n-Team Claire",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_ed-miliband-will-raise-your-energy-bills/content_22.html": "Labour went into the election promising to cut people's energy bills by £300.\nNow Ed Miliband won't repeat that figure because he knows it's not true - and one of Labour's first acts in government has been to take away up to £300 this winter from many pensioners in poverty.\nIt's a complete betrayal of the British people.\nClick to read Claire's speech: Ed Miliband will RAISE your energy bills.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_campaigns_celebrating-east-surreys-communities/content_19.html": "One thing that struck me in my first couple of years as your MP is that no matter who I was visiting – whether I was at a school, community group, or speaking to the police – the human cost of loneliness came up time and time again. We may not always realise it, but the strength of our relationships sit at the heart of what makes us happy and well – and when people feel that they have lost those support networks, it becomes all too easy for them to fall through the cracks.\nThat’s why, in 2022, I launched The Friendship Project, to support the many wonderful community groups in East Surrey who tackle loneliness by creating friendships. In 2023, I was able to raise £8,825 to support these groups do what they do best, and starting this year, cash grants of up to £1,300 will start to land in their bank accounts to help them carry on their magnificent work.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_claire-visits-felbridge-primary-godstone-primary-and-st-francis-uk-parliament-week/content_20.html": "Fab day taking questions from staff and pupils at Felbridge Primary, Godstone Primary and St Francis' in Caterham for UK Parliament Week.\nParliament Week is all about getting schools and community groups across the country interested in what Parliament is, what we do, and how they can get involved.\nI love welcoming constituents to Parliament to watch debates in the gallery and for guided tours - so if you would like to visit with your family please do contact me on [email protected]. #UKPW",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news/content_4.html": "Supporting the Lingfield Farmers' Market Friday, 25 April, 2025 Make sure you stick a note in your diaries for the next Lingfield Farmer’s market on Sunday 11th May! Alexia Lescure’s first farmers' market was held in the glorious spring sunshine a few weeks ago to great acclaim. Local businesses will be selling their wares including cheese, flowers and crafts at Lingfield Primary School from 9am until 1pm – so please do pop by if you get the chance. -Team... Local News\nUpdate on Talks with GTR About the Potential Reinstatement of the Caterham to London Victoria Rail Service 22nd April 2025 We wanted to share an update on our ongoing talks with GTR about the possible future reinstatement of the Caterham to London Victoria rail service. The key... Local News\nInstallation of a Multi-Bank Deposit Machine in Oxted + Update on Caterham's Banking Hub 10th April 2025 It's good news that after listening to residents’ difficulties accessing banking services in Oxted, Cash Access have installed a new 'multi-bank deposit machine... Local News\nClaire's Team Congratulates Volunteers at the Woodhouse Centre for a Successful Spring Opening 3rd April 2025 A huge well done to all the volunteers at the Woodhouse Centre in Oxted for such a successful spring opening morning! The Centre was buzzing with activity, with... Local News\nClaire's Team Visits St Mary's Church for an Update on the Restoration 2nd April 2025 Members of our team visited St Mary's in Oxted recently to receive an update on the restoration of this wonderful church, which dates back to the 12th century... Local News\nUpdate on Claire's Rail Survey 24th March 2025 In Claire’s rail survey, many residents who use the East Grinstead Line told us that rail services have not kept up with demand since the COVID timetable change... Local News\nLocal Government Reorganisation Update 21st March 2025 Today, the leaders of all twelve councils in Surrey have submitted their joint interim proposals on local government reorganisation to the Government. This sets... Local News\nClaire's Constituency Manager Richard Takes East Surrey's Residents' Concerns Straight to the Top 20th March 2025 This week, Claire's constituency manager Richard popped up to Westminster to join GTR at their parliamentary drop-in event. On the back of Claire’s rail survey... Local News\nClaire Receives a Response from the VOA Following Her Letter on Behalf of Businesses in Godstone 19th March 2025 I've received a response from the Chief Executive of the Valuation Office Agency following my letter on behalf of businesses in Godstone. I'm pleased that after... Local News\nClaire Writes to the Chief Executive of the Valuation Office Agency Following Godstone Business Meeting 7th March 2025 I've written to the Chief Executive of the Valuation Office Agency, the body who make decisions on business rates relief, asking that they consider urgent... Local News",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_labour-scrap-universal-winter-fuel-payments/content_40.html": "During the election, Labour sources said the winter fuel payment would continue under a Starmer government and that there were no plans to change eligibility for these benefits. Today they have revealed they misled the public.\nRachel Reeves’ announcement that she is scrapping the universal Winter Fuel Payment is a callous decision by the new Chancellor, which will have a devastating impact here in East Surrey and across the country. Any pensioners who are not in receipt of Pension Credit will now no longer receive their Winter Fuel Payment each year.\nLabour have been pretending today that they didn't know the state of the nation's finances before they got into Government. But the Chancellor herself told the Financial Times during the election campaign that 'you don't need to win an election to find out the state of public finances'. The truth is that Labour have inherited an economy where inflation is back at 2%, unemployment is nearly half what it was in 2010, and so far this year we are the fastest growing G7 economy.\nSometimes governments must make hard choices, and it is in these moments that their priorities are revealed. This Chancellor has chosen to withdraw a benefit designed to help keep pensioners warm in the winter while finding £7.3 billion for Ed Miliband's GB Energy gimmick, £8.3 billion for the National Wealth Fund, and around £10 billion for public sector pay awards, including a 22% above-inflation pay rise for junior doctors. That's £24 billion of extra spending in just 24 days.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_campaigns_transport-works-you/content_21.html": "Westminster should be making it easier for you to get around, not harder. That’s why I have opposed Sadiq Khan’s rash and self-serving ULEZ policy, Government has forced TfL to backtrack on their planned axing of Day Travelcards, and fought off plans to close train ticket offices.\nThis is all on top of the extra £3.7 million we’ve delivered for Surrey to help fill in potholes this year and next, and my work to force fuel retailers to provide live price information, bringing down prices at the pump. Looking forward, we need to review Surrey’s Local Transport Plan 4, encourage use of demand-responsive transport, and defend drivers against plans that make it harder to get around.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_campaigns_right-homes-east-surrey/content_23.html": "Affordable homes are needed to support local families and the local economy. But new housing should not come at the expense of our precious areas of outstanding natural beauty or be driven through without the infrastructure needed to support new residents. We should enforce against unauthorised development, empower local parish councils to direct development to where they want it, and nurture our areas of outstanding natural beauty.\nJoin Jeremy Hunt’s campaign to make the Surrey Hills a new National Park",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_ed-miliband-refuses-justify-taking-winter-fuel-payment-away-millions-pensioners/content_28.html": "The Labour Government is taking the Winter Fuel Payment from millions of pensioners, including those living in poverty, while spending billions of pounds of taxpayers' money on Ed Miliband's green energy plans.\nClick to watch: Ed Miliband REFUSES to justify taking the Winter Fuel Payment away from millions of pensioners",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_discussing-all-things-fe-surrey-college-heads/content_37.html": "On Friday I met Christine Ricketts of Brooklands College, Julie Kapsalis of NESCOT and Lindsay Pamphilon of East Surrey College with Cllr Richard Biggs, who has just been elected as Leader of Reigate and Banstead Borough Council.\nThis super trio of principals updated me on their collaborative work to tackle the skills gap in Surrey and provide their students with a top-notch education.\nWe also discussed supported internships for SEND students in further education, capital funding for teaching and support facilities, and resilience among students - all topics that I care deeply about.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_claires-constituency-manager-richard-takes-east-surreys-residents-concerns-straight-top/content_15.html": "This week, Claire's constituency manager Richard popped up to Westminster to join GTR at their parliamentary drop-in event.\nOn the back of Claire’s rail survey, this was a brilliant opportunity to take East Surrey's residents’ concerns straight to the top. Richard met with GTR’s CEO Angie Doll and Network Rail’s Southern regional lead Lucy McAuliffe.\nThey discussed the results of the rail survey, and Richard pushed for the reinstatement of the Caterham-Victoria service on behalf of residents.\nOur team will be meeting with representatives from GTR and Network Rail tomorrow to discuss the survey’s findings in detail. Please feel free to comment any feedback ahead of Friday’s meeting and we will make sure to feed these into our discussion.\n-Team Claire",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_category_Westminster-News/content_11.html": "Claire's letter to constituents following the vote on the Terminally Ill Adults (End of Life) Bill 29th November 2024 Today, MPs voted to progress the Assisted Dying Bill. I thank the hundreds of constituents who have taken the time to share their views with me. I voted against... Westminster News\nClaire co-chairs the Safer Phones Bill hearing in Parliament 20th November 2024 As Children’s Minister, I heard time and again how parents’ number one worry was how to handle their children’s access to digital devices. The evidence is clear... Westminster News\nClaire joins Conservative colleagues in protesting against Labour’s Family Farms Tax 19th November 2024 Standing with my Conservative colleagues against Labour’s plans to introduce a Family Farms Tax. I’ve heard directly from local farmers, including tenant... Westminster News\nConservatives call on Labour to rescind the Family Farms Tax 16th November 2024 I recently met with Sarah and Ian McCubbine and Chris and Phillip French in Bletchingley to hear firsthand about the devastating impact that Labour's new Family... Westminster News\nReaction to Labour's disastrous Autumn Budget 1st November 2024 Post Budget, where are we? Well, I think it’s fair to say we are in a very tough spot. Rachel Reeves has set out the largest tax rises Britain has seen in 30... Westminster News\nLabour scrap universal Winter Fuel Payments 29th July 2024 During the election, Labour sources said the winter fuel payment would continue under a Starmer government and that there were no plans to change eligibility... Westminster News\nInflation almost back to 2% 22nd May 2024 The price of electricity, gas, and other fuels fell by 27% in the year to April - the largest fall on record. The average family’s energy bill has fallen by... Westminster News\nClaire acts to protect food securty 16th May 2024 Our energy security must not come at the expense of our food security, and I’m concerned at the increasing number of solar farms proposed on good quality... Westminster News\nNew common sense guidance for schools on sex education 16th May 2024 Children need to have a childhood. They shouldn’t be confused by adult concepts, nor taught contested political views as fact. Parents should be able to see the... Westminster News",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_my-speech-global-britain-2/content_30.html": "Today, Britain is forging a new path as a sovereign nation-state. We will stand by our long-held values of liberty, democracy, respect for human rights, tolerance, and the rule of law. We will work hard to support our European friends and neighbours and our allies around the world, and we will continue to stand by the world’s poorest. But we must also seize the opportunity of our new freedoms: the opportunity to cast Britain as an icon of an outward-looking modern state.\nTo do that, we have to recognise the changing factors disrupting the world as we know it today. First, the world’s economic centre of gravity has shifted East, and the Indo-Pacific region is now the fastest-growing region in the world. Second, the rise of technology is profoundly changing how we live and work. Those who can’t keep up will lose out. We need to prepare ourselves for the century ahead.\nMr Speaker, we should be proud of the talents borne across these islands and our shared achievements to date. We are the world’s fifth-largest economy, with more Nobel Prizes and world-leading universities than any European country. We are a diplomatic superpower and a nuclear power, benefiting from our leadership role in NATO, our permanent membership of the UN Security Council, and our role in the G7. We have a leading global financial centre, and we consistently attract the highest foreign direct investment in Europe. And along with China, the US, and India, we are one of the top ffour breeding grounds for tech unicorns – those rare new companies that achieve billion-dollar valuations.\nHowever, the world doesn’t stand still and neither can we. We must now use our hard-won freedoms to keep up with a changing world. The freedom to revise our regulations, at speed, to meet the pace set by the world’s brightest innovators; to strike new trading relationships which suit our distinct economic strengths; to spur on our specialist sectors.\nBritain’s record on Covid-19 vaccinations – vaccinating more people than the rest of Europe combined – has reminded us all of the importance of an ambitious and agile state which controls its own regulation. We can use progressive regulation to push new boundaries from AI to fintech, from life sciences to gene editing.\nWe can also be ambitious with our new global partnerships, particularly in the Indo Pacific. Our new trading freedom means Britain can join the CPTPP, the Comprehensive and Progressive Agreement for Trans-Pacific Partnership. Already the largest trade agreement by population, if the US joins, it will be the largest free-trade agreement in the world. Our trade agreement with Japan, the world’s third-largest economy includes some of the most cutting edge digital free trade provisions anywhere in the world. And we can do more to collaborate with our Indo Pacific partners from space alliances to green finance to protecting our shared values.\nThe pandemic has shown us that we need to modernise our state, address regional inequality, and build in resilience for the next global shock. It has also highlighted our strengths – from genomic sequencing to the full financial firepower of the British Treasury standing behind our businesses and workers. And of course, the scientific community which has developed an affordable vaccine for the world at the Oxford Jenner Institute.\nWe have used our soft power and our funds to ensure that those in the developing world aren’t left behind. We are the biggest funder of CoVax, the global vaccine alliance, which will ensure that we can get at least one billion doses of coronavirus vaccines to more than 90 developing countries.\nThrough innovation and partnerships, we are helping to get the vaccine to those who need it most, proving that an independent Britain is not only good for us but good for our friends across the world. Indeed, it is a fitting first step for a new truly Global Britain.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_about-me/content_3.html": "I was first elected as the Conservative MP for East Surrey in December 2019. I then served as a Parliamentary Private Secretary in the Treasury before being appointed Minister for Disabled People at the Department for Work and Pensions in September 2022 and Minister for Children, Families and Wellbeing at the Department for Education. From August 2023 until July 2024, I served in Cabinet as Secretary of State for Energy Security and Net Zero. I am currently serving as the Shadow Secretary of State for Energy Security and Net Zero and Shadow Minister for Equalities.\nI started my career at Merrill Lynch, before leaving the City for a career in social justice policy. I focused on a wide range of issues from education to financial inclusion, to the regeneration of deprived communities including at the Centre for Social Justice. I then spent two years within Government as a Special Adviser, including at HM Treasury. I have a master’s degree in Maths and Philosophy from Oxford.\nMy local priorities include supporting local community groups who tackle loneliness, protecting our green belt, and working with Surrey Police to tackle shoplifting in our town centres. In 2022 I set up The Friendship Project, a local charity which raises money to support local community groups, and I have distributed over £15,000 so far.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_cdn-cgi_l_email-protection/content_43.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_parliament/content_2.html": "Skip to main content\nMain navigation\nHome\nAbout Me\nNews\nSurveys\nContact\nAnnual Review 2024\nAnnual Review 2023\nIn Parliament\nTweet",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_question-chancellor-potholes-east-surrey/content_36.html": "Supporting the Lingfield Farmers' Market Friday, 25 April, 2025 Make sure you stick a note in your diaries for the next Lingfield Farmer’s market on Sunday 11th May!Alexia Lescure’s first farmers' market was held in the glorious spring sunshine a few weeks ago to great acclaim.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_campaigns_vat-private-schools-make-sure-you-have-your-say/content_10.html": "I believe Education is the most important thing we deliver in Government.\nAs you may be aware, the new Government are planning to charge VAT on independent school fees, meaning parents will now have to pay an additional 20 per cent if they send their child to an independent school. This would make us one of the only countries in Europe to tax education and worse still, it would risk more children being pushed into the state sector, requiring specialist support.\n1 in 4 pupils in Surrey go to a local independent school. These aren't Etons or Harrows. These schools are often providing support for children with complex needs. If these children are forced into the state sector, this could add extra costs to the taxpayer, mean larger class sizes and worse outcomes for some of our most high needs children. There are 100,000 SEND pupils who could face this extra tax if the Government goes ahead with it, as planned in January 2025.\nIf you think you will be affected or you have any thoughts, please do fill in my survey.\nBest wishes,\nClaire Coutinho",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_rolling-out-free-childcare-2-year-olds/content_17.html": "When I was at the Department for Education, I worked very hard to launch the biggest expansion of childcare ever - saving families in East Surrey and across England an average of up to £6,500 a year.\nThe first stage of our ambitious rollout has now launched, with applications open for working parents of two-year-olds to receive 15 hours of free childcare per week starting from April 2024.\nPlease visit childcarechoices.gov.uk to find out your eligibility and apply.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_visit-limpsfield-common/content_29.html": "It was delightful to visit Limpsfield Common to catch up with Stephanie Fudge and Mark Dawson from the National Trust. They talked me through the improvements they have recently made to the Common to restore our ancient woodland, protect nature, and make the Common more accessible for those with limited mobility.\nSurrey is the most wooded county in England, with about a quarter of our woods classed as ancient woodland. Spending time in the natural world can do wonders for our mental health and wellbeing, and the National Trust, along with the Friends of Limpsfield Common, make sure these benefits can be protected for generations to come. I’m going to be putting members of my Friendship Project in touch with the National Trust to see how we can encourage people to enjoy nature together.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_claires-team-congratulates-volunteers-woodhouse-centre-successful-spring-opening/content_5.html": "A huge well done to all the volunteers at the Woodhouse Centre in Oxted for such a successful spring opening morning!\nThe Centre was buzzing with activity, with the Men in Sheds crafting bee drawers for local school children to decorate, visitors enjoying tea and cakes, and volunteers fundraising with their wonderful handmade gifts.\nClaire's Friendship Project part-funded new flooring and lighting throughout the space, so it was great to see this being put to good use!\nMore information about upcoming classes and volunteering opportunities can be found on the Woodhouse Centre website at: www.thewoodhousecentre.org.uk\n-Team Claire",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_claire-writes-chief-executive-valuation-office-agency-following-godstone-business-meeting/content_26.html": "I've written to the Chief Executive of the Valuation Office Agency, the body who make decisions on business rates relief, asking that they consider urgent support for businesses in the south of Godstone affected by the ongoing disruption.\nAt the meeting that my team organised last week, many small business owners told us their concerns that any delay in receiving rates relief would have a devastating affect on their cash flow and ability to stay open. I've also asked the Chief Executive for a dedicated point of contact so that businesses can have clear, regular updates on their applications.\nFootfall for small businesses in Godstone has dropped significantly since the road was closed, so please do continue to support them as much as you can.\n-Claire\nPlease see Claire's letter below:",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_reaction-labours-disastrous-autumn-budget/content_24.html": "Post Budget, where are we?\nWell, I think it’s fair to say we are in a very tough spot.\nRachel Reeves has set out the largest tax rises Britain has seen in 30 years. Borrowing is up. Growth has been downgraded, inflation and interest rates will be higher, bond markets are pushing up the cost of capital.\nTaken together the estimated impact is that an average family will be £770 worse off in 2029 compared to today (Joseph Roundtreee Foundation). The impact on businesses when you add in their Union workers package is incredibly tough.\nThe OBR have comprehensively rejected the made up £22bn ‘black hole’ figure that Labour have tried to hide behind.\nThe truth is, this is a traditional big tax and spend Labour budget - you can argue about the economic merits of that - but the key for me is that they have broken the promises they made over and over again to the electorate just weeks ago. Incidentally Labour also voted against being held accountable to their ‘£300 off energy bills by 2030’ election promise on Wednesday night.\nThe big measures that may affect you are:\n- £25 billion increase to employer's National Insurance by raising the rate to 15% and lowering the thresholds to £5000 (75% of this will be passed on through lower wages, particularly hitting low paid workers).\n- The minimum wage will rise to £12.20 from April and up to £10 for under 18s.\n-Short term big boost to NHS spending (4.7% increase for two years) before falling back to lower levels.\n-Stamp duty surcharge to go up from 3% to 5% and thresholds will drop from main home (from £250,000 to £125,000) and for first-time buyers pay the tax (from £425,000 to £300,000)\n- Imposing an education tax by charging VAT on independent schools. A quarter of our student population in Surrey will be affected by this. SEND schools will not be exempt. I will write more about this.\n- 20% inheritance tax on farms above £1m (this will be particularly bad for our farmers, I also worry the real plan is to squeeze them out and replace them with large scale solar farms which will impact our countryside).\n- Cutting business rate reliefs for retail, hospitality, and leisure businesses from 75% to 40%.\n- Basic rate capital gains tax on profits from selling shares to increase from from 10% to 18%, with the higher rate rising from 20% to 24%",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_campaigns/content_6.html": "Are You Satisfied? - Tell me your views about the local train service Residents across East Surrey frequently get in touch with me to share their views on train services across East Surrey. Common themes include the need for more...\nVAT on Private Schools - Make sure you have your say I believe Education is the most important thing we deliver in Government. As you may be aware, the new Government are planning to charge VAT on independent...\nProtect our Green Belt - Make sure you have your say on the Government's plans to build on the Green Belt In today’s King’s Speech, the new Government announced a new Planning Bill which it is widely reported will remove the right of local communities to reject...",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_claire-receives-response-voa-following-her-letter-behalf-businesses-godstone/content_31.html": "I've received a response from the Chief Executive of the Valuation Office Agency following my letter on behalf of businesses in Godstone.\nI'm pleased that after they received my letter a valuer from the VOA visited many businesses in Godstone to provide advice to owners and inspect their properties. They strongly encouraged businesses to contact the VOA through their Check, Challenge, Appeal service and submit trade figures before and after the collapse as evidence.\nI am also glad that the Chief Executive has taken up my suggestion of providing a dedicated point of contact for businesses in Godstone to provide updates and support on their applications for relief.\nAs always, if you are a business or resident who needs my support on the ground collapse or any other issue, please do email me on claire.coutinho.mp@parliament.uk - and please do continue to support our brilliant businesses in Godstone in the meantime.\n-Claire\nPlease read it below:",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com/content_1.html": "Intro Video (background video that auto-plays without sound)\nClaire Coutinho\nServing East Surrey\nI'm Claire Coutinho and I am the MP for East Surrey. Growing up, I watched my parents work in the NHS, listening to people's problems and solving them as best they could. It is in that spirit that I hope to serve the people of East Surrey.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_campaigns_protect-our-green-belt-make-sure-you-have-your-say-governments-plans-build-green-belt/content_13.html": "In today’s King’s Speech, the new Government announced a new Planning Bill which it is widely reported will remove the right of local communities to reject housing developments when they don’t think they are right for their neighbourhood. I know many of you will be worried about what this means for our area.\nWe absolutely need affordable homes for local families and key workers including teachers and nurses, but forcing through new developments without a proper role for residents to question local infrastructure, traffic or access to green spaces or public services is not the answer.\nI’m going to be meeting Tandridge District Council to discuss what these plans mean for our area, and how we can provide constructive opposition to ensure that we get the affordable homes we need, while managing infrastructure pressures and protecting our green spaces.\nIf you feel strongly about this issue, I’ve launched a survey for you to tell me how more building on the green belt will affect you.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_cookies/content_38.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_about-rss/content_32.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_annual-review/content_35.html": "It’s exactly one year since I was elected and it has been the privilege of my life to serve the people of East Surrey as your MP. Before I became involved with politics like most people I know I wasn’t really aware of what an MP actually did. So I wanted to take some time to explain to you what I’ve been up to this year as your representative. As well as my work as Parliamentary Private Secretary to the Treasury and dealing with the pandemic response, I’ve been campaigning on my local priorities -better roads, supporting the local economy, and protecting our local environment and I’ve been answering 12,000 pieces of your correspondence to try and get local people the help and answers they need.\nAccessibility: Coming from an NHS family, I view being an MP a bit like being a family doctor. I wanted to make myself as accessible as possible and to that end have held travelling surgeries in Oxted, Caterham, Lingfield, Woldingham and Smallfield before the pandemic and fortnightly telephone surgeries now. I write for local parish newsletters and newspapers, take part in Facebook Live Q&As and regularly update my Facebook page with what I’m up to and send out a regular newsletter. I aim to respond to every piece of correspondence that I get from you – 12,000 emails and letters this year so far.\nRoads: This has been my No.1 local priority. I campaigned at the March Budget for much needed funds and secured £33.5million extra for potholes across Surrey. Having visited the work in action, I am pressing for a review of our contractor. I’m also working with local residents to address excessive HGV movements in Smallfield, Burstow, Horne and Outwood and with Surrey County Council (SCC) and Tandridge District Council (TDC) to try and pin down infrastructure funding to improve our key junctions.\nLocal Economy: The Treasury’s £200bn economic response has been called one of the best examples of coordinated action globally. Locally the furlough scheme and self-employed schemes supported over 20,000 livelihoods. On top of this a range of grants, loans and cashflow schemes have directly benefitted local businesses. Nonetheless it has been an incredibly hard year for business. That’s why in June, I set up the East of Surrey Local Economic Taskforce with Crispin Blunt our neighbouring MP. We meet fortnightly with the councils, LEP and Federation of Small Businesses and so far we’ve drawn in £1.7million in public investment and are working to support high streets, skills and jobs, particularly for young people and aviation workers. I’ve loved meeting local businesses, supporting their applications for grants and Bounce Back loans and working with the BIDs. I also sit on the Surrey Economic Growth Board and will continue to place economic recovery at the heart of my work.\nEnvironment: Our new home in Bletchingley is surrounded by nature and I feel so lucky to be there. I want to protect our local environment for the next generation too, and I spoke about this in my maiden speech in Parliament. That’s why I’ve worked to get a much overdue boundary review to protect the Surrey Hills for the next generation. I’ve organised local litterpicks in Westway Common and in Horley and got the Environment Minister for a special Q&A with residents. I’ve been inspired by the local environmentalists and the farmers I’ve met and visits to the exceptional Lingfield Nature Reserves and the British Wildlife Centre. Next year I will be campaigning to introduce Wild Belts to protect our nature recovery. On the national stage, I’ve supported the Environment and Agriculture Bills and was a member of the Fisheries Bill Committee, landmark legislation which will transform our landscape in the years to come.\nPandemic Response: Me and my team were inundated during the pandemic with questions and requests for help. I called to check in on older residents in the evening, joined up people in need with our fantastic local volunteer groups to get food and medicines, and worked with care homes and extremely kind donors to distribute PPE. I launched an East Surrey Community Champion Awards and Bounceback Business programme to recognise the phenomenal efforts of businesses and community groups like the Dormansland Diamonds, the Kindred Bakery and the Dog and Duck in Outwood.. An enormous number of people messaged in with the most incredible stories, and when social distancing allows, I hope we can celebrate their achievements together.\nParliament: This year, I’ve spoken in 24 debates in the House of Commons, but Parliament is a bit like a Greek tragedy – a lot of the action happens off stage! To that end, I often meet with Ministers to raise your concerns – particularly around housing - lobby for individual cases and work with caucuses like the Social Justice Caucus to achieve common aims. Here are some of the speeches I’ve made this year:\n- Maiden Speech\n- Housing and Planning\n- Race and Inequality\n- Improving Local Infrastructure & More Funding for Potholes\nAviation: Gatwick is a major driver of employment in our area. I have worked regularly with the team there and raised the plight of aviation workers with Ministers. Thanks to combined efforts of lobbying we have seen a removal of the 10pm curfew in airports and a move from Quarantine to Test and Release. The Local Economic Taskforce I run has pursued help for people around Gatwick working with DWP Ministers to ensure local people can be supported with skills and extra job support on site.\nSchools: Before being an MP, I worked in the Education and Social Mobility team at KPMG. It has been an incredibly tough for year for so many in public service and I thank heads and teachers for all that they’ve done to adapt in difficult circumstances. I pressed for a Catch Up Fund, based on the EEF’s work, and am talking to schools about how this additional £1.5bn is landing on the ground. I have also loved meeting some of our outstanding SEN schools. We are putting in place 213 extra SEN placements across Surrey and over a £1bn extra funding nationally over the last two years but this remains a challenging area for parents to navigate. My favourite part of the job is meeting pupils and doing my best to answer their questions.\nTrains: Before the pandemic I met with Govia Thameslink Rail to discuss our train services and worked with neighbouring MPs to address the landslips in January 2019. However, train usage has massively fallen since the pandemic. This has brought its own challenges of sustainability and confidence in public transport and I will be monitoring this in the year ahead.\nNational Policy: This year I was appointed to the Advisory Board for the think tank Onward and to Policy Exchange’s Indo Pacific Commission to promote how Britain can best work with the fastest growing region in the world. I have written articles on the Indo-Pacific, Digital trade and how Fintech can support people on low incomes. I was also delighted to be appointed to the Armed Forces Parliamentary Scheme to learn more about the work of the Navy. You can read more about some of this work here:\nESDAS: I’ve met so many wonderful local charities and community groups, but one stands out this year and that is the extremely busy East Surrey Domestic Abuse Services. We all know this has been an awful year for domestic abuse victims, if you would like to support ESDAS’ work you can donate here.\nFinally, I’d like to wish you all a happy Christmas and wish every health and happiness to you and your families for the new year. Thanks to the outstanding work of scientists and clinicians around the world I am hopeful we will see a return to normality once again. I look forward to seeing as many of you as possible in 2021. As ever, if there is anything you would like to get in touch with me about you can contact me at [email protected].\nYou can sign up to receive my newsletters here.\nYou can follow me on Facebook here.\nYou can follow me on Twitter here.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_category_Speeches-in-Parliament/content_7.html": "Labour Minister's WEAK answer on racist hiring policies 18th December 2024 Hiring people based on the colour of their skin is nothing short of state-sanctioned racism. The Minister says this is illegal, but it’s happening on Labour’s... Speeches in Parliament\nEd Miliband REFUSES to justify taking the Winter Fuel Payment away from millions of pensioners 17th December 2024 The Labour Government is taking the Winter Fuel Payment from millions of pensioners, including those living in poverty, while spending billions of pounds of... Speeches in Parliament\nEd Miliband signs UK up to a $300 BILLION climate target - but won't say how much Brits will pay. 26th November 2024 At COP29, Ed Miliband signed the UK up to new targets to cut emissions by 81% by 2035, and promised to contribute to a $300 billion international climate... Speeches in Parliament\nEd Miliband votes AGAINST his own promise to cut energy bills 29th October 2024 Just a few months after telling Labour candidates to promise their voters £300 of energy bill savings through Great British Energy, tonight he ordered them to... Speeches in Parliament\nEd Miliband will RAISE your energy bills 5th September 2024 Labour went into the election promising to cut people's energy bills by £300. Now Ed Miliband won't repeat that figure because he knows it's not true - and one... Speeches in Parliament\nMY SPEECH ON GLOBAL BRITAIN 12th January 2021 Today, Britain is forging a new path as a sovereign nation-state. We will stand by our long-held values of liberty, democracy, respect for human rights... Speeches in Parliament\nCovid-19: Future UK-EU Relationship 15th July 2020 I am somewhat bemused by the motion today because on the very first page of the document to which it refers the Scottish Government say: “This transition period... Speeches in Parliament\nAgriculture Bill Report Stage 13 05 20 13th May 2020 In East Surrey over half of the land is farming land. I want to thank my local farms, particularly Felcourt Farm, for their insight ahead of this debate. This... Speeches in Parliament",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_west-park-road-set-resurfacing/content_39.html": "I’ve received confirmation from Surrey County Council that West Park Road will be resurfaced between 19th June and 22nd July. Residents nearby will receive leaflets telling them what to expect while the repairs are carried out.\nI know the road has been bothering lots of you for months now, and having driven on it myself recently, I’m very glad the issue will soon be resolved.\nMany thanks to Cllr Lesley Steeds for pursuing these repairs relentlessly. Please do let your local councillors know about unsafe potholes near you, or report them online here.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_update-claires-rail-survey/content_34.html": "In Claire’s rail survey, many residents who use the East Grinstead Line told us that rail services have not kept up with demand since the COVID timetable change. After weeks of raising this with GTR and Network Rail, we are pleased to share that from December, the East Grinstead line will return to pre-COVID service levels.\nThis means that services from Dormans, Lingfield, Hurst Green, Oxted, Woldingham, and Upper Warlingham stations will run every 30 minutes all day, replacing the current off-peak hourly service.\nInitially, this updated schedule will run on Wednesday, Thursday, and Fridays, as trackside safety changes mean Monday and Tuesday services will remain the same for now.\nWe have also highlighted the need for more flexibility during school holidays, and GTR is considering whether the half-hourly service could run all week at these times.\nWe are also continuing to push for the return of the direct services from Caterham to London Victoria. While GTR gave us some positive signals in our meeting, we will keep the pressure on to get this important service back.\nThank you again for everyone who took part in the survey – your voices were crucial in making this happen.\n-Team Claire",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_ed-miliband-votes-against-his-own-promise-cut-energy-bills/content_14.html": "Just a few months after telling Labour candidates to promise their voters £300 of energy bill savings through Great British Energy, tonight he ordered them to vote against my amendment to make them stick to their promises.\nThe truth is, Ed Miliband will send bills soaring, send British jobs abroad, and reduce our energy security.\nClick to watch: Ed Miliband votes AGAINST his own promise to cut energy bills",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_privacy/content_33.html": "This document outlines how Claire Coutinho processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Claire Coutinho\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Claire Coutinho.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Claire Coutinho, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Claire Coutinho via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_campaigns_are-you-satisfied-tell-me-your-views-about-local-train-service/content_9.html": "Residents across East Surrey frequently get in touch with me to share their views on train services across East Surrey. Common themes include the need for more frequent services from Upper Warlingham during rush hour and a more reliable service on the Merstham line. Given the clear desire from local residents to see improved services, I would like to invite you to take part in this survey.\nNetwork Rail in partnership with GTR is currently considering changes for the next timetable. Based on your responses, I will press Network Rail and GTR to look at the services that need more attention, or demonstrate the demand for extra services at specific times.\nThe survey will be open until the 20th February. I want to hear from as many people possible so please do take part and encourage others to get involved too.\nNotice: Responses received in this survey will be used for Parliamentary purposes only.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_covid-19-future-uk-eu-relationship/content_27.html": "I am somewhat bemused by the motion today because on the very first page of the document to which it refers the Scottish Government say:\n“This transition period is due to finish on December 31, but it can be extended… as long as that is agreed by the end of June. After that date, it will not be possible to extend under the terms of the Withdrawal Agreement—and no other plausible route to an extension has been put forward.”\nSo I would be interested to hear from SNP Members what route they know of to extend and why they have not shared that with their colleagues in the Scottish Government.\nConservative Members believe that the whole United Kingdom is stronger when we work together and that the real threat to recovery would be the SNP’s policy of separating Scotland from the rest of the UK. We value this Union, this family of nations, which, formed more than 300 years ago, has been the most successful union in history. While 17% of Scottish exports go to the 27 member states of the EU, 60%—over three times more—of Scottish trade goes to the rest of the United Kingdom, and a similar value flows back over the border.\nFifty years ago, my mum and dad moved to the UK, leaving behind their families and friends, because the UK represented the values that meant so much to them and which mean so much to me as well—indeed, they are referenced in the Scottish document: human dignity, freedom, democracy and equality of opportunity. The UK does not just talk about those values; it embodies them. Recently, when Hong Kong’s freedoms were threatened, the UK stepped up to the plate, not just by raising concerns with China but by inviting up to 3 million British national overseas passport holders and their dependants with open arms to move to the UK.\nAs someone from an immigrant background, I can say that these islands represent hope and opportunity. This is a Union not just of nations but of people, and it is personal for me. My mother works in the NHS in England; my cousin works in the NHS in Scotland. The whole United Kingdom has opened its arms and become a home to my family, and for that I am very grateful.\nThe optimistic vision for Britain after 31 December is of more trade. It is a vision of a global Britain, engaged around the world, representing our British values of decency and progress, and boosting British exports, from the sparkling wines of Surrey to the slightly better known—for now—Scotch whisky. Scotland will benefit from these trade deals. The rest of the UK is by far Scotland’s biggest market, with trade worth £51 billion, dwarfing that with the EU—and the EU trade will likely suffer because of US sanctions to the EU, which have targeted Scottish products.\nThe Comprehensive and Progressive Agreement for Trans-Pacific Partnership provides the opportunity for a trade deal centred on the world’s fastest-growing region, covering a population of 495 million people—greater than that of the EU—and, crucially, opening up opportunities in the services sector, which constitutes 70% of the Scottish and, indeed, UK economies. Accession would be a key step in realising our ambition for 80% of UK trade to be covered by free trade agreements in the next three years.\nOur vision means more control over our fisheries, ensuring more Scottish fish are caught by Scottish fishermen. It means an agriculture policy designed not for the needs of 27 diverse nations but by the Scottish Parliament for Scottish farmers. As my hon. Friend the Member for Stockton South (Matt Vickers) mentioned, it means freeports, which I think would benefit many coastal communities in Scotland. And leaving on 31 December will mean more powers for the Scottish Parliament; I note that the Institute for Government says it will gain powers in 63 different policy areas.\nI hope that we can continue to work together for our common future and to ensure the best possible recovery from the epidemic. The covid-19 recovery has highlighted the strength of our shared institutions, with the UK Government working with devolved Governments to ensure the best possible provision for our people; devolved Governments tailoring policies to local requirements; the NHS, formed across the UK, providing care on the basis of need; the British Army building hospitals and testing people across our four nations, and the Treasury using the financial firepower of our strong Union to ensure that money is distributed to England, Wales, Scotland and Northern Ireland on the basis of need. Our resources are pooled and shared. The best hope for our recovery and the future of the British people is our continued co-operation—working together in a national effort to get the whole country back on its feet.\nCrucially, even if it were possible to extend, I am not convinced that that would bear fruit. At the beginning of my career, I worked on a trading floor, and I had a frontline view as the Greek credit crisis unfolded. There are very few decisions that the EU has to bring its 27 countries to terms on to which the answer is more time. We saw last year that extensions do not change the fundamentals. There is no use hiding from the decisions that need to be taken. Perhaps someone should tell the Labour party that.",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_news_category_Speeches/content_42.html": "Energy UK Speech 2024 17th September 2024 Now as someone whose party recently got trounced in the polls, who is not going to be in Government for the next 5 years, you may be wondering what’s the point... Speeches\nChatham House Speech on Energy Security 12th March 2024 Full text of a speech delivered at Chatham House on Britain's energy security strategy on 12th March 2024. INTRODUCTION As Secretary of State for Energy... Speeches\nFreedom of Speech and the Leaders of Tomorrow 5th July 2023 Today, I gave a speech at Policy Exchange about the Higher Education (Freedom of Speech) Bill I recently took through Parliament. You can read the entire speech... Speeches",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_map-locations/content_12.html": "Skip to main content\nMain navigation\nHome\nAbout Me\nNews\nSurveys\nContact\nAnnual Review 2024\nAnnual Review 2023\nMy map",
  "https_www_clairecoutinho_com_/https_www_clairecoutinho_com_accessibility/content_41.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S"
}