{
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_ourplan/content_8.html": "As a father of two young children and a former school governor, I am serious about improving Island education. That's why I introduced fellow primary school parents to the Education Secretary Gillian Keegan MP so they could raise their concerns direct with Government.\nWorking with local police, I secured a special grant from the Police and Crime Commissioner which has enabled a new sports programme in Ryde to divert young people away from crime.\nI have been leading calls for more genuinely affordable housing for Islanders including affordable rental homes. We secured £40m in the Council’s Budget and published a 5-point action plan for delivery.\nAs an advisor to a national nursing charity I work professionally alongside the NHS and care providers every day. I have helped secure better care and support for people in their own homes, including here on the Island.\nBusiness investment is key to growing the Island’s economy and creating new jobs and opportunities, particularly for young people and families. I am already supporting our East Wight tourism sector and promoting the Island nationally as a place for businesses and individuals to invest in.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_node_6/content_6.html": "As a father of two young children and a former school governor, I am serious about improving Island education. That's why I introduced fellow primary school parents to the Education Secretary Gillian Keegan MP so they could raise their concerns direct with Government.\nWorking with local police, I secured a special grant from the Police and Crime Commissioner which has enabled a new sports programme in Ryde to divert young people away from crime.\nI have been leading calls for more genuinely affordable housing for Islanders including affordable rental homes. We secured £40m in the Council’s Budget and published a 5-point action plan for delivery.\nAs an advisor to a national nursing charity I work professionally alongside the NHS and care providers every day. I have helped secure better care and support for people in their own homes, including here on the Island.\nBusiness investment is key to growing the Island’s economy and creating new jobs and opportunities, particularly for young people and families. I am already supporting our East Wight tourism sector and promoting the Island nationally as a place for businesses and individuals to invest in.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_joes-small-business-survey/content_11.html": "Dear Business Owner,\nRe: Isle of Wight East Small Business Survey\nSmall businesses like yours are the backbone of the East Wight economy. You provide the jobs, the growth and the revenue that helps our Island thrive. Throughout the General Election campaign, one of my top priorities was promoting businesses and jobs, and this remains the case.\nWithin the first couple of weeks of entering Parliament, I became a member of the All-Party Parliamentary Group for Hospitality and Tourism in order to work with cross-party MPs to press the Government for more support for the sector and reduce the high tax burden for small businesses to promote jobs and growth. I have now been appointed Parliamentary Private Secretary to the Shadow Department of Culture, Media and Sport team which also covers tourism and the creative industries. With the Labour Government announcing a hike in employer national insurance contributions in the October Budget, I want to hear your views and experiences as a small business in the East Wight.\nI want to be able to help you as much as possible, that’s why I am asking you to fill in this survey. Once I have gathered all your views, I’ll share them with the Council, Government and any other organisation that works with our high streets and businesses in order to address and tackle your top concerns. Individual responses will be anonymised if shared.\nI’d be most grateful if you could therefore fill in this quick survey.\nYours sincerely,\nJoe Robertson MP",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_accessibility/content_24.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_campaigns_tackle-anti-social-behaviour/content_15.html": "Working with local police, I secured a special grant from the Police and Crime Commissioner which has enabled a new sports programme in Ryde to divert young people away from crime. I persuaded the Commissioner to reopen Ryde police station to the public and I am now campaigning for regeneration of our towns including exploring new community opportunities for publicly owned land in Sandown.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_privacy/content_2.html": "This document outlines how Joe Robertson processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Joe Robertson\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Joe Robertson.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Joe Robertson, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Joe Robertson via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_joe-robertson-welcomes-conservative-leadership-hopeful-james-cleverly-island/content_23.html": "Former Home Secretary and Conservative Leadership hopeful, James Cleverly MP, visited the Island yesterday. He was welcomed off the hovercraft by Isle of Wight East MP Joe Robertson, who introduced Mr Cleverly to local businesses in Ryde before going on to a Conservative members event at Wight Knuckle Brewery at the Nunwell Estate in Brading. They also visited Wight Shipyard with its famous Union Jack doors in East Cowes to see aluminium ferries being built.\nIn Ryde, the MPs visited Black Sheep Bar, Victoria Arcade and Robert Lee Barbers on Union Street before going on for an ice cream at Big Kanuna café on the beach.\nJoe Robertson said, “James has visited the Island many times and it was great to welcome him back and introduce him to local residents and businesses. The tourism industry is so important to the East Wight economy and James heard for himself how high ferry prices are impacting the tourist economy. Small, family run businesses are the lifeblood of our Island economy, employing local people, and they need our support.”\nMr Cleverly told local Conservative members that he was pleased to be back on the Island again. “The Conservative Party needs to win back the trust of the British people and it needs to start in places like the Isle of Wight. You are fortunate to have Joe Robertson as your new energetic MP for the East who has already met with the Secretary of State for Transport to press the case for intervention on ferries. I want to be leader of the Conservative Party because I believe I am the right candidate to unite us so that we can deliver for the British public once again, and return two Conservative MPs here at the next election.”\nThe Members event was followed by a South African style BBQ at \"Braai\" – a collaboration between Heron restaurant, Nunwell Estate, Wight Whisky and Wight Knuckle Brewery – is based.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_contact/content_28.html": "Skip to main content\nMain navigation\nHome\nAbout Joe\nNews\nOur Plan\nGet involved\nContact\nHave your say on the future of the Isle of Wight Council\nJoe's Small Business Survey\nContact\nLeave this field blank\nThe Office of Joe Robertson MP\n6 Palmerston Road, SHANKLIN, PO37 6AU\n01983 217089\n[email protected]\nJoe on Facebook\nJoe on Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_local-councillors-and-businesses-welcome-parking-charge-freeze/content_20.html": "Councillors and businesses have welcomed the announcement that the Council’s planned parking charges hike for 2024 will now not go ahead. On 27th January a senior Council officer took the decision to raise parking and permit charges with delegated authority given by the Council Leader, Cllr Phil Jordan. The decision would have seen increases of between 10-20 per cent from April which prompted a number of cross-party Councillors to try and “call-in” the decision to be challenged at a public meeting of the Corporate Scrutiny Committee. With a lack of clarity in the Council’s constitution about challenging decisions made by officers, the call-in request was rejected leaving Councillors without a say. However, just 24 hours later (Wednesday), the Alliance Group’s draft budget was published under the headline, “Car parking charges frozen” meaning a swift reversal of the decision taken in late January.\nCllr Joe Robertson, Chairman of the Council's Corporate Scrutiny Committee, welcomed the news. “I have been campaigning against parking charges and talking to local businesses over many months. Year after year motorists and shoppers are seen as an easy target for raising money by the Council. High parking charges have a detrimental effect on the vibrancy of our towns, the high street, small businesses, the visitor economy and hard-pressed residents. The Leader should never have delegated the decision to an unelected official in the first place but I am glad good sense prevailed after pressure from our cross-party committee of councillors.”\nNeil Gibbs of the Spyglass Inn in Ventnor said, “I was against the increase in parking charges. Decision makers do not seem to understand the damage it does to the local economy including visitor spending. There should be a further freeze next year.\"\nCllr Ray Redrup, of Grace's Bakery, with a high street shops in Newport, Ryde, Shanklin, Cowes and Yarmouth said, \"I am pleased that the price hike will not go ahead. The Island's parking charges are already higher than comparable places on the mainland and they encourage people to shop at the big supermarket chains with free car parks. That doesn't help our town centres and small businesses.\"\nCouncillors Peter Spink, Sarah Redrup, Chris Quirk, Warren Drew and Ed Blake also signed the call-in request criticising the original decision to increase charges.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk/content_1.html": "Isle of Wight East\nAm I your MP?\nEnter your postcode\nI'm Joe Robertson, the Conservative MP for Isle of Wight East. We may already have met, in my role as an Isle of Wight councillor or dementia charity worker, but if we haven't then I look forward to meeting you and discussing your concerns soon.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_joe-robertson-isle-wight-county-press-column/content_7.html": "On Wednesday, the Minister for Maritime and Aviation visited the Island to host a roundtable with the ferry companies, Richard Quigley and me, and other stakeholders. It was an opportunity to make the case to the Minister and civil servants from the Department of Transport that services and prices are so far from what is acceptable that the ferry companies cannot be relied upon to make the improvements required without Government oversight.\nI presented evidence of £350 return tickets, dwindling timetables which have seen the Portsmouth-Fishbourne route reduce from an average of 35 return crossings a day in 2010 to 30 in 2015 and only 25 in 2025. I am confident that the Minister will return to Westminster with a better impression of the scale of the problems than when he arrived. The Government is nationalising trains and subsidising buses to the tune of £1 billion. Isle of Wight ferries are an outlier as the only lifeline transport link entirely privately owned, unregulated, debt-laden, and unsubsidised. All we are asking is for our Island to be treated fairly, like everywhere else in the UK.\nMeanwhile, I have set up a Ryde Business Forum to better connect businesses in Ryde. It is being chaired by John McLagan, and we held our first drop-in event at Royal Victoria Arcade in Union Street with over 50 people in attendance. It comes at an important time for Ryde, which will be receiving £20 million from the Government over the next 7-10 years to be distributed by a new Neighbourhood Board, and I want to make sure a wide spectrum of voices have input into how the money is spent. I am pleased to have persuaded the Board to add 4 new members with an emphasis on business, health, education, and young people.\nDuring the break, I took the opportunity to attend two “Let’s Talk” beat surgeries with local police in Lake Morrisons and Shanklin Coop. I heard from concerned residents about anti-social behaviour, including the nuisance caused by the illegal use of scooters. The Crime and Policing Bill is currently going through Parliament (I am on the Bill Committee), which will give the police a number of new powers, such as the power to confiscate scooters driven with intent to annoy without having to first give a warning.\nI also met with Ventnor residents and Councillor Ed Blake in Bath Road to lend my support to getting it reopened. I am pleased that, within days, the Council finally agreed to get it reopened and deal with the potential ownership dispute thereafter, so residents and businesses don’t have to suffer any longer while the Council argues about who should foot the final bill. Next on the agenda is Belgrave Road, which I have already spoken out about.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_category_Local-News/content_10.html": "Maritime Minister Joins Isle of Wight MPs for Ferries Roundtable 23rd April 2025 Joe Robertson Joins Roundtable on Ferries in Cowes, Calls for Government Action on Pricing, Timetables, and Reliability Joe Robertson, MP for Isle of Wight East... Local News\nJoe Robertson Isle of Wight County Press Column 23rd April 2025 On Wednesday, the Minister for Maritime and Aviation visited the Island to host a roundtable with the ferry companies, Richard Quigley and me, and other... Local News\nFirst Ryde Business Forum 22nd April 2025 East Wight MP hosts the first Ryde Business Forum drop-in event Joe Robertson, Member of Parliament for Isle of Wight East, has hosted the first Ryde Business... Local News\nJoe Joins Shanklin Residents at \"Let's Talk\" Beat Surgery 17th April 2025 Joe Robertson, recently joined the \"Let's Talk\" beat surgery in Shanklin alongside local police officer Tom Sheath to discuss pressing concerns from residents... Local News\nJoe Robertson MP Appointed to Conservative Shadow Transport Team 15th April 2025 Joe Robertson MP Appointed to Conservative Shadow Transport Team Joe Robertson, Member of Parliament for Isle of Wight East, has been appointed as Parliamentary... Local News\nJoe's Isle of Wight Observer Column 10th April 2025 I am launching a Business Forum for Ryde, chaired by John McLagan, which will help bring business together to share ideas and better connect with decision... Local News\nJoe urges Health Secretary to commit to National Prostate Cancer Screening Program 8th April 2025 Joe Robertson Urges Health Secretary to Introduce National Prostate Cancer Screening Program Joe Robertson has called on the Health Secretary to take decisive... Local News\nJoe Robertson Launches Ryde Business Forum 8th April 2025 Joe Robertson, Member of Parliament for Isle of Wight East, has launched a new Business Forum for Ryde, in order to better connect local business with each... Local News\nJoe meets with key figures and local businesses to discuss Ryde Challenges 4th April 2025 Joe Robertson recently met with Hampshire & Isle of Wight Police Commissioner Donna Jones, Isle of Wight Councillor Karen Lucioni, and Rob Madigan at The Star... Local News",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_campaigns_deliver-affordable-homes/content_25.html": "I have been leading calls for more genuinely affordable housing for Islanders including affordable rental homes. We secured £40m in the Council’s Budget and published a 5-point action plan for delivery. I meet regularly with housing providers have spoken direct with Government ministers about releasing Camp Hill prison site for affordable and social housing.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_joe-meets-key-figures-and-local-businesses-discuss-ryde-challenges/content_14.html": "Joe Robertson recently met with Hampshire & Isle of Wight Police Commissioner Donna Jones, Isle of Wight Councillor Karen Lucioni, and Rob Madigan at The Star Coffee & Ale House to discuss key issues facing Ryde, with a focus on supporting local businesses and addressing anti-social behaviour.\nDuring the meeting, Joe emphasized the importance of backing Ryde’s local businesses, which are integral to the town’s economy and community. He also highlighted the need for stronger action to tackle anti-social behaviour, which continues to impact residents and visitors alike.\nIn addition, Joe expressed his commitment to ensuring that the funds allocated by the newly established Ryde Neighbourhood Board are invested effectively and wisely. \"It is crucial that we prioritize the needs of our community and make sure the money is directed toward projects and initiatives that will have a lasting, positive impact on the area.\"\nThe discussion marks another step in the ongoing collaboration between local leaders to tackle the challenges Ryde faces and to promote growth and prosperity for the town and its residents.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_joe-robertson-meets-pcc-donna-jones-discuss-crime-and-policing-isle-wight/content_18.html": "Joe Robertson MP Meets with Hampshire & IOW Police Commissioner and Local Councillor to Discuss Crime and Policing on the Isle of Wight\nJoe Robertson MP recently met with Donna Jones, Police Commissioner for Hampshire and the Isle of Wight, and Councillor Karen Lucioni to discuss crime and policing issues affecting the Isle of Wight. The meeting focused on the positive developments in local policing, as well as ongoing challenges.\nJoe was pleased to hear that policing numbers on the Island have been bolstered with the launch of the new 'Bobby on the Beat' scheme in early 2024. This initiative is part of a broader effort to strengthen community safety. Overall, crime on the Isle of Wight has decreased by 1.8%, with anti-social behaviour (ASB) down by 8%, reflecting the positive impact of this scheme.\nDuring the discussion, particular attention was given to issues surrounding shoplifting, anti-social behaviour, and repeat offending, especially in the areas of Ryde and Sandown. These concerns have been raised by local residents, and Joe stressed the importance of continuing efforts to address these persistent problems.\nDonna Jones confirmed that a new initiative, aimed at tackling these specific issues, will be launched in the spring. Joe Robertson has pledged his full support for this scheme, which he believes will make a significant difference in improving safety and tackling crime in local communities.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_map-locations/content_9.html": "Skip to main content\nMain navigation\nHome\nAbout Joe\nNews\nOur Plan\nGet involved\nContact\nHave your say on the future of the Isle of Wight Council\nJoe's Small Business Survey\nMy map",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_cookies/content_13.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_cdn-cgi_l_email-protection/content_29.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_maritime-minister-joins-isle-wight-mps-ferries-roundtable/content_12.html": "Joe Robertson Joins Roundtable on Ferries in Cowes, Calls for Government Action on Pricing, Timetables, and Reliability\nJoe Robertson, MP for Isle of Wight East joined a crucial roundtable discussion on ferry services in Cowes, hosted by Mike Kane, the Government Minister responsible for Maritime. The meeting also included West Wight MP Richard Quigley, ferry company representatives, and key local stakeholders.\nThe key outcome of the roundtable is the Government's commitment to remain engaged with the issue, with the Department of Transport agreeing to review key aspects of ferry services, including pricing, timetables, and reliability. This marks a significant step forward in addressing the ongoing challenges facing ferry services on the Isle of Wight.\nJoe Robertson said, \"The key takeaway from the meeting is that this is not a one-off event. The Government will stay involved with the DfT looking into pricing, timetables and reliability.\nI remain of the view – which I expressed unequivocally at the meeting – that the ferry companies cannot be relied upon to act and make sufficient changes in the interests of the Island without Government involvement. They have had 20 years to show they understand but in that time prices have gone up and timetables have dwindled. Over £300 for a return car trip for Islanders or visitors is not acceptable at any time. The unregulated private equity model doesn’t work. Lifeline services for rail, buses and ferries elsewhere do not operate in that way so why should the Isle of Wight be made to tolerate this uniquely vulnerable position.\"",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_node_7/content_5.html": "Become part of Team Joe!\nCampaigning is a constant process and you are invited to join the team. Whether you just want to help fold leaflets or fancy canvassing, there is a space for you in our large group of fellow East Wight residents. You'll get to help the work going into sorting local issues and creating a better future for Isle of Wight East.\nGet in touch via the Contact section and join the journey.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_joe-robertson-mp-appointed-conservative-shadow-transport-team/content_21.html": "Joe Robertson MP Appointed to Conservative Shadow Transport Team\nJoe Robertson, Member of Parliament for Isle of Wight East, has been appointed as Parliamentary Private Secretary (PPS) to the Shadow Transport Team, which is led by Gareth Bacon MP, Shadow Secretary of State for Transport.\nThis appointment makes Mr Robertson the first of the new 2024 intake of Conservative MPs to be given additional Shadow duties as he will fulfil this role alongside his existing position in the Shadow Culture, Media and Sport Team and his role on the cross-party Health and Social Care Select Committee.\nPart of this new role will see Mr Robertson closely involved in the Conservatives’ National Transport Policy Commission announced recently by Kemi Badenoch MP, the Leader of HM Opposition.\nThis Commission will help formulate the Conservative policy positions ahead of the next General Election and will allow Joe an opportunity to argue for more measures to improve ferry services to the Isle of Wight.\nJoe Robertson MP said, “I am pleased to have been appointed to the Shadow Transport Team and look forward to helping formulate the Conservative party’s approach to Transport the next election.\n“Considering the significant problems we have with ferries on the Island, transport is one of the most important local issues and I will be working with my colleagues on policy to get cross-Solent transport taken into the fold of national regulation like trains, buses, and Scottish ferries.\n“I remain cautiously optimistic that the current Government will intervene on cross-Solent transport. It is untenable for them to nationalise trains and give local authorities control over buses while leaving Isle of Wight ferries as the only privatised, foreign-owned, unregulated and unsubsidised lifeline transport route in the country.”",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_campaigns_improve-community-healthcare/content_16.html": "As an advisor to a national nursing charity I work professionally alongside the NHS and care providers every day. I have helped secure better care and support for people in their own homes, including here on the Island. As a member of the local Public Health Scrutiny Committee I continue to argue for more NHS dentists and better cross-Solent travel for patients.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_category_Articles/content_17.html": "Joe Robertson East Wight MP votes against scrapping Winter Fuel Payment 10th September 2024 Joe Robertson MP has voted against Labour’s plan to cut winter fuel payments for 18,490 pensioners in East Wight after the Conservatives forced Labour to accept... Articles\nJoe Robertson welcomes Conservative Leadership hopeful James Cleverly to the Island 13th August 2024 Former Home Secretary and Conservative Leadership hopeful, James Cleverly MP, visited the Island yesterday. He was welcomed off the hovercraft by Isle of Wight... Articles\nJoe Robertson hits the campaign trail in Ryde 23rd May 2024 Twenty-four hours after the Prime Minister called a General Election for 4th July, Joe Robertson, Conservative MP candidate for Isle of Wight East, hit the... Articles\nJoe Robertson backs a tidal sea pool for Sandown 9th April 2024 Joe Robertson has pledged his support for creating a tidal sea pool in Sandown Bay after meeting with Sue and Victoria from Swin the Wight, the community... Articles\nJoe Robertson and Ed Blake call for the reopening of Leeson Road in Ventnor 29th February 2024 Over 300 local residents packed into St Catherine’s Church in Ventnor to hear the Council and Island Road’s plans to reopen Leeson Road following the landslip... Articles\nRyde Academy students discuss citizenship campaigns with Joe Robertson 23rd February 2024 GCSE students at Ryde Academy discussed citizenship issues with Isle of Wight Councillor and MP candidate Joe Robertson. As part of their citizenship course... Articles\nSuella Braverman visits businesses in Ryde 16th February 2024 Former Home Secretary, Suella Braverman, visited Ryde today (Friday). Together with Joe Robertson, Conservative MP candidate for Isle of Wight East, she met... Articles\nLocal councillors and businesses welcome parking charge freeze 13th February 2024 Councillors and businesses have welcomed the announcement that the Council’s planned parking charges hike for 2024 will now not go ahead. On 27th January a... Articles\nHunting for Nurdles 26th January 2024 At the invitation of Planet Aware, Joe joined councillors and campaigners to hunt for plastic “nurdles” on Compton beach. Not officially classed as pollution... Articles",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_joe-robertson-backs-tidal-sea-pool-sandown/content_27.html": "Joe Robertson has pledged his support for creating a tidal sea pool in Sandown Bay after meeting with Sue and Victoria from Swin the Wight, the community interest company behind the plan. Swim the Wight aims to make sea swimming as safe as possible through education and running supervised and risk assessed, regular swims, year-round.\nTidal sea pools are a man-made structure which fill with water as the tide comes in and retain the water as the tide recedes allowing safe sea swimming at all states of the tide and wind. There are known health benefits to sea water swimming which has become more popular since Covid. The plan for Sandown is to build a retaining wall between existing groynes thereby creating the pool.\nAfter meeting with Sue and Victoria, Joe said, “I am pleased to support Swim the Wight’s plans for an accessible tidal sea pool in Sandown. There are the obvious health benefits to creating a new facility but also opportunities for research in the environment created by the pool. The plans would be fully funded and not reliant on local taxpayer money. I have offered to do what I can to persuade the Council and Environment Agency to agree, particularly through the planning application stages.\nLocal Councillor Ian Ward has already thrown his support behind the project.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_joes-isle-wight-observer-column/content_22.html": "I am launching a Business Forum for Ryde, chaired by John McLagan, which will help bring business together to share ideas and better connect with decision makers like the Isle of Wight Council and Ryde Neighbourhood Board. It is an exciting time for Ryde with the Government providing £20 million to the Neighbourhood Board over the next 7-10 years so we must ensure that the money is invested wisely and with proper consultation with residents and local businesses. My next Business Forum event will be a drop-in at Royal Victoria Arcade on Union Street at 5 pm on 15th April.\nEarlier this week I attended the monthly “Let’s Talk” Beat Surgery at Morrisons in Lake with Police Community Support Officer Ashley Webb. Residents raised a number of anti-social behaviour issues including nuisance riding of e-scooters. I was pleased to report that the Police and Crime Bill which should become law later this year will allow police to seize scooters (and similar) driven with intent to cause distress without having to give a warning first.\nI have written to the local Government Minister setting out 5 red lines for the negotiation for a new Combined Mayoral Authority shared with Hampshire. My position remains that we do not want a shared Mayor, however if we are forced to have one then they must be given regulatory powers over cross-Solent transport operators if the Government doesn’t create those powers for itself.\nFinally, I have been challenging the Health Secretary Wes Streeting in Parliament, over dementia care and screening for prostate cancer. I got an indication from him that he would like to see a national screening programme for men at high risk. He stopped short of making a firm commitment at this time but my exchange with him made the front page of the Daily Mail last Wednesday.\nThe Health Secretary was more dismissive of reintroducing dementia as a priority in the annual NHS Planning Guidance. He described the issue as a “hobby horse” which is alarming coming from the man in charge of the NHS. I reminded him that dementia is the biggest cause of death in the UK. I have written an article for Alzheimer’s Disease International’s annual report to raise awareness of the issue.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_about-joe-robertson/content_4.html": "Joe Robertson grew up on the Island and went to school in Ryde. After qualifying and working as a family solicitor, he joined a national nursing charity helping to increase the number of community nurses up and down the country, including here on the Island. He lives in St Helens with his wife Tanya and two children and serves as an Isle of Wight Councillor.\nJoe has been working hard to improve the lives of fellow Islanders for over 20 years. He has served as a governor of two Island primary schools, a trustee of Isle of Wight Citizens Advice, and President of the local Campaign to Protect Rural England. While still at school he was elected as a Youth Parliament regional representative by Island students. Today, alongside his professional work for a charity and commitments as a Councillor, Joe is a county coordinator for a national school reading charity helping place over 70 volunteers in Island schools.\n“Working with a nursing charity and in the family courts has instilled in me the value of helping those less able to help themselves. My mum was a community care worker and my sister and brother-in-law are nurses at St Mary’s Hospital. A strong sense of public service runs through our family. It would be an honour to serve as your MP so that I can deliver on more of the work that I have already started.”",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_campaigns_promote-business-and-jobs/content_26.html": "Business investment is key to growing the Island’s economy and creating new jobs and opportunities, particularly for young people and families. I am already supporting our East Wight tourism sector and promoting the Island nationally as a place for businesses and individuals to invest in. I backed Bob Seely to secure the Island as a priority area for Arts Council funding and I am now supporting a specific multi-million pound bid for Shanklin’s Performing Arts Centre.",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_ryde-academy-students-discuss-citizenship-campaigns-joe-robertson/content_19.html": "GCSE students at Ryde Academy discussed citizenship issues with Isle of Wight Councillor and MP candidate Joe Robertson. As part of their citizenship course, students are developing campaigns around a diverse range of issues such as mental health, freedom of speech and youth reoffending. They are looking to persuade decision makers of their point of view and ultimately to change policy and law. Some of the students have taken their campaigns online after researching widely. Joe Robertson spent two hours debating the issues.\nJoe said, “It was great to hear such a range of views from well informed young people. It was hard to disagree with much of what they had to say. Some of the issues they raised should have greater prominence in public discourse – such as raising the age of criminal responsibility. I am confident that some of those in the room will be our elected representatives of the future. The Island is in safe hands.”",
  "https_www_joerobertson_co_uk_/https_www_joerobertson_co_uk_news_first-ryde-business-forum/content_3.html": "East Wight MP hosts the first Ryde Business Forum drop-in event\nJoe Robertson, Member of Parliament for Isle of Wight East, has hosted the first Ryde Business Forum drop-in event. Over 50 business people turned out at the Royal Victoria Arcade in Union Street last Tuesday (15/04/25) to discuss issues affecting business and the wider Ryde community.\nThe Ryde Business Forum was set up by the East Wight MP with the stated aim of better connecting business people in the town at a time when the Government will be providing £20 million over 10 years to be invested by a new Ryde Neighbourhood Board. The MP’s Forum aims to “join up the dots” and avoid replicating what other groups or organisations are doing.\nJoe Robertson MP said, “One of the criticisms I hear is that there is a lack of opportunities for business people in Ryde to come together and share ideas and try and influence decisions which affect them.\n“That is why I have set up the MP’s Ryde Business Forum – to join up the dots and make sure business voices are heard. Ryde is a fantastic place to live, work and visit and with an opportunity to regenerate the town further with £20 million of Government money.\n“We need to ensure a wide spectrum of voices feed into decisions about how the money can be best invested, including business voices.”\nJohn McLagan, owner of Royal Victoria Arcade and Chair of the Business Forum added, “It’s great to see this Forum being established. Business people are the real drivers of growth in our town - investors, innovators, and job creators. Having a platform where we can contribute directly to discussions about the town’s future is not just encouraging, it’s essential.\n“I am looking forward to seeing what we can achieve together through open dialogue and collaboration. To get involved, please contact the MP’s office.”\nMeanwhile, civil servants from Whitehall have visited Ryde to look around the Town and attend a Neighbourhood Board meeting where governance issues and board membership were discussed. The final Board documents are being submitted to the Government today (Tuesday) for approval."
}