{
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_news_100-days-labour/content_15.html": "Sunday the 13th October marks 100 days since the General Election and 100 days of a Labour government and a Labour Member of Parliament here in Derbyshire Dales. Now I cannot promise to be impartial as my political allegiance to the Conservative Party is in no doubt, but as a Derbyshire Dales resident, this is my take so far.\nDespite having written to our Labour MP, Cllr John Whitby three times, I am yet to receive a response to any of my correspondence, so I remain unaware of his stance on planning or Traveller sites. Although I did not receive a response to my request for his views on the scrapping of the Winter Fuel Allowance, he voted to remove this from pensioners in Parliament recently, so at least this provided clarity on his support for what in my opinion is a cruel Labour Party policy.\nThe first 100 days of Labour seems to have been marred by a series of blunders and nonsensical decisions. Labour said they would put people and country before politics and party, yet apparently this did not include our pensioners. I know from my years of supporting vulnerable residents here in Derbyshire Dales that many have worked very hard to make modest savings for retirement. Sadly, these savings will now take them just over the threshold and pensioners this winter will quite literally go cold thanks to Labour.\nNationally we have a millionaire Prime Minister who received countless undeclared gifts. This resulted in one of his own MPs resigning in disgust and now his Chief of Staff Sue Gray has resigned too, although the reason for her leaving is not yet clear.\nLabour is looking into policies which would end inheritance tax reliefs, which in my view will have a catastrophic impact on our farmers and food security, as family farms will be forced to split up if agricultural property relief and business property relief are scrapped. I know from speaking to local farmers they feared this move and I sincerely hope our MP will fight this.\nLabour plan to tax private schools when they have no plan to support the thousands of children who will now be back in state education. This is divisive politics and has not been thought through, all it does it put further pressure on local schools.\nThe Conservative Party have lessons to learn, and I sincerely hope our next Leader makes the changes that are so desperately needed and stands on a platform of true Conservative values. While Rishi Sunak is working to hold the Prime Minister to account, the Conservatives are in the midst of a Leadership Election. It is vital that governments have strong opposition in Parliament, and I personally would have preferred to see a new leader of the Conservatives in time for what is likely to be a brutal budget from Labour.\nIt does feel disingenuous that Labour keep referring to an unknown economical blackhole, yet that hasn't stopped them finding billions for above-inflation public sector pay rises. The Chancellor herself said during the campaign, \"we've got the OBR now. You don't need to win an election to find out about the public finances.\" The Labour Party also has had privileged access to Senior Civil Servants at the Treasury since January as the Lead Opposition Party, this does not sound like a hidden ‘black hole’ to me. So, was this their plan all along?\nI love our Country, and I want us to prosper. I sincerely hope the next 100 days from Labour are better than the 100 so far. It is vital that we hold the Labour Party locally and nationally to account, so I urge residents to join me in writing to our MP to hear his views on the issues that impact us all.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_campaigns_plastic-pollution-0/content_30.html": "The Resources and Waste Strategy for England sets out the Government’s plans to reduce, reuse, and recycle more plastic and Ministers have committed to work towards all plastic packaging on the market being recyclable or reusable by 2025.\nSignificant progress has already been made to address plastic pollution, including a ban on microbeads and restricting the supply of plastic straws, plastic drink stirrers, and plastic-stemmed cotton buds. The use of single-use carrier bags in supermarkets has reduced by over 98 per cent.\nFurther, restrictions on a range of single-use plastics, including plastic plates, trays, bowls, cutlery, balloon sticks and certain types of polystyrene cups and food containers have now come into force. I understand that England uses 2.7 billion items of single-use cutlery and over 700 million single-use plates per year, but only 10 per cent are recycled. This new ban is the next step in cracking down on harmful plastic waste.\nThrough the Environment Act 2021, the Government has set a target is to halve residual waste by 2042. This refers to waste that is sent to landfill, put through incineration, or used in energy recovery in the UK or overseas. This is an intentionally broad target, which will include the most environmentally harmful materials like plastics, rather than banning a single type of material and risk producers moving to a different, more harmful material.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_campaigns_do-you-want-banking-hub-derbyshire-dales/content_24.html": "Join me in my campaign to secure banking provision in our area by signing my petition for a Banking hub in Derbyshire Dales.\nFollowing the terrible closure of Bakewell NatWest, getting a Banking Hub is more important than ever. I have already started having meetings to get a Banking Hub in our area and I want to hear from you.\nPlease sign this petition if you would like to see a Banking Hub in our area.\nThis petition will close May 2024. This petition will be presented to Banking Hub stakeholders to illustrate the strength of local feeling.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_campaigns_waiting-times-cancer-treatment-and-care/content_28.html": "I share your urgency that we reduce the backlog of cancer care that built up during the pandemic. During the pandemic, the country’s endeavour was used to tackle the virus and the Government is committed to applying this same spirit to tackling cancer.\nTo help reduce waiting times for cancer care, the Government is investing £8 billion by 2025 to help deliver nine million checks, scans, and operations by 2025, and expand the number of surgical hubs across the country. As part of the 2021 Spending Review, £2.3 billion was committed to expand Community Diagnostic Centres, which will offer rapid access to clinical tests and life-saving checks closer to home. These centres have already delivered over 3.8 million additional checks and tests and are playing an important role in helping to reduce waiting times.\nThe implementation of the Faster Diagnosis Standard has been instrumental in reducing waiting times, setting a clear, measurable standard for health services, and ensuring a quicker transition to the treatment phase for patients.\nTackling major conditions that cause ill-health - including cancer - provides an opportunity to improve the lives of millions of people. That is why I welcome that a Major Conditions Strategy will be published to outline how outcomes in six major condition areas will be improved, including cancer.\nThis strategy will allow for a renewed focus on innovative treatments and diagnosing cancer faster to improve outcomes, boosting the cancer workforce, and preventing more cancers from occurring.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_sarah-parliament/content_6.html": "Tweet Here you can read Sarah Dines's speeches and appearances in Parliament when she was a Member of Parliament (provided by theyworkforyou):\nCrimes of Violence: Prosecutions | Attorney General | Written Answers To ask the Attorney General, with reference to the Answer of 20 January 2023 to Question 125287 on Rape: Prosecutions, how many (a) complete\nRape: Prosecutions | Attorney General | Written Answers To ask the Attorney General, with reference to the Answer of 20 January 2023 to Question 125287 on Rape: Prosecutions, how many (a) complete\nSexual Offences: Prosecutions | Attorney General | Written Answers To ask the Attorney General, with reference to the Answer of 20 January 2023 to Question 125287 on Rape: Prosecutions, how many (a) complete\nHornets | Department for Environment, Food and Rural Affairs | Written Answers To ask the Secretary of State for Environment, Food and Rural Affairs, what steps his Department is taking to provide (a) resources, (b) str\nAccess to Banking: Devon | Commons debates As the Minister knows, I represent Derbyshire Dales, where we recently had the closure of the last bank, the National Westminster bank, in B\nAccess to Banking: Devon | Commons debates As the Minister knows, I represent Derbyshire Dales, where we recently had the closure of the last bank, the National Westminster bank, in B\nDerbyshire County Council | Commons debates May I say on behalf of the people of Derbyshire Dales that we are immensely grateful for the £13.5 million of levelling-up funds, without wh",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_news_category_Reports/content_13.html": "Statement from Sarah Dines MP & Sarah Fowler, Chief Executive of the Peak District National Park Keep your distance in the Peak District 21st May 2020 Reports",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_map-locations/content_17.html": "Skip to main content\nMain navigation\nHome\nAbout Sarah\nNews\nIn Parliament\nContact\nBanking Hub petition\nCampaign Responses\nMy map",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_campaigns_water-pollution-farming/content_27.html": "I would like to assure you that the Government is committed to the environment. Farming activities are a main source of water pollution in the UK and the Government is working with farmers to reduce pollution and encourage better practices and reforms. Ministers committed through the Environmental Improvement Plan and the Plan for Water to review farming regulations to ensure they are fit for purpose.\nThe Environment Act 2021 includes a target to reduce nitrogen, phosphorus and sediment pollution from agriculture into the water environment by at least 40 per cent by 2038, compared to a 2018 baseline. In addition, farms are subject to robust regulations on agricultural activities which could cause environmental harm, including through the Farming Rules for Water and the Nitrate Pollution Prevention Regulations. These set out clear standards and a baseline with which farmers must comply.\nFurther, the Government announced in its Plan for Water that it would provide £200 million of funding through the Slurry Infrastructure Grant for new and expanded covered slurry stores in the highest priority areas of England, for example protected nature sites in unfavourable condition. Ministers will also enable the use of on-farm technologies for better use of slurry, including slurry separators, and help farmers store, transport, and apply their organic nutrient through the Farm Equipment and Technology Fund. This will involve investing £25m to drive innovation to help farmers manage plant and soil nutrients.\nThe Sustainable Farming Incentive, Countryside Stewardship (CS) and Landscape Recovery schemes will provide farmers with funding support for regenerative measures that reduce water pollution and improve biodiversity. CS funding is improving farm infrastructure, such as roofing for manure stores to keep dirty water and effluent separate from rainwater and prevent contamination.\nFinally, the Government has also made extra funding available to the Environment Agency for 50 new farm inspectors to ensure that agricultural diffuse pollution regulations are followed. This enabled them to conduct 4,000 farm inspections in the last fiscal year. I am assured that if the Environment Agency finds pollution or significant risk of pollution, it will not hesitate to take further action.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_campaignresponses/content_25.html": "A large body of research has linked the amount of ‘screen time’ such as watching television, playing computer games, and using smartphone apps with negative outcomes for children of all ages.\nI would like to assure you that the Government is committed to the environment. Farming activities are a main source of water pollution in the UK and the Government is working with farmers to reduce pollution and encourage better practices and reforms.\nThe Resources and Waste Strategy for England sets out the Government’s plans to reduce, reuse, and recycle more plastic and Ministers have committed to work towards all plastic packaging on the market being recyclable or reusable by 2025.\nSignificant progress has already been made to addr\nThe UK is a global leader in protecting our seas, the ocean and marine life, working with counterparts both in the UK and overseas.\nAt COP15 in 2022, almost 200 countries agreed a global commitment to reverse biodiversity loss and to protect 30 per cent of land and oceans by 2030.\nThank you for contacting me about accessing Child Trust Funds (CTF) accounts belonging to young adults with learning disabilities or lacking decision-making capacity around their finances.\nI understand the strength of feeling on this issue, and the barriers that it presents to many families a\nLive music venues contribute significantly to our community by bringing people together and celebrating the music of people from all backgrounds and ages.\nI am aware that under the provisions in the Wildlife and Countryside Act 1981, The Wild Mammals (Protection) Act 1996 and Animal Welfare Act 2006, there are a range of offences around injuring and inflicting unnecessary suffering on wildlife and in the event that a member of the public believes that\nI would like to assure you that my ministerial colleagues and I take the welfare of all animals seriously. Since publishing the Action Plan for Animal Welfare, the Government has delivered an ambitious legislative programme, bringing significant improvements for animals both in the UK and abroad.\nI share your urgency that we reduce the backlog of cancer care that built up during the pandemic. During the pandemic, the country’s endeavour was used to tackle the virus and the Government is committed to applying this same spirit to tackling cancer.\nTo help reduce waiting t\nThe Resources and Waste Strategy for England sets out the Government’s plans to reduce, reuse, and recycle more plastic and Ministers have committed to work towards all plastic packaging on the market being recyclable or reusable by 2025.\nSignificant progress has already been made to addr\nJoin me in my campaign to secure banking provision in our area by signing my petition for a Banking hub in Derbyshire Dales.\nFollowing the terrible closure of Bakewell NatWest, getting a Banking Hub is more important than ever. I have already started having meetings to get a Banking Hub",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_cdn-cgi_l_email-protection/content_8.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_campaigns_support-people-affected-stroke/content_10.html": "As part of the NHS Long Term Plan, improving outcomes for people affected by stroke is a priority for the NHS in England. I know that good progress has been made in the treatment of strokes in recent years, with falling mortality rates for people who have experienced strokes. Statistics from January to March 2023 show that 96.8 per cent of patients arrived at hospital within 72 hours of experiencing symptoms of stroke for the first time.\nThe National Stroke Service Model was published in May 2021 to advise providers and commissioners on how stroke units can ensure patients receive the most appropriate treatment within one hour of arrival. This will be achieved by delivering the NHS Long Term Plan’s commitments to establish 20 local Integrated Stroke Delivery Networks and meeting targets for treatments, prevention and rehabilitation. NHS England’s National Stroke Programme – developed with the Stroke Association – is supporting local organisations to meet these commitments.\nTackling major conditions that cause ill-health - including cardiovascular diseases such as stroke - provides an opportunity to improve the lives of millions of people. That is why a Major Conditions Strategy is being developed and will be published over the next year to outline how outcomes in six major condition areas will be improved, including stroke. Following a recent call for evidence, I understand that the strategy will be published in due course.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk/content_1.html": "I'm Sarah Dines, Conservative campaigner for Derbyshire Dales. Here, you can find my latest news, campaigns and more about me. I'm here to help, so please do not hesitate to get in touch.\nYou are right that the affordability of food is a serious issue and everyone…\nOn Twitter\nDissolution of Parliament\nMuch of the content on this website was established while I was a Member of Parliament. As Parliament has been dissolved there are no MPs until after the General Election on 4th July 2024.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_campaigns_big-plastic-count/content_29.html": "The Resources and Waste Strategy for England sets out the Government’s plans to reduce, reuse, and recycle more plastic and Ministers have committed to work towards all plastic packaging on the market being recyclable or reusable by 2025.\nSignificant progress has already been made to address plastic pollution, including a ban on microbeads and restricting the supply of plastic straws, plastic drink stirrers, and plastic-stemmed cotton buds. The use of single-use carrier bags in supermarkets has reduced by over 98 per cent.\nFurther, restrictions on a range of single-use plastics, including plastic plates, trays, bowls, cutlery, balloon sticks and certain types of polystyrene cups and food containers have now come into force. I understand that England uses 2.7 billion items of single-use cutlery and over 700 million single-use plates per year, but only 10 per cent are recycled. This new ban is the next step in cracking down on harmful plastic waste.\nThrough the Environment Act 2021, the Government has set a target is to halve residual waste by 2042. This refers to waste that is sent to landfill, put through incineration, or used in energy recovery in the UK or overseas. This is an intentionally broad target, which will include the most environmentally harmful materials like plastics, rather than banning a single type of material and risk producers moving to a different, more harmful material.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_about-rss/content_16.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_news_sarah-dines-mp-hosts-taste-derbyshire-dales-event-parliament/content_18.html": "On the 16th April, Sarah Dines MP welcomed eleven Derbyshire businesses to Parliament to showcase to her Parliamentary colleagues all that Derbyshire Dales has to offer. The attendees were Chatsworth Farm Shop, Coldeaton Jersey Dairy, Drowned Villages Smokery, Ginger Butchers at New Close Farm, Hartington Creamery, Mallon & Green, Matlock Meadows Ice Cream, The Old Original Bakewell Pudding Shop, Nigel’s Butchers, Peak Ales, and Sourdough Dave. Representatives of Visit Peak District & Derbyshire were also in attendance, as were Lord McLoughlin and the Earl of Burlington.\nSarah Dines MP said, ‘I know I am completely biased but I wholeheartedly believe that Derbyshire Dales has the best produce in the country, and that much of it is world-class. I was absolutely honoured to be joined by some fantastic local businesses in Parliament on the 16th April, all of which embody this spirit of excellence. Together they showcased some of the fabulous things on offer in Derbyshire Dales. Every single person that attended, whether they were Members of Parliament, Lords, Baronesses, Parliamentary staff, Ministers or House staff, went away singing the praises of all the businesses in attendance, declaring the event to be the best ‘Taste Of’ event ever to be held in Parliament - of which there are a great number held each year. So many attendees have made plans to visit the businesses in person here in Derbyshire Dales and I am quite certain that all the businesses will have many new customers as a result of the day.\nLooking around the room at the beautifully curated stands and delicious produce just before the event was opened, I was struck by the incredible array of talent in the room. Chatsworth Farm shop had a glorious display of products, including giant lemons grown in the greenhouse at Chatsworth – which I am told make a fantastic addition to a lemon drizzle cake recipe.\nHartington Creamery had all my favourites for everyone to try and Robert Gosling was joined by Ryan, a previous Young Cheesemaker of the Year winner whose family have been making cheese in Hartington for four generations. Coldeaton Jersey Dairy and Matlock Meadows served incredible ice cream and I saw many a government minister leaving the room with a tub or two. As a committed ice cream lover, I was so delighted to not have only one ice cream producer, but two.\nPeak Ales provided fantastic samples of their drinks, including Chatsworth Gold. I was told by one attendee that their Chatsworth Gin was the nicest they had tried. The Old Original Bakewell Pudding Shop showcased our much-loved Bakewell Pudding and it was so lovely to hear people being introduced to the difference between a Bakewell tart and a pudding, which is a very important distinction to all of us in Derbyshire.\nGinger Butchers and Nigel’s Butchers did Derbyshire proud, illustrating the incredible quality of our local meat. Pork pies, sausages, cooked meats and potted beef were on offer. I think people sometimes forget, or at least do not appreciate, the incredible skill that goes into butchery and I doubt we could have been joined by two finer examples of the craft.\nWhile the other businesses demonstrated produce from the land, Mallon & Green and Drowned Villages Smokery highlighted the importance of our local water quality and offered delicious smoked Derbyshire-caught trout. Both businesses care passionately about preserving the health of our rivers and welcoming more people to learn more about fishing on our local waterways.\nSourdough Dave provided the most incredible fresh baked sourdough bread and seeing as he got up at midnight to bake the loaves fresh for the day and for his loyal customer base, he and Sourdough Sarah deserve a huge thank you for their commitment.\nI cannot thank the businesses enough for coming to Parliament and showcasing what our area has to offer. I am incredibly proud to represent some of the finest artisans around. I am very much looking forward to holding similar events in the future.’",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_contact/content_5.html": "Skip to main content\nMain navigation\nHome\nAbout Sarah\nNews\nIn Parliament\nContact\nBanking Hub petition\nCampaign Responses\nContact\nLeave this field blank\nDDCA Green Farm, Tissington, DE6 1RA\n[email protected]\nSarah on Facebook\nSarah on Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_news_general-election-4th-july/content_19.html": "Much of the content on this website was established while I was a Member of Parliament. As Parliament has been dissolved there are no MPs until after the General Election on 4th July 2024.\nMuch of the content on this website was established while I was a Member of Parliament. As Parliament has been dissolved there are no MPs until after the General Election on 4th July 2024.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_campaigns/content_23.html": "Achieving Net Zero While I appreciate your concerns, the assessment of the independent Committee on Climate Change has concluded that this target is feasible, deliverable and can...\nSupport for People Affected by Stroke As part of the NHS Long Term Plan, improving outcomes for people affected by stroke is a priority for the NHS in England. I know that good progress has been...\nAccess to Affordable Food You are right that the affordability of food is a serious issue and everyone has a right to nutritious and adequate food supply. High energy prices, exacerbated...\nFuel Duty and Prices Thank you for contacting me about fuel prices. In recognition of the unprecedented circumstances pushing up fuel prices, I welcome the decision announced at the...\nGene Editing: Animal Welfare Thank you for contacting me about gene editing and animal welfare. The Government is working to encourage agricultural and scientific innovation in the UK. The...\nGreat Homes Upgrade Climate change is one of the greatest challenges we face, and I agree that urgent action is needed. That is why I am glad that the Government has set out a...\nFootball Governance I agree that football governance must keep evolving if it is to keep pace with the challenges of the modern game. The global commercial attractiveness of...",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_news/content_9.html": "100 days of Labour Friday, 11 October, 2024 Sunday the 13th October marks 100 days since the General Election and 100 days of a Labour government and a Labour Member of Parliament here in Derbyshire Dales. Now I cannot promise to be impartial as my political allegiance to the Conservative Party is in no doubt, but as a Derbyshire Dales resident, this is my take so far. Despite having written to our Labour MP, Cllr John Whitby three times, I... Local News\nHasker Farm 30th August 2024 You may recall the District Council undertaking talks with a career criminal in pursuit of buying land for a permanent Traveller site at Hasker Farm. At the... Local News\nStatement on the General Election 2024 result 9th July 2024 I am disappointed with the results of the election, and I wish I was still your Member of Parliament. Serving you has been a great honour and as a resident... Local News\nGeneral Election 4th july 23rd May 2024 Much of the content on this website was established while I was a Member of Parliament. As Parliament has been dissolved there are no MPs until after the... Local News\nSarah Dines MP hosts a Taste of Derbyshire Dales event in Parliament 19th April 2024 On the 16th April, Sarah Dines MP welcomed eleven Derbyshire businesses to Parliament to showcase to her Parliamentary colleagues all that Derbyshire Dales has... Local News\nSarah Dines MP Petitions NatWest to stay open in Bakewell 27th November 2023 On Wednesday 22nd November, NatWest announced that they would be closing the Bakewell Branch. Sarah Dines MP is campaigning against this closure. Sarah Dines MP... Local News\nMy hopes for the Autumn Statement 20th November 2023 The British people vote Conservative to guarantee low taxes, fiscal responsibility, and freedom for all, I am sincerely hoping these tenets will be at the heart... Local News\nBakewell Swimming Pool receives £29,679.00 3rd November 2023 As announced in the 2023 Spring Budget, the Government is investing over £60 million of new funding to support public facilities with swimming pools across... Local News\nMinister for Flooding comes to Derbyshire Dales 30th October 2023 On Thursday 26th October Sarah Dines MP welcomed Right Honourable Rebecca Pow MP, Parliamentary Under Secretary of State at the Department for Environment, Food... Local News\nDerbyshire Dales District Council Full Council 29th September 2023 On Thursday 28th September, the Derbyshire Dales District Council met for a full Council meeting. On the agenda was an item regarding Traveller site provision... Local News",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_cookies/content_14.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_campaigns_achieving-net-zero/content_2.html": "While I appreciate your concerns, the assessment of the independent Committee on Climate Change has concluded that this target is feasible, deliverable and can be met within the same cost as was estimated for our previous target of 80 per cent which was set back in 2008, such has been the power of innovation in reducing costs.\nYet I am pleased that the recent revisions to the net zero strategy have outlined a fairer path to achieve the target, easing the financial burden on British families. For too many years politicians in governments of all stripes have not been honest about costs and trade-offs. To this end, the Government is taking a more pragmatic, proportionate and realistic approach to ensure that public support is maintained.\nI believe that the proposed revisions increase the achievability of the target in the long run. Our politics must again put the long-term interests of our country before the short-term political needs of the moment. These changes include: easing the transition to electric vehicles from 2030 to 2035, in line with other similar countries; giving families far more time to transition to heat pumps while significantly increasing grants to upgrade boilers; scrapping onerous energy efficiency requirements and not forcing people to make alterations; a commitment to no rules on carpooling, seven different bins and more expensive meat; and greater support for new oil and gas in the North Sea.\nHowever, it is right that we should look carefully at how these costs are distributed in the longer-term. In 2021, the Treasury published its Net Zero Review which found that the majority of global GDP is now covered by net zero targets. As the world decarbonises, UK action can generate benefits for businesses and households across the country. The report highlighted that the transition to net zero implies a significant transformation of the UK economy over the next three decades. It noted that the overall impact is uncertain and challenging to estimate. However, existing estimates suggest that the impact on GDP by the end of the transition is likely to be relatively small, and dwarfed by the costs of global inaction.\nThe most recent cost estimates in the Net Zero Strategy present a net cost, excluding air quality and emission reduction benefits, equivalent to 1-2 per cent of GDP in 2050. This is easily justified when another report estimated the overall costs and risks of global warming to be equivalent to losing between 5 per cent and 20 per cent of global GDP each year. While the UK might be less exposed to physical risks of continued global warming than many other nations owing to its temperate climate and status as an advanced economy, there are potentially still significant indirect impacts. For example, damage to global supply chains affecting trade, reduced production in trading partner nations pushing up the cost of imported goods, or changes to migration from regions heavily affected by climate change.\nUltimately, in fulfilling the scale of the commitment, technological and logistical changes are needed in the way we use our land and to seize the opportunity to support investment in a range of new or advanced technologies, including in areas such as carbon capture, usage and storage, hydrogen and nuclear. The Treasury's interim report noted that well-designed policy can reduce costs and risk for investors, support innovation and the deployment of new technologies.\nThe Government's Net Zero Strategy sets out a clear path for the changes needed to secure our energy, create jobs and new industries, and end the UK's contribution to climate change. The UK can rapidly cut carbon emissions, while creating new jobs, new technologies and future-proof industries that will generate economic growth for decades to come.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_news_hasker-farm/content_12.html": "You may recall the District Council undertaking talks with a career criminal in pursuit of buying land for a permanent Traveller site at Hasker Farm. At the time, as the Member of Parliament for the area, I made representations to the Council on behalf of residents who understandably felt it was inappropriate for the Council to try to buy land off someone not entitled to sell it.\nUnfortunately, the only way I was able to ascertain the facts of the case was through FOI requests to the Council. I was unsatisfied with their responses and their dealing with this issue and subsequently submitted my own complaint. Over 90 days on, this complaint is still unanswered and in the interest of transparency, I have linked it below for all to view.\nIn my opinion the District Council have questions to answer.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_campaigns_access-affordable-food/content_3.html": "You are right that the affordability of food is a serious issue and everyone has a right to nutritious and adequate food supply. High energy prices, exacerbated by events in Ukraine, mean that there have been pressures on food prices as a result of increased input costs.\nI am aware of FareShare’s Campaign and appreciate your concerns about the increased pressures on living costs, including energy costs and the price of food. I would like to assure you that this is an issue that my ministerial colleagues and I take extremely seriously. I am aware that the Government has put in place a set of measures to help people deal with the rising cost of living, including £37 billion of support to households. Through the Energy Price Guarantee, the Government will limit a typical household's energy bill to £2,500 until April 2023, as well as further targeted support such as the £650 cost of living payment to those on means tested benefits including Universal Credit, and the £400 energy bill rebate. Additionally, local authorities have access to the £1.5 billion Household Support Fund to provide further support.\nRegarding food banks, my ministerial colleagues and I recognise the data limitations in this area and from April 2021 introduced a set of questions into the Family Resources Survey to measure and track foodbank usage. I understand that the first results of these questions are due to be published in March 2023.\nI am assured that the UK has a highly resilient food supply chain, as demonstrated throughout the Covid-19 pandemic. Our high degree of food security is built on supply from diverse sources, strong domestic production as well as imports through stable trade routes. We produce 60 per cent of all the food we need, and 74 per cent of food which we can grow or rear in the UK for all or part of the year. I am aware that these figures have changed little over the last 20 years.\nFinally, Ministers published the Food Security Report last year, which recognised the contribution made by British farmers to our resilience, and the importance of strong domestic production to our food security. This report will serve as an evidence base for future policy work.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_privacy/content_7.html": "This document outlines how Sarah Dines processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Sarah Dines\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Sarah Dines.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Sarah Dines, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Sarah Dines via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_news_statement-general-election-2024-result/content_11.html": "I am disappointed with the results of the election, and I wish I was still your Member of Parliament.\nServing you has been a great honour and as a resident living in the Derbyshire Dales I sincerely hope Mr Whitby is up to the challenge and that he appreciates just how lucky he is to represent such a wonderful constituency.\nI want to sincerely thank every single person who voted for me and my common-sense track record of getting things done. I am so grateful for the hundreds of emails of thanks I have received. During my time as your MP, I and my office responded to over 44,000 emails and I am heartened to know that I have actively helped so many residents. Derbyshire Dales is the most special place in the world and I have loved every single second of my time as your MP.\nThere is no denying that people felt let down by the Conservative government and I understand why, because at times I have shared their frustration. This being said, I am disappointed that locally people voted for a Reform candidate who had been disowned by Nigel Farage for racism and let in a Labour Member of Parliament.\nI watch eagerly now to see how Mr Whitby will protect women-only spaces, tackle Bovine TB, continue my campaign for a Banking hub, maintain our traditions, work to prevent flooding, stop sewage in our rivers and continue with my work to hold water companies to account, protect our green spaces from overdevelopment and securing a Relief Road for Ashbourne.\nI think some people hoped that I would disappear after this election, but I am sorry to disappoint them. Derbyshire is my home, I am here to stay, and Mr Whitby can look forward to me holding him to account as a resident of our area.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_campaigns_fuel-duty-and-prices/content_26.html": "Thank you for contacting me about fuel prices.\nIn recognition of the unprecedented circumstances pushing up fuel prices, I welcome the decision announced at the Spring Statement to cut fuel duty by five pence for a full year across all fuel duty rates.\nThe decision to freeze fuel duty for the twelve consecutive years prior to this cut had already saved the average driver over £1,900 compared to the pre-2010 escalator.\nVehicles are essential to many people here in the constituency and I have conveyed your comments on fuel duty to my colleagues at the Treasury.\nI also welcome that for the first time since 1926, money raised through car tax (Vehicle Excise Duty) is now being spent directly on the roads. Around £28bn is being invested in England's strategic and local roads, an amount equivalent to all VED receipts. I was also very pleased to see the announcement in the Spending Review that £1.7 billion has been made available for local highway authorities in England (outside London) for 2021-2022 to improve the condition of local roads and associated infrastructure.\nI firmly believe that the most effective way to keep fuel prices down is through an open and competitive market.\nThank you again for taking the time to contact me.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_news_bakewell-swimming-pool-receives-ps2967900/content_22.html": "As announced in the 2023 Spring Budget, the Government is investing over £60 million of new funding to support public facilities with swimming pools across England.\nThe measures are intended to ensure that children and adults up and down the country continue to have access to a public swimming pool, helping people get active and maintain a healthy lifestyle.\nBakewell Swimming Pool will receive £29,679.00.\nThe criteria used to determine who received funding considered a range of factors, including financial need, the risk of closure, the proximity to other swimming pools providing public swimming access and the level of demand for the facility. You can check the full list of facilities receiving funding on the Sport England website – it will be published as a news story on Saturday here.\nSarah Dines MP said, 'Swimming is fantastic exercise and I am delighted that Bakewell pool will benefit from this fund.'",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_accessibility/content_4.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_about-sarah-dines/content_20.html": "Sarah was born in Billericay, and raised in Basildon, Essex. She attended Chalvedon comprehensive school and completed her A Levels at Basildon College.\nSarah's grandparents on both sides were farmers and small holders, and her parents, were tenant farmers until their tenancy was ended and the land they farmed was taken from them to form part of what then became Basildon new town.\nSarah has been a life-long Conservative and has been a member of the Conservative party since she was a teenager. In her maiden speech on 17 March 2020 Sarah stated: \"I am a Conservative by both nature and nurture. I was born into this tribe . . .\" Sarah added that her mother canvassed with her in the pram and that she delivered her first Conservative party leaflet at the age of 8. Sarah's father served on Maldon Town Council and her mother was a Conservative councillor on Basildon District Council and was later elected to Maldon Town Council, Maldon District Council as well as an Essex County Councillor, serving as the cabinet member for health and social services.\n\"I am a living embodiment of Conservative policies. I am a working-class, council house-reared, comprehensive school-educated Conservative—a product of Margaret Thatcher’s blueprint for change. Her vision socially and economically enfranchised millions of individuals across our country, presenting them with opportunities unavailable to previous generations. I am one of those people. This country needs to continue to level up.\"\nSarah was chairman of the Basildon Young Conservatives. While at university she was chairman of the Brunel University Conservative Association and Secretary of the London Conservative Students. While at university she also worked as a parliamentary researcher for Sir George Gardiner MP. At the age of 21, Sarah was elected to Basildon District Council, serving from 1987-1991, and she contested the seat of Belfast East in 1997 General Election.\nSarah studied law at Brunel University from 1983-1987, and at the Inns of Court School of Law between 1987-88. She is a member of Lincoln's Inn and was called to the Bar in July 1988. She worked as a family law practitioner for over 30 years, latterly at 3 Paper Buildings in The Temple, London, dealing with divorce, including complex financial and business assets, care, adoption, international child law and child abduction and related issues.\n\"My thirty years of experience as a family lawyer has meant that I have dealt with many of the issues facing today’s society. I have represented many people with the assistance of Legal Aid. I am particularly interested in supporting young and vulnerable families and the elderly.\"\nSarah was elected as Member of Parliament for the Derbyshire Dales constituency in the 2019 General Election with 29, 356 votes, a majority of 17, 381. Sarah made her maiden speech on 17 March 2020.",
  "https_www_sarahdines_org_uk_/https_www_sarahdines_org_uk_news_my-hopes-autumn-statement/content_21.html": "The British people vote Conservative to guarantee low taxes, fiscal responsibility, and freedom for all, I am sincerely hoping these tenets will be at the heart of the Chancellor’s Autumn Statement on Wednesday. They are values I hold dear, and I know that the vast majority of the British public feel the same way. I understand that the Chancellor has insisted economic growth is his priority at the Autumn Budget and this is music to my ears, of course, the announcement on Wednesday will see if the proof is in the pudding and if he has delivered on this pledge.\nMy hope for the Chancellor’s Statement on Wednesday is quite simply, that he is Conservative. I wholeheartedly believe that the best people to know how to spend their money, are the people that earn it, not the government and I would hope for a budget that reflects this view. Low taxes, responsible spending and the financial freedom of constituents is in my mind vital for the recovery of our country.\nI have joined other Conservative MPs in signing a joint letter to request to the Chancellor that the 75% business rates relief for leisure, hospitality, and retail, which are set to end in April, are extended. I am passionate about supporting our independent shops, community pubs and hospitality and I believe wholeheartedly that this relief has a hugely positive impact on these sectors. These measures have been proven to be a lifeline for many small shops, restaurants, community pubs and others, which are the lifeblood of our local economy. We are all aware that retail, leisure, and hospitality businesses have faced difficult times, including high energy bills, rising wage costs and difficulty recruiting. I worry that if this discount is not extended, this could have a huge and irreversible impact, on the viability of the local businesses which we all love and rely on. I hope the Chancellor does the right thing and that this is a Conservative statement for the benefit of our country."
}