{
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_allotment-group_14-january-2024/content_47.html": "14th. January 2024 – First impressions\nOur first impression was “My, there’s a lot to do” !!\nA good look around the plot with it’s 4 main beds, a large compost heap, one shed and a greenhouse gave us the outcome to sit down, put the kettle on and discuss !\nKate Needham, Richard Cannon, Richard Needham, Alex Treasure and Caroline Westley\nAfter discussing some of the Allotment guidelines and rules, we decided that for the next visit we would go about sorting out the greenhouse and shed which would be quite a mammoth job.\nClick Photos for full size",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_allotment-group_21-january-2024/content_89.html": "21st. January 2024\nToday we were joined by two new members, which totalled six altogether. We set about some tasks..\nClick photos for full size\nTasks completed..\nClearing out and tidying the greenhouse\nUprooting some heavy long grass around the greenhouse\nTrimming back the bush winding around the trellis\nClearing and tidying the shed\nFive bags of waste going to the Recycling Centre\nAll in all it was a good couple of hours work, good for the allotment and good for those who came along. If you would like to join our group, please email contact@winchester.org.uk and we reiterate, it’s not just about doing a bit of gardening, it’s about socializing with likeminded people.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_06_27_green-party-councillors-test-the-water-in-the-river-meon/content_4.html": "Sunday morning dog walkers must have wondered why our three Councillors; Malcolm Wallace, Suzanne White and Danny Lee were paddling in the upper River Meon in Droxford. The answer is as follows..\nThe ‘Great UK WaterBlitz’ provides an important snapshot of the health of our rivers across the country from data collected by volunteers. Your three councillors took to the water at the River Meon in Droxford to measure the water quality. Cllr Danny says: “Citizen science projects like this really empower people to take action by contributing to valuable research but it alsohelps scientists to collect data on a large scale.” Cllr Suzanne adds: “This testing allowed us to see first-hand the current quality of the river water in Droxford.\nWorryingly,our results confirmed that the river is in poor chemical health. Although results can vary depending on the conditions, it’s clear that the impacts demand more regular monitoring to gain a full picture of the health of our River Meon. ”The ‘Great UK WaterBlitz’ will be running again in September. See.. earthwatch.org.uk/greatukwaterblitz/",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_about-us/content_25.html": "about us\nThe Winchester Green Party was convened in March 2008. Since then we have grown year by year and through hard work getting our message across, this year saw Malcolm Wallace elected to be our first Councillor representing the Central Meon Valley Ward.\nHaving a Green Voice in the Council gives us a huge opportunity to grow even more and we will stop at nothing to gain more seats.\nWe’re working progressively on local issues; to improve the lives of all people in Winchester and the Meon Valley to improve our local environment. As part of the Green Party of England & Wales, we share a deep concern for social and environmental justice, expressed through our national policies, we believe fair is worth fighting for.\nWe rely on people power rather than corporate finance in all that we do. Get involved with us today so that we can achieve so much more for Winchester.\nOn a national basis the Green Party is growing at a rapid and consistent rate. We now represent people in Westminster and in a record number of local councils, as well as in the London Assembly.\nWe’re working progressively on local issues; to improve the lives of all people in Winchester and the Meon Valley to improve our local environment. As part of the Green Party of England & Wales, we share a deep concern for social and environmental justice, expressed through our national policies, we believe fair is worth fighting for.\nWe rely on people power rather than corporate finance in all that we do. Get involved with us today so that we can achieve so much more for Winchester.\nOn a national basis the Green Party is growing at a rapid and consistent rate. We now represent people in Westminster and in a record number of local councils, as well as in the London Assembly.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_allotment-group_21-january-2024-copy/content_21.html": "31st. January 2024\nClick photos for full size\nSowing Broad Beans, salad and sweet peas.\nA big effort to remove the dreaded bindweed from the old compost heap and Eddie happy starting off more in the compost bin.\nIf you would like to join our group, please email contact@winchester.org.uk and we reiterate, it’s not just about doing a bit of gardening, it’s about socializing with likeminded people.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_08_15_winchester-emissions-and-carbon-neutrality-action/content_54.html": "Winchester District – The Climate Crisis: update on our local greenhouse gas (CHG) emissions and determined action!\nEvidence of climate breakdown is all around us and the UN Secretary-General recently said we are in an era of ‘climate boiling’. So, are we doing enough?\nYou might think the June 2019 Climate Emergency declaration by Winchester City Council (WCC) and the subsequent creation of Winchester District’s ‘Carbon Neutrality Action Plan (CNAP)’ would have produced rapid progress with determined actions and projects. Frankly the jury must declare itself out on this question.\nClick to enlarge\nAt the end of last year, WCC received an updated Climate Crisis evidence base called the CNAP Roadmap which signposted a choice of improved actions. It is now 8 months on and the much-needed refresh of the CNAP to go faster with more coherent actions for key priority activities has still not been produced. Meanwhile, the latest Government data on greenhouse gas emission for our District has just been released UK local authority and regional greenhouse gas emissions national statistics, 2005 to 2021 – GOV.UK\nThe data highlights the growing size of the challenge: emissions per person in Winchester are the highest in Hampshire (see graphic) and sixth highest out of the 64 South East of England local authorities.\nWinchester Green Party Councillor Lee said: “There is no time to waste. We have the Carbon Neutrality\nAction Plan Roadmap which is an evidence base for improved actions plus the 2021 government update on greenhouse gas (GHG) emissions for the District. We know what we need to do. We should now work\ntogether to get the best outcomes for our residents, communities, and our environment. The clock is ticking and faster progress by Winchester District to achieve net zero can provide many local benefits and\ncontributions to the bigger National and Global climate challenges”.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_news_page_3/content_64.html": "18 July 2024 / 10 August 2024 by richardcannon\nLast week, in replacement of our monthly members zoom meeting, we went for a walk around St. Claire’s Nature Reserve in Soberton. The weather stayed good for us and the walk alongside the river was quite a treat with some interesting wildlife observations which included dragon flies, various beetles and a deer making a dash […]\nRead more »\n9 July 2024 / 16 January 2025 by richardcannon\nFor the first time Winchester District Green Party fielded a candidate in a General Election.Our candidate Lorraine Estelle commanded a good campaign by attending Hustings meetings in the area and election boards were placed in many locations around the city and a number in surrounding villages.\n28 June 2024 / 7 February 2025 by richardcannon\nnature hasn’t a voice of it’s own – but we have Saturday 22nd.June was a day to remember, over 60,000 people turned up in London to march from Hyde Park to Parliament Square to ensure the newly elected Government know that time is running out.Nature is wonderful, but doesn’t have a voice of it’s own […]\n27 June 2024 / 10 August 2024 by richardcannon\nSunday morning dog walkers must have wondered why our three Councillors; Malcolm Wallace, Suzanne White and Danny Lee were paddling in the upper River Meon in Droxford. The answer is as follows..\nLast weekend our candidate Lorraine Estelle attended the general election Hustings at Christ Church Winchester.Those attending were Flick Drummond (Conservative), Lorraine Estelle (Green Party), Hannah Dawson (Labour), Danny Chambers (LibDems) and Shaun Whelan (Reform UK).\n13 June 2024 / 10 August 2024 by richardcannon\nour green party candidate – richard needham Owing to the resignation of the sitting LibDem Councillor for St. Michael, a by-election has been called for on the same day as the General Election on Thursday 4th. July Richard writes.. I have lived in the heart of St Michael ward for almost 40 years, having first […]\n12 June 2024 / 10 August 2024 by richardcannon\nCarla Denyer and Adrian Ramsay write.. ‘Millions of people in our country are feeling insecure and deeply worried about the future. We live in one of the richest countries on the planet, yet nurses are using food banks, our children’s schools are crumbling, a roof over our heads is all too often unaffordable, and hospital […]\n10 June 2024 / 10 August 2024 by richardcannon\nThe recent boundary changes have meant that Whiteley and Shedfield, currently under Winchester, are now in the new Hamble Valley constituency (see maps on previous post). After the formal selection for a candidate, Kate Needham, our Winchester Co-Chair and candidate for Whiteley and Shedfield in the City elections will be standing. Kate writes.. We are […]\n4 June 2024 / 10 August 2024 by richardcannon\nFollowing national constituency boundary changes, below are maps showing the new / revised Winchester and Hamble Valley areas. You will see that some of the old Winchester boundary now comes under Hamble Valley. Click photos for larger size. winchester… hamble valley… ( Maps are open source from Ordnance Survey.. https://www.ordnancesurvey.co.uk/election-maps/gb/ )\n29 May 2024 / 10 August 2024 by richardcannon\nLorraine Estelle campaigning for Real Hope and Real Change. The Green Party today announced their candidate for the Winchester constituency at the coming General Election. They have selected Lorraine Estelle. Lorraine said, “I am honoured to have been chosen as the Green Party’s candidate for Winchester. In recent years, more and more people have realised […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_06_13_city-council-by-election-st-michaels-4th-july-24/content_83.html": "our green party candidate – richard needham\nOwing to the resignation of the sitting LibDem Councillor for St. Michael, a by-election has been called for on the same day as the General Election on Thursday 4th. July\nRichard writes..\nI have lived in the heart of St Michael ward for almost 40 years, having first moved here in 1985. Our children grew up here and attended St Bede’s and Westgate School and Peter Symonds College. I worked as a secondary school teacher and as Head of department for many years and am now in hospitality. I am a dedicated environmental campaigner and a good communicator.\nI am local, hardworking and trustworthy.\nI decided to stand for election because;\nI’m disappointed by the slow progress being made to tackle the nature crisis, reduce traffic and to protect our green spaces from overdevelopment.\nI’m dismayed by the eye watering costs of rents, lack of affordable homes and lack of local facilities.\nI’m determined to do my utmost to achieve real change for the better and to speak up to represent the real concerns of residents in all areas of St Michael ward.\nI want our children, grandchildren and future generations to be able to live a happy and healthy life here and for them to have a future they can look forward to.”\nRichard Needham",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_allotment-group_25th-february-2024/content_87.html": "25th. February 2024\nsowing and digging – we’re getting there !\nClick all photos for full size\nWe removed the glass from the greenhouse ready to replace it with a taller, stronger framed one.\nWe put the seedlings in a cold frame and planted up two rows of elephant garlic. One row was started in pots and already has a strong root system and the other row went straight in the ground. Let’s see if there’s a difference….\nSowing Parsnips, finding frogs and getting the bindweed roots up\nWe found some frogs so atm we are going to leave that corner plot as a ‘wildlife area’ Any tips on how to make it frog friendly please? (We aren’t allowed a pond)\nEddie planted the elephant garlic by making a small row of holes in the layer of cardboard and planting through.\nAs we left someone kindly donated half a net of first early Pink Fir Apple seed potatoes.\nApparently, these are a very tasty variety!",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_05_09_green-party-shows-huge-gains-in-popularity-all-around-hampshire/content_95.html": "18 months ago Hampshire had no District Councillors elected. Fast forward to May 2023, we now have ten !\nIn addition, the Isle of Wight has 2.\nHere are the details..Basingstoke and Deane, 1 – Michael Howard-Sorrell\nEast Hampshire, 2 – James Hogan & Ian James\nHavant, 1 – Grainne Rason\nNew Forest, 3 – Neil Millington, Adam Parker & Janet Richards\nSouthampton, 1 – Katherine Barbour\nWinchester, 2 – Danny Lee & Malcolm Wallace\nKatherine Barbour wins in Portswood, Southampton\nWhat this surely shows is that people, more than ever before, are thinking about their local and surrounding environment.\nWoodlands, wildlife, areas of beauty and the countryside in general have gone down the priority list through bad decisions made by majority Parties.\nClimate Change no longer is an issue a long way from home, it is affecting us locally.\nHere in Winchester, we have visited many homes and it’s very clear that concerns are for local issues such as badly thought out policies on new homes, pollution in our Rivers, insufficient leisure facilities, the decreasing number of bus services cutting peoples access to work and shops which in turn leads to more cars on the road, plus a deep want for Politicians to speak for them and not for their Party.\nBeating the cold weather – East Hampshire Greens out and about\nHampshire is one of the most beautiful parts of the Country; the New Forest, the South Downs National Park are gems and need protected more than they are, but we’re not just about rural, Katherine Barbour by winning Portswood in Southampton shows our message reaches to all areas and communities.\nWord has got round that Green Party Councillors have an independent voice ! We still have a mountain to climb, but we’re now out of Base Camp and heading towards greater things.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_pollution/content_29.html": "8 October 2024 / 8 October 2024 by richardcannon\nCLICK IMAGE TO READ IN FULL..\nRead more »\n10 September 2024 / 10 September 2024 by richardcannon\nA talk given on (and in) the River Meon at Meonstoke on Wednesday 4th.September 2024 by Chalk Streams expert Dr. Richard Osmond Kate Needham writes.. There was a lot more to river fly monitoring than I imagined. It was truly fascinating. Some creatures are more susceptible to pollution than others. So each type is given […]\n27 June 2024 / 10 August 2024 by richardcannon\nSunday morning dog walkers must have wondered why our three Councillors; Malcolm Wallace, Suzanne White and Danny Lee were paddling in the upper River Meon in Droxford. The answer is as follows..\n7 February 2024 / 10 August 2024 by richardcannon\nwhy this petition matters England’s rivers and seas are under threat due to the continuous pollution caused by water companies discharging sewage. This practice not only harms our precious aquatic ecosystems but also poses a significant risk to public health. According to the Environment Agency, in 2020 alone, untreated sewage was released into English waters […]\n8 January 2024 / 10 August 2024 by richardcannon\nReducing traffic for a better environment After the formalities and reports by Committee Role Players at our Annual General Meeting on the 3rd.January, we were delighted to welcome Emily Kerr, Oxford City Councillor for the St.Mary’s Ward who gave a very detailed and positive presentation on ‘Active Travel’. CLICK TO VIEW PRESENTATION You will see […]\n3 December 2023 / 10 August 2024 by richardcannon\nHampshire Pension Fund manages over £9.6bn in assets, so where the fund invests really matters. Winchester Green Party have been one of main local organisations that have been petitioning the Fund to move away from investment in fossil fuels and, in September, several members picketed outside Hampshire County Council offices at a protest organised by […]\n21 November 2023 / 10 August 2024 by richardcannon\nGlobally there are just 210 classified as Chalk Streams and of those 160 are found in England. Here in Hampshire we can boast three; The Rivers Meon, Itchen and Test. Our Councillors Malcolm Wallace and Danny Lee, alongside the River Meon at Droxford With the Rivers Meon and Itchen flowing within the Winchester City Council […]\n15 August 2023 / 10 August 2024 by richardcannon\nWinchester District – The Climate Crisis: update on our local greenhouse gas (CHG) emissions and determined action! Evidence of climate breakdown is all around us and the UN Secretary-General recently said we are in an era of ‘climate boiling’. So, are we doing enough? You might think the June 2019 Climate Emergency declaration by Winchester […]\n6 March 2023 / 10 August 2024 by richardcannon\nWinchester City Council – Health and Environment Policy Committee – Wednesday 1 March 2023. Natural England and Southern Water at the Winchester City Council’s Health and Environment Policy Committee meeting on Wednesday 1 March 2023 provided a number of updates on a variety of aspects related to ‘the protection of our local rivers & waterways’. […]\n27 January 2023 / 10 August 2024 by richardcannon\nAfter some delay due to a global shortage of electric vehicles, Winchester City Council have announced that upon delivery of a first bus arriving shortly, a trial run will take place using the Park and Ride service this coming Spring. Winchester Green Party are dedicated to reduce all pollution in Winchester City and the surrounding […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_donate/content_2.html": "Your donations are very warmly welcomed!\nWe remain deliberately independent to support your concerns. We therefore have a fraction of the funding available to main political parties supported by corporate donors or unions, so every penny really does help.\nDonations are wisely and effectively spent on items such as Banners, Posters, Newsletter production, election expenses and more.\nShould you have any questions about making donations please contact Giles Gooding for details.\nMany thanks, it really will make a difference. The Winchester Green Party Team",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_01_26_the-protected-landscapes-propgramme/content_24.html": "Funding available to support local farming communities and our environment.\nLocal Green Party Councillor supports Defra’s Farming in Protected Landscapes programme.\nArticle by Stan Evans\nLocal Meon Valley based Green Party Councillor, Malcolm Wallace stated : ”I’d like to remind our friends in the farming and land management community that Defra’s, Farming in Protected Landscapes (FiPL) program makes funding available to enhance their business and the rural environment, of which they are very much the guardians. This is a wonderful initiative, funding applications for new local projects are open now, this support is especially welcome in these difficult times”.\nSo what is Farming in Protected Landscapes (FiPL) ?\nOverview:\nWe are very lucky to live in or have such a beautiful rural landscape on our doorsteps. Not only is most of it a designated Area of Outstanding Natural Beauty but it’s also a\nhard working environment, farming being at the very heart of our local communities, both with regards to employment, socially, and being responsible for management of our environment.\nMany of us actually live within the boundaries of the South Downs National Park, over 75% of which is farmed.\nOur rural landscape supports a huge range of habitats and species, which are enjoyed by millions of people every year. So looking after our rural assets has broad positive impact, it’s not just local farmers and their supporting communities, but visitors to our area who support the local economy whilst enjoying everything our countryside, towns, villages, and the city of Winchester has to offer.\nFarmers and land managers in the country’s protected landscapes need support to protect what we have for future generations, in recognition of the role they play in managing these areas Defra has developed the Farming in Protected Landscapes (FiPL) programme as part of Defra’s Agricultural Transition Plan, which runs from July 2021 to March 2024.\nThe programme will pay for projects that provide value for money and result in at least one climate, nature, people or place outcome.\nThe programme will fund projects that:\n• support nature recovery\n• mitigate the impacts of climate change\n• provide opportunities for people to discover, enjoy and understand the landscape and its cultural heritage\n• protect or improve the quality and character of the landscape or place\nClimate Outcomes\nYour project should deliver:\n• more carbon being stored, sequestered or both\n• reduced flood risk\n• a better understanding among farmers, land managers and the public as to what different habitats and land uses can deliver for carbon storage and reduced carbon emissions\n• a landscape that’s more resilient to climate change\nNature outcomes\nYour project should deliver:\n• a greater area of wildlife-rich habitat\n• greater connectivity between habitats\n• better management of existing habitats for biodiversity\n• increased biodiversity\nPeople outcomes\nYour project should deliver:\n• more opportunities for people to explore, enjoy and understand the landscape\n• more opportunities for diverse audiences to explore, enjoy and understand the landscape\n• greater public engagement in land management, for example through volunteering\nPlace outcomes\nYour project should deliver:\n• enhancing or reinforcing the quality and character of the landscape\n• historic structures and features being conserved, enhanced or interpreted more effectively\n• an increase in the resilience of nature-friendly sustainable farm businesses, which contributes to a more thriving local economy (you must deliver this along with other outcomes)\nWho can apply?\n· The Farming in Protected Landscapes programme is open to all farmers and land managers within an AONB or National Park in England, or the Broads.\n· The programme is also open to farmers and land managers on land outside of protected landscapes.\nHow to apply\nBefore you apply, you should discuss your project with the protected landscape body, where you can also obtain an application form.\nYou can submit your application anytime up until the programme closes for applications in 2024.\nYour project must end by March 2024.\nFor us in the Winchester and Meon Valley area that body is the South Downs National Park Authority.\nThey can be found at https://www.southdowns.gov.uk/custodians/farming/farming-in-protected-landscapes-fipl/\nYou can check if your land is in a protected landscape\nhere https://magic.defra.gov.uk/MagicMap.aspx?&chosenLayers=aonbIndex,npkIndex",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_national-news/content_23.html": "27 January 2025 / 29 January 2025 by richardcannon\nCarla Denyer MP Carla‘s amendment to the Renters Rights Bill on requiring landlords to make reasonable changes to make homes accessible for disabled people, prompted the Minister to agree to a cross-party meeting to discuss how the Government makes sure the law is strong enough. She spoke during a debate on the so called ‘Sunshine […]\nRead more »\n18 December 2024 / 16 January 2025 by richardcannon\nThe National Green Party has voiced strong criticism of the government’s White Paper on local government reorganization, arguing that the proposals risk weakening local democracy rather than strengthening it. The reforms prioritize centralized “super-councils” and regional mayoral offices, pulling power further away from local communities.Local councils play a vital role in driving meaningful change on […]\n2 December 2024 / 2 December 2024 by richardcannon\nCarla Denyer MP Carla proposed and spoke in favour of several amendments to the Renters’ Rights Bill, including in support of rent controls, as a member of the committee looking at the legislation in detail. She and Siân have also tabled an Early Day Motion in support of funding a 4 Day Working Week pilot trial […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_bishops-waltham/content_10.html": "Hampshire County Council-Bishop’s Waltham by-election 3 October 2024 / 4 October 2024 by richardcannon Your green party candidate, Alex Ellis The current County councillor for Bishops Waltham district has stepped down triggering a ‘snap’ by-election which will be held on Thursday 31st October. The division covers a wide area including Bramdean to the North, Colden Common to the West and Durley to the South. See map below for boundary. […] Read more » Alex Ellis Bishop's Waltham",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2025_03_01_winchester-action-on-the-climate-crisis-denmead-community-centre/content_27.html": "On the 26th.February the trustees of Denmead Community Centre welcomed visitors from other community buildings around the district.\nWinchester Green Party was represented by Councillor Suzanne White\nThey shared their experience of raising funds and arranging the installation of solar panels on their building.\nStu Mills, Project Manager for WinACC also gave a presentation about the community solar support scheme.\nIt’s fantastic to see so many communities embracing solar panels for their buildings. We’ve been blown away (and very busy) by the interest shown.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_danny-lee/content_3.html": "Winchester Greens on the Web 21 March 2025 / 25 March 2025 by richardcannon ‘keeping you informed all year round’ social media We like to keep residents of the Winchester District informed ALL YEAR ROUND and not just sudden surges in the weeks leading up to an election. Here is the full list of our social media platforms where you will find regular local news and activities… Following the […] Read more » Central Meon Valley Danny Lee Malcolm Wallace Meon Valley Suzanne White\nA busy start to the year for winchester greens 2 February 2025 / 7 February 2025 by richardcannon Delivering new year cards Our non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places. In the Winchester District Wards a huge […] Read more » Danny Lee Malcolm Wallace Meon Valley People Suzanne White\nGreen Party criticises the Government White Paper on English Devolution for Local Government reorganisation! 18 December 2024 / 16 January 2025 by richardcannon The National Green Party has voiced strong criticism of the government’s White Paper on local government reorganization, arguing that the proposals risk weakening local democracy rather than strengthening it. The reforms prioritize centralized “super-councils” and regional mayoral offices, pulling power further away from local communities.Local councils play a vital role in driving meaningful change on […] Read more » Danny Lee Malcolm Wallace National Suzanne White\nOut and about photos from autumn ’24 2 December 2024 / 2 December 2024 by richardcannon Read more » Danny Lee Malcolm Wallace Meetings Meon Valley People Suzanne White\nSouth East Green Party Councillor’s Conference 26 November 2024 / 2 December 2024 by richardcannon Last week two of our three Councillors, Danny Lee and Malcolm Wallace attended the annual South East Green Party Conference in which many topics were discussed including of course, congratulations on all our recent Council elections. Read more » Danny Lee Malcolm Wallace Meon Valley\nMeon Valley, Whiteley & Shedfield Newsletters, Nov ’24 25 November 2024 / 26 November 2024 by richardcannon Click images to view full newsletters Read more » Danny Lee Malcolm Wallace Meon Valley Suzanne White\nMeon Valley Autumn Newsletter 2024 8 October 2024 / 8 October 2024 by richardcannon CLICK IMAGE TO READ IN FULL.. Read more » Danny Lee Malcolm Wallace Meon Valley Suzanne White\nGreen Party Councillors test the water in the River Meon 27 June 2024 / 10 August 2024 by richardcannon Sunday morning dog walkers must have wondered why our three Councillors; Malcolm Wallace, Suzanne White and Danny Lee were paddling in the upper River Meon in Droxford. The answer is as follows.. Read more » Danny Lee Droxford Malcolm Wallace Suzanne White\nCouncillor Danny Lee meets Veg Box 20 April 2024 / 10 August 2024 by richardcannon LOCAL ENTERPRISES IN CENTRAL MEON VALLEY Councillor Danny Lee campaigning in Hambledon for Suzanne White as the next Winchester City Green Party Councillor and Malcolm Wallace as the first Green Party County Councillor for Hampshire County. During campaigning he chatted to the fabulous Hampshire Veg Box Director Chris Huskins to hear first hand about the […] Read more » Danny Lee\nA lack of Affordable housing – Cllr. Danny Lee speaks out 7 February 2024 / 10 August 2024 by richardcannon Councillor Danny Lee raised concerns at the recent Housing Committee about the absence of new affordable housing schemes in the eastern part of the Winchester City Council district area. A lack of affordable housing in rural areas risks creating social difficulties for the elderly but especially for the young who will move to the urban […] Read more » Danny Lee",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_03_06_holding-southern-water-to-account/content_76.html": "Winchester City Council – Health and Environment Policy Committee – Wednesday 1 March 2023.\nNatural England and Southern Water at the Winchester City Council’s Health and Environment Policy Committee meeting on Wednesday 1 March 2023 provided a number of updates on a variety of aspects related to ‘the protection of our local rivers & waterways’. Full coverage of the meeting can be accessed via YouTube (see below).\nGreen Party Cllr Malcolm Wallace followed-up on the motion passed by WCC in July 2022 to ‘Protect our local rivers & waterways’. Southern Water were asked to commit support to WCC to ensure all planning applications for major developments include assessments of the wastewater system capacity to avoid polluting impacts on our\nwatercourses and wider environment. It was stressed the 3,500 hrs of wastewater discharge during last year was an unacceptable situation.\nTo see Cllr. Malcolm Wallace speak and replies given, scroll to approx 53 minutes\nThe many ongoing concerns about Hambledon and Waltham Chase wastewater – sewerage water incidents – were also raised. It was stressed the Hambledon Infiltration Reduction Plan along with Flood Alleviation work still required further attention following recent incidents. Similarly, Waltham Chase residents were fed-up with the lack of action about wastewater.\nClarification about how the large areas of Southern Water owned land can support nature recovery was also sought. The response from Southern Water was positive in that they would look into these issues, and it was confirmed they\nwould be actively progressing Nature Recovery as part of their Land Management Strategy.\nDanny Lee, the Green Party candidate for Central Meon Valley said after the meeting –” The Council, Environment Agency, Southern Water and Natural England need to work closer together to ensure residents, communities, businesses and farmers have the highest quality standards of reliable drinking water and waste water processing for our health plus protection and recovery of nature. High nature, low carbon and pollution free joined-up Strategies and Plans are needed now more than ever before.\nMalcolm Wallace and Danny Lee discuss the forthcoming meeting by the River Meon in Droxford\nPolly Parry who also attended the meeting said ” I was pleased to hear Southern Water has not forgotten about the River Meon despite the meeting’s considerable focus on the Test and Itchen rivers",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_04_25_around-and-about-pre-election-23/content_93.html": "With more than double the volunteers compared to last year, we’ve been busy distributing leaflets, letters and meeting people listening to any issues they may have and outline our ambitions for the future\nAdd to that we’ve nearly trebled the requests for ‘Vote Green’ boards’ throughout the Meon Valley and some in the city itself.\nThe response we have has not just been so rewarding but confirmation that people are turning to us for real change and direction in local politics.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_02_07_mandate-water-companies-to-cease-polluting-rivers-and-seas-with-sewage-petition/content_81.html": "why this petition matters\nEngland’s rivers and seas are under threat due to the continuous pollution caused by water companies discharging sewage. This practice not only harms our precious aquatic ecosystems but also poses a significant risk to public health. According to the Environment Agency, in 2020 alone, untreated sewage was released into English waters more than 400,000 times. The lack of stringent regulations allows these companies to continue this harmful practice without facing severe consequences.\nThe time has come for us to take a stand against this environmental injustice. We call upon the UK government and regulatory bodies to enforce stricter laws that mandate water companies stop polluting our rivers and seas with sewage. By signing this petition, you are contributing towards preserving England’s natural beauty and ensuring a safer environment for future generations.\nPlease click here to sign this petition today; let us together demand cleaner waters for England\nThis petition is promoted by Cllr Laura Manston on behalf of the South East Green Party, both at PO Box 78066, London SE16 9GQ.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2022_07_12_protecting-our-rivers-waterways/content_52.html": "Winchester City Council pass Green Party Cllr. Malcolm Wallace’s proposal\nAt the Winchester City Council meeting earlier this week (06-July) Councillors voted to improve protections on our local rivers and waterways by taking account of the cumulative impact of pollution.\nIn a first for Winchester, Green Councillor Malcolm Wallace proposed a motion to address this issue, then worked collaboratively with Liberal Democrat and Conservative colleagues to finalise the motion, which was then unanimously agreed by the Council. The motion means that, amongst other actions, planning applications for major developments should now include the effect on watercourses in their assessments.\nMalcolm Wallace, who is Green Party councillor for Central Meon Valley, said: “Winchester district residents are deeply concerned about water quality. The build-up of sewage, agricultural waste and plastic is polluting the waters of many of our rivers and waterways. Not a single river in our District has received a clean bill of health for chemical contamination and yet water companies appear to be dumping untreated or partially treated sewage in rivers on a regular basis. Although there are long term commitments, there are no plans in place which will address the immediate unacceptable situation either locally by Southern Water or by national government.”\n“It is beyond the authority of Winchester Council to resolve these issues in their entirety, however by enforcing a review of the potential for new developments to affect sewage outflow into watercourses, this motion is aimed at stopping the problem from getting any worse. Without action, the increasing levels of untreated sewage will continue to damage not only human health but natural habitats and local wildlife.”\nNotes\nContact: Cllr Malcolm Wallace, mwallace@winchester.gov.uk, 07739 050224 Malcolm is available for interview and to provide further information on this\npioneering approach to making Water companies and developers come clean on the impact of new developments on sewage discharges into local rivers and waterways.[1] Full motion approved by Winchester City Council, see Agenda for Council on\nWednesday, 6th July, 2022, 7.00 pm – Winchester City Council\n[2] Data from The Rivers Trust show that Southern Water discharged sewage into\nrivers and waterways in the Winchester district over 250 times in 2021, totalling over 3,500 hours of sewage discharge in just one year\n[3] Malcolm Wallace was elected in May 2022 and is the first Green Party Councillor on Winchester City Council.\n[wpforms id=”2140″]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_about-us_newsletters/content_8.html": "Click images to see newsletter in full\nClick for Whiteley Newsletter – Click for Meon Valley Newsletter\nCentral Meon Valley – January 2024\n____________________________________________________\nMarch 2023 – Central Meon Valley\nNewsletter November / December 2022\nMeon Valley Newsletter Sept / Oct 2022\nCould you help with Leaflet distribution ? If so, please go to the GET INVOLVED page\nCentral Meon Valley March 2022\nCentral Meon Valley – February 2022\nUseful Phone Numbers -January 2022",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_08_04_pending-railway-ticket-office-closures/content_49.html": "The Railway Delivery Group have recently announced they are proposing a huge closure of ticket offices around the country.\nTo see more, go to https://www.raildeliverygroup.com/uk-rail-industry/customer-focused-reform/customer-focused-stations\nBelow is our response to this. By following the above link, you are able to ‘have your say’ as individuals. Public consultation has been extended to 1st.September 2023.\nour response..\n‘We write to oppose the changes you are proposing to make on South Western Railways and in particular to the changes at Winchester station. The station is heavily used by residents and tourists and it would be represent a deterioration of the service to close the remaining office. The closure of the office on the London-bound platform was not welcome – it was used a lot during peak times; but to close the main office on the South-bound platform would be an enormous loss. Your consultation states that 75% of tickets are purchased online or through vending machines – what of the remaining 25%? This is a significant number of passengers who will be unable to purchase tickets, or will struggle with purchasing the correct ticket. Our objections stem from the need to provide universal, accessible, reliable, safe public transport. Removing the ticket offices is not in the interest of passengers and will not improve services. It is shortsighted, short-termist measure which will reduce accessibility and use of the rail service. The claim that stations will have the same numbers or increases in numbers of “multi-skilled” staff is doubtful. We already see many times at weekends and evenings, or during periods of staff sickness when the station is either unstaffed or staffed by contractors (who do not know anything about tickets or journey planning).\nAt present ticket offices are the only form of regulated station staffing, and if those are removed train companies will be under no statutory obligation to provide staff – and it is easy to imagine that numbers of staff will dwindle over time. The ticketing system is currently extremely complicated and the ticket office is the only way to ensure that passengers are able to access the appropriate and best value fare for their journey. Some products and services are not available either online or using the vending machines such as permission to travel, refunds, some discounts, connections with buses & ferries. Online services do not provide all route options, favouring the more expensive in many cases. Accessibility for disabled people will be greatly reduced and there has been widespread opposition from disability campaign groups. These changes as presented will result in reduced accessibility. Have equality impact assessments been carried out at every station to ensure that there is no discrimination? Please reconsider this in the context of passenger safety, accessibility, value for money and overall quality of experience. We need to be encouraging more people to use public transport in order to reduce carbon emissions. Retrograde steps such as closing station offices will prejudice this’.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_allotment-group_4th-february-2024/content_86.html": "4th.February 2024\nLots done and a new greenhouse !!\nThis week we were offered a free neighbouring greenhouse and all the contents. This turned out to be a treasure trove of useful tools, trays and a tin full of packets of seeds. Cassie, Dave Kate & Richard cleared the greenhouse and began to dismantle it.\nClick all photos for full size\nMeanwhile, Eddie and Darius were busy preparing a growing bed with compost which we then covered with cardboard (thank you Halfords) and will be covered with recycled weed control fabric. The plan is to use this bed to grow squashes through the covering later in the year.\nHopefully, this method will help to rid the bed of any remaining bindweed and weeds over the course of the next year. We were also offered two compost bins which are full of lovely rich compost. Happy days!\nNext week we hope to create a nice bed in the new greenhouse and to start clearing a second bed.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_07_09_elections-2024-green-party-votes-winchester/content_50.html": "For the first time Winchester District Green Party fielded a candidate in a General Election.\nOur candidate Lorraine Estelle commanded a good campaign by attending Hustings meetings in the area and election boards were placed in many locations around the city and a number in surrounding villages.\nUnder the circumstances of the election and understandable tactical voting by many, we were pleased with a 4.8% vote share with 2,740.\nMeanwhile, the by-election for the City Council seat in St.Michael, produced 795 votes more than doubling our share of the vote in May, all credit to our candidate Richard Needham.\nAlso of course, we cannot go without thanking the many members and supporters who gave up their time to help.\ngeneral election\nDanny Chambers\n29,939 (52.5%\nConservative,\nFlick Drummond\n16,118 (28.2%)\nReform UK,\nSean Whelan\n4,797 (8.4%)\nLabour,\nHannah Dawson\n3,023 (5.3%)\nGreen,\nLorraine Estelle\n2,740 (4.8%)\nSocial Democratic Party,\nAndrew Davis\n146 (0.3%)\nIndependent,\nKevin D’Cruze\n127 (0.2%)\nHampshire Independents,\nAndy Liming\n44 (0.1%)\nIndependent,\nChris Barfoot\n142 (0.2%)\nst.michael by-election\nRichard Murphy (Liberal Democrat)\n2,217\nLeo Keay (Conservative)\n1,193\nRichard Needham (Green Party)\n795\nPeter Ronald Marsh (Labour)\n385\nRichard Needham and Lorraine Estelle together with members after a long but pleasing night at Winchester Leisure Centre\nnationally\nOur four newly elected Green Party MP’s. With our greatly increased vote share, under proportionate representation we would have 42 seats ( Source: electoral-reform.org.uk ). Food for thought !",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2022_10_14_members-meeting-oct-2022-a-presentation-from-flight-free/content_82.html": "The meeting was held at St Pauls Church hall, Winchester. Members were also able to attend on Zoom during which we were very pleased to host a presentation by the ‘Flight Free’ group.\nOur speaker was Anna Hughes, Director and initiator of this charity in 2019. Its aim is to change social habits around flying and foster greater awareness of its environmental impact. Via its website https://flightfree.co.uk it offers the public an opportunity to take a pledge not to fly for one year – or for life.\nBy the time COVID lockdowns struck, 6,800 pledges had been made, and more thousands continue to come in.\nWe need to challenge the idea that flying is a normal way to travel, a lifestyle choice. The vast majority of humanity do not have such a choice.\nAnna made a distinction between flying for leisure , flying in order to maintain family contact, and flying that has a necessary purpose. There are many alternatives for holiday travel and travel agencies that specialise in flight-free options.\nWe need to be aware of the disproprtionate carbon footprint of flying, eg a flight to Bali would consume your carbon “ration” for a year, and a transatlantic flight has more emissions per person than not driving for a year or not eating meat for a year.\nGovernment proposals for reducing the environmental impact of flying do not include taxing aviation fuel, instead they revolve around “sustainable” fuel, offsetting and techno solutions not yet discovered. We need more Green MPs !\nThe pledge can be accessed via the website\nDate of next meeting: Wednesday November 2nd, 7.30\nIf you are looking for alternatives to travel abroad we would suggest trying out https://www.interrail.eu/en and a brilliant website is https://www.seat61.com/ that has any up to date detail about traveling by train in the UK, Europe and around the world.\nThere are lots of travel guides that offer flight free travel. Or try this one https://mossy.earth/guides/travel/travel-without-flying",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_06_02_winchester-green-party-questions-council-over-harmful-weed-killers/content_37.html": "As reported in the Hampshire Chronicle…\nWhilst walking through Winchester City Centre, Green Party Campaigner Richard Needham noticed that some council workers were using a well known weed killer which contains Glyphosates, banned by some councils across the country for harming human health and as a potential carcinogenic.\nOur co-chair Kate Needham instantly questioned the council about this stating there are far safer options for the control of weeds.\nA spokesperson for Winchester City Council said: “Our contractors idverde recently carried out some limited weed spraying activity to clear hard surfaces at St George’s Street, ensuring they remain safe and fit for use. The work was undertaken to coincide with dry weather to make sure only the targeted area was affected….\n“Products containing glyphosate are currently only used by the council in two per cent of the district grounds where impacts on the local environment are minimal and its use is restricted to twice a year.”\nA spokesperson for Winchester City Council said: “Our contractors idverde recently carried out some limited weed spraying activity to clear hard surfaces at St George’s Street, ensuring they remain safe and fit for use. The work was undertaken to coincide with dry weather to make sure only the targeted area was affected.\n“Products containing glyphosate are currently only used by the council in two per cent of the district grounds where impacts on the local environment are minimal and its use is restricted to twice a year.”\nCentral Meon Valley Green Party Councillor Danny Lee comments..\n“I am seeking a review of all relevant policies to limit and ban the use of such chemicals for managing weeds especially Glyphosates.\n“Safer non-chemical methods are available including mechanical techniques to manage and remove weeds. Urgent action is needed as no other herbicide is so non-selective. Glyphosate works against all plant species, can potentially kill large trees, and easily destroy wider habitats.\n“According to Pesticide Action Network UK many councils have turned to chemical-free options so why not our local authorities? It is essential we strive for a more hospitable environment for communities, our nature and animals. A review could usefully be undertaken with Hampshire County Council for wider co-ordinated risk prevention to people and our environment.”",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_05_07_cllr-malcolm-wallace-wins-county-council-by-election-for-meon-valley/content_94.html": "The County Council By-Election was only called at the last minute. This in turn meant a huge effort by our Volunteers to ensure the residents were well informed of our abilities by distributing leaflets and canvassing.\nWith so many new homes being built in Whiteley, the task was a challenge, but we succeeded with time to spare.\nIn the previous 2021 election Malcolm Wallace came second to the Conservatives with the LibDems following closely behind.\nTo win this seat, it goes to show the impact Malcolm has had in his role as District Councillor for Winchester.\nRest assured he will give his all to represent his constituants, especially now when politics in general is quite volatile.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_06_28_the-restore-nature-now-march-london/content_19.html": "nature hasn’t a voice of it’s own – but we have\nSaturday 22nd.June was a day to remember, over 60,000 people turned up in London to march from Hyde Park to Parliament Square to ensure the newly elected Government know that time is running out.\nNature is wonderful, but doesn’t have a voice of it’s own to say we are on the brink of an environmental disaster.\nThe outline was to to call upon all politicians to get behind action for nature in a legal, peaceful and family friendly way.\nWithout a doubt, this proved to be the case with the streets of London being filled with colour and having the feel of togetherness no matter what organization they may be representing.\nIn Parliament Square a host of well known figures gave speeches and a nice touch during the procedings was a Peregrine Falcon circling Big Ben !\nAll in all a great day out with a purpose, a voice which nature itself cannot give. Let’s hope our new Government takes this message seriously and puts forward positive and remedial plans to put things right.\nchannel 4 video…\nMore photos can be found on this GUARDIAN NEWSPAPER PAGE",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_04_09_winchester-city-council-elections-2024/content_65.html": "Your Green Party Candidates\nPlease scroll down the page to see your Ward\nDave Westley\nAlresford & Itchen Valley\nDavid joined the Green Party with a view to influencing a better ecological localised approach\nwhich in plain terms means a thriving environment that allows nature to take its course and\nbenefit all the community.\nAt the moment local government spends money in an uneconomic and un-eco manner. The cost of\nunnecessary mowing for example and wrong focus means avoidable inefficiency and David would\nlike to see a Green agenda come to the fore that will deliver a more effective management of\nresources and work power that doesn’t waste money whilst simultaneously delivering a\nsympathetic Green policy.\n____________________________________________________________________________________________________\nMax Priesemann\nBadger Farm & Oliver’s Battery\nOliver’s Battery, like many other places in the South of Winchester, is a great community\nclose to the countryside. People here worry about the pollution of our rivers, litter in\nour countryside, air pollution and noise as well as the light pollution from the nearby\nM3 compound.\nI pledge to protect our beautiful countryside from ever increasing threats from unwanted\ndevelopments like the application for a new industrial and retail estate at the former\nBushfield Camp. This plan will harm the area that had been left alone for many decades.\nWe will lose wonderful views and important habitats and it will create an extra 4000+ daily\ncar journeysalong Badger Farm Road.\nWinchester needs to be much smarter when planning new developments!\nI propose:\n- Only build what the community needs. (No to posh overpriced houses that normal\npeople can’t afford.) - Develop only on real brownfield sites near the city centre\n- Connect housing, public services, work and retail planning for communities (avoid\nsleeping ghettos) - Get the infrastructure right: Harvest rainwater, Build sufficient sewage treatment\nworks - Stop sealing off surfaces that will increase flooding\nI have been a campaigner to improve accessibility of Badger Farm Road junctions for many\nyears but current councillors have not achieved any improvements.\nI want to see more and better bus connections connecting Hursley, Compton, Olivers Battery\nand Shawford with Winchester reliably so that we don’t have to rely on our cars all the time.\n_____________________________________________________________________________________________________\nRichard Cannon\nBishop’s Waltham\nRichard moved from Ashford in Kent to Bishop’s Waltham six years ago.\nHe is passionate about wildlife and nature and has seen the terrible demise in population of many\ncreatures caused by poor agricultural policies,loss of habitat, woodland and climate change.\nBeing a keen walker and Wildlife Photographer has given him the pleasure of speaking to many\npeople hearing the many issues and concerns they have.\nRoad noise, pollution and safety are a priority issue along with ensuring local business’s are\nsupported and our Countryside is maintained\nand improved where needed.\nRichard states “Our Village, our County, our Country and Planet are in urgent need of\nenvironmental change and putting wrongs to rights.\nWe must act now and the Green Party are the Party who will do just that, our many Councillors\naround the Country have been extremely successful in changing things for the good”.\n__________________________________________________________________________________________________\nSuzanne White\nCentral Meon Valley\nSuzanne has lived in Hampshire for over twenty years and moved to Soberton in the Meon Valley\nthree years ago.\nShe worked for sixteen years as a primary school teacher in a Hampshire school and more recently\nran a gardening service, helping older residents to comfortably stay in their own homes and\nacting as a point of contact to combat loneliness and isolation.\nShe is passionate about caring for our local environment and has spent many years taking part in\npractical conservation work, including maintaining our rare wildflower meadows and local pond\nas well as monitoring the health of the River Meon. She has set up a ‘Climate Action Group’ to\nprovide advice and information on sustainable living and facilitate projects that will benefit\nthe people living in the local area.\nIf elected as a Winchester City councillor, she is looking forward to working with Cllr Malcolm\nWallace and Cllr Danny Lee to achieve even more for local residents and businesses in\nthe Meon Valley.\n______________________________________________________________________________________________________\nElizabeth Riley\nDenmead\nElizabeth has lived in the Meon Valley since 2007, and in Denmead since 2014. She joined the\nGreen Party many years ago in responseto the lack of action on climate change, this has only been\ndiluted since. Having worked in the education sector for over seventeen years, she has a strong\nidea of the issues that our young people are concerned about and the future they face if we do\nnot do better now!\nIn recent years, all aspects of our lives and the impact this is having on our natural world\nare on a downward slide andthis needs to change.\nAs a society, we can no longer continue to put profit before everything else. As a result of\nthe current climate, she has decided to put herself forward for a position where she can make\na difference.\nDoing what one can at home is no longer enough to affect change.\n___________________________________________________________________________________________________\nCharlotte Harley\nSt. Barnabas\nI have been a member of the Green Party since 2019 and having grown up in Winchester, I am\npassionate about putting Green issues at the forefront of council policies.\nI love spending time with my family in and around our beautiful City. My priority is to\nensure that new buildings and developments are designed with the environment and local\ncommunity front of mind, and that businesses meet their environmental responsibilityto protect\nand preserve the natural environment and its resources.\nI’m committed to ensuring that families and young people have access to safe green spaces and\nthat these are protected and maintained so everyone has access, and the opportunity, to enjoy\nand reconnect with the natural world.\nMy focus is to implement conscious and sustainable changes which will create a greener city\nand thriving community, with a commitment to the natural world and future generations.\n___________________________________________________________________________________________________\nLorraine Estelle\nSt. Bartholomew\nLorraine Estelle Abraham lives in Winchester and is a volunteer guide, showcasing the beauty\nand history of our cathedral to visitors. In 2022, she was honoured with the prestigious\n“Contributions to Scholarly Publishing” award, recognizing her successful career and\naccomplishments.\nHer most recent work involved collaborating with libraries in developing and transitioning\neconomies, facilitating access to knowledge for education, learning, and research, and\npromoting sustainable community development.\n_________________________________________________________________________________________________\nMike Perrott\nSt. Luke\nMy main reason for joining the Green Party was that towards the end of my 40 year career as a\nCivil Engineer on large projects (including the M25) .It became clear that most projects had\ncaused more damage than good. I could see that the Green party was the only party not subject\nto the vested interests of the oil industry and big agricultural interests.\nI am standing as a candidate for the WCC election to support the good work that Green Party\nCouncillors Malcolm Wallace and Danny Green have been doing for our communities.\n___________________________________________________________________________________________________\nRichard Needham\nSt. Michael\nRichard joined the Green Party because of their policies to protect the environment and for\nsocial justice. He wants his children and grandchildren to grow up and enjoy a happy future\nand he believes that ‘The future is Green or not at all’.\nRichard grew up in a village and he understands the unique benefits and issues of village life.\nHe is a keen environmental campaigner and would be a strong voice to speak up for local residents.\n_____________________________________________________________________________________________________\nGiles Gooding\nSt. Paul\nI have lived in Fulflood for more than 20 years and have been actively involved in the local\ncommunity for most of this time.\nI volunteer with the Winchester Scouts and campaign on green issues with Friends of the Earth,\nWinACC and GreeningFulflood and also launched Freecycle Winchester in 2006.\nThe City of Winchester is choked by cars affecting the heath of its residents and visitors.\nMuch has been promised to reduce traffic but little has been delivered.\nThe Council needs to increase its Green Voice to get the Movement Strategy back on track and\nprioritise pedestrians and bicycles over cars. I want to see a cleaner, healthier, fairer\nWinchester for all.\n__________________________________________________________________________________________________\nBeata Parry\nSouthwick & Wickham\nI have been a resident of Swanmore since 2010. Before then I lived and raised my 5 children in\nthe beautiful Blue Mountains, NSW Australia – an area declared as a World Heritage Site. Living\nin such a wonderful place inspired me to appreciate nature and wildlife and strive to protect it.\nI enjoy gardening – growing my own vegetables & fruit, using composting to help recycle waste and\nimprove the soil, planting to provide friendly environments for wildlife.\nI am also a keen walker, observing the magic of seasonal changes & how it affects growth and\nhabitats. Spending so much time outdoors made me realise how precious our planet is and how much\nit is changing. We all need to make more efforts to protect it. I feel strongly about reducing\ncar pollution, eliminating chemicals from gardens & plastic in our homes.\nI am hoping to educate the next generations to reuse rather than buy new, recycle what we\nalready have and reduce the amount of plastic, artificial fibres, etc. in everyday use.\nI believe the Green Party is the only party fully committed to make these changes.\n_____________________________________________________________________________________________________\nKate Needham\nWhiteley & Shedfield\nWe are in a climate and biodiversity emergency. Local services have been cut and we have lost\nso much. I worry about what the future will be like for my grandchildren. I would like them to\nbe able to paddle in the sea and local streams without fear of becoming sick. I’d like them\nto breathe cleaner air and be surrounded by more green spaces and nature.\nTo be able to cycle more safely and to be able to afford to live here when they are older.\nWe need to vote more greens into positions of power and influence in order to take action now\nfor a greener, fairer world and a future we can all look forward to.\n________________________________________________________________________________________________\nDee Wright\nWonston & Micheldever\nI’m Dee, the youngest Green candidate for Winchester City Council, at just 18 years old and\nI’m currently in college, getting ready to sit my A-level exams.\nBecause I am young, I have a personal stake in the environment – it’s my future, and it’s the\nfuture of our communities. I’ve spent the last 2 years sitting within the UK Youth Parliament\ntackling a variety of issues in partnership with councils: taking meetings with key decision\nmakers on mental health; jobs and opportunities; and education; alongside creating an\neco-conference for Hampshire’s school children, empowering them to improve their areas.\n______________________________________________________________________________________________\nAndrew Pogson\nThe Worthys\nI have been interested in Green Polices and Politics since studying Meteorology at University.\nI moved to Kings Worthy three years ago and since then I’ve spent many hours exploring the\nwonderful surrounding countryside alongside my two Labradors.\nEven in this short time I have seen many changes that are concerning to me. The challenge\nof building for a sustainable future is particularly relevant here, where we must find ways\nto preserve our city’s heritage and natural environment.\nBy thinking more long term and planning with the bigger picture in mind. We can protect our\nlocal environment, boost our local economy and improve peoples quality of life. That is why I\nam proud to represent the Green Party this May.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_news_page_5/content_68.html": "24 January 2024 / 23 January 2025 by richardcannon\nNext Wednesday 31st. January at 6.30pm Winchester City Council will be holding a meeting in the Walton Suite,, Winchester Guildhall to discuss the Hampshire Hospital Consultation. Full details of the meeting along with links to various documents can be found by going to the public website HERE Our Green Party Councillor Malcolm Wallace comments.. ‘This […]\nRead more »\n8 January 2024 / 10 August 2024 by richardcannon\nReducing traffic for a better environment After the formalities and reports by Committee Role Players at our Annual General Meeting on the 3rd.January, we were delighted to welcome Emily Kerr, Oxford City Councillor for the St.Mary’s Ward who gave a very detailed and positive presentation on ‘Active Travel’. CLICK TO VIEW PRESENTATION You will see […]\n6 December 2023 / 10 August 2024 by richardcannon\na copy of our full letter explaining the reasons for our objection Bushfield army camp, once an emergency measure in WW2 that returned to the Church Commissioners about 40 years later, has since been rewilding itself for nearly 45 years. There have been multiple attempts for developing this site until the newest proposal. The application […]\n3 December 2023 / 10 August 2024 by richardcannon\nHampshire Pension Fund manages over £9.6bn in assets, so where the fund invests really matters. Winchester Green Party have been one of main local organisations that have been petitioning the Fund to move away from investment in fossil fuels and, in September, several members picketed outside Hampshire County Council offices at a protest organised by […]\n1 December 2023 / 10 August 2024 by richardcannon\nAt yesterday’s Council meeting, Winchester City Council passed a motion calling for the government to ban the sale and manufacture of disposable vapes by 2024. The motion was based on a Local Government Association initiative. Cllr Malcolm Wallace, who supported the call for the ban, said, ‘Disposable vapes are an unsustainable product, so an outright ban is […]\nAt a follow-up meeting to the recent Climate Café event, a group of Soberton and Newtown residents formed a new group. Climate Action for Newtown and Soberton (C.A.N.S), was born, with the main aim of reducing the carbon footprint of the parish. Looking at all the ideas suggested at the Climate Café, it was decided […]\n21 November 2023 / 10 August 2024 by richardcannon\nGlobally there are just 210 classified as Chalk Streams and of those 160 are found in England. Here in Hampshire we can boast three; The Rivers Meon, Itchen and Test. Our Councillors Malcolm Wallace and Danny Lee, alongside the River Meon at Droxford With the Rivers Meon and Itchen flowing within the Winchester City Council […]\n22 October 2023 / 10 August 2024 by richardcannon\nStan Evans writes.. A massive thanks go to SoberNewts members who took care of tea, coffee, and biscuit duties, the staff at Rookesbury Hall for running a great facility, Councillor Danny Lee for his input and for taking our messages back to our City Council, and Stu Mills from Winchester representing WinACC and Climate Action […]\n23 September 2023 / 10 August 2024 by richardcannon\nOur Green Party Councillor Danny Lee was glad to support the adoption of the declaration of a ‘Nature Emergency’ by Winchester City Council (WCC) on 20 September 2023. Based on his original draft for the cancelled Full Council meeting in July, it was proposed by the Portfolio lead for the Climate Emergency and seconded by […]\n19 August 2023 / 10 August 2024 by richardcannon\nDelay, delay, delay seems to be the story of the Winchester City Council’s Local Plan and was highlighted in an article appearing in the Hampshire Chronicle last week. See https://www.hampshirechronicle.co.uk/news/23725912.green-party-concern-winchester-city-councils-local-plan-delay/ In response, Green Party Councillor Danny Lee made the following statement.. “The council’s decision will mean lower environmental standards will continue for longer for all […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_06_27_green-party-winchester-candidate-lorraine-estelle-at-the-hustings/content_12.html": "Last weekend our candidate Lorraine Estelle attended the general election Hustings at Christ Church Winchester.\nThose attending were Flick Drummond (Conservative), Lorraine Estelle (Green Party), Hannah Dawson (Labour), Danny Chambers (LibDems) and Shaun Whelan (Reform UK).\nA full minute by minute timeline is published in the Hampshire Chronicle here.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_01_10_the-2-bus-fare-cap/content_92.html": "max priesemann writes..\nA single bus ticket price cap of £2 is very welcome!\nUnfortunately only until End of March.\nEnd of 2022 a Stagecoach Single ticket from Winchester to places like West Meon, Cheriton, Arlesford or Romsey cost £5.90.\nA Bluestar Single between Southampton and Winchester cost as much a £7.\nFrom 1st of January, all of these Single fares have been capped at £2 only.\nBut be AWARE that Return tickets may still cost the same as before. This means that a Return may cost you more than the price of 3 Single tickets to the same destination (Stagecoach website screenshot).\nRecalculate your day tickets too because these may not save you as much compare to single journeys anymore.\nClick image for full size\nNot all bus companies are part of this scheme and school buses are excluded too (as if children have more money).\nTo find out which Bus Companies nationwide are participating in this scheme, go the Government Website…https://www.gov.uk/guidance/2-bus-fare-cap",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_04_22_green-party-candidate-hampshire-county-council-meon-valley-by-election/content_77.html": "Our Candidate, Cllr. Malcolm Wallace\nMalcolm was elected a Winchester City Council Councillor for the Central Meon Ward in 2022 and since then has become an established member of the Council and proven that a Green in the room really does make a difference. Here’s just a few things he has achieved in this time..\n- Successfully passed a Council motion to include the effect on our precious rivers in planning applications for major developments\n- Organised a ‘Transport Forum’ to bring together parish council leads across the local area\n- Successfully passed a Council motion on opposing fracking across the district\n- Worked with fellow Cllr. Danny Lee in successfully passing a Council motion to declare a nature emergency.\n- Has improved accessibility for disabled residents by securing agreement for some dropped kerbs and pavement resurfacing.\n- With Cllr. Danny Lee has hosted councillor surgeries around the local area listening to what really matters to local people\n- With Kate Needham (candidate for Whiteley & Shedfield) has promoted energy efficient grants for both community buildings and domestic properties to help people with the cost-of-living crisis\n- Has worked hard to help local businesses with sustainability initiatives.\n- Supported Parish Councils on flood action pushing for Southern Water to upgrade drainage\nIn the last Meon Valley County Council election Malcolm came second to the Conservatives, a vote for him in this election will help to secure our first Green Party Councillor for Hampshire.\nMalcolm always out and about listening to people’s views and issues and……..acting upon them.\n________________________________________________________________________________________",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_news_page_7/content_72.html": "9 May 2023 / 10 August 2024 by richardcannon\n18 months ago Hampshire had no District Councillors elected. Fast forward to May 2023, we now have ten ! In addition, the Isle of Wight has 2. Here are the details..Basingstoke and Deane, 1 – Michael Howard-SorrellEast Hampshire, 2 – James Hogan & Ian JamesHavant, 1 – Grainne RasonNew Forest, 3 – Neil Millington, Adam […]\nRead more »\n7 May 2023 / 10 August 2024 by richardcannon\nAlresford and Itchen Valley Russell Gordon-Smith (Lib Dem) 2,034 Harry Johnson-Hill (Con) 1,187 Richard Needham (Green) 164 Tessa Valentine (Labour) 74 Majority: 847 Turnout: 40% Bishop’s Waltham Jonathan Williams (Lib Dem) 1,618 Donald Iro (Con) 1,022 Richard Cannon (Green) 232 Steve Haines (Labour) 113 Majority: 596 Turnout: 45% Denmead Paula Langford-Smith (Con) 1,035 Michael Bennett […]\n6 May 2023 / 10 August 2024 by richardcannon\nClick photos to view full sizes Time out in the Cafe Richard, Danny, Malcolm, Giles & Max Giles Gooding Richard Needham Andrew Pogson Julia Priesemann Celebrating the Central Meon Valley win Richard Cannon Malcolm, Giles and Max Our two Winchester Councillors ! Friedrich & Julia Priesemann\n25 April 2023 / 10 August 2024 by richardcannon\nWith more than double the volunteers compared to last year, we’ve been busy distributing leaflets, letters and meeting people listening to any issues they may have and outline our ambitions for the future Add to that we’ve nearly trebled the requests for ‘Vote Green’ boards’ throughout the Meon Valley and some in the city itself. […]\n8 April 2023 / 10 August 2024 by richardcannon\n16 wards – 16 candidates vote green Click candidate photos to view details Richard Needham Alresford and Itchen Valley >> Max Priesemann Alresford and Itchen Valley >> Richard Cannon Bishop’s Waltham Danny Lee Central Meon Valley >> Lucinda Graham Colden Common & Twyford Beata Parry Denmead Lorraine Abraham St. Barnabas Charlotte Harley St. Bartholomew Reece […]\n24 March 2023 / 4 June 2024 by richardcannon\nDanny Lee writes.. The Low Carbon Across the South and East programme provides a free business support programme in the South and East. LoCASE offers grants for businesses of up to £20,000 for installation of energy efficiency measures (up to 40% of the cost of your eligible project, with the remainder matched by your business), as well as training workshops and […]\n12 March 2023 / 10 August 2024 by richardcannon\nFollowing a presentation about the plan for the M3 / J9 changes by Chris Gilham at our March Member’s meeting it became apparent that we needed to ensure the public are aware that applications to be an ‘interested party’ via the National Infrastructure Planning website needed to be completed before 2359hr. Monday 13th. March, we […]\n10 March 2023 / 10 August 2024 by richardcannon\nStan Evans writes On a recent visit to Winchester I was lucky enough to stumble across Earthian – Zero Waste Shop, right in the centre of the city on Parchment Street. With a passion for all things eco I had go inside to check out what this attractive shop has to offer. I was lucky […]\n6 March 2023 / 10 August 2024 by richardcannon\nWinchester City Council – Health and Environment Policy Committee – Wednesday 1 March 2023. Natural England and Southern Water at the Winchester City Council’s Health and Environment Policy Committee meeting on Wednesday 1 March 2023 provided a number of updates on a variety of aspects related to ‘the protection of our local rivers & waterways’. […]\n7 February 2023 / 10 August 2024 by richardcannon\nGREENS IN THE NEWS JANUARY ! Our Green Party Councillor Malcolm Wallace has certainly made his mark since being elected last May. Here’s some links to articles he’s mentioned and quoted in over the last few weeks ! Article: Plans for dog walking paddock divide opinion in Meon Valley Malcolm voiced his opinion on plans […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_nhs/content_51.html": "Winchester City Council Health and Environment Policy Committee mtg. 24 January 2024 / 23 January 2025 by richardcannon Next Wednesday 31st. January at 6.30pm Winchester City Council will be holding a meeting in the Walton Suite,, Winchester Guildhall to discuss the Hampshire Hospital Consultation. Full details of the meeting along with links to various documents can be found by going to the public website HERE Our Green Party Councillor Malcolm Wallace comments.. ‘This […] Read more » NHS",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_about-us_allotment-group/content_14.html": "Welcome to our Allotment Diaries\nWith Green Party members and supporters in mind, this January we acquired an allotment site off the Worthy Road in Winchester.\nThe photographs below are how we found it when first visiting on Sunday 14th.January 2024.\nBy the second week about 10 people have come along to see what’s happening and finding out how they can join in ‘the fun’ of growing vegetables and fruit plus of course to socialize with likeminded people.\nNew entries to the diary will be shown in the right hand column, so please pay us a visit to see how we’re getting on.\nPlease feel free to join in. To do so, please email: contact@winchester.greenparty.org.uk and mark it for the attention of Kate Needham",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_12_02_out-and-about-photos-from-autumn-24/content_62.html": "Skip to content\nSkip to footer\nWinchester\nMenu\nNews\nAbout us\nAbout us\nHere to help\nGreen Thought Archives\nReducing waste and recycling\nOur Allotment Group\nPeople\nGet Involved\nNewsletters\nContact\nEvents\nJoin\nDonate\nJoin\nDonate\nMenu\nOut and about photos from autumn ’24\nHome\nEvents\nMeetings\nNews\nOut and about photos from autumn ’24\n2 December 2024\n/\n2 December 2024\nby\nrichardcannon\nCllr. Malcolm Wallace (left) writes… On 29-Sep, Waltham Chase village hall celebrated its 50th anniversary with an event attended by the Mayor of Winchester. It was great to see this village hall still going strong after 50 years, thanks to the work of the village hall committee and support of local residents.\nOver the summer, Cllr’s Suzanne White and Malcolm Wallace had the opportunity to visit Solent Powerchair Football Club – the only powerchair football club in Hampshire. They are based at Swanmore College in the Meon Valley and attract players from across Hampshire.\nAs part of #UKParliament Week, Cllr. Malcolm Wallace gave a presentation to the 1st.Shedfield Scout Group in which many interesting and challenging questions were raised. Photo taken from the Scout’s facebook page at\nhttps://www.facebook.com/1stshedfieldscouts\nThrough November Members and supporters were busy distributing Newsletters to the Meon Valley, Whiteley and Shedfield. Naturally interrupted by a quick coffee break !\nOur three Councillors have attended a number of District Council meetings (Cllr. Malcom Wallace also participating in County Council). The screenshot from Winchester City Council youtube channel. All council meetings are streamed live and left for playback later.\nhttps://www.youtube.com/@Winchester_City\nand\nhttps://www.youtube.com/@hampshire_county_council\nTo top",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_05_05_last-days-of-campaigning-and-the-count/content_85.html": "Our hard working Teams were out and about for a number of weeks before the election date. With such short notice for the vacant County County by-election, it meant our canvassers and leaflet distributors were extremely hard pressed to cover Central Meon Valley, Meon Valley as well as around Winchester city itself.\nRequests for ‘Vote Green’ boards more than doubled over last year with Richard Needham setting up his own ‘factory’ in his Winchester back garden ! Just when he thought he had enough, even more requests came flooding in.\nOur Whiteley Action day brought in friends from East Hampshire and Test Valley Green Party. We are indebted to them.\nRichard Needham hard at work – Cllrs. Suzanne White and Danny Lee in Droxford\nMax Priesemann, Jo Harmer, Kate Needham and Richard Cannon – Malcolm Wallace planning with Dee Wright\nMalcolm visiting residents in Waltham Chase – One of over 100 Vote Green Boards around the area\nAlex Ellis, Lorraine Estelle, Giles Gooding, Ilana Pleas, Kate Needham in Hyde – Dee Wright\nSuzanne White and Malcolm Wallace at their declarations (videos HERE >>)\nKate Needham and Max Priesemann at their declarations\nGiles Gooding and Lorraine Estelle both coming second in their Wards, a best result for the City.\nError: Contact form not found.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_03_10_interview-with-earthian-zero-waste-shop-winchester/content_71.html": "Stan Evans writes\nOn a recent visit to Winchester I was lucky enough to stumble across Earthian – Zero Waste Shop, right in the centre of the city on Parchment Street.\nWith a passion for all things eco I had go inside to check out what this attractive shop has to offer.\nI was lucky enough to visit when Katie, the manager and owner of Earthian, was there, and she was more than happy to answer my questions.\nEarthian is not just another retail business in the heart of the city, it’s a passion, and in fact part, and the start, of something much bigger, as Katie explains :\nQ: Katie, what is Earthian and what made you think about starting this business?\nEarthian offers a more eco-friendly way to shop for your essentials. We have food and cleaning products in bulk that customers can fill their own tubs with, negating the need for new packaging each time they shop. We also stock an ever-growing range of plastic free homeware and personal care products. I started this business because I wanted to reduce my own harmful impact and I was trying to live a low waste lifestyle at home. After a while, I set about trying to find a way that I could offer others a place to shop this way more easily.\nQ: Are the public ready to purchase and shop ecologically? What are the differences, challenges, and advantages of this new way of shopping?\nI believe that people are ready and they’re willing to make it part of their habits. There is growing concern around plastic pollution, not just for those that study nature but everyone has some awareness now and would like to do their bit. The two main advantages of shopping with us is reduced plastic and food waste of course, but we are also comparable to the supermarket in terms of pricing. The challenge can be taking the first step, but fortunately this is often a lot easier than people imagine it to be.\nKatie chatting over a product with Winchester Green Party Joint Co-ordinator, Kate Needham\nQ: How do you see the future of your business and eco-shopping?\nImproving the ethical and sustainable standards of our business is our immediate goal. This year and beyond we aim to become carbon neutral and zero waste to landfill. We would like to grow in size to be able to offer more variety, at the moment we are limited by space but these things will come in time. Beyond our own shop, I’d like to see eco-friendly shopping become normal practice rather than something niche. It needs to be more accessible, but that should also come with higher standards that prevent greenwashing.\nQ: What do you think local or national government should be doing to help environmentally focused retailers such as yourselves?\nWe are all trying to do the best we can, as community groups, small businesses and as individuals but this is independent of our governments actions. We need a more joined up approach to sustainability and a willingness from leadership to make bigger, more actionable change. In terms of supporting eco-focused retailers, we struggle with the same issues that all independent businesses do. In recent years there have been a huge number of challenges to overcome, and the support has been noticeably lacking, even though SMEs make up 99% of the GDP!\nEarthian is at 9a Parchment St. Winchester – Visit their website HERE\nWe often hear ecological green product and service reviews from the point of view of the consumer. So it was great to hear an eco-retailers point of view and perspective on bringing more environmentally sound products to our shopping bag, and the challenges and opportunities they face. For sure the way we shop, and the way retailers sell will change, from products, to packaging, to packing avoidance, to purchasing. People like Katie are quietly driving the future of shopping with one eye firmly on our environment and what and how we consume, when in Winchester go and visit Earthian and check it out for yourself. A positive green highlight, shops like this are thankfully leading the way. Thanks Katie.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_danny-lee_page_2/content_70.html": "Winchester pushes for Hampshire Pension Fund to move away from fossil fuels 3 December 2023 / 10 August 2024 by richardcannon Hampshire Pension Fund manages over £9.6bn in assets, so where the fund invests really matters. Winchester Green Party have been one of main local organisations that have been petitioning the Fund to move away from investment in fossil fuels and, in September, several members picketed outside Hampshire County Council offices at a protest organised by […] Read more » Danny Lee\nSaving our Chalk Streams 21 November 2023 / 10 August 2024 by richardcannon Globally there are just 210 classified as Chalk Streams and of those 160 are found in England. Here in Hampshire we can boast three; The Rivers Meon, Itchen and Test. Our Councillors Malcolm Wallace and Danny Lee, alongside the River Meon at Droxford With the Rivers Meon and Itchen flowing within the Winchester City Council […] Read more » Danny Lee Malcolm Wallace\nSoberton Newtown Climate Cafe a great success 22 October 2023 / 10 August 2024 by richardcannon Stan Evans writes.. A massive thanks go to SoberNewts members who took care of tea, coffee, and biscuit duties, the staff at Rookesbury Hall for running a great facility, Councillor Danny Lee for his input and for taking our messages back to our City Council, and Stu Mills from Winchester representing WinACC and Climate Action […] Read more » Danny Lee Newtown Soberton Suzanne White\nDeclaration of Nature Emergency for Winchester 23 September 2023 / 10 August 2024 by richardcannon Our Green Party Councillor Danny Lee was glad to support the adoption of the declaration of a ‘Nature Emergency’ by Winchester City Council (WCC) on 20 September 2023. Based on his original draft for the cancelled Full Council meeting in July, it was proposed by the Portfolio lead for the Climate Emergency and seconded by […] Read more » Danny Lee\nDelays to Winchester City Council’s local plan 19 August 2023 / 10 August 2024 by richardcannon Delay, delay, delay seems to be the story of the Winchester City Council’s Local Plan and was highlighted in an article appearing in the Hampshire Chronicle last week. See https://www.hampshirechronicle.co.uk/news/23725912.green-party-concern-winchester-city-councils-local-plan-delay/ In response, Green Party Councillor Danny Lee made the following statement.. “The council’s decision will mean lower environmental standards will continue for longer for all […] Read more » Danny Lee\nWinchester Emissions and Carbon Neutrality Action 15 August 2023 / 10 August 2024 by richardcannon Winchester District – The Climate Crisis: update on our local greenhouse gas (CHG) emissions and determined action! Evidence of climate breakdown is all around us and the UN Secretary-General recently said we are in an era of ‘climate boiling’. So, are we doing enough? You might think the June 2019 Climate Emergency declaration by Winchester […] Read more » Danny Lee\nHambledon Greening Festival 2023 15 May 2023 / 10 August 2024 by richardcannon Once again, the Hambledon Greening Group pulled off a fabulous Festival last Saturday 13th May. On a lovely sunny afternoon, crowds gathered to stroll around a diverse selection of Stands which included The Hampshire & Isle of Wight Wildlife Trust, The Woodland Trust, Energise South Downs, Waterlooville Hedgehog Rescue, The Sustainability Centre, an exhibition by […] Read more » Danny Lee Hambledon Malcolm Wallace\nHolding Southern Water to account 6 March 2023 / 10 August 2024 by richardcannon Winchester City Council – Health and Environment Policy Committee – Wednesday 1 March 2023. Natural England and Southern Water at the Winchester City Council’s Health and Environment Policy Committee meeting on Wednesday 1 March 2023 provided a number of updates on a variety of aspects related to ‘the protection of our local rivers & waterways’. […] Read more » Countryside Danny Lee Malcolm Wallace",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_kate-needham/content_43.html": "Members & Supporters open meeting – The importance of Chalk Streams 10 September 2024 / 10 September 2024 by richardcannon A talk given on (and in) the River Meon at Meonstoke on Wednesday 4th.September 2024 by Chalk Streams expert Dr. Richard Osmond Kate Needham writes.. There was a lot more to river fly monitoring than I imagined. It was truly fascinating. Some creatures are more susceptible to pollution than others. So each type is given […] Read more » Kate Needham River Meon\nKate Needham to stand as candidate in Hamble Valley 10 June 2024 / 10 August 2024 by richardcannon The recent boundary changes have meant that Whiteley and Shedfield, currently under Winchester, are now in the new Hamble Valley constituency (see maps on previous post). After the formal selection for a candidate, Kate Needham, our Winchester Co-Chair and candidate for Whiteley and Shedfield in the City elections will be standing. Kate writes.. We are […] Read more » Hamble Valley Kate Needham\nHampshire County Council Budget Consultation 2024-2026 4 August 2023 / 10 August 2024 by richardcannon Please find below our written response to the release of Hampshire County Council’s budget Consultation for 2024 to 2026. The full consultation documents can be found at the Hampshire County Council website HERE …….. 23rd July 2023 Dear Hampshire County Councillors, HAMPSHIRE COUNTY COUNCIL 2024-26 BUDGET CONSULTATION Winchester Green Party’s response to the consultation is […] Read more » Kate Needham Max Priesemann",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_07_18_a-walk-around-st-clairs-nature-reserve-soberton/content_42.html": "Last week, in replacement of our monthly members zoom meeting, we went for a walk around St. Claire’s Nature Reserve in Soberton.\nThe weather stayed good for us and the walk alongside the river was quite a treat with some interesting wildlife observations which included dragon flies, various beetles and a deer making a dash through the long grass.\nSummer gives us a good opportunity for getting out and about, to enjoy the scenery we are blessed with, but also highlights some of the concerns such as bird and invertebrate numbers which are rapidly declining.\nMore outdoor events are planned before summer’s end, so please keep an eye on our digital newsletters and the Events page on this website.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2025_03_21_winchester-greens-on-the-web/content_18.html": "‘keeping you informed all year round’\nsocial media\nWe like to keep residents of the Winchester District informed ALL YEAR ROUND and not just sudden surges in the weeks leading up to an election.\nHere is the full list of our social media platforms where you will find regular local news and activities…\nFollowing the results of the USA elections, a huge number of people left twitter and moved to Bluesky. The UK now has 2.8 million users. We started our page on 28th.November ’24 and numbers are gradually growing.\nLink: https://bsky.app/profile/wingreenparty.bsky.social\nWinchester Greens\nThis is our general facebook page which covers the whole of the Winchester City Council district.\nLink: https://www.facebook.com/winchestergreenparty/\nCentral Meon Valley Councillors\nRun by Green Councillor’s Suzanne White, Malcolm Wallace and Danny Lee this features their news and activities within the Ward and beyond.\nLink: https://www.facebook.com/meonvalleycouncillors/\nMeon Valley County Green Councillor Malcolm Wallace\nRun by Malcolm. The county electoral boundary varies to the rest of our domain, although some villages in the Central Meon Valley do overlap.\nLink: https://www.facebook.com/meonvalleygreenparty/\nOur Instagram page was started late 2022 and with followers up by 80% in the last six month’s it is proving to be more and more popular.\nLink: https://www.instagram.com/winchestergreenparty\nFor now, are continuing with this platform and watching the trends carefully.\nLink: https://x.com/wingreenparty/\nRun by Alex Ellis, this is a new social media platform to Winchester Greens and already proving to be popular. Link: https://www.tiktok.com/@winchester_green_party\nFinally of course, there’s our website. If it’s the first time you’ve visited, please go to the top of the page where you will find useful information links about us and some forthcoming events which may be of some interest.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_10_03_fund-raising-live-folk-evening-26th-september-2024/content_61.html": "Initiated by Kate Needham and organised by Rich Turner and Jo Harmer, we held a live music and dance folk evening featuring local artists at the Hyde Tavern in Winchester.\nJo Harmer writes..\nIt was a great night, so much skill and talent in the Hyde Tavern’s quirky and wonderful Cellar Bar. Each of the acts deserved to have had double the length they were given. Ilana Pleas opened with a range of songs from her musical theatre background: her voice is a force to be reckoned with! Andy Staples was next, really fabulous, what a beautiful mellow voice. Lovely Dylan numbers\nLouise Siddons and Linda Game played a mix of folk fiddle/keyboard and spoken word. Linda’s a top notch folk/orchestral musician, and with Louise calling, they run monthly inclusive ceilidhs in the Nutshell called Winqeilidh.\nCath Watkins and Nic Bradford (Southampton-based) played a set of fiddle/ guitar tunes and song. Jazz and blues influences over a core of local Hampshire folk material. Top of the bill were Provincials: Polly and Seb were just astonishing.\nA very big thank you to the Hyde Tavern for hosting the evening free of charge.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_allotment-group_19th-february-2024/content_28.html": "21st. February 2024\nMoving in our new Greenhouse\nClick all photos for full size\nHaving taken all the glass out, we then had had to pass it over the fence and then four people carried it with one on each corner. What the photo doesn’t show is the steep drop on the other side of the fence!\nThey had to wind their way through a maze of paths holding it aloft to avoid various trees, sheds and what not. It was quite a feat.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_pollution_page_2/content_84.html": "14 October 2022 / 10 August 2024 by richardcannon\nThe meeting was held at St Pauls Church hall, Winchester. Members were also able to attend on Zoom during which we were very pleased to host a presentation by the ‘Flight Free’ group. Our speaker was Anna Hughes, Director and initiator of this charity in 2019. Its aim is to change social habits around flying and […]\nRead more »\n12 July 2022 / 10 August 2024 by richardcannon\nWinchester City Council pass Green Party Cllr. Malcolm Wallace’s proposal At the Winchester City Council meeting earlier this week (06-July) Councillors voted to improve protections on our local rivers and waterways by taking account of the cumulative impact of pollution. In a first for Winchester, Green Councillor Malcolm Wallace proposed a motion to address this […]\n29 March 2022 / 10 August 2024 by richardcannon\nA letter from Chris Gilham Strategic Transport Economy, Transport and Environment Department Hampshire County Council The Castle Winchester SO23 8UD Dear Sir I am responding to the consultation of the Winchester Movement Strategy (WMS) on behalf of the Winchester Green Party. Hampshire County Council and Winchester City Council have declared a Climate emergency and all […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_03_24_business-support-for-small-businesses/content_98.html": "Danny Lee writes..\nThe Low Carbon Across the South and East programme provides a free business support programme in the South and East. LoCASE offers grants for businesses of up to £20,000 for installation of energy efficiency measures (up to 40% of the cost of your eligible project, with the remainder matched by your business), as well as training workshops and fully funded events.\nHowever, it is closing in June of this year, and the proposed cut-off date for new applications is March 31st. Approved projects need to be completed, evidenced and paid for by June 30th 2023 to be able to claim the grant funding. Projects which save on fuel or mileage are also accepted.\nDanny Lee is our Candidate for Central Meon Valley on Thursday 4th.May",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_healthy-living/content_20.html": "we asked local residents for views on the river park leisure centre’s future 30 March 2025 / 31 March 2025 by richardcannon it’s your views which matter ! Upon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news […] Read more » healthy living Leisure Lorraine Estelle Winchester City\nWinchester City Council pass motion to call for ban on disposable vapes 1 December 2023 / 10 August 2024 by richardcannon At yesterday’s Council meeting, Winchester City Council passed a motion calling for the government to ban the sale and manufacture of disposable vapes by 2024. The motion was based on a Local Government Association initiative. Cllr Malcolm Wallace, who supported the call for the ban, said, ‘Disposable vapes are an unsustainable product, so an outright ban is […] Read more » healthy living Malcolm Wallace\nWinchester Green Party questions council over harmful weed killers 2 June 2023 / 10 August 2024 by richardcannon As reported in the Hampshire Chronicle… Whilst walking through Winchester City Centre, Green Party Campaigner Richard Needham noticed that some council workers were using a well known weed killer which contains Glyphosates, banned by some councils across the country for harming human health and as a potential carcinogenic. Our co-chair Kate Needham instantly questioned the […] Read more » healthy living Richard Needham\nThe eco-shopping revolution in the heart of Winchester 10 March 2023 / 10 August 2024 by richardcannon Stan Evans writes On a recent visit to Winchester I was lucky enough to stumble across Earthian – Zero Waste Shop, right in the centre of the city on Parchment Street. With a passion for all things eco I had go inside to check out what this attractive shop has to offer. I was lucky […] Read more » healthy living\nElectric buses coming to Winchester 27 January 2023 / 10 August 2024 by richardcannon After some delay due to a global shortage of electric vehicles, Winchester City Council have announced that upon delivery of a first bus arriving shortly, a trial run will take place using the Park and Ride service this coming Spring. Winchester Green Party are dedicated to reduce all pollution in Winchester City and the surrounding […] Read more » healthy living Malcolm Wallace",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_richard-needham/content_33.html": "Elections 2024 green party votes winchester 9 July 2024 / 16 January 2025 by richardcannon For the first time Winchester District Green Party fielded a candidate in a General Election.Our candidate Lorraine Estelle commanded a good campaign by attending Hustings meetings in the area and election boards were placed in many locations around the city and a number in surrounding villages. Read more » Lorraine Estelle National Richard Needham\nCity Council by-election St. Michael’s 4th.july ’24 13 June 2024 / 10 August 2024 by richardcannon our green party candidate – richard needham Owing to the resignation of the sitting LibDem Councillor for St. Michael, a by-election has been called for on the same day as the General Election on Thursday 4th. July Richard writes.. I have lived in the heart of St Michael ward for almost 40 years, having first […] Read more » Richard Needham\nWinchester Green Party questions council over harmful weed killers 2 June 2023 / 10 August 2024 by richardcannon As reported in the Hampshire Chronicle… Whilst walking through Winchester City Centre, Green Party Campaigner Richard Needham noticed that some council workers were using a well known weed killer which contains Glyphosates, banned by some councils across the country for harming human health and as a potential carcinogenic. Our co-chair Kate Needham instantly questioned the […] Read more » healthy living Richard Needham",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_04_20_cllr-danny-lee-meets-veg-box/content_67.html": "LOCAL ENTERPRISES IN CENTRAL MEON VALLEY\nCouncillor Danny Lee campaigning in Hambledon for Suzanne White as the next Winchester City Green Party Councillor and Malcolm Wallace as the first Green Party County Councillor for Hampshire County.\nDuring campaigning he chatted to the fabulous Hampshire Veg Box Director Chris Huskins to hear first hand about the company’s aspirations to supply a great variety of seasonal fruit and vegetables, and artisan products.\nDanny said “ What an inspiring organisation working towards putting small-scale sustainable farming back at the heart of the food system we all depend on. We need to support more local companies like Veg Box”. https://shop.hampshirevegbox.co.uk/about",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_allotment-group_early-march-2024/content_55.html": "Early March 2024\nmore seeds are sown and Rhubarb Crumble in Autumn !\nSunday 3rd March\nWe continued to dig up clumps of grass and reestablish the shape of the beds. Julia worked on a wild flower patch while Cassie & Dave cleared space to plant a couple of raspberry canes and a clump of rhubarb. So, we now have the beginnings of a wildflower area and a fruit area! Lastly we planted out the broad beans which were strong healthy plants with a good root system.\nSunday 10th March\nToday was a lovely sunny day! Eddie cleared some space for 2 more rhubarb plants so we have a row of 3 now. We planted 4 rows of Pink Fir Apples potatoes in an area with lovely rich soil. There’d been bindweed so, we took out as much as possible. Will just have to wait and see…. We sowed beetroot, chard and globe artichokes. The salad is coming along nicely and it tastes delicious. Richard made a good start on preparing the area for replacing the green house. Does anyone have any 3×2 or 4×2 tantalised timber they’d be willing to donate please? We need a couple of lengths to make a stronger base. Eddie planted the elephant garlic by making a small row of holes in the layer of cardboard and planting through.\nAs we left someone kindly donated half a net of first early Pink Fir Apple seed potatoes.\nApparently, these are a very tasty variety!",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2025_05_03_by-election-results-and-count-in-photos/content_40.html": "winchester greens rubber stamping an even stronger presence in winchester !\nAfter the election and Count, there’s the little job of collecting circa. 100 Vote Green Boards….\nRichard Needham (right) with Andy Stables slowly filling up the Needham household’s back garden. Just the first of about five lots !",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_03_12_the-m3-jn9-debate-we-have-our-say/content_69.html": "Following a presentation about the plan for the M3 / J9 changes by Chris Gilham at our March Member’s meeting it became apparent that we needed to ensure the public are aware that applications to be an ‘interested party’ via the National Infrastructure Planning website needed to be completed before 2359hr. Monday 13th. March, we set up a Stand at the Buttercoss in Winchester city centre.\nIt was very noticeable that we did not have to approach people, passers by saw what it was about and showed a great interest with many using our QR code to get a link to the relevant National Highways page.\nHere are some comments made by the public..\n- Waste of money\n- Is it really that bad how it is?\n- Yet another HS2, will it stop half way and leave a mess for years?\n- (from a visually impaired person) We need our pavements sorted out\n- It’s not a priority when the rest of our roads need sorting out\n- More attention should be paid to cycle paths and their safety\n- Another disturbance of nature and wildlife\n- The Government want us to use our cars less ???\n- £200m being spent on this and bus services reduced, no incentive to use public transport",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_social-justice/content_75.html": "30 March 2025 / 31 March 2025 by richardcannon\nit’s your views which matter ! Upon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news […]\nRead more »\n3 December 2023 / 10 August 2024 by richardcannon\nHampshire Pension Fund manages over £9.6bn in assets, so where the fund invests really matters. Winchester Green Party have been one of main local organisations that have been petitioning the Fund to move away from investment in fossil fuels and, in September, several members picketed outside Hampshire County Council offices at a protest organised by […]\n4 August 2023 / 10 August 2024 by richardcannon\nThe Railway Delivery Group have recently announced they are proposing a huge closure of ticket offices around the country. To see more, go to https://www.raildeliverygroup.com/uk-rail-industry/customer-focused-reform/customer-focused-stations Below is our response to this. By following the above link, you are able to ‘have your say’ as individuals. Public consultation has been extended to 1st.September 2023. our response.. […]\nPlease find below our written response to the release of Hampshire County Council’s budget Consultation for 2024 to 2026. The full consultation documents can be found at the Hampshire County Council website HERE …….. 23rd July 2023 Dear Hampshire County Councillors, HAMPSHIRE COUNTY COUNCIL 2024-26 BUDGET CONSULTATION Winchester Green Party’s response to the consultation is […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_news_page_4/content_90.html": "7 May 2024 / 20 January 2025 by richardcannon\nThe County Council By-Election was only called at the last minute. This in turn meant a huge effort by our Volunteers to ensure the residents were well informed of our abilities by distributing leaflets and canvassing. With so many new homes being built in Whiteley, the task was a challenge, but we succeeded with time […]\nRead more »\n5 May 2024 / 16 January 2025 by richardcannon\nOur hard working Teams were out and about for a number of weeks before the election date. With such short notice for the vacant County County by-election, it meant our canvassers and leaflet distributors were extremely hard pressed to cover Central Meon Valley, Meon Valley as well as around Winchester city itself. Requests for ‘Vote […]\n4 May 2024 / 6 February 2025 by richardcannon\nCentral meon valley and Meon valley by-elections Councillors Danny Lee, Suzanne White and Malcolm Wallace Four years ago some thought the Green Party would never have representation in either the Winchester District Council or Hampshire County Council. Fast forward four years and we now have three District Councillors, one of which also a County Councillor […]\n22 April 2024 / 10 August 2024 by richardcannon\nOur Candidate, Cllr. Malcolm Wallace Malcolm was elected a Winchester City Council Councillor for the Central Meon Ward in 2022 and since then has become an established member of the Council and proven that a Green in the room really does make a difference. Here’s just a few things he has achieved in this time.. […]\n20 April 2024 / 10 August 2024 by richardcannon\nLOCAL ENTERPRISES IN CENTRAL MEON VALLEY Councillor Danny Lee campaigning in Hambledon for Suzanne White as the next Winchester City Green Party Councillor and Malcolm Wallace as the first Green Party County Councillor for Hampshire County. During campaigning he chatted to the fabulous Hampshire Veg Box Director Chris Huskins to hear first hand about the […]\n20 April 2024 / 9 August 2024 by richardcannon\nA great morning spent in Whiteley distributing leaflets and speaking to residents about the forthcoming two elections on Thursday 2nd.May; Winchester City Council and a Hampshire County Council by-election for Meon Valley. Ably supported by friends from the East Hampshire Green Party and Test Valley Greens, we managed to cover a large area in and […]\n9 April 2024 / 10 August 2024 by richardcannon\nYour Green Party Candidates Please scroll down the page to see your Ward Dave Westley Alresford & Itchen Valley David joined the Green Party with a view to influencing a better ecological localised approachwhich in plain terms means a thriving environment that allows nature to take its course andbenefit all the community. At the moment […]\n7 February 2024 / 10 August 2024 by richardcannon\nwhy this petition matters England’s rivers and seas are under threat due to the continuous pollution caused by water companies discharging sewage. This practice not only harms our precious aquatic ecosystems but also poses a significant risk to public health. According to the Environment Agency, in 2020 alone, untreated sewage was released into English waters […]\nCouncillor Danny Lee raised concerns at the recent Housing Committee about the absence of new affordable housing schemes in the eastern part of the Winchester City Council district area. A lack of affordable housing in rural areas risks creating social difficulties for the elderly but especially for the young who will move to the urban […]\n29 January 2024 / 10 August 2024 by richardcannon\nOn Wednesday 25th.January, Cllr.Malcolm Wallace spoke out at the Cabinet meeting on Winchester’s Car Parking and Access Improvement Program regarding expenditure In the past year there has been next to no progress on improving alternative travel options in the District, Cllr.Wallace used his statement to highlight that fact. To watch Cllr.Wallace’s statement, scroll through video […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2022_01_22_winchester-movement-strategy-proposal/content_79.html": "First impressions\nWinchester Movement Strategy in it’s 5th year of consultations and studies\nImagine the amount and effort that went into preparing studies after studies would have gone into real changes…\nBut here we are once again – another consultation that does not deliver the urgent changes that are required to offer alternatives to car traffic. Despite our frustrations we need to engage with this process.\nThe proposals are unlikley to achieve a significant reduction in traffic – the first of the 3 priorities of the Movement Strategy.\nPlease tell our local councils how disappointing and weak these proposals are. Your own personal input counts most but please try to remember that too much criticism may lead them to do nothing.\nPlease consider demanding an immediate:\n20mph speed limit on all roads within Winchester unless they are lined with safe cycle lanes and walking pavements without creating conflict between pedestrians and cyclists.\nWinACC has put lots of effort into working out a detailed response and it is worthwhile having a look at this: https://tinyurl.com/tyxh3dp5",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_countryside/content_6.html": "A walk around St.Clair’s Nature Reserve Soberton 18 July 2024 / 10 August 2024 by richardcannon Last week, in replacement of our monthly members zoom meeting, we went for a walk around St. Claire’s Nature Reserve in Soberton. The weather stayed good for us and the walk alongside the river was quite a treat with some interesting wildlife observations which included dragon flies, various beetles and a deer making a dash […] Read more » Countryside Soberton\nThe Restore Nature Now march, London 28 June 2024 / 7 February 2025 by richardcannon nature hasn’t a voice of it’s own – but we have Saturday 22nd.June was a day to remember, over 60,000 people turned up in London to march from Hyde Park to Parliament Square to ensure the newly elected Government know that time is running out.Nature is wonderful, but doesn’t have a voice of it’s own […] Read more » Countryside Farming and Agriculture Petitions Videos\nOil Drilling at Cheesefoot Farm 14 August 2023 / 10 August 2024 by richardcannon accelerating climate change ! Avington Oil Field taken from article at https://drillordrop.com/2023/07/13/south-downs-oil-field-to-restart-production/ Just recently the Prime Minister announced a raft of new oilfield drilling licences in the North Sea, which will fuel further climate destruction and do nothing to help tackle the cost-of-living crisis. The Intergovernmental Panel on Climate Change, the International Energy Agency and […] Read more » Countryside\nVisiting Rushmere Farm Hambledon 4 August 2023 / 10 August 2024 by richardcannon Rushmere Farm, Hambledon – the future of farming. A Winchester Green Party Walk and Talk. Sitting high in the hills above Hambledon in the Meon Valley something special is happening, a coming together of people and planet via a passionate environment friendly farming family, the Crossley’s. It was a pleasure to attend a really informative […] Read more » Countryside Farming and Agriculture\nGreening Campaign receives £0.5m boost from National Lottery Fund 22 May 2023 / 10 August 2024 by richardcannon Following a bid alongside Hampshire County Council, Hampshire & Isle of Wight Wildlife Trust and Southampton University, the Greening Campaign is to receive £495,000 from the National Lottery Funding. As many know, the Hambledon Greening Group has been very active since joining the campaign and just recently held another very successful Festival which attracted many […] Read more » Countryside Hambledon\nHolding Southern Water to account 6 March 2023 / 10 August 2024 by richardcannon Winchester City Council – Health and Environment Policy Committee – Wednesday 1 March 2023. Natural England and Southern Water at the Winchester City Council’s Health and Environment Policy Committee meeting on Wednesday 1 March 2023 provided a number of updates on a variety of aspects related to ‘the protection of our local rivers & waterways’. […] Read more » Countryside Danny Lee Malcolm Wallace\nCllr. Malcolm Wallace acts to prevent fracking 26 January 2023 / 10 August 2024 by richardcannon At the Winchester City Council meeting earlier this week, Councillors voted to:1) Oppose as a matter of council policy any initiatives to develop fracking for shale gas.2) To respond to the County Council’s consultation on the refreshed Minerals andWaste Plan stating our opposition the extraction of oil and gas, including by fracking. Cllr Wallace stated: […] Read more » Countryside Malcolm Wallace\nThe Protected Landscapes Programme 26 January 2023 / 10 August 2024 by richardcannon Funding available to support local farming communities and our environment. Local Green Party Councillor supports Defra’s Farming in Protected Landscapes programme. Article by Stan Evans Local Meon Valley based Green Party Councillor, Malcolm Wallace stated : ”I’d like to remind our friends in the farming and land management community that Defra’s, Farming in Protected Landscapes […] Read more » Countryside Farming and Agriculture\nVisiting the Soberton Down wilding Project 10 August 2022 / 10 August 2024 by richardcannon After an enjoyable, more informal meeting in July when we met for a walk at the Winnal Nature Reserve in Winchester followed by a meeting afterwards, it was decided that this month we would follow suit and visit the Wilding Project at Soberton Down. The beautiful hillside which features grasses and meadowland commands a wonderful […] Read more » Countryside Soberton\nPioneering Green Action to Protect our local Rivers and Waterways 12 July 2022 / 10 August 2024 by richardcannon Winchester City Council pass Green Party Cllr. Malcolm Wallace’s proposal At the Winchester City Council meeting earlier this week (06-July) Councillors voted to improve protections on our local rivers and waterways by taking account of the cumulative impact of pollution. In a first for Winchester, Green Councillor Malcolm Wallace proposed a motion to address this […] Read more » Countryside Malcolm Wallace",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2025_04_14_gaining-momentum-in-winchester-eastgate-and-colden-common-twyford-by-elections/content_34.html": "Both candidates along with their strong teams out and about..\nLorraine has been busy calling in on residents and very active in arranging ‘vote green’ boards to go into peoples front gardens. Lorraine say’s “the response has been great and many people have expressed their enthusiasm to vote for change.\nLiam has also been very busy calling on residents, giving his thoughts on some of the problems facing the local community. Being a keen cyclist, he is most concerned about safety. Like Lorraine, he say’s many people are wanting a new look to politics and will voite Green.\nWe have had a huge demand for our Vote Green boards around both Eastgate, Colden Common and Twyford.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_newtown/content_41.html": "Climate action for Newtown and Soberton joins the Winchester Climate Action Network 1 December 2023 / 10 August 2024 by richardcannon At a follow-up meeting to the recent Climate Café event, a group of Soberton and Newtown residents formed a new group. Climate Action for Newtown and Soberton (C.A.N.S), was born, with the main aim of reducing the carbon footprint of the parish. Looking at all the ideas suggested at the Climate Café, it was decided […] Read more » Newtown Soberton\nSoberton Newtown Climate Cafe a great success 22 October 2023 / 10 August 2024 by richardcannon Stan Evans writes.. A massive thanks go to SoberNewts members who took care of tea, coffee, and biscuit duties, the staff at Rookesbury Hall for running a great facility, Councillor Danny Lee for his input and for taking our messages back to our City Council, and Stu Mills from Winchester representing WinACC and Climate Action […] Read more » Danny Lee Newtown Soberton Suzanne White",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_videos/content_36.html": "The Restore Nature Now march, London 28 June 2024 / 7 February 2025 by richardcannon nature hasn’t a voice of it’s own – but we have Saturday 22nd.June was a day to remember, over 60,000 people turned up in London to march from Hyde Park to Parliament Square to ensure the newly elected Government know that time is running out.Nature is wonderful, but doesn’t have a voice of it’s own […] Read more » Countryside Farming and Agriculture Petitions Videos\nSuzanne White and Malcolm Wallace win elections and Greens make big progress in the City 4 May 2024 / 6 February 2025 by richardcannon Central meon valley and Meon valley by-elections Councillors Danny Lee, Suzanne White and Malcolm Wallace Four years ago some thought the Green Party would never have representation in either the Winchester District Council or Hampshire County Council. Fast forward four years and we now have three District Councillors, one of which also a County Councillor […] Read more » Central Meon Valley Malcolm Wallace Meon Valley Suzanne White Videos",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_06_04_winchester-hamble-valley-general-election-constituency-maps/content_32.html": "Following national constituency boundary changes, below are maps showing the new / revised Winchester and Hamble Valley areas.\nYou will see that some of the old Winchester boundary now comes under Hamble Valley. Click photos for larger size.\nwinchester…\nhamble valley…\n( Maps are open source from Ordnance Survey.. https://www.ordnancesurvey.co.uk/election-maps/gb/ )",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_05_04_suzanne-white-and-malcolm-wallace-win-elections-and-greens-make-big-progress-in-the-city/content_57.html": "Central meon valley and Meon valley by-elections\nCouncillors Danny Lee, Suzanne White and Malcolm Wallace\nFour years ago some thought the Green Party would never have representation in either the Winchester District Council or Hampshire County Council. Fast forward four years and we now have three District Councillors, one of which also a County Councillor !\nIn Central Meon Valley Suzanne became our third Councillor alongside Danny Lee and Malcolm Wallace. The votes were as follows\nWHITE Suzanne Emma Green Party 1717 – 52%\nGEMMELL Linda Local Conservatives 960 – 29%\nBODGER Eric Liberal Democrats 579 -17%\nHIRSCH Oliver Stephen Labour Party 80 – 2%\nMeanwhile, after a hard fought contest, Cllr. Malcolm Wallace won the County Council by-election last held by the Conservatives. He now becomes the first Green Councillor for Hampshire. The votes were as follows…\nMalcolm Wallace Green Party – 2083 – 36%\nVivian Achwal Liberal Democrat -1906 -33%\nNeil Bolton Conservatives 1630 – 28%\nOliver Stephen Hirsch The Labour Party – 199\nthe declarations..\nbig headway in city wards\nAfter huge requests for ‘Vote Green’ boards and many supporters willing to give their time to delivering leaflets, canvassing and having boards in their front garden, residents could see we’re a Party on a mission to make Winchester and it’s surrounding areas a better place to be. Two Wards, St.Luke (candidate Giles Gooding) and St.Bartholomew (candidate Lorraine Estelle) from being in third place at the last election, came in a very reputable second place.\nOur message is clear, ‘a Green in the room makes a difference’. It already has with two District Councillors who have achieved a lot in the last two years and with Suzanne joining them, things will get better.\nLeft, Giles Gooding – Right, Lorraine Estelle\nOf course, throughout the whole of Winchester District and Meon Valley, we could not have achieved what we have without huge help from our members, supporters, canvassers, leaflet distributors and residents who have requested having boards in their front gardens and windows.\nYou can see details on all our candidates HERE",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_01_27_electric-buses-coming-to-winchester/content_39.html": "After some delay due to a global shortage of electric vehicles, Winchester City Council have announced that upon delivery of a first bus arriving shortly, a trial run will take place using the Park and Ride service this coming Spring.\nWinchester Green Party are dedicated to reduce all pollution in Winchester City and the surrounding areas.\nOur Green Party Councillor, Malcolm Wallace told the Hampshire Chronicle..\n“Traffic is the largest source of greenhouse gas emissions in Winchester, with the latest data showing that transport makes up 57% of all CO2 emissions in the district.\nThe electric bus trial should be an exciting step towards decarbonising our public transport, not only helping us to reduce our carbon footprint but also improving local air quality”.\n“However, a lot more is needed going forward. In their draft Local Transport Plan, Hampshire County Council stated that national policies won’t get us far enough and a 10% reduction in car use is required between 2019 and 2030. Achieving this goal requires a coordinated response across all aspects of local transport (walking, cycling, trains and buses) to ensure that residents have improved options available for getting around. So, electric buses will be a step in the right direction, but there’s a long way to go”.\nThe Council thanked Stagecoach for their help in obtaining the trial bus from Sweden.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_about-us_recycle/content_35.html": "reducing waste and recycling\ncouncil collection\nGREEN BIN – clean paper, cardboard, food and drink cans, aerosols, plastic bottles without caps; NO OTHER PLASTIC\nBROWN BIN: garden waste only; currently a paid extra service. GLASS: monthly collection when crate supplied.\nGLASS: monthly collection when crate supplied.\nSMALLER ELECTRICAL GOODS/BATTERIES: bagged separately, placed on top of green or black bin. No light bulbs.\nBLACK BIN: household waste that is not recyclable – check for exceptions.\nat home\nFOOD WASTE: use a compost bin (eg ‘bokashi’ kitchen bin) or garden composter.\nother recycling\nTake to a recycling point: all recycling should be dry and clean. Some communities have cooperative schemes: consider starting or joining one.\nCOUNCIL RECYCLING CENTRES: keep up to date on what is recycled.\neg.. clean kitchen baking foil is accepted, light bulbs etc.\nSOFT PLASTIC/PACKAGING: many supermarkets are now recycling.\nHARD PLASTIC: Winchester is not yet recycling but Portsmouth Council operates collection points. Some garden centres recycle plant pots.\nFind (and book) your closest recycling centre in Hampshire…. CLICK HERE >>>\n___________________________________________________________________________________________",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_hambledon/content_38.html": "Greening Campaign receives £0.5m boost from National Lottery Fund 22 May 2023 / 10 August 2024 by richardcannon Following a bid alongside Hampshire County Council, Hampshire & Isle of Wight Wildlife Trust and Southampton University, the Greening Campaign is to receive £495,000 from the National Lottery Funding. As many know, the Hambledon Greening Group has been very active since joining the campaign and just recently held another very successful Festival which attracted many […] Read more » Countryside Hambledon\nHambledon Greening Festival 2023 15 May 2023 / 10 August 2024 by richardcannon Once again, the Hambledon Greening Group pulled off a fabulous Festival last Saturday 13th May. On a lovely sunny afternoon, crowds gathered to stroll around a diverse selection of Stands which included The Hampshire & Isle of Wight Wildlife Trust, The Woodland Trust, Energise South Downs, Waterlooville Hedgehog Rescue, The Sustainability Centre, an exhibition by […] Read more » Danny Lee Hambledon Malcolm Wallace",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_allotment-group_13th_february-2024/content_63.html": "13th.February 2024\nHard work and fun paying off !!\nThis week we were offered a free neighbouring greenhouse and all the contents. This turned out to be a treasure trove of useful tools, trays and a tin full of packets of seeds. Cassie, Dave Kate & Richard cleared the greenhouse and began to dismantle it.\nClick all photos for full size\nIt was a beautifully sunny day at the allotment. The sweet peas have started to come up along with the broadbeans and salad. Cassie and Dave cleared the huge clumps of grass and bits of plastic from some of the old beds and we dug up a few tough perennial weeds Max and Julia then covered the beds with cardboard and lovely compost which Max fetched in a wheelbarrow from one of the compost bins donated by a neighbour. After a tidy up it’s beginning to look good. We haven’t lost the plot, we’ve found it!",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_rivers/content_30.html": "30 March 2025 / 31 March 2025 by richardcannon\nit’s your views which matter ! Upon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news […]\nRead more »\n9 December 2024 / 16 January 2025 by richardcannon\nA message from Caroline Lucas.. Back in May, in my last few months as MP, I secured a parliamentary debate on nature and biodiversity loss. It was the dying days of Sunak’s government, and amidst the chaos and election fever, I wanted to focus attention on the upcoming nature summit in Colombia. Because nature is […]\n25 November 2024 / 26 November 2024 by richardcannon\nClick images to view full newsletters\n8 October 2024 / 8 October 2024 by richardcannon\nCLICK IMAGE TO READ IN FULL..\n10 September 2024 / 10 September 2024 by richardcannon\nA talk given on (and in) the River Meon at Meonstoke on Wednesday 4th.September 2024 by Chalk Streams expert Dr. Richard Osmond Kate Needham writes.. There was a lot more to river fly monitoring than I imagined. It was truly fascinating. Some creatures are more susceptible to pollution than others. So each type is given […]\n28 June 2024 / 7 February 2025 by richardcannon\nnature hasn’t a voice of it’s own – but we have Saturday 22nd.June was a day to remember, over 60,000 people turned up in London to march from Hyde Park to Parliament Square to ensure the newly elected Government know that time is running out.Nature is wonderful, but doesn’t have a voice of it’s own […]\n27 June 2024 / 10 August 2024 by richardcannon\nSunday morning dog walkers must have wondered why our three Councillors; Malcolm Wallace, Suzanne White and Danny Lee were paddling in the upper River Meon in Droxford. The answer is as follows..\n7 February 2024 / 10 August 2024 by richardcannon\nwhy this petition matters England’s rivers and seas are under threat due to the continuous pollution caused by water companies discharging sewage. This practice not only harms our precious aquatic ecosystems but also poses a significant risk to public health. According to the Environment Agency, in 2020 alone, untreated sewage was released into English waters […]\n21 November 2023 / 10 August 2024 by richardcannon\nGlobally there are just 210 classified as Chalk Streams and of those 160 are found in England. Here in Hampshire we can boast three; The Rivers Meon, Itchen and Test. Our Councillors Malcolm Wallace and Danny Lee, alongside the River Meon at Droxford With the Rivers Meon and Itchen flowing within the Winchester City Council […]\n6 March 2023 / 10 August 2024 by richardcannon\nWinchester City Council – Health and Environment Policy Committee – Wednesday 1 March 2023. Natural England and Southern Water at the Winchester City Council’s Health and Environment Policy Committee meeting on Wednesday 1 March 2023 provided a number of updates on a variety of aspects related to ‘the protection of our local rivers & waterways’. […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_01_26_cllr-malcolm-wallace-acts-to-prevent-fracking/content_15.html": "At the Winchester City Council meeting earlier this week, Councillors voted to:\n1) Oppose as a matter of council policy any initiatives to develop fracking for shale gas.\n2) To respond to the County Council’s consultation on the refreshed Minerals and\nWaste Plan stating our opposition the extraction of oil and gas, including by fracking.\nCllr Wallace stated: “The construction of new fossil fuel infrastructure and expanded reliance on fossil fuels exposes our communities to untenable risks to public health and safety at the local and global levels, whilst failing to provide relief to those struggling with fuel bills as the tiny contribution such activity would make to the world market would not affect prices.\nThe economic opportunities presented by a clean energy transition far outweigh the opportunities presented by an economy supported by expanding fossil fuel use and extraction. “Whilst the Minerals and Waste policy in Hampshire is set by the County Council, the motion ensures that a clear message is sent to both the Government and to Hampshire County Council that Winchester Council is committed to a just energy transition to a low carbon economy. Any proposal to support or allow fracking, or the extraction of oil or gas in any form, goes against Winchester City Council’s plan and the Council’s Climate Emergency declaration.”Cllr. Malcolm Wallace’s introduction to the Motion in full:\n“The motion before the Council today is two-fold. Firstly, to oppose as a matter of council policy any initiatives to develop fracking for shale gas. Secondly, to respond to the County Council’s consultation on the refreshed Minerals and Waste Plan stating our opposition to fracking and to the extraction of oil and gas.\nCurrent Government policy is for a moratorium (or temporary prohibition) on fracking. However, as we have seen over the past few months, the Government position in this areais fluid. Therefore, it is important that this Council confirms Winchester’s position.\nAs you are aware, fracking is a way of extracting gas or oil which is trapped inside rocks. To get the gas or oil out, the rock has to be fractured. A mixture of water, sand and chemicals is pumped down the well at very high pressure. This fractures the rock and, when the pressure is released, the gas or oil flows back up the well.\nClick to watch Malcolm presenting his Motion to the Council in full (youtube)\nThere are many risks surrounding fracking:\nFracking risks contaminating water supplies – In England, groundwater is used to supply a third of our drinking water. According to the British Geological Survey,\n“Groundwater may be potentially contaminated by extraction of shale gas both from the constituents of shale gas itself, from the formulation and deep injection of water containing a cocktail of additives used for hydraulic fracturing and from flowback water which may have a high content of saline formation water.”\nFracking poses risks to public heath – In the UK, 20 leading medical experts\nwrote to the British Medical Journal stating that “the arguments against fracking on\npublic health grounds are overwhelming”.\nFracking poses a risk to the local environment – The area of landscape disturbed\nby fracking is typically 8 to 11 times that of conventional gas drilling.\nA draft Government report states that “shale gas development may transform a previously pristine and quiet natural region, bringing increased industrialisation”.\nFracking does not lead to a jobs boom – The 6-year proposed fracking project in\nLancashire was anticipated to create just 11 jobs at each of the two sites, according to the fracking company’s application. This includes on-site, indirect supply chain and induced effects.\nFracking is unlikely to reduce energy bills – Even Lord Browne, the former\nchairman of fracking firm Cuadrilla, said that UK shale gas would not have a material impact on gas prices.\nFracking in the UK has triggered many small earthquakes – More than 120\ntremors were recorded during drilling at a Cuadrilla site in Blackpool, including one\nwhich lasted almost 100 hours.\nFinally, and most importantly, fracking is incompatible with tackling climate\nchange. And this is the point that ties to the second part of the motion regarding\nopposing oil and gas development in our area.\nPolicy 24 of the draft Minerals and Waste Plan states that: Oil and gas development will be supported subject to environmental and amenity considerations. Frankly this position (even with the caveats) is shocking.\nIn May 2019 the UK Government declared a Climate Emergency. In June 2019 Hampshire County Council declared a Climate Emergency. And yet both groups are still producingpolicies that are contrary to these declarations.\nLast summer, the High Court found the UK Government’s climate strategy unlawful as it doesn’t show how the UK’s legally-binding carbon budgets (our Net Zero commitment) will be met. Now we have Hampshire County Council carrying on with a business as normal approach, ignoring the basic requirements for decarbonising our economy.\nScientists agree that if we are to avoid dangerous levels of global warming, the majority of fossil fuel reserves need to stay in the ground. At the same time, the Government’s own net zero review that was published last week identified the massive opportunities to both the economy and to communities from switching to clean, green energy.\nThere is absolutely no justification for further oil and gas development, and it is time that policies are put in place to support the transition that is needed.\nI propose this motion to Council and hope you will support it.”",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_news_page_6/content_74.html": "15 August 2023 / 10 August 2024 by richardcannon\nWinchester District – The Climate Crisis: update on our local greenhouse gas (CHG) emissions and determined action! Evidence of climate breakdown is all around us and the UN Secretary-General recently said we are in an era of ‘climate boiling’. So, are we doing enough? You might think the June 2019 Climate Emergency declaration by Winchester […]\nRead more »\n14 August 2023 / 10 August 2024 by richardcannon\naccelerating climate change ! Avington Oil Field taken from article at https://drillordrop.com/2023/07/13/south-downs-oil-field-to-restart-production/ Just recently the Prime Minister announced a raft of new oilfield drilling licences in the North Sea, which will fuel further climate destruction and do nothing to help tackle the cost-of-living crisis. The Intergovernmental Panel on Climate Change, the International Energy Agency and […]\n4 August 2023 / 10 August 2024 by richardcannon\nRushmere Farm, Hambledon – the future of farming. A Winchester Green Party Walk and Talk. Sitting high in the hills above Hambledon in the Meon Valley something special is happening, a coming together of people and planet via a passionate environment friendly farming family, the Crossley’s. It was a pleasure to attend a really informative […]\nThe Railway Delivery Group have recently announced they are proposing a huge closure of ticket offices around the country. To see more, go to https://www.raildeliverygroup.com/uk-rail-industry/customer-focused-reform/customer-focused-stations Below is our response to this. By following the above link, you are able to ‘have your say’ as individuals. Public consultation has been extended to 1st.September 2023. our response.. […]\nPlease find below our written response to the release of Hampshire County Council’s budget Consultation for 2024 to 2026. The full consultation documents can be found at the Hampshire County Council website HERE …….. 23rd July 2023 Dear Hampshire County Councillors, HAMPSHIRE COUNTY COUNCIL 2024-26 BUDGET CONSULTATION Winchester Green Party’s response to the consultation is […]\n7 July 2023 / 10 August 2024 by richardcannon\ngreen coffee morning On Saturday 1st.July., Richard and Kate Needham’s garden was opened up for Members and Supporters to come along and enjoy chit chat, coffee and cakes. Donations, which amounted to just over £60, will go towards forthcoming election campaigns. walk and talk at winnall Replacing our normal monthly meeting, on Wednesday 5th.July., we […]\n9 June 2023 / 10 August 2024 by richardcannon\nFollowing the announcement that Caroline Lucas will not be re-standing as a candidate for parliament in the next general election, I’m sure you will all join us in thanking Caroline for her truly inspiring work. “Caroline’s impact on politics in this country cannot be overstated: she truly is a force of nature and has been […]\n2 June 2023 / 10 August 2024 by richardcannon\nAs reported in the Hampshire Chronicle… Whilst walking through Winchester City Centre, Green Party Campaigner Richard Needham noticed that some council workers were using a well known weed killer which contains Glyphosates, banned by some councils across the country for harming human health and as a potential carcinogenic. Our co-chair Kate Needham instantly questioned the […]\n22 May 2023 / 10 August 2024 by richardcannon\nFollowing a bid alongside Hampshire County Council, Hampshire & Isle of Wight Wildlife Trust and Southampton University, the Greening Campaign is to receive £495,000 from the National Lottery Funding. As many know, the Hambledon Greening Group has been very active since joining the campaign and just recently held another very successful Festival which attracted many […]\n15 May 2023 / 10 August 2024 by richardcannon\nOnce again, the Hambledon Greening Group pulled off a fabulous Festival last Saturday 13th May. On a lovely sunny afternoon, crowds gathered to stroll around a diverse selection of Stands which included The Hampshire & Isle of Wight Wildlife Trust, The Woodland Trust, Energise South Downs, Waterlooville Hedgehog Rescue, The Sustainability Centre, an exhibition by […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_08_04_hampshire-county-council-budget-consultation-2024-2026/content_60.html": "Please find below our written response to the release of Hampshire County Council’s budget Consultation for 2024 to 2026.\nThe full consultation documents can be found at the Hampshire County Council website HERE ……..\n23rd July 2023\nDear Hampshire County Councillors,\nHAMPSHIRE COUNTY COUNCIL 2024-26 BUDGET CONSULTATION\nWinchester Green Party’s response to the consultation is outlined in this letter. We note the parlous state of HCC’s\nfinances as a consequence of over a decade of austerity and budget cutting by the Conservative Government.\nThe Green Party supports a radical transformation of society for the benefit of all and for the planet. This budget is\nentirely focussed on economic growth and financial rectitude and does little to address or recognise the need to\nradically overhaul systems and structures in order to create economic, social and environmental wellbeing. External\ncosts resulting from the imposition of further draconian cuts are not reflected in this budget. Neither is there any\nattempt to reflect the value of natural capital or carbon accounting. On all of these bases we consider the budget\nprocess to be flawed.\nResponding specifically to each of your proposed measures:\n1. Lobbying\nWe strongly support sustained and effective lobbying. This should not be limited to lobbying the current\nconservative government (which has not listened and is the source of these problems) but should include opposition\nand cross party bodies; and working with the LGA to compel government to restore funding to enable society to\nfunction properly. We would also encourage HCC to lobby for an overhaul of the council tax system to make it\nprogressive depending on size and value per inhabitant.\n2. Using Council Reserves\nWe strongly support the use of Council reserves. These should be used now for gaps in the budget. The funds are for\nthe current population and should not be kept for future possible projects when core services are at risk. This is the\npriority source of income and should be the first port of call before any loss of service or reduction in\nquality/scope/scale.\nYour duty is to the residents of Hampshire now; beyond operational/insurance reserves, you should use the money\nyou have to fund the shortfall – this is the current populations entitlement, not that of future generations. It is\niniquitous to hold on to multi-million pound reserves while implementing measures which will cause deterioration of\nthe quality of life of Hampshire residents.\nYou have excluded transport capital projects from this consultation. We strongly support scrapping these projects.\nJust a year ago we found reference to the following transport project :\nApproves an increase in the scheme value for the M27 Junction 9 project within the Universal Services capital\nprogramme of £1.325m from £23.1m to £24.425m to be funded from a combination of developer contributions\n(£0.725m) and the corporate capital inflation risk reserve (up to £0.6m) pending the conclusion of funding discussions\nwith National Highways.\nThe Climate Change Committee 2022 Progress report recommended that the Department for Transport and National\nHighways must “rigorously assess the emissions impacts of [road-building] plans and thoroughly consider alternative\napproaches”. In the light of this and other clear evidence against road building in a climate emergency, this scheme,\nand other capital transport projects, should be cancelled, releasing much needed capital funds for plugging gaps and\nfor public transport projects instead.\n3. Generating income from services\nWe support the generation of income from services, if this is possible without prejudicing providing services to\nresidents.\n4. Introducing and increasing costs\nWe are strongly opposed to introducing and increasing costs for existing services, with the exception of parking –\nparking charges should be increased in all cases in order to encourage a reduction in car use, which is essential for\ncarbon reduction. Parking income should be used to give people who live outside Winchester an alternative to use\nthe car, better bus and cycle infrastructure.\nWe would urge you to Introduce local pollution and congestion taxes (e.g. ULEZ style charges for M3, road tolls etc)\nas a way of generating income but more importantly to reduce air pollution, curb the use of cars and reduce\ncongestion.\nParking charges and road-use tax of whatever form could move the subsidy from road freight and private cars (i.e.\nthe externalities usually reckoned at about three times the total tax and duty take from road users) to cross-\nsubsidise efficient public transport and move it from a vicious circle of decline to a virtual circle of growth.\n5. Reducing services\nWe strongly oppose any reduction in service. Replacing paid workers with volunteers is no way to run adult social\ncare services. Absolutely no further cuts to bus services or to library services which have both been devastated over\nthe past 10 years. School Crossing Patrols must not be cut – this will deter active travel and further endanger\nchildren.\n6. Increase Council Tax\nHaving the second lowest council tax in England in one of the most affluent areas does not seem right. If the\npopulation of Hampshire is relatively wealthier, it can afford to pay more council tax.\nWe support an increase over 4.99% with a referendum; and an encouragement to increase council tax charges to the\nwealthiest where possible.\nWhilst this will impact everyone, there are a number of discounts & exemptions in place for vulnerable residents.\nWe would also support the introduction of a 100% premium charge for second homes/holiday homes from April\n2025.\nNo mention is made in the consultation of increasing business rates – these too should be increased for medium and\nlarge businesses located in retail parks, out of town developments, supermarkets and other large complexes\naccessible only by car.\n7. Change structure to 1 tier\nRecognising the political difficulties of achieving this, we would recommend that efficiencies and sharing of\nresources through informal and collaborative relationships be explored without the structural change which seems a\nlong way off happening. It is important that decisions continue to be made at the closest practical level to those\naffected by them.\nOn behalf of Winchester Green Party\nKate Needham – Co-Chair\nMax Priesemann – Co-Chair",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_10_22_soberton-newtown-climate-cafe-a-great-success/content_58.html": "Stan Evans writes..\nA massive thanks go to SoberNewts members who took care of tea, coffee, and biscuit duties, the staff at Rookesbury Hall for running a great facility, Councillor Danny Lee for his input and for taking our messages back to our City Council, and Stu Mills from Winchester representing WinACC and Climate Action Newtworks, who gave us an opening talk and of course, to all those who attended.\nIt was a wonderful, nicely-noisy, thoughtful, creative, enthusiastic, and productive meeting.\nWe enjoyed a really good turnout, almost everyone stayed for the full two hours. Many local residents obviously care about climate related issues and opportunities right here on our doorstep.\nThe hall had discussion tables representing different subject areas such as Transport, Waste, Recycling, Energy, and Food. We rotated around the hall and spent time at each table. Feedback was captured on table sheets, Post-It notes, then tokens in voting jars to identify the groups priorities.\nCouncillor Danny Lee with Suzanne White (click photos for full size}\nThere is no shortage of really good experience in our villages, we have a number of quiet experts as our neighbours, many have valuable personal experience on subjects ranging from electric cars, food cooking and locally sourcing, to improving their heating systems. Those experiences were happily shared, thoughts exchanged and advice ideas for the future offered.\nThe one word I’d describe the meeting is ‘positive!’. It was a pleasure to listen-in to what people had to say and hear their thoughts on how together we might make things better for all of us.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_12_02_november-updates-from-our-greens-in-parliament/content_59.html": "Carla Denyer MP\nCarla proposed and spoke in favour of several amendments to the Renters’ Rights Bill, including in support of rent controls, as a member of the committee looking at the legislation in detail.\nShe and Siân have also tabled an Early Day Motion in support of funding a 4 Day Working Week pilot trial by local authorities, which you can see here. Carla also asked a written question about better support for trans children.\nEllie Chowns MP\nEllie asked the Prime Minister to use his influence to push for an ambitious climate finance agreement at COP29, to match the levels of support identified by countries in the global South and to ensure funding would be delivered in the form of grants, not loans – see here.\nShe has also tabled two Early Day Motions, calling on the government to exempt both charities and not for profit social care providers from increased employer NI contributions.\nSiân Berry MP\nSiân spoke in a debate about funding for youth services, to highlight the urgent need to fund the creation of new permanent youth worker posts.\nAnd she spoke during Parliament’s debate to mark Black History Month, including about redress and action on reparations for the transatlantic trade in trafficked and enslaved Africans, and about institutionalised racism in the justice system. You can read her speech here.\nAdrian Ramsay MP\nAdrian has been standing up for his constituents on a wide range of topics this month, including setting out for the Minister the impact that the loss of dentists has on rural areas, highlighting how villages in Waveney Valley are struggling with poor broadband speeds, and speaking during a debate about flood preparedness. His contribution to the latter focused on nature based solutions in particular and can be read in full here.\nBaroness Jenny Jones\nJenny put amendments on the duties of the water regulator and on water companies using nature based solutions to deal with sewage and flooding. Both of these amendments led to the government responding with their own versions and it is expected that these will become law. Thanks to pressure in the House of Lords and from campaign groups Ofwat will now have a duty to protect the environment.\nJenny faced the united opposition of Labour and Conservative benches when she proposed that Ministers must consider public ownership as an option if water companies fail. She also tried to stop water bills rising in order to bailout failing private water companies and to bring water companies into Special Administration if they failed to meet minimum environmental standards.\nOur Green Peers supported the government legislation to take the railways back into public ownership, and to set up GB Energy. Jenny also supported a Conservative amendment ensuring that Salmon farms on Crown Estate properties meet minimum environmental standards.\nBaroness Natalie Bennet\nNatalie has spent a lot of the past month hosting events in parliament, which gives scientists, NGOs and campaigners the crucial access to MPs, Peers, officials, and journalists. In the past month Natalie has hosted:\n- The Green Economics Institute, celebrating 20 years of work to create a global network of intelligent and caring voices for social, environmental and economics justice and creating a multidisciplinary academic narrative of green economics! Speakers included Miriam Kennet, Anjikwi Mshelbwalla, Bianca Madison-Vuleta, and Gwendoline Delbos-Corfield.\n- A roundtable on Accelerating Human-Specific Technologies on behalf of Animal Free Research UK brought together leading experts in human-specific technologies and was attended by several MPs. The event included a call for Herbie’s Law to enable the phase out of animal testing in medical research.\n- A meeting of experts on Bovine TB Policy acknowledging that the science behind the badger cull is deeply and fatally flawed and has been a very costly distraction to the primary control effort needed – biosecurity to control this cattle disease.\nNatalie has also secured a debate in the Lords about Anaesthesia Associates and Physician Associates.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_01_29_cllr-malcolm-wallace-speaks-out-at-city-council-cabinet-meeting-on-greenwashing/content_88.html": "On Wednesday 25th.January, Cllr.Malcolm Wallace spoke out at the Cabinet meeting on Winchester’s Car Parking and Access Improvement Program regarding expenditure\nIn the past year there has been next to no progress on improving alternative travel options in the District, Cllr.Wallace used his statement to highlight that fact.\nTo watch Cllr.Wallace’s statement, scroll through video to 38mins.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_allotment-group/content_44.html": "Welcome to our Allotment Diaries\nWith Green Party members and supporters in mind, this January we acquired an allotment site off the Worthy Road in Winchester.\nThe photographs below are how we found it when first visiting on Sunday 14th.January 2024.\nBy the second week about 10 people have come along to see what’s happening and finding out how they can join in ‘the fun’ of growing vegetables and fruit plus of course to socialize with likeminded people.\nNew entries to the diary will be shown in the right hand column, so please pay us a visit to see how we’re getting on.\nPlease feel free to join in. To do so, please email: contact@winchester.greenparty.org.uk and mark it for the attention of Kate Needham",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_news_page_9/content_96.html": "1 November 2022 / 30 May 2024 by richardcannon\nOur Stand at the Hampshire Youth Parliament meeting in Winchester Whilst visiting family in Yorkshire, Kate and Richard Needham helped out with a Fracking demonstration. Above we see Kate speaking to BBC Local Television Richard Needham proudly displays his huge owl. A mission indeed. Max Priesemann leading the way at the mass ‘Cycle Winchester’ day. […]\nRead more »\n14 October 2022 / 10 August 2024 by richardcannon\nThe meeting was held at St Pauls Church hall, Winchester. Members were also able to attend on Zoom during which we were very pleased to host a presentation by the ‘Flight Free’ group. Our speaker was Anna Hughes, Director and initiator of this charity in 2019. Its aim is to change social habits around flying and […]\n11 August 2022 / 10 August 2024 by richardcannon\nA published letter to the Hampshire Chronicle A Firm grip on climate emergency Last week, on the same day that the temperature in the UK hit a record high, the High Court found the UK Governments climate strategy unlawful as it doesn’t show how the UK’s legally-binding carbon budgets (our net zero commitment) will be […]\n10 August 2022 / 10 August 2024 by richardcannon\nAfter an enjoyable, more informal meeting in July when we met for a walk at the Winnal Nature Reserve in Winchester followed by a meeting afterwards, it was decided that this month we would follow suit and visit the Wilding Project at Soberton Down. The beautiful hillside which features grasses and meadowland commands a wonderful […]\n12 July 2022 / 10 August 2024 by richardcannon\nWinchester City Council pass Green Party Cllr. Malcolm Wallace’s proposal At the Winchester City Council meeting earlier this week (06-July) Councillors voted to improve protections on our local rivers and waterways by taking account of the cumulative impact of pollution. In a first for Winchester, Green Councillor Malcolm Wallace proposed a motion to address this […]\n10 May 2022 / 10 August 2024 by richardcannon\nMalcolm Wallace elected as Councillor for Central Meon Valley On the 5th. of May 2022, Voters in the Central Meon Valley Ward elected Malcolm Wallace to become Winchester’s first ever Green Party Councillor. The result was as follows.. Malcolm Wallace (Green) – 1,955 (55.49%) Linda Gemmell (Conservative) – 1,203 (34.14%) Gregory Joseph (LibDems) – 294 […]\n29 March 2022 / 10 August 2024 by richardcannon\nA letter from Chris Gilham Strategic Transport Economy, Transport and Environment Department Hampshire County Council The Castle Winchester SO23 8UD Dear Sir I am responding to the consultation of the Winchester Movement Strategy (WMS) on behalf of the Winchester Green Party. Hampshire County Council and Winchester City Council have declared a Climate emergency and all […]\n10 February 2022 / 10 August 2024 by richardcannon\nCongratulations to Winchester Green Party Campaigner Malcolm Wallace and Anna Younger on being elected co-Chair of the South Eastern Green Party. Below is their remit and we have every confidence that both will represent us in an efficient and poisitive way. 1. The Chair of the Confederation shall chair SE Meetings or arrange for such […]\n22 January 2022 / 10 August 2024 by richardcannon\nFirst impressions Winchester Movement Strategy in it’s 5th year of consultations and studies Imagine the amount and effort that went into preparing studies after studies would have gone into real changes… But here we are once again – another consultation that does not deliver the urgent changes that are required to offer alternatives to car […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_events/content_9.html": "may 2025\nWednesday 7th. May\nOpen Meeting (for members and non-members) – 7.30pm -on Zoom\n‘A presentation for ‘BUY BACK BUSHFIELD’\nThis campaign’s mission is to ensure that Bushfield Camp remains a thriving haven for wildlife and a cherished green space for our community. They aim to acquire Bushfield Camp from the Church Commissioners and establish it as a permanent nature reserve, safeguarding the site as a community asset for future generations.\nAt this meeting, you’ll:\nHave the opportunity to ask Ben and Bridget your questions about the Buy Back Bushfield campaign?\nGain insights into why Bushfield Camp is under threat and what its future might be.\nHear how they’ve established a Community Interest Company and nominated Bushfield Camp to become an Asset of Community Value.\nFor non members who would like to attend on zoom, please email contact@winchester.greenparty.org.uk and we’ll send you the link\napril 2025\nWednesday 2nd.April ’25\nOpen Meeting – 7.30pm -on Zoom\n‘Gaza in Crisis: Exploring the Roots and Realities of a Humanitarian Catastrophe’\nJoin us for our next Open Meeting, where we’re excited to welcome Liam Bailey-Morgan (a long-standing Green Party member) has worked in the humanitarian and international development sectors for 16 years, seven of which were spent living, working and travelling in the Arabic speaking world, including the Occupied Palestinian Territories which he has visited on numerous occasions. He is keen to raise further awareness of the scale of Israel’s genocidal assault on Palestinians in Gaza, the humanitarian situation on the ground, and why we should be proud of the Green Party’s stance in the face of the UK government’s complicity. Liam will endeavour to make the presentation accessible to those who know little to nothing about the history of the conflict as his main aim is to generate interest in the subject.\nIf are not a member and would like to come along, please email contact@winchester.greenparty.org.uk for zoom login details.\nSaturday 12th. April\nThe Repair Cafe, Winchester\nBadger Farm Community Centre 10.00am -1.30pm\nSaturday 26th.April\nCYCLE WINCHESTER – MASS RIDE\nVarious points around Winchester\nClick here to read full details on the Cycle Winchester website\nPrevious dates\nmarch 2025\nSaturday 1st.March ’25\n‘GREEN CHAT’\nat Projects Kitchen and Store, 6.Middle Brook Street, Winchester SO32 88Q – 9.30am – 11.00am.\nCome along and meet, chat and socialize with other green minded people. Always enjoyable and open to all.\nWednesday 5th. March ’25\nOpen Meeting – 7.30pm -on Zoom\nJoin us for our next Open Meeting, where we’re excited to welcome Leonie Nimmo, Executive Director of GM Freeze. GM Freeze works to promote a food system that is responsible, fair, and sustainable, raising awareness of the risks associated with genetic modification (GM) and advocating for biodiversity over GM monocultures.\nIf are not a member and would like to come along, please email contact@winchester.greenparty for zoom login details.\nSaturday 8th. March\nThe Repair Cafe, Winchester\nBadger Farm Community Centre 10.00am -13.30pm\nfebruary 2025\nSaturday 1st.February ’25\n‘GREEN CHAT’\nat Projects Kitchen and Store, 6.Middle Brook Street, Winchester SO32 88Q 9.30am – 11.00am.\nCome along and meet, chat and socialize with other green minded people. Always enjoyable and open to all.\nWednesday 5th. February ’25\nOpen Meeting – 7.30pm -on Zoom\nAnother of our popular open meetings. This time we have Andy Key from ‘Cycle Winchester speaking on ‘Winchester – a better way to Bike’ and the environmental benefits of cycling.\nIf are not a member and would like to come along, please email contact@winchester.greenparty for zoom login details.\nSaturday 8th. February\nThe Repair Cafe, Winchester\nBadger Farm Community Centre 10 -12.30pm\njanuary 2025\nWednesday 8th.January – 7.30pm\nWinchester Greens Annual General Meeting\nAll members should have received full details in our digital newsletter. Should you have not received and wish to attend, please email contact@winchester.greenparty.org.uk for the ZOOM LINK\nSaturday 11th. January\nThe Repair Cafe, Winchester\nBadger Farm Community Centre 10 -12.30pm\nSaturday 25th. January\nSustainable Waltham Chase – ‘Energise South Downs’\nSwanmore Village Hall 10am -12.30pm\nA workshop to explore the production of community energy. ‘Energise South Downs’ is a non-profit group which supports projects to generate renewable power in the National Park. How might Swanmore, Shedfield and Waltham Chase power its community using locally produced renewable energy? Tickets can be purchased through Sustainable Waltham Chase website here.. https://swacs.co.uk/event/future-energy-landscapes-workshop\nTuesday 28th. January\nCouncillor Surgery – Wilfred’s Cafe, Droxford 10.00 – 11.30am\nCome along and meet your local Councillors Malcolm Wallace, Suzanne White and Danny Lee to talk about the local issues that matter to you",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley/content_1.html": "The recent boundary changes have meant that Whiteley and Shedfield, currently under Winchester, are now in the new Hamble Valley constituency (see maps on previous post).\nAfter the formal selection for a candidate, Kate Needham, our Winchester Co-Chair and candidate for Whiteley and Shedfield in the City elections will be standing.\nKate writes..\nWe are in a climate and biodiversity emergency. Local services have been cut and we have lost so much. I worry about what the future will be like for my grandchildren. I would like them to be able to paddle in the sea and local streams without fear of becoming sick. I’d like them to breathe cleaner air and be surrounded by more green spaces and nature.\nTo be able to cycle more safely and to be able to afford to live here when they are older.\nWe need to vote more greens into positions of power and influence in order to take action now for a greener, fairer world and a future we can all look forward to.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2022_05_10_historic-day-winchester-greens/content_53.html": "Malcolm Wallace elected as Councillor for Central Meon Valley\nOn the 5th. of May 2022, Voters in the Central Meon Valley Ward elected Malcolm Wallace to become Winchester’s first ever Green Party Councillor.\nThe result was as follows..\nMalcolm Wallace (Green) – 1,955 (55.49%)\nLinda Gemmell (Conservative) – 1,203 (34.14%)\nGregory Joseph (LibDems) – 294 (8.34%)\nPatricia Harvey (Labour) – 71 (2.00%)\nAll our Candidates for 2022\nTo see the Election’s full results, go to the Winchester City Council page HERE",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2023_01_31_out-and-about-january-2023/content_78.html": "Polly, Kate, Richard and Danny meet up for a walk around Corhampton\nRupert Pitt and Kate Needham attending the Bushfield Camp consultation.\nDanny Lee visits Catherine Tuffrey in Waltham Chase to discuss roof insulation\nMalcolm puts his motion to the Council to legally ensure that fracking will not be allowed in the Winchester District. Click here to see the Motion on YouTube\nLinda, Kate and Richard enjoying a break while delivering New Year Cards in Upper and Lower Upham\nLeft, Cllr. Malcolm Wallace with Zack Polanski at the South East Greens AGM. Right, Malcolm and Danny Lee attended the Council meeting where Danny gave a talk in reference to the Climate Emergency Decision Day.\nA great Green Chat morning at the Project, Store and Kitchen earlier this month\nDanny Lee and Polly Parry visited Meonstoke Village Stores to learn about the popular fresh free range milk facility.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_leisure/content_16.html": "we asked local residents for views on the river park leisure centre’s future 30 March 2025 / 31 March 2025 by richardcannon it’s your views which matter ! Upon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news […] Read more » healthy living Leisure Lorraine Estelle Winchester City",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2025_03_05_green-motion-commits-council-to-explore-solar-for-council-housing/content_31.html": "At a recent City Council meeting, supported by Cllr. Suzanne White, Cllr. Malcolm Wallace raised a motion on the important issue of solar panels being installed on Council Housing.\nMalcolm stated “The Council must seize the opportunity provided by the development of more efficient, cost effective technologies as well as by the innovative solutions and business models offered by local companies that are tailored to the needs of councils’ housing….\nAs we have heard in the debate, these schemes are not without risks and challenges, in terms of upfront costs and ensuring equity of benefit across the tenant base for example. However, a feasibility study of the current market models will investigate what viable, practical options are available for Councils and is therefore worth exploring.\nIt is noted that the council’s retrofit programme will now include the possible options of solar PV and battery storage to be considered alongside the fabric improvements to the building to raise the energy performance ratings. Here is an opportunity to investigate how the council could scale up and crucially speed up this process of\ndecarbonisation of housing. By outsourcing to one of the local companies who are now running these schemes, there is very little extra staffing resource required. It could also have the added benefit of stimulating green business in our local economy.\nRead the Public Document pack HERE\nIn supporting this motion, we are showing leadership in making a very strong commitment to further reducing carbon and providing housing fit for the future. In the face of this uncertainty surrounding future local\ngovernment arrangements, we will send a clear message to council staff, residents and neighbouring authorities about our ambition to achieve the best possible housing for our tenants within any future combined unitary\nauthority.And so what about the tenants? From attending Housing committee meetings, it is notable how the council’s housing department put theneeds of our tenants at the heart of their decisions.\nThis motion gives usan opportunity to explore how solar panels could unlock further benefits for tenants- lower energy bills in the face of yet more price increases, more comfortable, healthy housing fit for the future, energy resilience in increasingly turbulent times.\nI am grateful to Cllr Wallace for his work over many months researching these schemes and to the officers and the housing portfolio holder who\ngave up their time to discuss and help shape the motion you are presented with. A truly collaborative effort which I hope you feel you can support.\nThank you.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_denmead/content_17.html": "winchester action on the climate crisis – denmead community centre 1 March 2025 / 18 March 2025 by richardcannon On the 26th.February the trustees of Denmead Community Centre welcomed visitors from other community buildings around the district. Winchester Green Party was represented by Councillor Suzanne White They shared their experience of raising funds and arranging the installation of solar panels on their building. Stu Mills, Project Manager for WinACC also gave a presentation about […] Read more » CLIMATE-JUSTICE Denmead Suzanne White",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_11_25_meon-valley-whiteley-shedfield-newsletters-nov-24/content_7.html": "Skip to content\nSkip to footer\nWinchester\nMenu\nNews\nAbout us\nAbout us\nHere to help\nGreen Thought Archives\nReducing waste and recycling\nOur Allotment Group\nPeople\nGet Involved\nNewsletters\nContact\nEvents\nJoin\nDonate\nJoin\nDonate\nMenu\nMeon Valley, Whiteley & Shedfield Newsletters, Nov ’24\nHome\nClimate\nCounty Council\nHousing\nNews\nRivers\nTransport\nWinchester City Council\nMeon Valley, Whiteley & Shedfield Newsletters, Nov ’24\n25 November 2024\n/\n26 November 2024\nby\nrichardcannon\nClick images to view full newsletters\nTo top",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_transport/content_46.html": "25 November 2024 / 26 November 2024 by richardcannon\nClick images to view full newsletters\nRead more »\n29 January 2024 / 10 August 2024 by richardcannon\nOn Wednesday 25th.January, Cllr.Malcolm Wallace spoke out at the Cabinet meeting on Winchester’s Car Parking and Access Improvement Program regarding expenditure In the past year there has been next to no progress on improving alternative travel options in the District, Cllr.Wallace used his statement to highlight that fact. To watch Cllr.Wallace’s statement, scroll through video […]\n8 January 2024 / 10 August 2024 by richardcannon\nReducing traffic for a better environment After the formalities and reports by Committee Role Players at our Annual General Meeting on the 3rd.January, we were delighted to welcome Emily Kerr, Oxford City Councillor for the St.Mary’s Ward who gave a very detailed and positive presentation on ‘Active Travel’. CLICK TO VIEW PRESENTATION You will see […]\n15 August 2023 / 10 August 2024 by richardcannon\nWinchester District – The Climate Crisis: update on our local greenhouse gas (CHG) emissions and determined action! Evidence of climate breakdown is all around us and the UN Secretary-General recently said we are in an era of ‘climate boiling’. So, are we doing enough? You might think the June 2019 Climate Emergency declaration by Winchester […]\n4 August 2023 / 10 August 2024 by richardcannon\nThe Railway Delivery Group have recently announced they are proposing a huge closure of ticket offices around the country. To see more, go to https://www.raildeliverygroup.com/uk-rail-industry/customer-focused-reform/customer-focused-stations Below is our response to this. By following the above link, you are able to ‘have your say’ as individuals. Public consultation has been extended to 1st.September 2023. our response.. […]\n12 March 2023 / 10 August 2024 by richardcannon\nFollowing a presentation about the plan for the M3 / J9 changes by Chris Gilham at our March Member’s meeting it became apparent that we needed to ensure the public are aware that applications to be an ‘interested party’ via the National Infrastructure Planning website needed to be completed before 2359hr. Monday 13th. March, we […]\n27 January 2023 / 10 August 2024 by richardcannon\nAfter some delay due to a global shortage of electric vehicles, Winchester City Council have announced that upon delivery of a first bus arriving shortly, a trial run will take place using the Park and Ride service this coming Spring. Winchester Green Party are dedicated to reduce all pollution in Winchester City and the surrounding […]\n10 January 2023 / 10 August 2024 by richardcannon\nmax priesemann writes.. A single bus ticket price cap of £2 is very welcome! Unfortunately only until End of March. End of 2022 a Stagecoach Single ticket from Winchester to places like West Meon, Cheriton, Arlesford or Romsey cost £5.90. A Bluestar Single between Southampton and Winchester cost as much a £7. From 1st of […]\n14 October 2022 / 10 August 2024 by richardcannon\nThe meeting was held at St Pauls Church hall, Winchester. Members were also able to attend on Zoom during which we were very pleased to host a presentation by the ‘Flight Free’ group. Our speaker was Anna Hughes, Director and initiator of this charity in 2019. Its aim is to change social habits around flying and […]\n29 March 2022 / 10 August 2024 by richardcannon\nA letter from Chris Gilham Strategic Transport Economy, Transport and Environment Department Hampshire County Council The Castle Winchester SO23 8UD Dear Sir I am responding to the consultation of the Winchester Movement Strategy (WMS) on behalf of the Winchester Green Party. Hampshire County Council and Winchester City Council have declared a Climate emergency and all […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_county-council/content_26.html": "3 May 2025 / 3 May 2025 by richardcannon\nwinchester greens rubber stamping an even stronger presence in winchester ! After the election and Count, there’s the little job of collecting circa. 100 Vote Green Boards…. Richard Needham (right) with Andy Stables slowly filling up the Needham household’s back garden. Just the first of about five lots !\nRead more »\n30 March 2025 / 31 March 2025 by richardcannon\nit’s your views which matter ! Upon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news […]\n2 February 2025 / 7 February 2025 by richardcannon\nDelivering new year cards Our non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places. In the Winchester District Wards a huge […]\n18 December 2024 / 16 January 2025 by richardcannon\nThe National Green Party has voiced strong criticism of the government’s White Paper on local government reorganization, arguing that the proposals risk weakening local democracy rather than strengthening it. The reforms prioritize centralized “super-councils” and regional mayoral offices, pulling power further away from local communities.Local councils play a vital role in driving meaningful change on […]\n25 November 2024 / 26 November 2024 by richardcannon\nClick images to view full newsletters\n10 June 2024 / 10 August 2024 by richardcannon\nThe recent boundary changes have meant that Whiteley and Shedfield, currently under Winchester, are now in the new Hamble Valley constituency (see maps on previous post). After the formal selection for a candidate, Kate Needham, our Winchester Co-Chair and candidate for Whiteley and Shedfield in the City elections will be standing. Kate writes.. We are […]\n5 May 2024 / 16 January 2025 by richardcannon\nOur hard working Teams were out and about for a number of weeks before the election date. With such short notice for the vacant County County by-election, it meant our canvassers and leaflet distributors were extremely hard pressed to cover Central Meon Valley, Meon Valley as well as around Winchester city itself. Requests for ‘Vote […]\n4 May 2024 / 6 February 2025 by richardcannon\nCentral meon valley and Meon valley by-elections Councillors Danny Lee, Suzanne White and Malcolm Wallace Four years ago some thought the Green Party would never have representation in either the Winchester District Council or Hampshire County Council. Fast forward four years and we now have three District Councillors, one of which also a County Councillor […]\n22 April 2024 / 10 August 2024 by richardcannon\nOur Candidate, Cllr. Malcolm Wallace Malcolm was elected a Winchester City Council Councillor for the Central Meon Ward in 2022 and since then has become an established member of the Council and proven that a Green in the room really does make a difference. Here’s just a few things he has achieved in this time.. […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_10_03_hampshire-county-council-bishops-waltham-by-election/content_13.html": "Your green party candidate, Alex Ellis\nThe current County councillor for Bishops Waltham district has stepped down triggering a ‘snap’ by-election which will be held on Thursday 31st October. The division covers a wide area including Bramdean to the North, Colden Common to the West and Durley to the South. See map below for boundary.\nWe have selected a fantastic local candidate Alex Ellis who lives in Colden Common in the heart of the community and is one of our most hardworking members.\nThe Green party WON the most recent county by-election which was held last May and Malcolm Wallace was elected as the only Green on Hampshire County council and he is working hard to make a real difference. Now we want to mount a challenge here too!",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_rivers_page_2/content_45.html": "12 July 2022 / 10 August 2024 by richardcannon\nWinchester City Council pass Green Party Cllr. Malcolm Wallace’s proposal At the Winchester City Council meeting earlier this week (06-July) Councillors voted to improve protections on our local rivers and waterways by taking account of the cumulative impact of pollution. In a first for Winchester, Green Councillor Malcolm Wallace proposed a motion to address this […]\nRead more »",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_04_20_action-day-in-whiteley/content_91.html": "A great morning spent in Whiteley distributing leaflets and speaking to residents about the forthcoming two elections on Thursday 2nd.May; Winchester City Council and a Hampshire County Council by-election for Meon Valley.\nAbly supported by friends from the East Hampshire Green Party and Test Valley Greens, we managed to cover a large area in and around the new housing developments. Their help is much appreciated and a fine example how Greens get together when there’s work to be done.\nStanding for Whiteley & Shedfield in the City Council election is Kate Needham and for the County Council by-election, Winchester City, Cllr. Malcolm Wallace.\nWith less than two weeks to go, our momentum is building; a record number of requests for ‘Vote Green’ boards and many residents being visited both in the City and around the surrounding Villages.\nThe response from residents is very positive and thankful for the hard work our two City Councillors have already put in.\nAnd not forgetting one of our biggest supporters…..",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_transport_page_2/content_66.html": "22 January 2022 / 10 August 2024 by richardcannon\nFirst impressions Winchester Movement Strategy in it’s 5th year of consultations and studies Imagine the amount and effort that went into preparing studies after studies would have gone into real changes… But here we are once again – another consultation that does not deliver the urgent changes that are required to offer alternatives to car […]\nRead more »",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_river-meon/content_5.html": "Members & Supporters open meeting – The importance of Chalk Streams 10 September 2024 / 10 September 2024 by richardcannon A talk given on (and in) the River Meon at Meonstoke on Wednesday 4th.September 2024 by Chalk Streams expert Dr. Richard Osmond Kate Needham writes.. There was a lot more to river fly monitoring than I imagined. It was truly fascinating. Some creatures are more susceptible to pollution than others. So each type is given […] Read more » Kate Needham River Meon",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_meon-valley/content_11.html": "Winchester Greens on the Web 21 March 2025 / 25 March 2025 by richardcannon ‘keeping you informed all year round’ social media We like to keep residents of the Winchester District informed ALL YEAR ROUND and not just sudden surges in the weeks leading up to an election. Here is the full list of our social media platforms where you will find regular local news and activities… Following the […] Read more » Central Meon Valley Danny Lee Malcolm Wallace Meon Valley Suzanne White\nA busy start to the year for winchester greens 2 February 2025 / 7 February 2025 by richardcannon Delivering new year cards Our non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places. In the Winchester District Wards a huge […] Read more » Danny Lee Malcolm Wallace Meon Valley People Suzanne White\nOut and about photos from autumn ’24 2 December 2024 / 2 December 2024 by richardcannon Read more » Danny Lee Malcolm Wallace Meetings Meon Valley People Suzanne White\nSouth East Green Party Councillor’s Conference 26 November 2024 / 2 December 2024 by richardcannon Last week two of our three Councillors, Danny Lee and Malcolm Wallace attended the annual South East Green Party Conference in which many topics were discussed including of course, congratulations on all our recent Council elections. Read more » Danny Lee Malcolm Wallace Meon Valley\nMeon Valley, Whiteley & Shedfield Newsletters, Nov ’24 25 November 2024 / 26 November 2024 by richardcannon Click images to view full newsletters Read more » Danny Lee Malcolm Wallace Meon Valley Suzanne White\nMeon Valley Autumn Newsletter 2024 8 October 2024 / 8 October 2024 by richardcannon CLICK IMAGE TO READ IN FULL.. Read more » Danny Lee Malcolm Wallace Meon Valley Suzanne White\nLast days of campaigning and the count. 5 May 2024 / 16 January 2025 by richardcannon Our hard working Teams were out and about for a number of weeks before the election date. With such short notice for the vacant County County by-election, it meant our canvassers and leaflet distributors were extremely hard pressed to cover Central Meon Valley, Meon Valley as well as around Winchester city itself. Requests for ‘Vote […] Read more » Malcolm Wallace Meon Valley\nSuzanne White and Malcolm Wallace win elections and Greens make big progress in the City 4 May 2024 / 6 February 2025 by richardcannon Central meon valley and Meon valley by-elections Councillors Danny Lee, Suzanne White and Malcolm Wallace Four years ago some thought the Green Party would never have representation in either the Winchester District Council or Hampshire County Council. Fast forward four years and we now have three District Councillors, one of which also a County Councillor […] Read more » Central Meon Valley Malcolm Wallace Meon Valley Suzanne White Videos\nHampshire County Council Meon Valley By-election 22 April 2024 / 10 August 2024 by richardcannon Our Candidate, Cllr. Malcolm Wallace Malcolm was elected a Winchester City Council Councillor for the Central Meon Ward in 2022 and since then has become an established member of the Council and proven that a Green in the room really does make a difference. Here’s just a few things he has achieved in this time.. […] Read more » Malcolm Wallace Meon Valley",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_news_page_8/content_97.html": "31 January 2023 / 10 August 2024 by richardcannon\nA selection of photos ahowing some of our Team's activities during January, plus a video of Cllr. Malcolm Wallace delivering his successful motion to ban future fracking in Winchester\nRead more »\n27 January 2023 / 10 August 2024 by richardcannon\nAfter some delay due to a global shortage of electric vehicles, Winchester City Council have announced that upon delivery of a first bus arriving shortly, a trial run will take place using the Park and Ride service this coming Spring. Winchester Green Party are dedicated to reduce all pollution in Winchester City and the surrounding […]\n26 January 2023 / 10 August 2024 by richardcannon\nAt the Winchester City Council meeting earlier this week, Councillors voted to:1) Oppose as a matter of council policy any initiatives to develop fracking for shale gas.2) To respond to the County Council’s consultation on the refreshed Minerals andWaste Plan stating our opposition the extraction of oil and gas, including by fracking. Cllr Wallace stated: […]\nFunding available to support local farming communities and our environment. Local Green Party Councillor supports Defra’s Farming in Protected Landscapes programme. Article by Stan Evans Local Meon Valley based Green Party Councillor, Malcolm Wallace stated : ”I’d like to remind our friends in the farming and land management community that Defra’s, Farming in Protected Landscapes […]\n10 January 2023 / 10 August 2024 by richardcannon\nmax priesemann writes.. A single bus ticket price cap of £2 is very welcome! Unfortunately only until End of March. End of 2022 a Stagecoach Single ticket from Winchester to places like West Meon, Cheriton, Arlesford or Romsey cost £5.90. A Bluestar Single between Southampton and Winchester cost as much a £7. From 1st of […]\n23 December 2022 / 10 August 2024 by richardcannon\nRain, wind, snow, warm, cold and whatever else, nothing stops our hard working members getting about to spread the Green message Beata Parry, Danny Lee and Kate Needham busy around the Meon Valley Danny Lee asking Swanmore residents to fill out our short 60 second survey ‘Green Drinks’ at the Black Boys Pub in Winchester […]\n29 November 2022 / 10 August 2024 by richardcannon\n‘have your say’ Surveys Kate Needham and Doug Stanton in Swanmore and Waltham Chase Kate Needham and Richard Cannon in Soberton Photos from our Stall in Winchester.. Chris Gilham Rob Parker Richard Needham Doug Stanton Max Priesemann (right) Richard and Kate Needham Rupert Pitt Enjoying a get together in the Open House Deli\n19 November 2022 / 8 October 2024 by richardcannon\nCllr Malcolm investigaTes Local recycling – says we can do better You do your part to help recycling by sorting your rubbish in different bins separating garden waste and taking your rubbish down to recycling centres. Waste Disposal teams empty our bins and take it all away from our doorstep’ But what happens next? Councillor […]\n13 November 2022 / 10 August 2024 by richardcannon\nWe set up our ‘Climate Justice’ & ‘Seven Demands for the UK Government’ Stand at the Buttercross on a very busy Winchester shopping day and were pleased to receive so much attention plus response from passers by. Beside giving out a substantial number of leaflets and speaking to people, we also set up a board […]\n9 November 2022 / 30 May 2024 by richardcannon\nHave your say: where and how houses will be built around winchester Malcolm Wallace with Danny Lee, local Green campaigner and contributor to the Local Plan Review Whilst development sites opposite the College in Swanmore and at Morgan’s Yard in Waltham Chase are included in the latest draft of the Winchester Local Plan (these sites […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_12_18_green-party-criticises-the-government-white-paper-on-english-devolution-for-local-government-reorganisation/content_73.html": "The National Green Party has voiced strong criticism of the government’s White Paper on local government reorganization, arguing that the proposals risk weakening local democracy rather than strengthening it. The reforms prioritize centralized “super-councils” and regional mayoral offices, pulling power further away from local communities.\nLocal councils play a vital role in driving meaningful change on many issues such as energy-efficient housing, river pollution, social care reform, and local economic development. Empowering local councils, rather than sidelining them, is essential for effective local governance and close representation of communities.\nWhilst there are potential benefits from managing some areas, such as public transport, at a wider, strategic level, by shifting power away from councils, it risks deepening public disillusionment with politics and eroding trust in democratic processes.\nThe Green Party is calling for genuine decentralization, emphasizing that decisions should be made as close as possible to the communities they affect. The key requirements are:\n• Local decision-making: Ensure decisions are made at the closest possible level to the people affected.\n• Community trust: Empower local communities to shape their own futures.\n• Fair investment: Provide councils with adequate funding to drive meaningful change.\n• Proportional representation: Implement fair voting in local elections.\nGreen Party MP Ellie Chowns voiced her concerns during a parliamentary debate, stating, “I welcome the elements of this White Paper that are about devolution, but we have to recognize that some elements are about concentration.” She warned that replacing local tiers with mayoral authorities risks creating a “democratic deficit”, especially given the low voter turnout (30% on average) in mayoral elections.\nChowns pressed the government to address this risk and urged for the introduction of proportional voting systems in local elections. The Green Party’s overarching message is clear: devolution must genuinely empower local communities, not distance them from decision-making processes. They pledge to continue advocating for local councils to retain and expand their role in leading green transformation across the country.\nLocal Response from Central Meon Valley Councillors…\nCentral Meon Valley Councillors Danny Lee, Malcolm Wallace, and Suzanne White have committed to minimising the impact of the proposed changes on local decision-making and democratic accountability. They emphasized the need for local input on key priorities, including housing, environmental protection, local economy and infrastructure improvements.\n“As plans develop, we will work hard to ensure the impact on local decision-making and democratic accountability is minimised,” the councillors stated. “This includes ensuring local inputs into prioritisation of the right homes in the right places, supporting nature, climate, local economy, and transport improvements.”\nCllr Danny Lee added, “The timelines for the reorganisation of Winchester and the Meon Valley are still being worked on, but the Government has committed to collaborating with local councils to develop and implement transition plans. Specific timelines for the dissolution of existing councils and the establishment of new unitary authorities will be determined during this phase. So, for now it is business as usual”\nFor more information on the White Paper and the Local Government Association’s https://www.local.gov.uk/parliament/briefings-and-responses/devolution-white-paper-day-factual-briefing\nError: Contact form not found.",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_news/content_48.html": "3 May 2025 / 3 May 2025 by richardcannon\nwinchester greens rubber stamping an even stronger presence in winchester ! After the election and Count, there’s the little job of collecting circa. 100 Vote Green Boards…. Richard Needham (right) with Andy Stables slowly filling up the Needham household’s back garden. Just the first of about five lots !\nRead more »\n14 April 2025 / 14 April 2025 by richardcannon\nBoth candidates along with their strong teams out and about.. Lorraine has been busy calling in on residents and very active in arranging ‘vote green’ boards to go into peoples front gardens. Lorraine say’s “the response has been great and many people have expressed their enthusiasm to vote for change. Liam has also been very […]\n11 April 2025 by richardcannon\nIf you live in Hampshire, this weekend is your last chance to respond to the local consultation on the government’s Devolution White Paper for Hampshire and the Solent. Please have your say now! The Devolution White Paper has significant implications for formation of a new Mayor led Strategic Combined Authority for Hampshire and the Solent. […]\n31 March 2025 / 4 April 2025 by richardcannon\nhampshire county council by-election for winchester eastgate – lorraine estelle Lorraine has been a Green Party member for a number of years. Living in the St. Bartholomew area makes her central to see all the issues which arise in Winchester. Just recently, upon reading the breaking news that Southampton University had pulled out of redeveloping […]\n30 March 2025 / 31 March 2025 by richardcannon\nit’s your views which matter ! Upon hearing the breaking news story in the Hampshire Chronicle referring to the LibDem Council led deal with Southampton University to redevelop the River Park Leisure Centre falling through, within 24 hours, led by Lorraine Estelle, we arranged a Stall outside the Leisure Centre informing residents about the news […]\n21 March 2025 / 25 March 2025 by richardcannon\n‘keeping you informed all year round’ social media We like to keep residents of the Winchester District informed ALL YEAR ROUND and not just sudden surges in the weeks leading up to an election. Here is the full list of our social media platforms where you will find regular local news and activities… Following the […]\n5 March 2025 / 5 March 2025 by richardcannon\nAt a recent City Council meeting, supported by Cllr. Suzanne White, Cllr. Malcolm Wallace raised a motion on the important issue of solar panels being installed on Council Housing. Malcolm stated “The Council must seize the opportunity provided by the development of more efficient, cost effective technologies as well as by the innovative solutions and […]\n1 March 2025 / 18 March 2025 by richardcannon\nOn the 26th.February the trustees of Denmead Community Centre welcomed visitors from other community buildings around the district. Winchester Green Party was represented by Councillor Suzanne White They shared their experience of raising funds and arranging the installation of solar panels on their building. Stu Mills, Project Manager for WinACC also gave a presentation about […]\n2 February 2025 / 7 February 2025 by richardcannon\nDelivering new year cards Our non relenting team of volunteers managed to deliver 12,000 new Year cards. This covered the Meon Valley County ward for which Malcolm Wallace is Councillor and incorporates Whiteley, Curbridge, Shedfield, Waltham Chase, Swanmore, Meonstoke, Warnford and Hambledon to name just a few places. In the Winchester District Wards a huge […]\n27 January 2025 / 29 January 2025 by richardcannon\nCarla Denyer MP Carla‘s amendment to the Renters Rights Bill on requiring landlords to make reasonable changes to make homes accessible for disabled people, prompted the Minister to agree to a cross-party meeting to discuss how the Government makes sure the law is strong enough. She spoke during a debate on the so called ‘Sunshine […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_tag_climate-justice/content_22.html": "winchester action on the climate crisis – denmead community centre 1 March 2025 / 18 March 2025 by richardcannon On the 26th.February the trustees of Denmead Community Centre welcomed visitors from other community buildings around the district. Winchester Green Party was represented by Councillor Suzanne White They shared their experience of raising funds and arranging the installation of solar panels on their building. Stu Mills, Project Manager for WinACC also gave a presentation about […] Read more » CLIMATE-JUSTICE Denmead Suzanne White\nMember’s Meeting Oct 2022 – A presentation from ‘Flight Free’ 14 October 2022 / 10 August 2024 by richardcannon The meeting was held at St Pauls Church hall, Winchester. Members were also able to attend on Zoom during which we were very pleased to host a presentation by the ‘Flight Free’ group. Our speaker was Anna Hughes, Director and initiator of this charity in 2019. Its aim is to change social habits around flying and […] Read more » CLIMATE-JUSTICE",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_category_news_page_2/content_56.html": "18 December 2024 / 16 January 2025 by richardcannon\nThe National Green Party has voiced strong criticism of the government’s White Paper on local government reorganization, arguing that the proposals risk weakening local democracy rather than strengthening it. The reforms prioritize centralized “super-councils” and regional mayoral offices, pulling power further away from local communities.Local councils play a vital role in driving meaningful change on […]\nRead more »\n9 December 2024 / 16 January 2025 by richardcannon\nA message from Caroline Lucas.. Back in May, in my last few months as MP, I secured a parliamentary debate on nature and biodiversity loss. It was the dying days of Sunak’s government, and amidst the chaos and election fever, I wanted to focus attention on the upcoming nature summit in Colombia. Because nature is […]\n2 December 2024 / 2 December 2024 by richardcannon\nCarla Denyer MP Carla proposed and spoke in favour of several amendments to the Renters’ Rights Bill, including in support of rent controls, as a member of the committee looking at the legislation in detail. She and Siân have also tabled an Early Day Motion in support of funding a 4 Day Working Week pilot trial […]\n26 November 2024 / 2 December 2024 by richardcannon\nLast week two of our three Councillors, Danny Lee and Malcolm Wallace attended the annual South East Green Party Conference in which many topics were discussed including of course, congratulations on all our recent Council elections.\n25 November 2024 / 26 November 2024 by richardcannon\nClick images to view full newsletters\n8 October 2024 / 8 October 2024 by richardcannon\nCLICK IMAGE TO READ IN FULL..\n3 October 2024 / 4 October 2024 by richardcannon\nInitiated by Kate Needham and organised by Rich Turner and Jo Harmer, we held a live music and dance folk evening featuring local artists at the Hyde Tavern in Winchester. Jo Harmer writes.. It was a great night, so much skill and talent in the Hyde Tavern’s quirky and wonderful Cellar Bar. Each of the […]\nYour green party candidate, Alex Ellis The current County councillor for Bishops Waltham district has stepped down triggering a ‘snap’ by-election which will be held on Thursday 31st October. The division covers a wide area including Bramdean to the North, Colden Common to the West and Durley to the South. See map below for boundary. […]\n10 September 2024 / 10 September 2024 by richardcannon\nA talk given on (and in) the River Meon at Meonstoke on Wednesday 4th.September 2024 by Chalk Streams expert Dr. Richard Osmond Kate Needham writes.. There was a lot more to river fly monitoring than I imagined. It was truly fascinating. Some creatures are more susceptible to pollution than others. So each type is given […]",
  "https_winchester_greenparty_org_uk_2024_06_10_kate-needham-to-stand-as-candidate-in-hamble-valley_/https_winchester_greenparty_org_uk_2024_05_29_winchester-district-green-party-announce-general-election-candidate/content_80.html": "Lorraine Estelle campaigning for Real Hope and Real Change.\nThe Green Party today announced their candidate for the Winchester constituency at the coming General Election. They have selected Lorraine Estelle.\nLorraine said, “I am honoured to have been chosen as the Green Party’s candidate for Winchester. In recent years, more and more people have realised that far from being just about the environment, the Green Party stands for a way of doing politics differently and for pragmatic, proven policies that can transform our country – and that Green Party politicians can be trusted to have the integrity people expect.”\n“It’s clear for everyone to see that our country is in a total mess: politics as usual hasn’t worked – we need a new approach for real hope and real change. That’s why the Green Party has grown so rapidly. Since Malcolm Wallace was elected as our first Green Party Councillor in the Winchester District, we have doubled the number of councillors year on year, including the first councillor seat at Hampshire County Council only a few weeks ago.”\n“Addressing the cost-of-living crisis also means rapid action to tackle both the climate and nature emergencies. Tackling these crises together will make local residents and businesses better off. Our plan for a new UK law to address the full extent of the climate and nature crises, in line with the most up-to-date science, will be front and centre of our policies. Harmony is needed between the social, environmental and economic triple challenges to build a much fairer Britain. These three essentials must be taken forward together."
}