{
  "https_erewash-independent_com_/https_erewash-independent_com_erewash-decides/content_5.html": "Erewash Sounds – #Erewash Decides\nListen to Erewash Sounds show – Erewash Decides\nhttps://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/1860956598&color=%23ff5500&auto_play=true&hide_related=true&show_comments=true&show_user=true&show_reposts=false&show_teaser=false",
  "https_erewash-independent_com_/https_erewash-independent_com_homelessness/content_50.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put it’s case, for the benefit of its people.\nRe: Homelessness\nDear [Redacted],\nThank you for your email, and I hope the following response make clear my position. I am not a “Soundbite” politician, I have a view and I will listen to others, therefore I make no apology for the length of my reply.\nAs you can see this is an issue that is extremely important to me, and not just now for votes but over a long period.\nI have signed your pledge, and I refer you to my own pledge\nhttps://erewash-independent.com/pledge-two/\nand three of my articles\nHomelessness & the housing crisis #UK\nBy John Kirby\nArticle 1\nMarch 30, 2023\nHomelessness and the housing crisis are some of the biggest challenges facing the United Kingdom today. Despite being one of the richest countries in the world, there are still thousands of people sleeping on the streets and millions more struggling to find affordable and decent housing. We need to explore the root causes of homelessness and the housing crisis in the UK, and it is not all bad news, there are some great beacon projects for dealing with it and potential long-term solutions.\nIn the #unitedkingdom, there are 25,000,000 residential properties with an average value of £290,000 https://www.gov.uk/government/news/uk-house-price-index-for-january-2023 which gives a total value of £7,250,000,000,000 that is seven trillion two hundred fifty billion pounds – It is obscene that with that much property and the value of it, that people are sleeping and dying on the streets\nThe Bureau of Investigative Journalism has done some fantastic work on the subject of the housing crisis https://www.thebureauinvestigates.com/projects/the-housing-crisis\nRoot Causes of Homelessness and Housing Crisis\nThe root causes of homelessness and the housing crisis in the UK are complex and multifaceted. However, some of the key factors contributing to this crisis include:\nLack of affordable housing:\nThe UK has a chronic shortage of affordable housing, particularly in urban areas where demand is high. As a result, many people are forced to live in overcrowded or substandard accommodation, or they are unable to find suitable housing altogether.\nRising rents:\nThe cost of renting in the UK has risen significantly over the past decade, making it increasingly difficult for people on low incomes to afford decent housing.\nWelfare reform:\nChanges to the welfare system, including cuts to benefits and the introduction of the Universal Credit system, have left many people without adequate financial support to pay for housing.\nDomestic abuse and family breakdown:\nDomestic abuse and family breakdown can lead to people becoming homeless, particularly women and children who are fleeing abusive relationships.\nMental health issues and addiction:\nPeople who suffer from mental health issues or addiction may find it difficult to maintain stable housing, which can lead to homelessness.\nBeacon Projects for Dealing with Homelessness and Housing Crisis\nDespite the challenges, many beacon projects are helping to address homelessness and the housing crisis in the UK. Here are some examples:\nHousing First:\nHousing First is an approach that provides homeless people with permanent, stable housing as a first priority, rather than requiring them to address underlying issues such as addiction or mental health problems before receiving housing. This approach has been successful in reducing homelessness in several cities in the UK, including Manchester and Liverpool.\nCommunity Land Trusts:\nCommunity Land Trusts are non-profit organisations that develop and manage affordable housing for local people. They are community-led and operate on a not-for-profit basis, which makes housing more affordable for those who would otherwise be priced out of the market.\nSocial Impact Bonds:\nSocial Impact Bonds are a type of funding mechanism that allows private investors to finance social projects, such as homeless prevention programmes or affordable housing developments. Investors receive a return on their investment if the project achieves certain outcomes, such as reducing homelessness.\nHousing Associations:\nHousing Associations are non-profit organisations that provide affordable housing for people on low incomes. They are an essential source of affordable housing in the UK, particularly for people unable to access social housing. However, many of these have benefited from large sums of public money and completely failed the tenants, one only has to view the work of the amazing journalist from @ITV News Daniel Hewitt https://www.itv.com/news/search?q=+Daniel+Hewitt+ to see the shameful inaction by these social landlords.\nHowever, in the interest of balance, there are some great Housing Associations and more importantly some fantastic staff even in the poor ones.\nLong-term Solutions to Homelessness and Housing Crisis\nWhile beacon projects are making a difference, long-term solutions are needed to address the root causes of homelessness and the housing crisis in the UK. Some of the potential solutions include:\nIncrease the supply of affordable housing:\nThe UK needs to build more affordable housing to meet demand. This can be achieved by investing in social housing, providing incentives for developers to build affordable housing, and introducing rent controls to keep rents affordable.\nReform the welfare system:\nThe welfare system needs to be reformed to ensure that people have adequate financial support to pay for housing. This could involve increasing benefits or providing targeted financial assistance to those who need it most.\nAddress mental health and addiction:\nPeople who suffer from mental health issues or addiction need appropriate support to help them maintain stable housing. This could involve investing in mental health services and addiction treatment programmes.\nAddress domestic abuse and family breakdown:\nMore needs to be done to prevent domestic abuse, and that means resources and also means cooperation across Government Departments, Local authorities and the Police.\nTemporary Accommodation in the UK: A Growing Concern?\nBy John Kirby\nArticle 2\nMay 2, 2023\nThe number of people living in temporary accommodation in the #UK has steadily risen in recent years. This trend has significant implications for both the individuals involved and the country as a whole. We have to examine the factors driving the increase in temporary accommodation, the associated costs, and the policies needed to reduce the numbers and improve the lives of those affected, particularly children. In England alone, there are over a quarter of a million in temporary accommodation.\nFactors Driving the Increase in Temporary Accommodation.\nHousing affordability crisis:\nThe UK has experienced a significant increase in property prices, making housing unaffordable for many. A lack of affordable homes has led to a rise in demand for temporary accommodation.\nWelfare reforms:\nCuts to welfare benefits, such as the housing benefit and Universal Credit, have left many unable to afford rent or mortgage payments, forcing them into temporary accommodation.\nHomelessness:\nThe number of homeless people has increased partly due to the abovementioned factors. Many of these individuals are placed in temporary accommodation by local authorities.\nReduction in social housing:\nThe UK has seen a decrease in the availability of social housing due to the sale of council houses and a lack of investment in building new homes.\nhttps://england.shelter.org.uk/support_us/campaigns/social_housing_deficit\nEconomic factors:\nUnemployment, underemployment, and low wages have contributed to housing instability, forcing more people to rely on temporary accommodation.\nThe Cost of Temporary Accommodation in the UK.\nThe financial burden on the government:\nThe UK government is responsible for providing temporary accommodation to eligible citizens, placing a significant financial burden on local authorities and the public sector.\nhttps://commonslibrary.parliament.uk/research-briefings/sn02110/\nImpact on the economy:\nPeople living in temporary accommodation face housing instability, which can result in job loss and reduced consumer spending. This, in turn, can have negative effects on the economy.\nSocial costs:\nThere are many social costs associated with temporary accommodation, including mental health issues, reduced educational attainment for children, and increased crime rates.\nhttps://blog.shelter.org.uk/2022/02/the-human-cost-of-temporary-accommodation\nPolicies to Reduce Temporary Accommodation and Improve Lives.\nAffordable housing:\nThe government must invest in building more affordable homes to address the housing crisis. This can include social housing, affordable rental properties, and affordable homes for purchase.\nWelfare reform:\nIt is crucial to review and reform welfare policies to ensure that they provide adequate support for those in need, helping them to afford stable housing.\nSupport for homeless individuals:\nProviding better support for homeless individuals, such as through comprehensive homelessness prevention programs, can help reduce the demand for temporary accommodation.\nAddressing economic issues:\nTackling unemployment, underemployment, and low wages can help to improve housing stability and reduce reliance on temporary accommodation.\nEducation and support for children:\nIt is essential to prioritise the needs of children living in temporary accommodations by providing additional educational support and access to services that help them thrive.\nThe rise in temporary accommodation is a complex issue requiring society to care for those affected by this issue and question our elected officials. By implementing policies that target the root causes of the problem, the UK government can not only reduce the number of people living in temporary accommodation but also improve the lives of those affected. This is particularly important for the well-being of children, who are most vulnerable to the negative impacts of housing instability.\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC9859054\nRise in Homelessness Amongst Young People and Children in the UK: A Result of Austerity, COVID-19, and the Cost of Energy Crisis\nBy John Kirby\nArticle 3\nJune 2, 2023\nHomelessness is a critical issue affecting societies worldwide, and the United Kingdom is no exception. In recent years, there has been a concerning rise in homelessness, particularly among young people and children. There are so many factors contributing to this alarming trend, with a particular focus on austerity measures, the COVID-19 pandemic, and the cost of the energy crisis. Understanding these interconnected factors is essential for developing effective solutions to address the issue and provide support to vulnerable individuals.\nAusterity Measures:\nReduction in Social Welfare:\nAusterity policies implemented in the UK have led to cuts in social welfare programs and benefits. This has disproportionately affected low-income families, pushing them towards homelessness.\nHousing Affordability:\nThe lack of affordable housing options, combined with the reduced availability of social housing, has created a challenging environment for young people and families, forcing them into unstable living situations.\nCOVID-19 Pandemic:\nEconomic Impact:\nThe pandemic resulted in widespread job losses, reduced working hours, and financial instability, leaving many individuals unable to afford housing.\nRental Market Challenges:\nLockdowns and restrictions disrupted the rental market, making it difficult for young people and families to secure stable housing or maintain existing tenancies.\nCost of Energy Crisis:\nRising Energy Costs:\nThe energy crisis has led to a sharp increase in energy prices, putting additional financial strain on households. For vulnerable families already struggling to make ends meet, this has made it even more challenging to cover basic expenses, including rent.\nImpact on Young People and Children:\nEducational Disruption:\nHomelessness often disrupts a child’s education, leading to academic difficulties and long-term consequences for their long-term prospects.\nEmotional and Physical Well-being:\nInstability, inadequate living conditions, and exposure to potential risks can have severe effects on the mental and physical health of young people and children experiencing homelessness.\nGovernment Response and Support:\nHomelessness Prevention:\nGovernments must invest in preventive measures, including increasing affordable housing options and providing robust social support programs to vulnerable families.\nOutreach and Support Services:\nStrengthening outreach services and support networks can help identify and assist at-risk individuals, providing access to temporary accommodation, healthcare, and counselling.\nCollaboration and Partnerships:\nCollaboration between government agencies, local authorities, non-profit organisations, and private sectors is crucial for developing comprehensive strategies and allocating resources effectively.\nThe rise in homelessness among young people and children in the UK is a complex issue, influenced by austerity measures, the COVID-19 pandemic, and the cost of the energy crisis. Governments, policymakers, and communities must work together to address this crisis. By implementing long-term solutions focused on affordable housing, social support programs, and targeted interventions, it is possible to alleviate the suffering of vulnerable individuals and provide them with the stability and support they need to thrive.\nKR\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_health/content_34.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: Health\nDear [Redacted]\nThank you for your correspondence. I have had a lot of emails that are basically akin to asking me which of my four children is my favourite. Asking me to support one aspect of health or another.\nI am not a “Soundbite” politician, so the answers are below. Please read them all or scroll down to the bits you are interested in.\nSo I am being transparent here: I am in favour of a well-funded #NHS with the capacity to operate a fully integrated service, free at the point of use, and for care to be available as needed across the broad spectrum of routine and specialist services.\nNow, I fully understand if that Is Renal, Oncology. or another speciality which affects you or your family, you will seek that to be the priority. However this response covers the following.\nMuscular Dystrophy\nLiver Health\nRenal\nNHS Dentistry\nBenefits for the Seriously ill\nMigraines\nBoth Lives Pledge\nBaby Loss\nReproductive Rights\nNHS Outsourcing\nMental Health\nRheumatology\nAssisted Suicide & Palliative Care\nImprovements in Healthcare\nShort Lives & Hospices\nChildren in Care\nMuscular Dystrophy – We need improved access to NHS services and treatments across all areas, by advanced and early diagnosis.\nWe have to ensure anyone affected by illness or disease is financially protected so they can concentrate on getting better and maintaining a quality of life. It is hard enough being unwell without financial worries on top of it.\nTimely diagnosis is essential for all conditions.\nIndeed, the migrant situation and student visa problems are destroying the UK’s reputation as a centre of excellence for research; we must maintain our position as the world’s leading centre for research.\nThe sharing of knowledge and increased understanding of conditions is a truly important\nLiver Health – An absolutely crucial message, and we have to take this seriously; with so many deaths being preventable, this is as much around Medical intervention as it is about education. 90% of liver disease is preventable, we 18,00 people dying each year, we have to address this. I am absolutely committed to being a positive voice to help in any way possible to get the message out there, and to get funding support to change the outcomes for people.\nRenal – Research is key, and that takes money and commitment. By understanding Kidney Disease, being able to diagnose it earlier and offering bespoke treatments earlier, we should be able to prevent it from becoming a £10bn a year issue and, more importantly, have better outcomes for patients, reducing pain and suffering.\nNHS Dentistry. – This is a crucial need; we have to understand oral care matters; it provides a window on so many other illnesses that a routine annual check-up can highlight; it is not right that the most common reason for hospital admission for children aged between 6 and 10 is for tooth extraction.\nhttps://dentistry.co.uk/2023/02/24/unfair-and-unjust-tooth-extractions-key-reason-for-hospital-admissions-among-young-children/\nAnd if we want better education, they children need to be in school, so losing 15 million school days is immoral\nhttps://www.denplan.co.uk/the-core/industry-and-company-news/15-million-school-days-missed\nAnd for the productivity of the nation, parents taking time of work to resolve this issues is damaging to the country.\nWe have to STAND UP for Dentistry\nBenefits for the Seriously ill – I am angry that this Government has done it utmost to place a division between those in work and those who are ill, and attempted to label them scroungers, the simple truth is if you have worked for 20 years and get sick, you have paid in to the safety net, and guess what if you have never worked, and always been affected by a disability, you are not a scrounger, you are in need of support, so that should be available.\nSo many politicians do not even understand PIP, calling it an unemployment benefit; it is not; they call out people with illnesses and disability, yet they do not enforce rules on employers to make adaptations and interview disabled people.\nWe have people sitting on waiting lists for #NHS treatment, and we see them going back for consultant visits often, whereas if they were treated and discharged, they would not need these extra appointments. The Government have created the issue and are blaming the victims, who are left in pain and very often in poverty too.\nMigraines – I have had many emails on this and on tinnitus too, with people dealing with these conditions saying they do not feel the #NHS treat them fairly as if they have an actual condition, and this is wrong. No one should suffer, we have to give proper funding to to allow an integrated care management plan to be put in place. There is a postcode lottery of care across the country, with access to drugs and their availability far better in some areas than others.\nIt is wrong that people have lost their jobs due to disciplinary actions on timekeeping/lost days because they have been suffering from migraines. We need to support people and employers to make adaptations to ensure all are supported.\nBoth Lives Pledge – I have strong views on abortion and am most concerned that whilst I accept a woman has a right to choose, our laws seem outdated; we have 23 weeks and 6 days as a limit for both on-demand and elective termination. I would like to see it reduced to 14 weeks for on-demand terminations of pregnancies and 22 weeks for cases where\nthe woman’s life is in danger\nthere is a severe fetal abnormality\nthe woman is at risk of grave physical and mental injury\nBear in mind, survivability. of babies at 21/22 weeks\nhttps://www.bbc.co.uk/news/uk-wales-64875309\nhttps://www.uab.edu/news/health/item/12427-uab-hospital-delivers-record-breaking-premature-baby\nhttps://www.childrensmn.org/2020/12/23/baby-richard-born-21-weeks-one-youngest-babies-survive/\nI certainly do not approve and I will fight against termination based on the biological sex of the baby, and truly believe we have to value parenthood more, and support the rights of parents in the workplace. I am more than happy to make the Pledge on this.\nBaby Loss – As a constituency where baby births take place at the Nottingham University Hospital Trust, you will be aware that this issue is important to me.\nI have four sons who were born there, and they are 34, 32, 26 and 22. I have to say the care given to my wife, Lea, was exceptional, but so many pressures have been put on the unit, including reduced staffing and funding cuts, and that is wrong. Every child deserves the best of care.\nI will work to the best of my ability to get answers for those who have suffered already and to help prevent such instances in the future.\nReproductive Rights –\n1) I do support removing women from the criminal law on abortions\n2) No, I would like to see changes to it; please see my response above Re: Both Lives Pledge; also, we know earlier abortions are safer for the mother too.\n3) Yes, I certainly do support improving access to contraception and better sex education – it is clear that abortions take their told on the mother, and are expensive to the #NHS, contraception is a better option.\n4) We need to value parenthood and tackle the cost of living crisis. We are forcing too many women into making tough decisions to delay having a child due to financial pressure, and we all know it can be harder and less safe to have children later in life.\nNHS Outsourcing –\nI do not think there is a person who would object to paying tax, if we could see where it was going, and there was transparency to where it was being spent, but when we have a National Health Service owned by us, funded by us, remember it id not FREE, we pay for it, It is Free at Point of use (except for private parking companies exploiting us, commercial shops on #NHS premises charge a 300% mark up on toothpaste etc, we get ripped off for being sick.)\nBut when people see revenue leaving the #NHS, and still private organisations profiteering, see the personal data of UK Patients being traded overseas and processed offshore, they instinctively know it is wrong.\nWhen the Government is setting up private Community Diagnostic Centres (CDC), diverting funds from the #NHS, private centres and companies that do not train staff but recruit out of the #NHS create more staff shortages (basically protecting their business model) by fewer #NHS appointments being available, so more goes to the private sector.\nWhen you visit a hospital and see more private ambulances than #NHS ones\nhttps://www.unison.org.uk/news/press-release/2023/04/nhs-spending-over-1m-a-week-on-private-ambulances-for-999-callouts-says-unison/\nBut the service is not improving.\nWe have to end the cosy relationships; we have to bring best practices back inside the #NHS, we need an #NHS accountable, nor farmed out.\nMental Health – The system is so under pressure; we hear numbers quoted for Erewash that nearly 40,00o adults and just over 8,000 young people are in the mental health system, but there is an issue: how many are not? How many are being left behind.\nMental health is seen as a poor relationship in terms of health, as well as being unfunded and understaffed. However, there is a financial ROI on good, effective mental health services, where for each £1 spent, nearly £5 is returned, but that is not the mind, the benefits to the individual and to the broader society is immense,\nThe sadness is that now 20% of children and young people are in need, and by addressing this and getting qualified mental health workers in every school would help us deal with he mental turmoil affecting children and their parents. We must address the issues, and that takes investment\nRheumatology – This is such a debilitating disease, my first experience of it was the wife of my Dad’s business partner having it, and I witnessed George’s love and devotion to Joan, caring for her. The understaffing and lack of recruitment of the staff needed, means that people are in pain, and suffering, when in fact investment into research and medical staff to care for individuals would make a substantive. I 100% am happy to sign the pledge on this important issue.\nAssisted Suicide & Palliative Care – I am sorry I cannot sign the End-of-Life Protection Pledge, and I set out my reasons here.\nI am pro-life, but more than that, I am pro-quality-of-life, so I would vote for assisted suicides, with safeguards, but I believe people should have dignity in death, but my preference is for “Enhanced Living” to give people better end-of-life care, so that they have options and should not have to suffer, however, I do feel they should have the option to terminate their life if they so choose, and due process has been followed.\nhttps://x.com/csljohnkirby/status/1740682805170819225\nSo that families do not put undue pressure on the individual, instead of a will, there will be a settlement statement that allows the person’s estate to be settled, but not beneficiaries, who would get payments 365 days after the passing of the patient. This would reduce pressures on people by “Bad Actors” after money.\nOn the second part, I would absolutely back better end-of-life care. I believe that palliative care should be better funded, research into best practices should be conducted, and better legislation is needed. My view is we should have Enhanced Living, with great care given to patients, to give them option to live.\nImprovements in Healthcare – Too many people in public life are scared to say anything about the #NHS, and when any organisation becomes so sacrosanct that people fear speaking up, then change fails to occur.\nYes, the #NHS is wonderful, and it has a superb staff, but it is not infallible, The judgement of any organisation is not the 90% it is getting things right, but how it acts the 10% it don’t.\nLook at the https://www.ockendenmaternityreview.org.uk/ onto failings in the #NUH Maternity services.\nIt shows the need for reform of the #NHS, and of the dialogue between patients and the professionals working in the service.\nThe NHS is NOT FREE, it is FREE at the Point of Use, it has a real value, and we have to understand this, that model Free at the Point of use must be protected, so in England for example the only country in the UNITED KINGDOM that has prescription charges, must end this abnormality, we see parents not collecting medications so they can feed their children. Health and well-being is important.\nIt must be funded, but the wasted and fraud must be tackled, we need value for money.\nWe need patient data protected and processed in the #UK and never sold off or processed overseas.\nWe need a Workforce Plan that is fair and just, but we need a strategy and stability with it too.\nShort Lives & Hospices – I have supported the amazing https://www.rainbows.co.uk/ for 22 years, and I am amazed at the work Hospices do across the country, and the value for money they offer, the pressures they remove from the #NHS, I would fight not just to maintain the current funding but increase it, there need to be a national committee, to liaise between service users, local authorities and service providers to set an agreed funding scheme, a central funding scheme that sets rates, and ensure prompt distribution of funding so hospices can plan and invest with certainty.\nBut the nature of the sector, we have to act fast but with care to endure those with a short life have every opportunity to make the most of every precious second.\nChildren in Care – Where do I start, we have to get rid of the two-child cap, we have to start valuing parenthood, and we have to start putting children first.\nWe have children living in poverty, and we have a 30% rise in children in care since 2010, what a legacy for a Government of 14 years to be leaving.\nWe have an NHS Chriss made by the Government, parents on waiting lists, sick, and unable to care for their children, we have a mental health crisis, parents and young people unable to get the support they need, leading to children ending up in care, and in prison.\nAnd we have a cost-of-living crisis leading to children going into care.\nWe will give a private childcare nursey thousands of pounds over a year to look after a child but not support a parent; we need a holistic joined-up approach.\nThe potential savings in #NHS and social care budgets are worth seeking; certainly, they are, but the most valuable part of this is better outcomes for parents and children.\nI will commit to meeting https://homeforgood.org.uk/ and https://safefamilies.uk/, which are merging, and I will do that, win or lose.\nI hope my letter makes where I stand clear ans answers your questions.\nKind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_category_uncategorised_page_5/content_36.html": "Pledge Six – Fair recompense to the Victims of the #PostOfficeScandal and STOP Royal Mail takeover\nJune 5 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up […]\nJune 5 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up […]\n4 June 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up\nPledge Five – Health Issues Read More »\n3 June 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up\nPledge Four – To raise awareness of Carbon Monoxide and Gas Safety. Read More »\n2 June 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up\nPledge Three -Change parliamentary conventions. Read More »\nThe “Everybody in” policy is paramount; it is morally wrong to have so many empty homes, some sitting rotting for\nPledge Two – Tackling Homelessness Read More »\n31 May 2024 by John Kirby, Organiser My first pledge if elected is to donate 25% of my MP salary\nPledge One – Donation to Charity Read More »",
  "https_erewash-independent_com_/https_erewash-independent_com_inland-waterways/content_18.html": "John Kirby – An Independent,\nLiberal-Minded Conservative\nSoul with a Socialist Heart,\ntinged with a Green Outlook.\nIndependent Candidate to be\nMP for Erewash Constituency\nhttp://www.erewash-independent.co.uk\nj.w_kirby@erewash-independent.co.uk\nhttps://x.com/erewashindie\nhttps://www.facebook.com/erewash.independen\nt\nhttps://www.gofundme.com/f/support-an-\nindependent-mp-for-erewash\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban\nand rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its\ncommunity and it has so much potential, and it deserves good representation in the House of\nCommons to put it’s case, for the benefit of its people.\nRe: Inland Waterways\nDear IWA,\nThank you for your email of the 17 th of June, 2024\nAll too often in this campaign, I have been reminded of the cost of doing something, but I am\nof the view that we should be more concerned with the cost of doing nothing.\nInland waterways, including rivers, canals, lakes, and reservoirs, are critical components of\nour natural and cultural heritage. They support a diverse range of ecosystems, provide water\nfor drinking and irrigation, serve as transportation routes, and offer recreational opportunities.\nEffective management and conservation of these waterways are essential to maintain their\necological integrity and ensure they continue to provide valuable services.\nAs your email points out, its value to the UK is £7.6bn, and it employs 41,000 people\ndirectly, with a further 300,000 roles supporting it.\nI hope you will take time to look at my views on VAT –\nhttps://erewash-independent.com/pledge-eight-vat-the-high-street-and-hospitality/\nand hopefully, you will see that it will help tourism, and by better funding of local authorities\nopen up funding opportunities for local authorities to support Inland Waterways to fulfil the\npotential of the national asset they are\nKind regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_author_jwkirbye30f562241_page_5/content_23.html": "Pledge Six – Fair recompense to the Victims of the #PostOfficeScandal and STOP Royal Mail takeover\nJune 5 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up […]\nJune 5 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up […]\n4 June 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up\nPledge Five – Health Issues Read More »\n3 June 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up\nPledge Four – To raise awareness of Carbon Monoxide and Gas Safety. Read More »\n2 June 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up\nPledge Three -Change parliamentary conventions. Read More »\nThe “Everybody in” policy is paramount; it is morally wrong to have so many empty homes, some sitting rotting for\nPledge Two – Tackling Homelessness Read More »\n31 May 2024 by John Kirby, Organiser My first pledge if elected is to donate 25% of my MP salary\nPledge One – Donation to Charity Read More »",
  "https_erewash-independent_com_/https_erewash-independent_com_grassroots-music/content_15.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: Grassroots Music\nDear [Redacted]\nThis might not be the answer you want, but I cannot support the Manifesto for Grassroots Music in its entirety.\nThe Arts are very important.\nhttps://x.com/search?q=%40csljohnkirby%20%2B%20%23thearts&src=typed_query&f=live\nhttps://x.com/search?q=%40csljohnkirby%20%2B%20%23arts&src=typed_query&f=live\nA £1 grassroots investment contribution from every arena and stadium\nticket sold to support grassroots music venues, artists and promoters\nI think this is a sensible proposal; it distributes wealth down to new and upcoming artists and helps keep the #Arts alive at a local level.\n2 A fan-led review to fully examine the long-term challenges to the live\nmusic ecosystem\nThe more we can engage people in the #Arts, the better. We have to have a change, we need a review of ticketing, to stop touts, break the monopoly of certain ticketing companies and offshoring of sales. It is morally wrong that tickets are sold with a face value, handling fee, service charge and postage.\n3 The agent of change principle in the National Planning Policy Framework\n(NPPF) to be put on a statutory footing at the earliest opportunity.\nThere needs to be an overall of planning on a national basis, with unified planning. This applies to so many aspects of planning, and Live Music Venues and our Nighttime Economy needs clarity and consistency\nThis was my response to NTIA\nFAO: John William Kirby – Urgent Action Required to Support and Revitalise the Night Time Economy\nMike,\nThank you so much for your email; you are right. Our nighttime economy is a crucial aspect of the quality of life for individuals and the local economies around the country.\nPlease read my pledge,\nWe have to get people back out, visiting our high street, retail, and hospitality, pubs, clubs and hotels.\nThat is why I want to encourage live acts, singers, bands, comedy etc.\nI know my answer to the Local Government Association is long-winded, but might be worth a read\nRe: Local Government Association.\nDear LGA Public Affairs Team,\nThe situation relating to funding for local authorities is a disgrace. What we need more than ever is stability in funding, and we need local people—who, at the end of the day, are the taxpayers who fund all services, nationally and locally—to see where their money is going and to see it having a positive effect on their own lives.\nI DO NOT want to see an increase in #VAT from 20% or extra sales taxes but I want to see the way it is distributed changed. You can see part of this in Pledge Eight – https://erewash-independent.com/pledge-eight-vat-the-high-street-and-hospitality/\nGreat local authorities around the country have economic development units, but these need expanding, and the local authority should benefit from their programmes.\nWe have our local shops and High Street suffering. By leaving online VAT at 20% but allowing a 15% rate for in-store/in-person sales, we could offer real help to retailers and hospitality venues that have a physical presence.\n#ShopLocal – helps the local economy and the local community, keeping money in the region, it creates local jobs. Economic development and growth helps fund public services and we need to bolster that, and the best way is that 25% of VAT so a ¼ of the 20% VAT is paid to the Local Authority (acting like a local sales tax) this would be worth some £43.1 billion added to Council Tax of £44.4 billion and Business Rates of £30.6 billion, and retaining existing grants of £28.6 billion this would give Local Authorities £146.7 billion.\nAccording to the House of Commons, last year Local authorities in England alone spent £113.5 billion in 2022/23.\nI genuinely believe that local people would respond if they saw a direct connection to where their taxes are being paid, and I think local authorities will strive for my growth if their region benefits directly. This settlement would allow for more economic growth, so increase revenue.\nI am committed to helping #Erewash. If you read my first pledge in the blogs section of my website, I will donate 25% of my MP salary to charities and good causes. I promise to do my very best every day.\nAs for your kind offers\n“Our offer to candidates:\nData about your area – The LGA holds a host of helpful data on constituencies. You can request information on a wide range of metrics so please get in touch to discuss what would be useful.\nBriefings – Online you can access LGA briefings on recent parliamentary activity. We will also endeavour to provide briefings on request, for other subjects relating to the work of councils.”\nI would love to have access to your Data on Erewash and, of course, for you to share your thoughts on how we can help local authorities and, via them, the people in our communities in Erewash and across the country.\nIn closing, I wish you well and thank you for all you do to help communities across the UK, you work is appreciated.\nI intend to stick up for our local economies and make sure Hospitality is recognised for the jobs it creates, the revenue it brings and the importance of it.\nKR\nJohn Kirby\n4 A reduction in VAT on cultural ticketing in GMVs to 0% and reduce VAT on\ncultural ticketing in the live music industry to the European average (5–7%)\nHere I disagree. I cannot see why there should be an exception for GMVs, and I have a stated policy already in place\nhttps://erewash-independent.com/pledge-eight-vat-the-high-street-and-hospitality/\n5 The creation of a specific business rates premises definition for GMVs and\nthe removal of properties satisfying that definition from the requirement\nto pay business rates\nAgain, Music Venues are businesses, so should pay business rates; businesses use services and are part of the community, so they should pay\nI am sorry my view does not align with what you are asking, but I have to say what I think and why, and I am always willing to listen to your views. Kind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_pledge-four/content_47.html": "https://gofund.me/392f8c2c\n#Erewash\nMy Fourth pledge is to work to work tirelessly in the areas of Carbon Monoxide and Gas Safety.\nCarbon monoxide (CO), a colourless and odourless gas, is a byproduct of the incomplete combustion of any carbon-containing material.\nSources of CO include inadequate ventilation of heating sources, automobile exhaust, faulty Boilers/furnaces, exposure to methylene chloride (an industrial solvent often used for cleaning and as paint thinner), and cigarette smoke and smoke from fires.\nExposure to CO raises levels of circulating carboxyhaemoglobin (COHb) in the blood.\nhttps://www.nhs.uk/conditions/carbon-monoxide-poisoning/\nI have campaigned on this for over 20 years and am now standing to be an Independent MP, and Gas Safety and Carbon Monoxide will be issues that I will fight for.\nI want to see all GP practices have non-invasive pulse CO-oximetry equipment.\nThis equipment is a continuous and non-invasive method of measuring the levels of various blood constituents, including carbon monoxide (SpCO).\nI will also campaign to change the rules on autopsy so that it is compulsory in all cases that involve an autopsy (Post-mortem) that carboxyhaemoglobin (COHb) tests are completed.",
  "https_erewash-independent_com_/https_erewash-independent_com_decapod-crustaceans/content_16.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: Decapod Crustaceans\nDear [Redacted]\nThank you so much for your email, and thank you for teaching me something, whilst I knew they were sentient, I did not know they did not have legal protections, despite being recognised as such. Decapod crustaceans, including lobsters, crabs, prawns, and shrimp, possess a complex nervous system that can perceive pain.\nI have to be open here; I am not a Vegan or Vegetarian; I eat meat, fish and game, but I do not believe in animal cruelty and believe all animals should have a quality of life and that the highest animal welfare standards should apply. I also believe that they should be dispatched (our polite way of saying killed) humanely.\nAgain, so that I am being transparent, I have purchased live animals and used an ice slurry for 30 minutes before spiking or cutting. However, after your intervention, I will ask my fishmonger to electrically stun and dispatch the animal for me in the future.\nI confirm if elected I will do my very best to raise awareness of this issue and implement the five aims\n1) I believe that these should be included in the Animal Welfare Act\n2) Also, they should be included in the Animals (Scientific Procedures) Act\n3) The ban on the sale of live animals to the public seems sensible because otherwise cruelty can take place, and that is not acceptable in a civilised society.\n4) On this issue, I accept that high welfare codes for Decapods should be introduced, but that is not enough, we have to ensure genuine and monitored high welfare standards are applied across all animals be they from the sea, land or air with enforcement\n5) I would certainly work to make sure that there is a ban on the export of all Decapods, and again like in 4) above, on all live animal exports.\nI hope the above answers you questions fully.\nKind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_mums-for-lungs/content_53.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |",
  "https_erewash-independent_com_/https_erewash-independent_com/content_1.html": "John Kirby\nIndependent Candidate to be MP for Erewash Constituency\nPlease note this is an archive site for the 2024 General election held on July 4th 2024, and remains only to show the platform on which I ran.\nAn Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook.\nIndependent Candidate to be MP for Erewash Constituency.\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put it’s case, for the benefit of its people.\nTime Left for General Election\nVision, Issues, & Values\nVision.\nI want to see community enhanced, I want people to feel valued and respected.\nI want to see your efforts rewarded\nWhen you have worked hard and paid taxes, you do not want the items you have worked hard for ruined. It is not right that your homes are flooded due to a lack of investment by water companies or that potholes damage your car due to a lack of investment in your road.\nBut health is more important than property, and you have paid for an NHS that is free at the point of use.\nIt should be there for you at the point of your need; GP wait times have to be addressed, first to ensure that people get the help they need when they need it, but also to reduce the individual’s pain and the worry delays cause and to reduce the strain on Hospital Emergency Departments.\nI believe in the community of #Erewash; I believe it has a future and that by working together, we can realise that potential.\nIssues\nThe primary duty of every MP is to represent their constituents, all of them those that voted for them, the one that choose to vote for others, and those that did not vote at all.\nAs an independent if you trust me with your vote will be able to do just that – I can fight for the issues that matter to you.\nI will not have to tow a party line; I can be your voice.\nValues\nI believe every person as a value, and deserves the best outcome in life.\nI believe there are more good people in this world than bad.\nThe sooner humanity realises that we all, regardless of gender, colour, creed, sexuality, religion, breathe one common air under one common canopy – for we are all equal, all making a single journey from birth to death, and use that knowledge to help each other the better\nThe ONLY label that matters is we are all #HumanBeings / #HumanKind and we NEED to be #HumanKind to each other\nAbout John\nJohn Kirby - An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook.\nIndependent Candidate to be MP for Erewash Constituency\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put it’s case, for the benefit of its people.\nReady to Support John For MP for Erewash?\nPlease support if you can and are willing, every penny counts to go up against established parties.\n#Erewash\nPRIORITY ISSUES\nThere are many issues facing our community, but as your representative, I have identified several key priorities that I believe require immediate attention.\nImproving access to healthcare\nPeople are truly concerned that they can not get GP appointments in a timely manner, nor can they access NHS Dentists. The divisions in the NHS mean so many feel they are falling between cracks in the system. They feel lost, and that is not acceptable, please read my policies page for more detail.\nEconomic inequality reduction\nOver the past twenty years, the gap between the haves and the have-nots has grown, and while no one wants to punish success, we must stop punishing those on low incomes. Our pensioner should receive a minimum income of £1828 per calendar month, Levelling up and fairness is crucial to our future, and together we need to look after each other, and ensure we value our children and young people, value families and parenting. We have to address fuel poverty, child poverty, food poverty, and pensioner poverty.\nInfrastructure investment plan\nI hope I speak for many of you, but are you not sick of hearing grandiose numbers £2 Billion for this plan, £11 Billion for that plan, Government announcement after government announcement, but you never hear where it was spent, you received it, or what the results were. We never hear how much was returned to the Treasury unspent. We must have transparency and accountability. Each project should provide detailed information. We, the public, have to see if we are getting value for money.\nHousing\nWe have to access all brownfield sites, and build homes on already scarred land as a priority, often these sites are where resources already exist. By increasing the housing supply, and ensuring that affordable homes to rent or buy are available",
  "https_erewash-independent_com_/https_erewash-independent_com_pledge-five/content_21.html": "https://gofund.me/392f8c2c\n#Erewash\nMy fifth pledge is about health. I will work to bring a change to how it operates. As of December 2023, there were 6,311 general practices in operation in England, the lowest number of practices since 2016. In fact, the numbers have been falling year on year since 2016. With the decreasing number of GP practices, the number of patients per practice in England is also increasing from 1600 to 2200, furthering the strain and pressure in general practice.\nAs of April 2024, 37,476 individual (headcount) fully qualified GPs were working in the NHS in England. In Full-Time Equivalent (FTE) terms of 37.5 hours a week, this equates to 27,606 full-time fully qualified GPs.\nThe Current Government have pledged to build 250 new ones if elected\nhttps://www.gpbusiness.co.uk/article/1303163/building-new-gp-surgery-premises\nIn this example, the cost to build one is £5m in 2011, but inflation will add to that, but even not taking that into account, 250 will cost £1.25 Billion and will take years to build.\nMost doctors’ surgeries are poorly utilised and open to the public for under 50 hours per week. So it is far better to use that £1.25 Billion to encourage existing practices to work a 6-2, 2-10 shift pattern, providing appointments 6 days a week, between the team, and employing new GP so help extend the service, and give the existing practices a utilisation on the investment of 96 hours per week.\nThis would also take the strain off #NHS Emergency Departments, reducing wait times significantly.\nThese facilities exist, they are there now, ready to be used, in your communities\nThis would increase appointments, this would increase availability to suit people working and lead to better health outcomes for patients.\n#GP #Doctors #GeneralPractice #health #erewash",
  "https_erewash-independent_com_/https_erewash-independent_com_dementia/content_44.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put it’s case, for the benefit of its people.\nRe: Dementia\nDear [Retacted]\nThank you for your email\nI understand and care about this issue, and not just to try and earn your vote.\nSadly my Mum Ann died of “Rapid Onset Dementia”\nIt was a dreadful time for us as a family to witness her fading and then coping with the grief of losing her. So, I well know the effect it has on the family and friends of the person who receives the diagnosis.\nIn addition to making personal charitable donations, I helped raise £7,150 for the Alzheimer’s Society.\nhttps://www.alzheimers.org.uk/\nhttps://www.justgiving.com/fundraising/lod-ac-12\nI share their vision of a world where dementia no longer devastates lives.\nSo, I am sorry to read your husband has a diagnosis and that Cognitive Stimulation Therapy is not available to your husband now. We know this can have a positive outcome and improve the quality of life for the patient and those around them.\nWe sadly had to put Mum into a nursing home, and the rate back in 2011 was £980 per week for the home, but because she had dementia, that was uplifted to £1372 (£196 per 24 hours), which clearly shows we need more dementia care and nursing.\nI hope that you are making time for yourself, too, and that your husband’s condition is managed to give him and you the best quality of life possible\nI am committed to helping #Erewash. If you read my first pledge in the blogs section of my website, I will donate 25% of my MP salary to charities and good causes. I promise to do my very best every day.\nI will happily sign the pledge on dementia, and it will be a subject I take forward and champion.\nKR\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_animals-animal-welfare/content_22.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: Animals\nDear Claire, Nicky, Marie, Paula, Debra, Cathy, Jane and Christoper\nThank you so much for your emails; this response covers those sent under the headings\nWill you pledge cruelty-free? (Claire, Nicky)\nStanding up for animals in this election? (Marie, Paula,Debra)\nHelp kick testing on animals out of our homes. (Cathy, Jane)\nSustainable and legal shooting and conservation. (Christopher)\nIn the interests of transparency, I am not a Vegan or Vegetarian; I eat meat, fish and game, and in the interests of open honest debate, so that no one group thinks I am saying one thing to them, and something else to others, my response is to the points raised.\nI am not a “Soundbite” politician, so I am clear in my response and give my reasons. I know my answers might not appeal to all, but I have to protect my integrity, so you know what I say and why.\nRegarding Cruelty-free\nI am wholly supportive on a ban on the testing on animals for cosmetic purposes, and go further, I want to see tighter regulation of the use of animals in all laboratories including medical research.\nWhen it comes to Chemical in our homes, I have written about Multiple Chemical Sensitivity (MCS) in April 2023 (See below my signature)\nWe need to alter the tax breaks for R+D funding to exclude research dependent on animal testing.\nThe protection for animals needs to be bolstered, and we need to use best practice to speed up the ban on animal testing.\nStanding up for Animals\nWhilst I agree with the view, we are a nation of Animal Lovers, and I want to see the highest welfare standards for animals, I am not going to be a hypocrite about it, I know to feed my family and me, animals are dispatched, the polite way of saying they are killed. However that should be in a humane way, and no animal should see of hear another being killed, it should be dome with as little stress as possible.\nI cannot sign the World Action Manifesto in its entirety because of the ending of the exploitation for profit of wild animals for profit clause. What others see as exploitation might be, in others’ eyes, running a commercially viable business. We need food with sustainability, and that costs money.\nThe contents in the Help Kick testing on Animals out of our homes is the same as the text in the Will you pledge cruelty-free? So is covered above.\nAnd finally, to the Sustainable and legal shooting and conservation.\nWhilst what you have read above from me, is about caring for Animals, I support Sustainable and legal shooting and conservation, but again it has be done in a humane way, one change I want to see, is that no one gets to shoot at a wild animal, without first shooting clays and skeets, and reaching a level of competence.\nBut land management, for both habitat management and conservation work is crucial and commercial shoots help to fund and support this important work.\nI cannot sit and eat Meat, fish and Game, but then condemn the process by which it reaches my table, if that way includes the highest standards of animal welfare, and is done in a sustainable way.\nSo I will work tireless to raise standards.\nKind Regards\nJohn Kirby\nMultiple Chemical Sensitivity (MCS)\nBy John Kirby\nApril 4, 2023\nMultiple Chemical Sensitivity (MCS) is a chronic condition in which individuals experience a variety of symptoms such as headaches, fatigue, dizziness, nausea, respiratory difficulties, and skin irritation when exposed to low levels of chemicals commonly found in the environment. These chemicals may include fragrances, pesticides, solvents, cleaning agents, and other substances found in everyday products such as perfumes, air fresheners, cleaning products, and building materials. The exact causes of MCS are not fully understood, but it is believed that exposure to multiple chemicals, genetic predisposition, and immune system dysfunction may all play a role.\nAlthough the prevalence of MCS is difficult to determine due to the lack of diagnostic criteria, it is estimated that between 5 and 15 per cent of the population may be affected by the condition. MCS can occur in individuals of all ages, genders, and backgrounds, although women are thought to be more commonly affected than men.\nMCS is a controversial condition, with some experts questioning its validity as a medical diagnosis. Despite this, many individuals with MCS experience significant impacts on their quality of life and may struggle to function in everyday environments due to their symptoms. The condition can also be difficult to diagnose, as there is no single test or set of criteria that can definitively confirm the diagnosis. Diagnosis is typically made through a process of elimination, in which other potential causes of the individual’s symptoms are ruled out.\nSome #NHS Trust are trying to get funding to do research\nhttps://bnssg.icb.nhs.uk/directory/multiple-chemical-sensitivity-mcs-and-clinical-ecology-environmental-medicine/\nhttps://bnssg.icb.nhs.uk/wp-content/uploads/2015/09/Multiple-Chemical-Sensitivity-and-Clinical-Ecology-Environmental-Medicine.pdf\nWhile the exact causes of MCS are not fully understood, it is believed that exposure to environmental chemicals may play a significant role. Individuals with MCS may have a heightened sensitivity to these chemicals, which can trigger a range of symptoms. Some experts believe that the immune system may also play a role, with some individuals with MCS experiencing changes in immune function or inflammation in response to chemical exposure.\nThere is no known cure for MCS, and treatment typically focuses on minimising symptoms and reducing exposure to environmental chemicals. This may include making changes to the individual’s living or working environment, such as using fragrance-free products, avoiding exposure to pesticides, and improving ventilation. Some individuals with MCS may also benefit from lifestyle changes such as a healthy diet and exercise, as well as supplements or medications to support immune function and reduce symptoms.\nIn the UK, there is limited research on MCS, and the condition is not officially recognised as a medical diagnosis. However, the UK MCS Research and Treatment Network is a key organisation in the field, bringing together researchers and healthcare professionals with an interest in MCS to share knowledge and promote research. The network aims to improve understanding of MCS and develop effective treatments for the condition.\nHowever, here is a paper from the US\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC1241653/pdf/ehp0111-001498.pdf\nDespite the lack of official recognition of MCS in the UK, many individuals with the condition may seek treatment and support from healthcare professionals. However, due to the lack of specific diagnostic criteria, individuals with MCS may struggle to access appropriate care. Some individuals may be referred to specialists in related fields, such as allergists, immunologists, or environmental health experts, while others may rely on complementary and alternative therapies to manage their symptoms.\nMCS is a complex condition that can have a significant impact on the lives of those affected. While the exact causes of the condition are not fully understood, exposure to environmental chemicals and immune dysfunction are thought to play a role. There is no known cure for MCS, and treatment typically focuses on minimising symptoms and reducing exposure to environmental chemicals. Although MCS is not officially recognised as a medical diagnosis in the UK, the UK MCS Research and Treatment Network is working to improve understanding of the condition and develop effective treatments. Individuals with symptoms suggestive of MCS may benefit from seeking advice from healthcare professionals or support groups to help manage their symptoms and improve their quality of life.\nThis condition can affect people in so many ways, and whilst no one was to deny people with service dogs access to the benefits they bring one example was when a person with a severe allergy turns up for a flight, and a service dog is boarded too.\nIf a person with a severe allergy to dogs has booked a flight and a guide dog is boarded on the same flight with another passenger, it can create a challenging situation. While airlines have policies in place to accommodate individuals with allergies, it’s important for the person with the allergy to communicate with the airline and seek assistance in managing their allergy symptoms. Here are some potential actions that can be taken:\nInform the airline in advance: If the person with the allergy knows in advance that a guide dog will be on the flight, they should inform the airline of their allergy and ask to be seated as far away from the animal as possible.\nUse medication: The person with the allergy may be able to take medication to manage their symptoms, but they should consult with a doctor before doing so.\nRequest a seat change: If the person with the allergy is seated near the guide dog, they can ask the flight attendant if there are any available seats farther away from the animal.\nWork with airline personnel: Airline personnel may be able to make accommodations such as reseating the person with the allergy or offering a face mask to help reduce exposure to the allergens.\nTake a later flight: In some cases, it may be necessary for the person with the allergy to take a later flight or find an alternative means of transportation.\nIt’s important to note that the airline is required by law to accommodate individuals with disabilities, including those who rely on service animals. However, they are also required to make accommodations for individuals with allergies to the extent that doing so does not fundamentally alter the nature of their service. Ultimately, the airline should work with the person to find a solution that is safe and comfortable for everyone involved, while also accommodating the needs of the passenger with the guide dog.",
  "https_erewash-independent_com_/https_erewash-independent_com_first-bus-public-transport/content_19.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: First Bus\nDear [Redacted]\nThank you so much for getting your public affairs team to email me your very informative briefing pack.\nI would like to refer you to a response I gave to Erewash Sound Question2.\nhttps://erewash-independent.com/erewash-sound-candidate-question-list/\nand to a concerned constituency member\nhttps://erewash-independent.com/access-to-nature/\nI am committed to Low Fare Public Transport (LFPT) but high standards of service, and that takes subsidies to make it work – Bus and Coach operators have done so much to decarbonise transport, and we need to build on that.\nI personally remain so disappointed that the Department of Transport would not engage with Project LUNA ADEONA; it had and still does have so much potential for a forward-looking bus/coach company to enhance its revenue stream and reduce private car journeys.\nI wish you, your team and your company the very best Kind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_about/content_26.html": "Meet John\nJohn is known for his warm, friendly, and helpful nature. He speaks to people in a non-judgmental way with kindness and compassion. He speaks to them on their level and shows understanding to those he meets. He is always willing to stop, have a cup of Tea and chat.\nBIOGRAPHY\nJohn Kirby was born and raised in the South. Spending his time between Ashford, Kent and Islington, North London. Before moving to the East Midland in December 1996.\nHe has spent the last 28 years raising his family in the local community and supporting the community whenever possible.\nProjects special to him are\nAlzheimer’s Society (alzheimers.org.uk) and he has helped raise over £7,000 for them https://www.justgiving.com/fundraising/lod-ac-12\nSupporting https://www.rainbows.co.uk/ for 18 years\nand supporting https://hhho.org.uk/ since 2011\nJohn has also supported many other charities with time and money over the years.\nIn addition, John has campaigned to raise awareness around Carbon Monoxide for over 20 years, as well as Fuel Poverty, Child Poverty, Food Poverty and Pensioner Poverty.\nBACKGROUND\nJohn Kirby comes from a working-class family and understands firsthand the challenges that many members of our community face.\nIn 1966, he knew about recessions and the devastation they had on communities, and he experienced the fuel crisis of the early 1970s.\nBeing an engineer allows him to solve problems and use logic to find solutions, and his business background means that he understands the balance sheet and return on investment.\nEDUCATION\nJohn's parents understood the value of education and supported John from a very young age; this enabled and empowered him.\nThe value of parenting should not be underestimated, and we have to ensure families are supported and valued.",
  "https_erewash-independent_com_/https_erewash-independent_com_pledge-one/content_27.html": "Pledge One – Donation to CharityBy John Kirby / 6th June 2024 31 May 2024 by John Kirby, Organiser My first pledge if elected is to donate 25% of my MP salary to local charities and good causes. Twitter Facebook This will bring money into the local community and help local people in Erewash. Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like this:Like Loading... Related",
  "https_erewash-independent_com_/https_erewash-independent_com_nus-national-union-of-students/content_11.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: NUS\nDear [Redacted]\nEducation lifts people out of poverty, which is a fact undeniable worldwide, but sadly, in the UK, it also puts students into debt.\nWe ask students to study hard, do well, and achieve, and that is a full-time job, yet we underfund and force them to work to survive. It is the equivalent to two full-time jobs.\nWe need to end tuition fees, as in Scotland, education should be free at the point of learning (As the #NHS is free at the point of use), but we have to recognise it is valuable and has value.\nI want changes to the tax system, including a 10% levy ringfenced for the NHS and a graduate tax of 3% ringfenced for education. If people know where their taxes are going, they will be willing to pay, and these are NOT additional taxes but a realignment inside the existing system.\nAs for homes, it is a disgrace so many properties lay empty whilst we have a housing crisis and people are homeless, either sofa-surfing or, at its worst, rough-sleeping. The big parties say the planning system is broken, but 2/3rd of planning giving consent in the past 5 years is unbuilt, and developers restricting supply to artificially keep prices high.\nA land Tax of 35% of the council tax or business rates per plot levied from one year after planning is granted, would encourage prompt development. Any money earned from this tax should be placed in a fund to upgrade all homes to the highest possible standards on energy , insulation etc.\nWhat a mess; the Government has stoked division on migration and has confused the terms used, so people live in fear. The fact is that our Universities are great, people want to come to study and to research, and the Government has stifled that market, which was income-producing, and all studies should bring net benefits to the UK.\nAs to a healthy future, that comes from improved air quality and earlier treatment. Reducing waiting lists, and getting treatment completed, is a better outcome for patients, less pain and suffering, but also good for productivity, getting people back to work. Kind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_blog_page_4/content_25.html": "Gender Ideology\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate […]\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate […]\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nPlease support if you can and are willing; every penny counts to go up against established parties. https://gofund.me/392f8c2c Erewash My\nPledge Eleven – ElectroSafe Cards (Technical Competence Cards for the Electrical Trades) Read More »\nIs it in the wording Britain was Great Britain, and then it was the United Kingdom, yet it seems to\nPlease support if you can and are willing; every penny counts to go up against established parties. https://gofund.me/392f8c2c Erewash My\nPledge Ten – Mortgage Prisoners Read More »\nPlease support if you can and are willing; every penny counts to go up against established parties. https://gofund.me/392f8c2c Erewash My\nNinth Pledge – Banking, Unbanked and Debanked Read More »\nPlease support if you can and are willing; every penny counts to go up against established parties. https://gofund.me/392f8c2c Erewash My\nPledge Eight – VAT, the High Street and Hospitality Read More »\nWater Companies https://gofund.me/392f8c2c Erewash My SEVENTH pledge is about Water Companies I do not understand why we cannot fine water\nPledge Seven – Water Companies Read More »",
  "https_erewash-independent_com_/https_erewash-independent_com_pledge-two/content_29.html": "The “Everybody in” policy is paramount; it is morally wrong to have so many empty homes, some sitting rotting for 10 years or more, and people in expensive, inappropriate accommodations with their lives on hold.\nThere are in Erewash – according to the Department for Levelling Up, Housing and Communities figures, 771 homes in Erewash were long-term empty as of October – an increase from 729 during the same period in 2022.\nAlso, just in brownfield sites in #Erewash, there is space for 2466 homes.\nHow can it be right that people are sofa surfing, that you, your children or grandchildren can not get an affordable home to live in, rent or buy\nPingback: Renters – Erewash Independent\nPingback: Homelessness – Erewash Independent",
  "https_erewash-independent_com_/https_erewash-independent_com_pledge-eight-vat-the-high-street-and-hospitality/content_13.html": "Erewash\nMy Eighth pledge is about VAT, the High Street and Hospitality\nI know VAT is 20%, and I think that should remain the higher level. While businesses that are VAT registered do not pay #VAT, so it is fiscally neutral to them, it does affect the spending power of the consumers they rely on.\nThe #HighStreet and the #Hospitality #HospitalitySector, in particular, have been asking for a #VATcut.\nMy compromise proposal is that the higher rate remains for all online orders/takeaways etc, but\nit is cut to 15% for all in-person sales, so if the public is in your shop, pub, club or restaurant, VAT is reduced to 15% – giving them a 5% discount. This will encourage people back to the shops and #hosptaility sector premises.\nI also propose that premises in the hospitality sector venue size up to 150 covers, can twice a month pay for a £20 licence to have a vat-free day, where they do not have to charge VAT but it is conditional on declaring their register number and X and Z reading at the start and finish of the day and that they are spending a combined amount of £200 on acts, either bands or Cabaret etc to host a live event.\nThis will result in a 15% discount to the public, encouraging them to go out and it will support live acts.\nAlso, on VAT, this would reduce the proposed VAT on Private Schools to 15% to help those that wish to keep their children in them, and the 15% raised this way should be ringfenced for education.\nPingback: Right to withdraw Labour – Erewash Independent\nPingback: Local Government Association – Erewash Independent\nPingback: Inland Waterways – Erewash Independent\nPingback: Grassroots Music – Erewash Independent",
  "https_erewash-independent_com_/https_erewash-independent_com_standing-up-for-people-planet-in-erewash/content_52.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put it’s case, for the benefit of its people.\nRe: Standing up for people and the planet in Erewash\nDear [Redacted]\nThank you for your email, and I hope the following response makes clear my position.\nFirst, can I refer you to my pledge to make Water Companies Responsible\nhttps://erewash-independent.com/pledge-seven/\nand given 8% live in flood risk areas, I find it abhorrent that while homes and businesses including farmland, are subject to flooding, and do not misconstrue this I am not against foreign aid, but we are funding a project in Iraq to build over 350km of drainage infrastructure as well as 15 stormwater and wastewater lifting stations near Hillah city.\nUpon completion, the project is expected to help over 25,000 households access clean water.\nhttps://www.gov.uk/government/news/uk-businesses-to-build-over-350km-of-new-critical-drainage-system-in-iraq\nSome will argue that it is creating British Jobs, but if we were building this here, the jobs would still be created.\nAnd as for Air Quality, see my reply to Mums For Lungs\nRe: Mums For Lungs\nDear [Redacted]\nThank you so much for your email of the 10th of June, and I thank you for it.\nI am standing as an independent, and yes, I want votes. I want to be empowered by the people of Erewash to represent them in Parliament, and air quality, air pollution, and the environment really matter.\nBUT, and yes, that was deliberately a big but, I am not replying to you to get your vote; I am replying because what you are asking me as a representative of yours if I am lucky enough to get elected is the RIGHT thing to do.\nI will share with you my personal non-campaign Twitter/X https://x.com/csljohnkirby\nAnd here are live links to the times I mentioned Air Quality\nhttps://twitter.com/search?q=%40csljohnkirby%20%2B%20air%20quality&src=typed_query&f=live\nhttps://twitter.com/search?q=%40csljohnkirby%20%2B%20pm2.5&src=typed_query&f=live\nAs you can see, this is personally important to me, just as it is to you and your family.\nPlease take a look at the website https://www.ultra-protect.co.uk/inbiot-indoor-air-quality-monitoring which is a commercial business, but look at the range of sensors, and the number of various samples that can be monitored. I genuinely believe these types of monitors should be in schools, drive-thru’s and homes\nThe figures you quoted in your email are correct. Ask a mum if she wants a 2% cut in national insurance or for her child not to be coughing, using inhalers, or missing their education through lost days of schooling due to illness. I know the answer you will get.\nFor those who say it is unaffordable, what value is a day of good health to a child? What value is a reduction in the long-term effect of poor air quality?\nLook at the cost to the NHS and Government via Social Care.\nhttps://www.gov.uk/government/news/new-tool-calculates-nhs-and-social-care-costs-of-air-pollution\nI have been standing up for people and the Environment all my adult life, and I make this commitment to you all, I will stand up for Erewash and the people of Erewash to the best of my ability\nKR\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_antisemitism-pledge/content_51.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put it’s case, for the benefit of its people.\nRe: Antisemitism Pledge\nDear Campaign against Antisemitism,\nThank you for your email dated the 10th of June, and I thank you for it.\nI have long supported the work https://www.het.org.uk/ and we have to learn from the past and forgive in the present, and education is key to this.\nI have signed your pledge.\nMy long-held view is\nThe sooner humanity realises that we all, regardless of gender, colour, creed, sexuality, religion, breathe one common air under one common canopy – for we are all equal, all making a single journey from birth to death, and use that knowledge to help each other the better The ONLY label that matters is we are all #HumanBeings / #HumanKind and we NEED to be #HumanKind to each other.\nKind regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_author_jwkirbye30f562241_page_2/content_14.html": "First Bus – Public Transport\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate […]\nFirst Bus – Public Transport Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate […]\nFirst Bus – Public Transport Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nDWP – Take account for your mistakes and stop convicting innocent people Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nBritish Hindu Community Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nJohn Kirby – An Independent,Liberal-Minded ConservativeSoul with a Socialist Heart,tinged with a Green Outlook.Independent Candidate to beMP for Erewash Constituency\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nAnimals – Animal Welfare Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nDecapod Crustaceans Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate",
  "https_erewash-independent_com_/https_erewash-independent_com_erewash-sound-candidate-question-list/content_43.html": "Candidate Question List\nYou will be asked ALL of the following questions.\n- Not every question is guaranteed to be used in the programme. – The questions may not be asked in this order.\n- Your answers are timed to ensure they do not need to be edited/clipped. You can see the clock as you answer.\n- Could you tell us a little about yourself in thirty seconds? [30 seconds]\nI am an Independent, Liberal-Minded Conservative Soul with a Socialist Heart tinged with a Green Outlook.\nI am willing to look at things logically and reach a compromise, starting with all the common ground. - People in the constituency have been struggling with constant changes to the bus services, such as the 21 being cut back in 2022 – what would you do to improve public transport for locals? [60 seconds]\nI believe in low-fare public transport (LFPT)\npromoting social inclusion;\nincreasing the mobility and disposable income of particular socio-economically disadvantaged groups;\nlowering employment costs for employers and employees and creating new opportunities for work;\nincreasing the modal share of public transport alongside modal shares for walking and cycling;\nreducing negative environmental impacts caused by urban transport (e.g., reducing traffic congestion and improving air quality and the long-term health of residents).\nI look to Europe, where countries that have invested in bus services benefit greatly. Kings did a lot of work on how low-cost transport helps mental health; the example you give re Route 21, and whilst I respect Trent Barton, has led to people in Kirk Hallam, Shipley View, and Hallam Fields, for example, not feeling valued and being isolated from the wider Erewash community. We need strong transport links and investment to ensure everyone is connected.\n- Over in Long Eaton we’ve recently seen the closure of one of the Asylum Accommodation Centres on Bostocks Lane – how would you deal as a national representative with the asylum seeker backlog? [60 seconds]\nThe Government has driven the cost of this, the policy of no “Safe-Routes”, the accommodation the Government chose to basically set up Gettos, the failure to DNA Sample and tag all asylum seekers for their protection as well as the security of the UK, and to bar them from working whilst allowing more visa was insanity.\nFrom day one, these asylum seekers should have needed to prove they were not only looking for refuge but also to give something back to us, the host country.\nBy working and contributing, I think the British people are genuinely compassionate. Still, the Government sowed division, and the British got up, went to work, earned money, and struggled to live, while hundreds were placed in their community and walked around all day. It is about fairness. - How are you going to engage with younger generations during these elections? What do you think is the most pressing issue for a group who historically don’t turn out to vote in such high numbers? [60 seconds]\nThis starts with respect and engagement, without Judgement; the “National Service” government policy does not meet that. However, encouragement to join the Police Cadets, the various military cadet programmes, the fire cadets, etc, can help immensely.\nYoung people are a great asset to our communities and nation, and we have to value them - Let’s look at the local Government. The councils across the country are cash-strapped, and Erewash Borough Council is phasing out the grants it gives to parish councils, how do you navigate all of this? [60 seconds]\nI find it odd that we are putting in extra layers of Government, like new mayors, yet gutting back on essential services. I believe people do not mind paying fair taxes, but they want to know where that money is going and that it is being spent wisely. Concurrent Grants are a fundamental part of levelling up and ensuring fair distribution of funds. In the future, we need a set formula to allow parish councils the ability to plan long-term (10 years) so money can be invested in programmes and maintained - Moving to regional Government, we’ve got a new Mayor for the East Midlands. How are you going to get the best deal for Erewash? [60 seconds]\nI answered the last question by mentioning extra layers of Government and how when we face so many cuts, the cost element has to be considered. We have to make it have value, and over the past few years, governments have caused local authorities to waste money trying to attract investment, such as levelling up funds, Town Centre funding etc, in “Beauty Parade” competitions.\nThat said, one has to engage with the mayor’s office, plead one’s case for #Erewash and highlight the broader benefits to the East Midlands that Erewash can bring.\nAnd, of course, we have to counter the threat to #Erewash from the special economic zone (Freeport) at East Midlands, as that could draw investment away from us. - Some people here have been hit terribly hard by flooding; just think back to Storm\nBabet, how will you help them? [60 seconds]\nWell, there are several things, but first, I must acknowledge the stress and anxiety this has caused people and continues to do so.\n1) OFWAT is not fit for purpose; it acts as a trade body protecting companies rather than consumers, so I would work to change that\n2) Water Companies have earned Billions from the UK consumer and underinvested; this has to be rectified; more investment from the companies and their shareholders without increasing bills; they have already had a lot of the money that should be allocated to this\n3) The Environment Agency needs to step up with better modelling, planning, and being more reactive.\n4) I am sure the listeners of Erewash Sound would be astounded to find out the British Government is underwriting the financing to develop over 350km of drainage infrastructure and 15 stormwater and wastewater lifting stations not here in Britain but in Iraq near Hillah city.\nUpon completion, the project is expected to help over 25,000 households access clean water in the wider Al-Hillah district, where wastewater is not currently treated.\nhttps://www.iraqinews.com/iraq/iraq-to-build-new-drainage-system-in-hilla-with-financing-from-the-uk/\nThe finance comprises of a direct loan of £113 million from His Majesty’s Treasury and a guarantee for £113 million in financing supplied by Standard Chartered Bank.\nhttps://www.gov.uk/government/news/uk-businesses-to-build-over-350km-of-new-critical-drainage-system-in-iraq\n5) the blight of homes in flooding areas needs to be alleviated by the British Government becoming the insurers of last resort to affected properties.\nThe finance comprises of a direct loan of £113 million from His Majesty’s Treasury and a guarantee for £113 million in financing supplied by Standard Chartered Bank.\n- Housing is becoming a hot topic; people want to protect greenbelt land, and people want homes for their children to live in. Just last year, the central Government intervened to force the borough council to stick to its house-building targets. Where do you stand? [60 seconds]\nI am a great advocate for using brownfield sites in Erewash alone.\nAlso, just in brownfield sites in #Erewash, there is space for 2466 homes\nhttps://erewash.gov.uk/component/jdownloads/?task=download.send&id=502&catid=22&m=0&Itemid=435\nThis is not using Greenfield sites or Farmland; the above figure is just a better use of resources.\nHow can it be right that people are sofa surfing, that you, your children or grandchildren cannot get an affordable home to live in, rent or buy?\nThink at an average of 1.85 bedrooms per property (2,466+771=3,237) x 1.85 =5,988 bedrooms in Erewash alone, yet we have people living in damp, overcrowded conditions.\n- Our high streets in Long Eaton and Ilkeston were both hit hard by the closure of Wilko stores, and it’s a struggle to compete with online retailers. What’s your plan to protect local businesses? [60 seconds]\nWe all know VAT is currently charged 20% on most things. However, whilst I agree this should remain as the primary rate for all online orders, takeaways, etc., I believe we should have a new rate of 15% for all instore purchases, whilst businesses that are VAT registered claim VAT back so this will be fiscally neutral to them as all VAT is, it is a consumer tax, it will make the visits to restaurants, pubs and club, nail bars, hairdressers and retail shop 5% cheaper for customer so that should help attract footfall and support the high street.\nOnce we lift footfall, that should attract other shops to open.\n#ShopLocal and #BuyBritish are essential to keeping the money in our community.\nFor use on our results night programme:\n- If you were to win the election, what would be the first thing you’d do? [60 seconds]\nFirst I would have a whiskey to celebrate, the E because it will be Irish\nAnd then\nWell, cliché, I know, but start to work for all the people of Erewash, those who voted for me and equally those who did not; we have a great community, and I value it.\nI also hope my first pledge to donate 25% of my salary throughout the life of the parliament will help our community,\nPingback: First Bus – Public Transport – Erewash Independent",
  "https_erewash-independent_com_/https_erewash-independent_com_questionnaire/content_3.html": "Skip to content\nHome\nAbout\nContact\nBlog\nQuestionnaire\nPolicies\nFunding\nMenu\nHome\nAbout\nContact\nBlog\nQuestionnaire\nPolicies\nFunding\nQuestionnaire\nLoading…",
  "https_erewash-independent_com_/https_erewash-independent_com_blog_page_2/content_30.html": "First Bus – Public Transport\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate […]\nFirst Bus – Public Transport Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate […]\nFirst Bus – Public Transport Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nDWP – Take account for your mistakes and stop convicting innocent people Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nBritish Hindu Community Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nJohn Kirby – An Independent,Liberal-Minded ConservativeSoul with a Socialist Heart,tinged with a Green Outlook.Independent Candidate to beMP for Erewash Constituency\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nAnimals – Animal Welfare Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nDecapod Crustaceans Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate",
  "https_erewash-independent_com_/https_erewash-independent_com_funding-2/content_9.html": "Donation DEMOCRACY Costs Money Please support if you can and are willing, every penny counts to go up against established parties.#Erewash Donate Now",
  "https_erewash-independent_com_/https_erewash-independent_com_access-to-nature/content_17.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put it’s case, for the benefit of its people.\nRe: Access to Nature\nDear [Redacted]\nThank you so much for your email of the 11th of June, and I thank you for it.\nAccess to nature is a very important cause, and I believe in believe in low-fare public transport (LFPT)\npromoting social inclusion;\nincreasing the mobility and disposable income of particular socio-economically disadvantaged groups;\nlowering employment costs for employers and employees and creating new opportunities for work;\nincreasing the modal share of public transport alongside modal shares for walking and cycling;\nreducing negative environmental impacts caused by urban transport (e.g., reducing traffic congestion and improving air quality and the long-term health of residents).\nI look to Europe, where countries that have invested in bus services benefit greatly. UCL www.ucl.ac.uk did a lot of work on how low-cost transport helps mental health; the example\nhttps://www.ucl.ac.uk/news/2019/may/bus-passes-linked-increased-happiness-older-adults And Kings did a more general piece that confirms much of what you said in your email\nBiodiversity is key to the mental health benefits of nature, new study finds | King’s College London (kcl.ac.uk)\nWe have to do more to open up the countryside and understand the value of access to it for the broader well-being of society\nKind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_blog_page_3/content_38.html": "Erewash Sound – Candidate Question List\nCandidate Question List You will be asked ALL of the following questions. promoting social inclusion; increasing the mobility and disposable […]\nErewash Sound – Candidate Question List Read More »\nCandidate Question List You will be asked ALL of the following questions. promoting social inclusion; increasing the mobility and disposable […]\nErewash Sound – Candidate Question List Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nLocal Government Association Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nStanding Up for People/Planet in #EREWASH Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nGlobal Hunger inc UK Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nRight to withdraw Labour Read More »\nJohn Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate\nAntisemitism Pledge Read More »",
  "https_erewash-independent_com_/https_erewash-independent_com_education/content_12.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put it’s case, for the benefit of its people.\nRe: Education\nDear [Redacted]\nThank you for your email, and I have received a large number of emails on this subject.\nI am not a soundbite politician; I have views and opinions, and reasons for having them. So my answers are as follows. Please feel free to read all of them, or scroll to the heading that matters to you\nThis response covers\nSupport people with learning disabilities this election!\nGE Candidate Survey-Are you Neurodiverse?\nLearning disability charity Hft\nPledge to oppose school cuts\nWill you support comprehensive education?\nSupport Parental Rights in Education\nf40 campaigning for reform of education and SEND, along with greater investment and fairer funding\nI wrote this about education over a year ago\nEducation\nBy John Kirby\nMarch 31, 2023\nThe education system in the UK has undergone significant changes in the past three years due to the COVID-19 pandemic. One of the most notable changes has been the temporary closure of schools and the transition to remote learning. This has had a significant impact on both students and teachers, and it has raised concerns about the effectiveness of remote learning and the long-term consequences of school closures.\nBut we do have to thank school teachers, college & university lecturers and the support staff in education, They adjusted to the situation and did their best in the circumstances.\nThe impact of school closures and remote learning on students has been significant. Many students have struggled with the lack of social interaction and the difficulties of adapting to a new way of learning. For younger students, in particular, the lack of in-person instruction has made it difficult for them to stay engaged and focused on their studies. Some students have also experienced technical issues and difficulties with accessing online resources, which has further disrupted their learning.\nThere are also concerns about the impact of school closures and remote learning on students’ academic progress. Research has shown that students who have been out of school for extended periods may experience learning loss and struggle to catch up with their peers when they return to the classroom. An extremely good paper, which whilst about missing school due to illness is still relevant https://adc.bmj.com/content/107/3/289 (Credit to @Nan Hu Joanna Fardell Claire Wakefield @Glenn M Marshall @Jane C Bell Natasha Nassar Raghu Lingham\nThis is particularly true for students from disadvantaged backgrounds who may not have access to the same resources and support systems as their more affluent peers.\nThe impact of school closures and remote learning has also been felt by teachers. Teachers have had to adapt quickly to a new way of delivering instruction, and many have reported feeling overwhelmed and overworked. The lack of in-person interaction with students has made it more difficult for teachers to assess student progress and provide personalised feedback.\nDespite these challenges, there have been some benefits to remote learning. For example, remote learning has allowed for greater flexibility in scheduling and has made it possible for students to access resources and instruction from anywhere. It has also allowed for greater collaboration and communication between teachers and students, as well as between students themselves.\nHowever, it is essential to recognise that remote learning is not a substitute for in-person instruction. The social and emotional benefits of attending school cannot be replicated through a computer screen. Many students have struggled with the lack of social interaction and support that comes with remote learning.\nLooking ahead, it is unclear what the long-term impact of school closures and remote learning will be. It is possible that there will be lasting effects on student academic progress and social development, particularly for those from disadvantaged backgrounds. It is also possible that the pandemic will lead to permanent changes in the way that education is delivered, with a greater emphasis on technology and remote learning.\nTo mitigate the negative impact of school closures and remote learning, educators and policymakers must work together to provide support and resources for students and teachers. This may include targeted interventions to address learning loss and provide additional support for students from disadvantaged backgrounds. It may also involve investments in technology and infrastructure to support remote learning, as well as ongoing training and professional development for teachers.\nSummary:\nThe COVID-19 pandemic has had a significant impact on the education system in the UK, particularly on school closures and remote learning. While remote learning has provided some benefits, it is important to recognise the limitations and the potential negative impact on student academic progress and social development. As we move forward, it will be important to prioritise support for students and teachers and to work together to ensure that all students have access to high-quality education, regardless of their circumstances.\n#Education #Learning #Teachers #remotelearning g#distancelearning\nSupport people with learning disabilities this election!\nMy support is for education, Full Stop. I have seen the power of it to change lives, and live people out of poverty. I have witnessed programmes like https://imaginationlibrary.com/uk/ make a difference so of course, I am supportive of www.ineedeasyread.org we have to make this world inclusive, companies need to make reasonable adjustments so that people of all abilities are on a level playing field.\nIt is morally wrong that disabled people are forced into debt and fall into poverty because of misunderstanding in terms and conditions, etc, for even items like hospital appointment parking arrangements.\nWe need clarity for all. I have signed the pledge\nGE Candidate Survey-Are you Neurodiverse?\nI have completed the survey. I am an “Oddball” by my own admission, and my ability to think differently as been an asset to many organisations, and in fact just over a year ago, I wrote this.\nThe Benefits of Employing a Diverse and Neurodivergent Workforce in the United Kingdom\nBy John Kirby\nJune 2, 2023\nTitle: The Benefits of Employing a Diverse and Neurodivergent Workforce in the United Kingdom\nExecutive Summary:\nIn today’s rapidly changing business landscape, fostering diversity and inclusivity within the workforce has become a strategic imperative for organisations. This document explores the benefits that United Kingdom businesses can derive from employing a diverse and neurodivergent workforce. It outlines the cost benefits associated with such employment practices and provides insights into the adaptations required to implement a successful plan.\nIntroduction:\nDiversity and neurodiversity refer to the inclusion of individuals from various backgrounds, cultures, and neurological differences in the workplace. The United Kingdom has recognised the importance of embracing diversity and has taken steps to promote equal opportunities and inclusive practices. By employing individuals with neurodivergent traits, businesses can harness unique perspectives, talents, and skills that can contribute to their success.\nBenefits of Employing a Diverse and Neurodivergent Workforce:\nEnhanced Innovation and Creativity:\nNeurodivergent individuals often possess exceptional problem-solving skills, attention to detail, and divergent thinking. By incorporating their perspectives into the workforce, businesses can foster innovation and creativity, leading to the development of novel ideas, products, and services.\nImproved Productivity:\nDiverse and neurodivergent employees can bring unique strengths and abilities that complement traditional ways of thinking. By leveraging these talents, businesses can improve overall productivity and efficiency. Neurodivergent individuals often excel in tasks requiring attention to detail, pattern recognition, and analytical thinking.\nExpanded Talent Pool:\nEmploying a diverse workforce allows businesses to tap into a larger talent pool. By creating an inclusive environment, organisations can attract a broader range of candidates, increasing the likelihood of finding individuals with the right skills and qualifications. This advantage strengthens recruitment efforts and reduces the risk of “group think” within the organisation.\nEnhanced Customer Understanding and Engagement:\nA diverse and neurodivergent workforce brings a wider range of perspectives, enabling businesses to better understand and serve their diverse customer base. With employees who can relate to customers from various backgrounds and experiences, organisations can create more inclusive and tailored products, services, and marketing strategies.\nCost Benefits of Employing a Diverse and Neurodivergent Workforce:\nReduced Recruitment Costs:\nHaving a diverse and inclusive reputation can significantly reduce recruitment costs. By being known as an organisation that values diversity, businesses can attract a wider range of candidates, reducing the need for expensive recruitment campaigns and agencies.\nImproved Retention Rates:\nA supportive and inclusive workplace fosters loyalty and commitment among employees. By providing the necessary accommodations and support for neurodivergent individuals, organisations can enhance employee satisfaction, leading to improved retention rates. This reduces the costs associated with turnover, rehiring, and retraining.\nIncreased Employee Engagement:\nWhen employees feel valued and included, they are more likely to be engaged and motivated in their work. By creating an environment that embraces diversity, businesses can foster higher levels of employee engagement, leading to increased productivity and overall business success.\nAdaptations Needed to Implement a Successful Plan:\nAccessibility and Accommodations:\nTo ensure an inclusive work environment, businesses must provide reasonable accommodations to support neurodivergent employees. This can include flexible working arrangements, assistive technologies, clear communication channels, and sensory-friendly spaces.\nTraining and Awareness Programs:\nOrganisations should implement training programs to raise awareness and understanding of neurodiversity among all employees. By promoting empathy, reducing stigma, and fostering a culture of acceptance, businesses can create a welcoming environment for all.\nSupportive Management Practices:\nManagers should be trained to recognise and appreciate the unique strengths and challenges\nLearning disability charity Hft\nFar too often, education is deemed to be about children but of course, it is adults too, and we need lifelong learning for all, not just the able-bodied but also those with disabilities.\nWhen you look at the prison population for example, the number of people that do not have basic Mathematic and English skills is disproportionately represented, and yet we fail them again, because we do not rehabilitate and upgrade their skills.\nI am happy to had my voice to help raise awareness, and to make sure that funding is in place to support and help with this issue.\nI also note there is an invitation to visit your services, and win or lose in my campaign, I am most happy to do so.\nPledge to oppose school cuts\nI have signed this pledge, it is abhorrent to me that schools are facing more cuts to budgets and have been subject to cuts over the past decade. We need an environment for learning, school building fit for purpose, and that is about suitable buildings, and air quality, it means supporting teachers, with training and with the correct equipment\nI wrote this article\nReinforced Autoclaved Aerated Concrete (RAAC)\nBy John Kirby\nSeptember 9, 2023\nReinforced Autoclaved Aerated Concrete (RAAC) presents specific challenges that require attention from the construction industry. While RAAC is favoured for its lightweight and insulating properties, it is not without issues, primarily related to moisture.\nOne significant concern is RAAC’s susceptibility to moisture-related problems due to its porous nature. Moisture infiltration and retention can lead to material deterioration and potential structural risks over time. Water absorption weakens the concrete, causing cracks, spalling, and reduced durability. This can pose a threat to the integrity of constructions, especially in areas with frequent freeze-thaw cycles.\nTo address these challenges and ensure the long-term performance of RAAC structures, various strategies can be applied:\nImproved Waterproofing:\nEmploying advanced waterproofing membranes and coatings can effectively prevent moisture from penetrating the material, reducing the risk of deterioration.\nProper Design and Construction:\nArchitects and engineers should consider site-specific conditions and incorporate design elements that minimise moisture exposure. Effective drainage systems, appropriate roof overhangs, and exterior finishes can help mitigate moisture-related issues.\nRegular Maintenance:\nImplementing a maintenance plan involving routine inspections is crucial to detect signs of moisture damage early, enabling timely repairs and preventing extensive harm.\nReinforcement Selection:\nCareful consideration of reinforcement materials and proper installation are essential to prevent deterioration caused by rusting.\nVentilation:\nAdequate ventilation is necessary to facilitate moisture escape, particularly in high-humidity regions.\nSealing and Coating:\nApplying specialised sealants and coatings designed for RAAC can protect the surface from moisture while preserving its thermal properties.\nEducation and Training:\nProviding construction professionals with proper training on RAAC handling, installation, and maintenance can enhance its longevity.\nResearch and Innovation:\nOngoing research and development in construction materials can lead to improved RAAC variants with enhanced moisture resistance.\nAddressing these challenges in the use of RAAC can lead to more sustainable and durable constructions. Collaboration with relevant stakeholders and advocating for responsible construction practices can contribute to the adoption of effective strategies within the industry.\nAnd this one\nAir Quality & Human Health\nBy John Kirby\nFebruary 13, 2023\nIt is important for governments and communities to take steps to reduce air pollution and protect people’s health and especially children’s health. This may include measures such as increasing the use of public transportation, promoting the use of renewable energy sources, and implementing stricter air quality standards. By reducing air pollution, we can help ensure that people can be protected and that children have the opportunity to grow and develop to their full potential.\nAir pollution has a significant impact on children’s health and educational outcomes.\nThis is not an exhaustive list, but these three main points show how air pollution affects children:\n1. Health Effects:\nChildren are more vulnerable to the harmful effects of air pollution as their bodies are still developing. Exposure to air pollution can cause respiratory problems, such as asthma and bronchitis, and increase the risk of cardiovascular disease. It can also harm the developing brain, leading to cognitive and behavioural problems.\n2. Learning and Development:\nAir pollution can also have negative effects on children’s learning and development. Studies have shown that exposure to air pollution can lead to decreased cognitive function and poor educational outcomes, including lower test scores and increased absenteeism.\n3. Physical Development:\nExposure to air pollution can also impact children’s physical development, leading to stunted growth and reduced lung function.\nChildren grow up to be adults, so it is only right to look at the longer-term impacts of poor air quality on the population.\nImproving air quality would have a positive impact on public health and would likely lead to significant savings for the NHS and the country.\nIll health does not just cost the NHS, it also cost the country in terms of reduced productivity, and increased benefit payments, but it cost the individual too, reduced income, suffering both physically and mentally.\nLong-term exposure to air pollutants such as carbon monoxide (CO), fine particulate matter (PM2.5), and nitrogen oxides (NOx) can have serious and lasting effects on human health.\nSome of the most common and well-documented health effects include:\n1. Cardiovascular disease:\nLong-term exposure to PM2.5 and NOx has been linked to an increased risk of cardiovascular diseases, such as heart attacks, strokes, and heart failure.\n2. Respiratory problems:\nPM2.5 and NOx can irritate the airways and lead to respiratory problems such as asthma, bronchitis, and chronic obstructive pulmonary disease (COPD).\n3. Cognitive decline:\nLong-term exposure to air pollution has been associated with decreased cognitive function, including memory loss, decreased attention, and reduced IQ scores.\n4. Cancer:\nLong-term exposure to air pollution has been linked to an increased risk of certain types of cancer, such as lung cancer and bladder cancer.\n5. Reproductive and developmental problems:\nAir pollution has also been linked to reproductive and developmental problems, including infertility, premature birth, low birth weight, and birth defects.\nImproving air quality in the country would benefit the National Health Service (NHS) in several ways:\n1. Reduction in air pollution-related illnesses:\nAir pollution has been linked to a range of health problems, including respiratory illnesses such as asthma and bronchitis, heart disease, stroke, and cancer. By reducing air pollution, the number of cases of these illnesses would likely decrease, reducing the burden on the NHS.\n2. Improved respiratory function:\nBetter air quality would improve respiratory function in the population, allowing people to breathe more easily and reducing the risk of respiratory-related illnesses. This would also reduce the need for hospitalization and treatments for these conditions, saving the NHS resources.\n3. Improved overall health:\nCleaner air can improve overall health and well-being by reducing exposure to pollutants that can cause harm. This can lead to a reduction in the number of patients requiring medical treatment for various health problems, saving the NHS resources.\nThe exact financial savings to the NHS and the country, clearly depend on several factors, including the extent of the improvement in air quality, the prevalence of air pollution-related illnesses in individual local areas, and the cost of treating these conditions.\nHowever, it is likely that the savings would be substantial, a figure of £50m, or potentially £157 million a year is being spent, with a total figure for 2017-2025 of £5bn likely to be the cost.\ngiven the significant health benefits that improved air quality can bring.\nIt is important to note that the health effects of air pollution are not limited to the information I provided above.\nDifferent individuals may be more or less susceptible to the effects of air pollution depending on factors such as age, genetics, and pre-existing health conditions. The best way to protect against the harmful effects of air pollution is to reduce exposure by promoting clean air policies, and taking steps to reduce personal exposure, such as using MVHR (Mechanical, Ventilation & Heat Recovery & air filters/purifiers in the home.\nWill you support comprehensive education?\nAbsolutely, I will support a comprehensive education, and I have failed to understand streaming, it is so academic focused, and writes of those for whom a practical training system would help.\nI would sooner have a 4-day academic programme, with one day per week from aged 11, allowing an option for skills-based training. From 11 to 12, we could teach practicable life skills, CPR, Basic First Aid, Fire Fighting etc, and then 13-16 options for Plumbing, Electrical, House maintenance, Nursing Parenting etc\nFor transparency here, I like the International Baccalaureate system, which values all learning and gives credit to students rather than on arbitrary tests, where a child could have a bad day or be ill, suffering from Hay Fever, for example.\nSupport Parental Rights in Education\nI support Relationships and Sex Education (RSE) in schools and whilst I agree that parents should be consulted, and have access to all material used, I do not believe in the right of a parent to withdraw their child from the classes.\nI do not think we should refrain teachers (Educators) from expressing a view, that leads to debate, but that said all perspectives should be presented in an open and transparent manner to reflect society as a whole.\nAs stated above I agree that parents should have access to all material used, but I would not agree that children can be withdrawn from any class regardless of subject. Education is a benefit, and all information in the agree curriculum should be taught to all.\nf40 campaigning for reform of education and SEND, along with greater investment and fairer funding\nI believe in Equitability, in people having fair chances, and that it matters, so unfair SEND funding deprives young people of realising their potential and making the most of all opportunities presented. It is immoral that instead of a National Funding Formula, that parents and young people are in a postcode lottery. We have seen recent cuts in transport to schools adversely affecting certain groups.\nNo child is a second-class citizen when it comes to education, and we have to ensure health and education work hand in hand to help improve the educational outcomes for all.\nKR\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_farming/content_45.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: Farming\nDear [Redacted]\nThank you so much for your email. I am so pleased to read how proud your local members are. Our agricultural sector is crucial, and we all know food security is becoming an even bigger issue post-Brexit.\nIn the UK, we impose high standards of animal welfare and environmental controls on farming, yet supermarkets abuse their positions and suppress farm gate prices.\nWe see farmers levied with huge fines for water pollution, yet water companies are literally given a slap on the wrist. It is the unfairness of the system\nI show below a link to my personal Twitter, and you will see my concern for this sector is not for votes now but part of who I am as an individual. Back in 2008/2011 I used to write a blog in Farmer’s Weekly\nhttps://x.com/search?q=%40csljohnkirby%20%2B%20farming&src=typed_query&f=live\nHow does a UK farmer feel when they lose crops or livestock due to flooding, their hard work washed away, only to read that the Government are backing loans to Iraq to improve drainage, water management and clean water.\nNearly a quarter of a billion pounds for a critical drainage system –\nhttps://www.gov.uk/government/news/uk-businesses-to-build-over-350km-of-new-critical-drainage-system-in-iraq\nAnd the Government’s argument, well, it creates jobs in the UK; well, guess what? If you are building that system in the UK and deploying it here, he creates even more jobs. Climate change is going to make water management and land management even more crucial in the future,\nI am more than happy to visit a farm in #Erewash and meet a group of farmers, and it goes without saying if, for bio-security reasons, that needs to be not on a farm due to numbers, that is fine too, and I will be more than happy to meet you for a Tea.\nPlease, as an Independent, I will not have to kowtow to the whip, so I can represent the people of #Erewash first, unlike the current Party First politicians, power at all costs.\nPenultimate, if there is any aspect your members think I should look into, please let me know, and I will make every effort to stay up to speed.\nAnd finally, thank you to your members for all they do, for the hours they work, and for ensuring this nation is fed.\nKind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_pledge-eleven-electrosafe-cards-technical-competence-cards-for-the-electrical-trades/content_46.html": "Erewash\nMy eleventh Pledge is about ElectroSafe Cards\nWe all know and understand about the GasSafe Register (Gassafe Cards) that ensures safety when it comes to Gas in our homes and businesses, but there is no equivalent in the Electrical Industry.\nElectricians and Electrical Engineers invest a great deal into their trade, their vans, tools, and test equipment, and their initial and ongoing training, keeping current with all the regulations and laws. For example, the Institution of Engineering and Technology. IET BS7671:2018 18th Edition.\nYet we see people able to buy consumer units and fit them without qualifications, with 100 Amp supples (Dangerous to all) even advertising and fitting EV car chargers in homes across the country without qualifications.\nWe have to take electrical safety seriously.\nHousehold Electrical Safety\nFaulty electrical equipment and sockets cause about 70 deaths and 350,000 injuries annually in UK homes. This statistic emphasises the importance of following electrical safety guidelines to prevent these incidents. Individuals must practice safety measures to avoid accidents with multiple electrical components and devices in an average home (Peabody).\nElectrical incidents are also a significant contributor to house fires. Electricity is responsible for over 20,000 accidental fires in homes annually. Key culprits include cooking appliances, laundry machines, portable heaters, and televisions, responsible for approximately 12,000 fires and 3,000 electrical injuries yearly. Therefore, investing in fireproof products and adhering to safety guidelines can significantly reduce the risk of devastating incidents( Electrical Safety First).\nThe number of house fires due to electrical faults, 20,00 plus per year\nhttps://www.electricalsafetyfirst.org.uk/media/1592/fire-factsheet.pdf\nOver 1,000 electricity-related workplace accidents are reported to the Health and Safety Executive (HSE) annually, with approximately 30 resulting in fatalities. High-risk environments such as construction sites, workshops, and warehouses must enforce strict electrical safety protocols. Even in low-risk office spaces, safeguarding employees from electrical incidents is essential.\nLook at the licensing need in Australia and the restriction on what can be brought with a Licenced electrician card as an example of best practice.\nhttps://erewash-independent.com/pledge-three/\nI want to be there to raise a voice for the national interests too.",
  "https_erewash-independent_com_/https_erewash-independent_com_blog_page_5/content_20.html": "Pledge Six – Fair recompense to the Victims of the #PostOfficeScandal and STOP Royal Mail takeover\nJune 5 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up […]\nJune 5 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up […]\n4 June 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up\nPledge Five – Health Issues Read More »\n3 June 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up\nPledge Four – To raise awareness of Carbon Monoxide and Gas Safety. Read More »\n2 June 2024 by John Kirby, Organiser Please support if you can and are willing; every penny counts to go up\nPledge Three -Change parliamentary conventions. Read More »\nThe “Everybody in” policy is paramount; it is morally wrong to have so many empty homes, some sitting rotting for\nPledge Two – Tackling Homelessness Read More »\n31 May 2024 by John Kirby, Organiser My first pledge if elected is to donate 25% of my MP salary\nPledge One – Donation to Charity Read More »",
  "https_erewash-independent_com_/https_erewash-independent_com_author_jwkirbye30f562241/content_7.html": "Erewash Decides\nErewash Sounds – #Erewash Decides Listen to Erewash Sounds show – Erewash Decides https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/1860956598&color=%23ff5500&auto_play=true&hide_related=true&show_comments=true&show_user=true&show_reposts=false&show_teaser=false",
  "https_erewash-independent_com_/https_erewash-independent_com_teach-the-future/content_49.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |",
  "https_erewash-independent_com_/https_erewash-independent_com_oath-https-wearehourglass-org/content_24.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: Oath\nDear [Redacted]\nThank you for your correspondence,\nWe have a population which is shifting, meaning an increase in our older population, and governments have seen the time ticking by and failed to address the issue.\nAnd instead of valuing them, policies have seen more fall into pensioner poverty; we have seen local authorities’ budgets cut, so services for the older generation and, in fact, affordable & social care homes closed down, and daytime support centres shut.\nIn addition, the crackdown on migrants has seen falling numbers in an already stretched care sector, still reeling from the loss of European staff post-Brexit. It has created the “Perfect Storm” Additionally, with increased hospital waiting lists and cancelled procedures, more people are suffering discomfort and pain, paramount to the state neglect of our older population.\nThis, combined with some of the lowest pensions, removes many aspects of quality of life from older individuals.\nIt is for all these reasons and more I support you and take your OATH\nKind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_coal-mining/content_32.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: Coal Mining\nDear [Redacted]\nThank you so much for your emails;\nOf course, I would love to earn your trust and gain your vote, but I want you to know my response here is not a glib reply to get it.\nI am going to share with you a couple of tweets from my personal X\nhttps://x.com/csljohnkirby/status/1686331245783904256\nhttps://x.com/csljohnkirby/status/1706971953636966901\nhttps://x.com/csljohnkirby/status/1678071615504957442\nAnd I am still concerned by the legacy of Coal mining.\nhttps://x.com/csljohnkirby/status/1643242971066691585\nhttps://x.com/csljohnkirby/status/1573242796374478848\nSo I agree with you, no more coal mines in the UK, and I go further and say we need to complete restoration and remove the Coal (Slag) Heaps\nKind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_foodbanks/content_10.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: Foodbanks\nDear [Redacted]\nGood morning, thank you for your emails.\nOn this you have touched a nerve, I have witnessed and supported the work of the Trussell Trust, and other organisations like the Manna Box network in Lond Eaton, and I agree the safety net should be in place, so people can not survive but live.\nThe generosity of the British people is apparent when looking at Children in Need, Sports Aid, Comic relief etc, yet the Government have made communities split with its divisive rhetoric pitting able bodies against the sick people (Yet, it is the Government that has caused the backlog in the #NHS) , they have used divisive methods over Asylum Seekers deeming them all illegal. It has even tried to make being homeless a criminal offence when it should be illegal for a Government to allow homelessness.\nWhat an amazing safety net the Trussell Trust and food banks have become, but what a sad reflection on our society, that they are needed.\nChanges to the Tax system are needed; people need to retain more of their money; by changing the tax code from 1275L to 2950L , no one on minimum wage would pay tax; this would take millions out of poverty and reduce the welfare state. People would have dignity, knowing what they earned they kept, instead of paying taxes and then having to beg for UC top and other tax credits. And as for the 2-child cap, that is immoral\nTherefore I am absolutely willing to sign the pledge and use my time to support this.\nKind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_web-election-page/content_35.html": "Policies\nI therefore ask you to invest your vote in me, John Kirby, an Independent. Your vote is valuable, and I will not take it or you for granted. I have ambition, and that is to serve you the voters of Erewash, to be there for YOU. I am not a member of a party, I am not looking to be a junior minister, a minister or a cabinet minister to take me away from devoting my time from working for you, the people or Erewash, and I will not be subject to the Whip or 3-Line Whip, so I do not have to follow the party line. I can work for you, stick up for you, and do what’s best for you\nHealthcare Services\nNHS Funding: Ensuring adequate funding for local NHS services, reducing waiting times, and maintaining the quality of care are critical concerns. Voters want guarantees that local hospitals and GP services will be sufficiently supported.\nI think it goes further than this, We all pay into the #NHS, and remember the average Doctors’ GP list has grown from 1600 to 2200. Not all those visit the GP, but the GP practice gets around £165 base payment per patient on the list. Practices get this payment per doctor but not pro rata for hours worked.\nBased on a widely accepted formula of 72 appointments per 1,000 patients each week and an average list size of 1,600 patients (per GP), the report, Safe Working in General Practice, proposes that GPs should be offering 115 appointments a week – an average of 23 a day over five days. But with an average list of 2200, the figure is 158 appointments or 31 per day\nSince Covid-19 the number of face-to-face appointments has fallen, and the number of available appointments is lower anyway, leading to a backlog. Finally, 1 in 4 appointments are now taken by frequent attendees, this is because matters are not being resolved, and extended wait times.\nPractices need to be more flexible on opening hours, and need to publish on a week-by-week basis, the number of appoints seen, face-to-face, telephone, and the number missed\nPrescriptions It is not fair that within a national NHS system, England is the only one of the four nations, (England, Northern Ireland, Scotland & Wales), that patients pay Prescription charges. NHS prescriptions are issued on the basis of need, and the NHS should be free at the point of use. I will campaign for this to change, people should not be forced to choose between their health, energy or food.\nTelephone Booking The Government talk about increasing our nation’s productivity,\nPlease think of your own experiences, how much time have you spent trying to get medical appointments, here is an example in 2024\nThis one aspect regarding GP services is the most mentioned and this is one example\n15th February – 8 calls to GP over 39 minutes – no appointments available\n16th February – 10 calls over 60 minutes – no appointments\n20th February – 7 calls over 43 minutes – no appointments\n23rd February – 9 calls over 45 minutes – no appointments (Told to phone on 27th February as some pre-bookable appointments will open up for the 11th of March.\n27th February – 19 calls to GP over 72 minutes – all pre-bookable appointments gone. Told to phone at 8am for a same-day appointment on the 28th\n28th – Took the day of work, phoned from 8am onwards, 9 calls, 44 minutes, All appointments gone, told to phone on 29th\n29th – took the day off work, phoned from 8am, 16 calls 78 minutes, no same-day appointments\n(To explain the reason for taking a day off for a same-day appointment, one has to call the doctor from 8am , and the appointment could be anytime that day, but to go to work means leaving East Midlands at 06.45 to be in London by 08.30, and once in London, getting to a same day appointment before 11.30 is impossible)\n5th March – 11 calls, over 50 minutes, no pre-bookable available, it was then explained to me that pre-bookable are only released for booking up to a maximum of 2 weeks ahead, If I phone in the morning on the 6th of March, 3 appointments would be available for the 20th of March.\n6th of March – 16 calls over 81 minutes, All appointments gone.\n512 minutes wasted on phone 8.5 plus two working days of 7.5 hours and STILL no appointment\nJust how many hours per annum are being wasted by people seeking simple appointments?\nIs the above your experience, if yes, you will know how frustrating it is?\nBetter health of the nation means lower costs to the NHS and better productivity to the nation. All calls need to be logged, and each given a reference number, once any patient has tried to get an appointment over 4 day, they should be able to log into the NHS app, give those call log details and be given an appointment.\nMental Health Services: There is increasing awareness and demand for better mental health support, with calls for more accessible and comprehensive mental health services. We have to understand mental health and value it as part of our NHS and Education systems.\nWe need a genuine and well-funded 24-hour, 365-day-a-year service. People do not hit the point of crisis just during office hours. Proper response teams of a Mental Health worker, police officer, and a two-person ambulance crew dedicated to the role are needed.\nWe are failing people in this area of health, and suicides are avoidable with better care\nSexual Health Services The budget for these services needs to be enhanced. The care provided is excellent, but not resourced enough\nhttps://observatory.derbyshire.gov.uk/wp-content/uploads/reports/documents/health/specialist_reports_and_assessments/2023/Derby_Derbyshire_Sexual_Health_Needs_Assessment_August_2023_Final.pdf\nWell-Woman and Well-Man clinics should be accessible to all; cervical screening, Breast Cancer screening, Testicle and Prostate Screening would help save lives.\nThe rise in STIs has an effect on people’s sexual health and can lead to difficulties in conception.\nEducation and Schools\nSchool Funding: Ensuring that local schools receive fair funding to provide high-quality education, including resources for both academic and extracurricular activities. We need to bring about better utilisation of resources, We need to understand and to explore fully why, despite policy, the gap for disadvantaged pupils hasn’t closed and in fact, has widened over the last decade and learn from that so the next decade of policy creates real equity.\nWe need to work out what non-school services need to be improved so that schools can focus more on education.\nFor example, in health care, not being able to get Doctors and Dentists appointments, so when parents or the child is ill, attendance suffers over a longer period than it needs too.\nParticularly mental health services (mentioned above), social services, drug abuse support for all parents, etc\nSchools increasingly pick up a lot of that because of strain on services but they aren’t always best placed to do it and it piles pressure on schools who also have increasingly strained resources\nTeacher Retention and Recruitment: Addressing issues related to the recruitment and retention of qualified teachers is important, alongside reducing class sizes and improving student-teacher ratios.\nThis I will broaden to all public services workers, we need a more progressive tax system, but we need funding for Education and the National Health Service, we need work to pay, and we need to incentivize people to remain in their careers. I will address wages later on this website.\nEconomic Development and Job Creation\nLocal Employment Opportunities: Peoples are keen on seeing more job creation initiatives, support for local businesses, and investment in new industries to boost the local economy.\nGrowth can not be underestimated, and a genuine #BuyLocal, #ShopLocal and #BuyBritish scheme need to be implemented. Look at my plans for VAT for example.\nSkills Training: Emphasis on vocational training and apprenticeship programs to equip residents with the skills needed for modern job markets. Degree opportunities should not be diminished, but we have to have excellent Technical Training Colleges as well; sadly, with the loss of Polytechnics to the university sector, much of this capacity was lost.\nI will fight to end tuition fees and student loans, cancelling all existing ones, and replace it with a 3% tax payable by those benefiting from it, the students and the firms employing them, but this money 6% will be ringfenced from all other Government spending and will only be used for education. We have to invest in our future and that is best served by treating #students and #youngpeople right.\nHousing and Infrastructure\nAffordable Housing: There is a strong demand for more affordable housing to support young families, key workers, and first-time buyers.\nThis is adversely affected by access to mortgages and supply and demand issues.\nWe need a Government-backed mortgage fixed at 3% over 45 years. It will be available for up to £145,000, but £45,000 of it will be home improvement in relation to energy and water, insulation first, secured by a first charge on the property. Taking the full £145,00 over 45 years would result in a monthly payment of £489.65. The savings on Water Bills, and Energy Bills would more than cover the £151.96 per month part due to the Energy/Water Scheme.\nIn #EREWASH – according to the Department for Levelling Up, Housing and Communities figures, 771 homes in Erewash were long-term empty as of October – an increase from 729 during the same period in 2022.\nAlso, just in brownfield sites in #Erewash, there is space for 2466 homes\nhttps://erewash.gov.uk/component/jdownloads/?task=download.send&id=502&catid=22&m=0&Itemid=435\nThis is not using Greenfield sites or Farmland; the above figure is just a better use of resources.\nHow can it be right that people are sofa surfing, that you, your children or grandchildren can not get an affordable home to live in, to rent or buy.\nThink at an average of 1.85 bedrooms per property, that is (2,466+771=3,237) x 1.85 =5,988 bedrooms in Erewash alone, yet we have people living in damp overcrowded conditions.\nInfrastructure Improvements: Investing in local infrastructure, including road maintenance, public transport, and broadband connectivity, is crucial for improving quality of life and economic prospects.\nI am fully supportive of the project to bring M1 Junction—J25A to reality. M1 Junction—J25A would unlock the area’s potential, leading to increased prosperity to the local area, in turn, supporting job opportunities, and alleviate traffic problems for the surrounding communities, which house thousands of residents.\nThe existing M1 J25 is considered to be operating over capacity and a new junction, near Stanton, would ease pressure on traffic flow and avoid impact on local villages. This will also enhance the major development at Stanton.\nTransport\nPublic Transport: Enhancing public transport options, including more reliable bus and train services, is important for reducing congestion and providing better connectivity.\nThe radial nature of the #NetTram in Nottingham, leads to the service being stopped when there is a breakdown/fault, by investment to make it a loop, via Toton, Long Eaton, Sawley, Castle Donington, East Midlands Airport, East Midlands Parkway, Fairham Pastures and then into Clifton, it would enhance employment and leisure opportunities across the region.\nAlso, we need to invest in a genuine Electric Vehicle Charging network that is practicable and accessible\nRoad Safety and Maintenance: Key concerns include addressing potholes, improving road safety measures, and ensuring efficient traffic management.\nWe need to go street by street in the #EREWASH constituency, and repair the surfaces of the roads, doing a proper restoration, and prior to work being carried out, speak to all utilities to make sure any planned work is done in the programmed prior to full surface restoration.\nCrime and Policing\nCrime Reduction: Voters are concerned about reducing crime rates, including anti-social behaviour, drug-related issues, and burglary.\nI would campaign for a new police force to be set up, “National Motorway Policing Group” a separate force for the UK transport Motorway system, it will take a lot of political will, but would allow a more connected joined-up system to deal with stolen vehicles, ANPR, and travelling drug dealers, shoplifting gangs and county lines drugs.\nI would have all Highways Officers retrained as constables with the power of arrest.\nA 26-week course to uplift skills from a Highways office to Police constable should be easy to implement.\nI do not want to see the UK become an armed police force, but Tasers for frontline officers is a must. Also, all officers to be issued with handheld metal detector wands, to help reduce knife crime. Here it is not about tougher sentencing but better use of existing powers.\nAlso, I would put forward an argument to stop the use of Police Community Support Officers (PCSOs) and have them cross-train as constables with the power of arrest.\nA 26-week course to uplift skills from PCSO to PC should be easy to implement.\nPolice Presence: There is a demand for a more visible and responsive police presence to ensure community safety. I truly believe the best way forward is to have staff wearing uniforms in other roles that are confused with police removed and have officers meeting the excellent standards of the Police active in the communities will improved matters.\nEnvironment and Green Spaces\nEnvironmental Protection: Protecting local green spaces, promoting recycling, and supporting sustainability initiatives are important to many voters. As mentioned in the section about Homes, using Brownfield sites first, and protecting Greenfield site and farmland is paramount.\nClimate Change: Addressing climate change through local initiatives and policies that reduce carbon footprints and promote renewable energy. The lifetime housing mortgage, with a substantial £45,000 programme to reduce water costs, and potable water usage, reducing flooding events and using the roofs of homes (Which in themselves are Brownfield sites) to provide energy, will lead to savings to offset the cost of the programme.\nSocial Services and Welfare\nSupport for Vulnerable Groups: Ensuring that social services are well-funded and capable of supporting vulnerable populations, including the elderly, disabled, and low-income families. The NHS/Social Care levy will be ringfenced for NHS/Social care, will be a big step forward to a long term, sensible spending programme.\nCommunity Services: Enhancing community services such as youth centres, libraries, and recreational facilities.\nCost of Living:\nLiving Costs: Addressing rising living costs, including utility bills, groceries, and fuel prices, is a significant concern for many residents.\nWages and Employment Conditions: Ensuring fair wages and decent working conditions to help residents cope with financial pressures. I would like to see wage control; no CEO/Director should be allowed to earn more in a week than the lowest pay person earns in a year. So, based on £29,250 per annum minimum, the maximum salary would be £1,521,000\nThe minimum wage needs to be £15 per hour (So based on a 37.5 hour week (£29,250)\nThe deduction from this should be a tax code of 2925L, so you are allowed to earn £29,250 before paying tax, NHS levy instead of NI of 10% (ringfenced for NHS/social care) and Pension of 10% deducted, and if you hold a degree or a further education level, or full apprenticeship qualification then a deduction of 3% (ringfenced for Education.)\nSo your minimum take home would be £22,522.50 and remember the pension is yours too, and companies would match these payments paying the NHS levy, 10% pension contribution to your pot and the Educational levy.\nStaff in public service, Doctors, Dentists, Police, Fire, Ambulance, Councils, teachers etc, after five years service and being in Good Standing (No disciplinaries) will have their tax code boosted by 2500 to 5425L\nTax-Free Allowance £29,250 (All Adults 16+ including Pensioners)\nTax-Free Allowance £54,250 (Five years service, plus Good Standing Condition)\n25% tax on £29,251 (£54,250, if Public Services worker, 5 Year award) to £87,753\n35% tax on £87,754 to £263,259\n45% tax on £263,260 to £789,780\n50% tax on £789,780 to £1,521,000\nBrexit and National Politics:\nBrexit Impact: Managing the local impacts of Brexit, particularly on trade, immigration, and funding for regional projects, remains a relevant issue.\nOn Immigration\nWhy does this government make immigration cost so much to be a burden, we could use it as an asset?\n- 500 people on a barge unable to work, yet can walk around Weymouth, all day long\nThere are currently as of the 30th of March 2023, 166,085 individuals awaiting initial decisions and appeal outcomes, and this is costing our country millions of pounds per day, yet, 78% of these people are considered to be economically viable, fit for work, that is 130,000 potential workers, why are we not being proactive – in the UK #Farming #Agriculutral sector alone, there are potentially 500,000 vacancies, see page 6 – Labour shortages in the food and farming sector (http://parliament.uk)\nImagine a compassionate scheme, a scheme in which if the individual agrees to have their #DNA registered, and wear a GPS Tag, undertake 3 hours of English classes a week and work 45 hours per week, then whilst their claim is being dealt with we pay them a salary of £25,000 of which £1850 is paid to a pension fund, they sacrifice £125 per week (£6500 per annum) for their accommodation, that £125 per week (£6500 per annum) is placed into saving which they get back if allowed to stay in the #UK to give them a start, or if they are deported/refused asylum, we take £1000 of it for their flight and the balance they get to restart their lives & have a pension fund from aged 65. On that income, they pay income tax of £3250 per annum and National insurance of £550. this leaves them with £6845 cash per annum so they will have £131.63 disposable income per week\nThe benefit to the country could be huge, increased food security, reduced cost to the taxpayer, giving the people an opportunity to gain self-worth and confidence. they would for good behaviour, working hard, being reliable and learning English then gain immigration points towards their claim. Farms/industries in the UK would have staff, and, for example, food would not need to be ploughed back into the ground.\nThese jobs exist, and farmers and other suitable businesses/industries will get access to a pool of staff at £11 per hour plus 13.45% (£1.48) cost in lou of employer national insurance cost etc, so a fixed total of £12.48ph, every individual will be traceable via the tag, removing it would end any claim to asylum & lead to removal, As well as saving the taxpayer the current cost of asylum, National Insurance will benefit by £71.5m and Tax Revenue by £422.5m\nThe Government will also get £8.66m from the 13.45% levy\nPolitical Representation: Voters are interested in strong, effective representation in Parliament, ensuring that local interests are adequately voiced and defended. This is best served by an approachable local independent candidate who will listen to the constituents and represent them and not a political party",
  "https_erewash-independent_com_/https_erewash-independent_com_palestine/content_40.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put it’s case, for the benefit of its people.\nRe:Palestine\nDear [Redacted]\nAs you can see I have had many request for me to answer questions on Palestine and for my views.\nI completed the online links most of you sent to me\nMy response was as follows:\nI do agree with the vast majority of the statement as it applies to Palestine and the Palestinian people; however, on the right of self-determination, that is conditional on it being unhindered by HAMAS.\nI think HAMAS does not care for the people of Palestine, and the terrible terrorist acts on October 7th 2023 were disgusting (However, please bear in mind this was not the start of the issues) and whilst I uphold the right of any state to defend itself, defence is one thing, and target not the terrorist of HAMAS, but the civilian population can never be right.\nThere should be an immediate ceasefire, with all hostages released without delay, including the bodies of deceased victims.\nAll arms sales should be stopped.\nA new Palestinian Authority be set up and recognised as the people’s authority.\nAfter six months of peace, the UN and its members should recognise a Palestinian State with defined borders, with no land grab by either side gained during the recent acts of war. A fully funded rebuilding programme be implemented with International Aid.\nAfter six months and within six months of then, they should be free, open, fair and transparent elections, excluding all members and associates of HAMAS\nPlease note some of the following questions talk of holding Isreal to account, I would also work to hold HAMAS to account and stop weapons to them too\nTo publicly demand and actively work to ensure an immediate, complete, and permanent ceasefire in Gaza.\nResponse: Yes\nTo stand up for the rights and dignity of Palestinian refugees by supporting the immediate and full restoration of UK funding to UNRWA and ensuring it can fulfil its mandate.\nResponse: Yes\nTo support a comprehensive two-way embargo on the trade in weapons, components, and military technology with Israel to ensure that Britain and its citizens are not complicit in aiding and abetting crimes including genocide.\nResponse: Yes\nTo support moves by the ICJ and ICC to hold Israel to account for breaches of International Humanitarian Law and the outcomes of those processes including by insisting that Britain must uphold any arrest warrants issued by the ICC.\nResponse: Yes\nTo support the suspension of the 2030 Road Map for UK-Israel bilateral relations and negotiations towards an enhanced trade agreement in response to grave violations on international law, and the immediate imposition of a ban on trade with illegal Israeli settlements.\nResponse: Yes\nTo uphold the freedom to advocate for Palestinian rights through the democratic process and in academic, cultural and educational spaces including by defending the right to protest and opposing any attempt to prevent public bodies from divesting or choosing not to procure from companies shown to be complicit in Israel’s violations of international law. Response: Yes\nI hope this email offers you clarity.\nKR\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_pledge-six/content_48.html": "Please support if you can and are willing; every penny counts to go up against established parties.\nhttps://gofund.me/392f8c2c\n#Erewash\nMy SIXTH pledge is about 2 items the first, I would work in my role as an MP to STOP the sell-off of Royal Mail to overseas investors; the Royal Mail is a National strategic asset\nAnd the second is to endure fair recompense to the Victims of the #PostOfficeScandal and for payments to be made without delay\nhttps://x.com/csljohnkirby/status/1747199274281058540\nSome affected were sub-postmasters who owned the property, others were leaseholders, and some were staff.\nIf I were setting up a scheme, it would look like the following, but, of course, I would speak to all parties involved to refine the idea.\nIt would be\n1) Freeholders – the current value of the property (as a trading office, even if that is no longer the case) less wherever they got for the fire sale after losing the Post office, plus 10 years salary (Claimants have a duty to mitigate their losses, so that seems reasonable) plus £350,000 standard compensation plus £1000 per day they spent in prison or police custody, halved if on tag and community work ordered paid at £100 per 8 hours completed.\n2) Leaseholder – the current value of the property (as a trading office, even if that is no longer the case) less wherever they got for the fire sale after losing the Post office and minus how much rent they would have paid, plus 10 years salary (Claimants have a duty to mitigate their losses, so that seems reasonable) plus £275,000 standard compensation plus £1000 per day they spent in prison or police custody, halved if on tag and community work paid at £100 per 8 hours completed.\n3) Staff (Manager of Agency Branches (now referred to as Franchise Partners) 10 years salary (Claimants have a duty to mitigate their losses, so that seems reasonable) plus £150,000 standard compensation plus £1000 per day they spent in prison or police custody, halved if on tag and community work paid at £100 per 8 hours completed.”\nConvictions overturned.\n#JFSA #PostOffceScandal\n#PostOfficeInquiry #royalmail #postoffice",
  "https_erewash-independent_com_/https_erewash-independent_com_pledge-three/content_28.html": "Please support if you can and are willing; every penny counts to go up against established parties.\nhttps://gofund.me/392f8c2c\n#Erewash\nMy THIRD pledge is to work to change parliamentary conventions.\nThe political system in the UK is not what individuals think.\nIt is distorted by a convention that even on an item of national importance if you write to an MP who is not your constituency MP, you get a response that includes something like\n“There is a strict parliamentary rule that MPs can only help their own constituents.”\nIn addition, it is further distorted by the “Whip” & “3-line Whip.”\nhttps://twitter.com/csljohnkirby/status/1746862670177841609\nParty MPs get messaged all the time – with the party’s view, they can not say what they think, and every interview is monitored.\nWe have a system of “The Stepford Wives” rather than true representation.\nThe #infectedbloodinquiry #postofficeinquiry #postofficescandal were all affected by this convention. Individual MPs were getting messages, but those who took an interest did not see other items, even when people knew they were taking a lead.\nSo I want the convention changed so that you can EMAIL any MP as long as you copy your own MP in.\nThat way, these scandals will be heard of quickly, and hopefully resolved.\nPingback: Comment: – Erewash Independent\nPingback: Pledge Eleven – ElectroSafe Cards (Technical Competence Cards for the Electrical Trades) – Erewash Independent",
  "https_erewash-independent_com_/https_erewash-independent_com_pledge-seven/content_41.html": "Water Companies\nErewash\nMy SEVENTH pledge is about Water Companies\nI do not understand why we cannot fine water companies this way. I think they should be fined from their existing shares from existing shareholders, and for every sewage discharge caused by under-investment, they should have to hand over £10k worth of shares. (There are an average of 825 sewage discharges a day, so over 330,000 a year.) So we build up a £3bn a year stake in the companies and get a voice on the boards.\nThe companies would not be allowed to issue new shares to pay these fines, so shareholders would be directly punished for the company’s shortcomings.\nPingback: Standing Up for People/Planet in #EREWASH – Erewash Independent",
  "https_erewash-independent_com_/https_erewash-independent_com_category_uncategorised/content_6.html": "Erewash Decides\nErewash Sounds – #Erewash Decides Listen to Erewash Sounds show – Erewash Decides https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/1860956598&color=%23ff5500&auto_play=true&hide_related=true&show_comments=true&show_user=true&show_reposts=false&show_teaser=false",
  "https_erewash-independent_com_/https_erewash-independent_com_blog/content_2.html": "Erewash Decides\nErewash Sounds – #Erewash Decides Listen to Erewash Sounds show – Erewash Decides https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/1860956598&color=%23ff5500&auto_play=true&hide_related=true&show_comments=true&show_user=true&show_reposts=false&show_teaser=false",
  "https_erewash-independent_com_/https_erewash-independent_com_lgbt/content_33.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: LGBT+\nDear [Redacted]\nThank you for your correspondence, I noticed you placed an arbitrary deadline of the 27th of June in your correspondence however as an Independent, I do not have a party machine behind me, and have answered all 1613 emails received personally and in order they were received.\nI have a view,\nThe sooner humanity realises that we all, regardless of gender, colour, creed, sexuality, religion, breathe one common air under one common canopy – for we are all equal, all making a single journey from birth to death, and use that knowledge to help each other the better\nThe ONLY label that matters is we are all #HumanBeings / #HumanKind and we NEED to be #HumanKind to each other\nhttps://x.com/csljohnkirby/status/1744044517655785579\nI support all sections of the community, and I will use my voice to help bring unity, and my words are not just to gain votes now, it is how I have lived my life and is part of what make me ME, and I will always enable others to be who they are.\nKind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_age-champion/content_8.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: Age Champion\nDear [Redacted]\nThank you for your correspondence,\nI am 58, and my parents have passed away now, but I certainly remember helping them deal with their needs. I did my very best to champion their cause and support them.\nEvery elderly individual needs that person in their corner, helping them navigate the various service, and I pledge I will stick up for and support older people, and this will be whether or not I have the privilege of being an MP for Erewash or not, because it is the right thing to do.\nKind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_gender-ideology/content_31.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community, and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: Gender Ideology\nDear [Redacted]\nThank you for your email of the 10th of June, and I thank you for it.\nI am not a “Soundbite” politician, so whilst you have asked for brief answers, I can promise they will be honest.\nSo first of I will make it clear\nThe sooner humanity realises that we all, regardless of gender, colour, creed, sexuality, or religion, breathe one common air under one common canopy – for we are all equal, all making a single journey from birth to death, and use that knowledge to help each other the better.\nThe ONLY label that matters is we are all #HumanBeings / #HumanKind and we NEED to be #HumanKind to each other\nDo you recognise that there are two sexes, male and female and that the law should recognise that there are situations where this matters?\nI will not allow myself to be distracted by terminology. There are TWO biological sexes and different Genders, but they are two different things.\nYes, there are situations where this matters, imagine going into a rape centre and asking to speak to a man or woman, and you get someone that is self-ID’ing as that sex, or in a woman’s refugee, for example.\nIf elected, will you stand up for single-sex services and sports?\nYes, I will. The compromise is that we can have single-sex sports and services and unisex sports. It is a nuanced position, but we have to aim to balance the recognition of self-identified genders with safe-guarding single-sex spaces.\nDo you agree that the Equality Act should be made clearer to provide protection against discrimination based on sex?\nYes, and the main reason is to stop the confusion; people are scared to speak up, fearing being cancelled or labelled as a bigot. The right to freedom of speech is paramount; everyone is entitled to a view, but not to make up facts, and we must emphasise the importance of sex-based (Biological) protections under the Equalities Act.\nWill you commit not to bring in gender self-ID through the back door?\nI am cautious about Self-ID; I will always protect the individual’s choice and self-realisation; they have to have a place to start their journey and a way to gain societal validation of their transition.\nLike all journeys, there needs to be an open and transparent plan, and to not speak of it or allow it to creep via the backdoor would do a massive disservice to transgender people and broader society.\nDo you agree that freedom of speech about sex and gender is important?\nAbsolutely, we need to debate sex and gender, and whilst there is a lot of discourse over gender ideology and gender self-identification, it has to be spoken about. Sadly, so many in society will not express a view for fear of it being held against them. Will you meet with “gender-critical” groups and constituents if you are elected to Parliament?\nIf I have the privilege of representing Erewash, I will, of course, meet with “Gender-Critical” groups and constituents, but not at the expense of those that are “Pro-Gender” I will do my very best to represent everyone and listen fairly to there comments and views\nKr\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_contact/content_37.html": "Contact The Campaign We welcome contact from you; please feel free to complete the questionnaire with your views or contact us via this page on Twitter / X or Facebook.Your views are welcomed and valued. Contact Us ADDRESS: Erewash Independent, Suite 222, Mohan Business Centre, Tamworth Road, Long Eaton, Nottingham , NG10 1BE PHONE: 0115 795 2225 EMAIL: j.w_kirby@erewash-independent.co.uk FOLLOW US: Facebook Twitter Please enable JavaScript in your browser to complete this form.Please enable JavaScript in your browser to complete this form.Full Name *Email *Message *Send Message",
  "https_erewash-independent_com_/https_erewash-independent_com_the-arts/content_4.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put its case, for the benefit of its people.\nRe: ARTS\nDear [Redacted]\nThank you for your correspondence,\nThis is certainly an area I care about and am enthusiastic at supporting.\nI have long valued the arts as fuel for my soul\nhttps://x.com/search?q=%40csljohnkirby%20%2B%20%23arts&src=recent_search_click&f=live\nhttps://x.com/search?q=%40csljohnkirby%20%2B%20%23thearts&src=typed_query&f=live\nI want to see VAT used to support local authorities and to help the entertainment and hospitality sectors\nhttps://erewash-independent.com/local-government-association/\nhttps://erewash-independent.com/grassroots-music/\nhttps://erewash-independent.com/pledge-eight-vat-the-high-street-and-hospitality/\nI hope you find my points relevant.\nKind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_global-hunger-inc-uk/content_39.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and it has so much potential, and it deserves good representation in the House of Commons to put it’s case, for the benefit of its people.\nRe: Global Hunger\nDear [Redacted},\nCan you imagine in 1975 when a superb singer song-writer Harry Chapin and Radio Disc Jockey/Radio Host Bill Ayres set-up https://whyhunger.org/ that 49 years on, there would still be world hunger, and that hunger would be in our community in Erewash.\nWe saw the devastation of starvation on our televisions in 1985, when Live Aid took place. Thirty-nine years ago, we were full of hope of the future, that hunger would not be part of society globally.\nLook at the money the UK gives in Overseas Development Aid, and emergency payments, the millions raised bt BBC Children in Need, Comic Relief and Soccer Aid for example yet in 2023, over 281.6 million people across 59 countries/territories faced high levels of acute food insecurity requiring urgent assistance, according to the latest Global Report on Food Crises (GRFC) 2024 . The figure represents the 21.5% of the population of the countries considered.\nBeyond those facts, there is more than enough food is produced in the world to feed everyone on the planet. Yet as many as 783 million people still go hungry.\n14 million children are suffering severe acute malnutrition, which is the most life-threatening form of hunger\nOne in ten people globally goes to bed hungry every night, and three billion people can not afford a healthy, nutritious diet. As climate change takes effect more and more, this number will grow and spread more across the globe and closer to home.\nFinally, we have seen conflict cause food poverty and drive hundreds of thousands more into hunger.\nMy commitment is already there and I will pledge to do everything I can in the future\nKind Regards\nJohn Kirby",
  "https_erewash-independent_com_/https_erewash-independent_com_renters/content_42.html": "| John Kirby – An Independent, Liberal-Minded Conservative Soul with a Socialist Heart, tinged with a Green Outlook. Independent Candidate to be MP for Erewash Constituency | www.erewash-independent.co.uk j.w_kirby@erewash-independent.co.uk https://x.com/erewashindie https://www.facebook.com/erewash.independent https://www.gofundme.com/f/support-an-independent-mp-for-erewash |\nEREWASH, a constituency in the East Midlands, England, is a region with a mix of urban and rural areas, encompassing towns like Ilkeston and Long Eaton. It is an area known for its community and has so much potential. it deserves good representation in the House of Commons to put its case for the benefit of its people.\nRe: Renters and Section 21\nDear [Redacted].\nThank you for your email of the 11th of June, and I thank you for it.\nI have written about housing many times as it is important to me to me, and you will see on my website the following\nhttps://erewash-independent.com/pledge-two/\nhttps://erewash-independent.com/pledge-ten-mortgage-prisoners/\nAnd if you scroll down to Affordable Housing https://erewash-independent.com/web-election-page/\nBelow is an article from last year\nHomelessness & the housing crisis #UK\n132 articles\nThe 30th of March, 2023\nHomelessness and the housing crisis are some of the biggest challenges facing the United Kingdom today. Despite being one of the richest countries in the world, there are still thousands of people sleeping on the streets and millions more struggling to find affordable and decent housing. We need to explore the root causes of homelessness and the housing crisis in the UK, and it is not all bad news, there are some great beacon projects for dealing with it and potential long-term solutions.\nIn the hashtag#unitedkingdom, there are 25,000,000 residential properties with an average value of £290,000 https://www.gov.uk/government/news/uk-house-price-index-for-january-2023 which gives a total value of £7,250,000,000,000 that is seven trillion two hundred fifty billion pounds – It is obscene that with that much property and the value of it, that people are sleeping and dying on the streets\nThe Bureau of Investigative Journalism has done some fantastic work on the subject of the housing crisis https://www.thebureauinvestigates.com/projects/the-housing-crisis\nRoot Causes of Homelessness and Housing Crisis\nThe root causes of homelessness and the housing crisis in the UK are complex and multifaceted. However, some of the key factors contributing to this crisis include:\nLack of affordable housing:\nThe UK has a chronic shortage of affordable housing, particularly in urban areas where demand is high. As a result, many people are forced to live in overcrowded or substandard accommodation, or they are unable to find suitable housing altogether.\nRising rents:\nThe cost of renting in the UK has risen significantly over the past decade, making it increasingly difficult for people on low incomes to afford decent housing.\nWelfare reform:\nChanges to the welfare system, including cuts to benefits and the introduction of the Universal Credit system, have left many people without adequate financial support to pay for housing.\nDomestic abuse and family breakdown:\nDomestic abuse and family breakdown can lead to people becoming homeless, particularly women and children who are fleeing abusive relationships.\nMental health issues and addiction:\nPeople who suffer from mental health issues or addiction may find it difficult to maintain stable housing, which can lead to homelessness.\nBeacon Projects for Dealing with Homelessness and Housing Crisis\nDespite the challenges, many beacon projects are helping to address homelessness and the housing crisis in the UK. Here are some examples:\nHousing First:\nHousing First is an approach that provides homeless people with permanent, stable housing as a first priority, rather than requiring them to address underlying issues such as addiction or mental health problems before receiving housing. This approach has been successful in reducing homelessness in several cities in the UK, including Manchester and Liverpool.\nCommunity Land Trusts:\nCommunity Land Trusts are non-profit organisations that develop and manage affordable housing for local people. They are community-led and operate on a not-for-profit basis, which makes housing more affordable for those who would otherwise be priced out of the market.\nSocial Impact Bonds:\nSocial Impact Bonds are a type of funding mechanism that allows private investors to finance social projects, such as homeless prevention programmes or affordable housing developments. Investors receive a return on their investment if the project achieves certain outcomes, such as reducing homelessness.\nHousing Associations:\nHousing Associations are non-profit organisations that provide affordable housing for people on low incomes. They are an essential source of affordable housing in the UK, particularly for people unable to access social housing. However, many of these have benefited from large sums of public money and completely failed the tenants, one only has to view the work of the amazing journalist from @ITV News Daniel Hewitt https://www.itv.com/news/search?q=+Daniel+Hewitt+ to see the shameful inaction by these social landlords.\nHowever, in the interest of balance, there are some great Housing Associations and more importantly some fantastic staff even in the poor ones.\nLong-term Solutions to Homelessness and Housing Crisis\nWhile beacon projects are making a difference, long-term solutions are needed to address the root causes of homelessness and the housing crisis in the UK. Some of the potential solutions include:\nIncrease the supply of affordable housing:\nThe UK needs to build more affordable housing to meet demand. This can be achieved by investing in social housing, providing incentives for developers to build affordable housing, and introducing rent controls to keep rents affordable.\nReform the welfare system:\nThe welfare system needs to be reformed to ensure that people have adequate financial support to pay for housing. This could involve increasing benefits or providing targeted financial assistance to those who need it most.\nAddress mental health and addiction:\nPeople who suffer from mental health issues or addiction need appropriate support to help them maintain stable housing. This could involve investing in mental health services and addiction treatment programmes.\nAddress domestic abuse and family breakdown: More needs to be done to prevent domestic abuse, and that means resources and also means cooperation across Government Departments, Local authorities and the Police.\nAs you can see from my existing commitment, I am happy to support Generation Rent, and get a fair deal for them\nKR\nJohn Kirby"
}