{
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_category_Reports/content_15.html": "Hackney North & Stoke Newington 2019 General Election Results 12th December 2019 It is fair to say that an Election campaign, even for a seat with the limited scope of winning as Hackney North and Stoke Newington, requires resilience... Reports\nHackney North & Stoke Newington Campaign RoundUp Final Week: 11th December 2019 The final week of a hard fought campaign. The final few thousand leaflets delivered up and down the length of Hackney North & Stoke Newington. The final push... Reports\nHackney North & Stoke Newington Campaign RoundUp Week 3: 8th December 2019 The last full week of campaigning saw us mobilise the wider Association out across the whole of the constituency distributing a variety of literature in order... Reports\nHackney North & Stoke Newington Campaign RoundUp Week 2: 1st December 2019 Hackney North & Stoke Newington Campaign RoundUp Week 2: A fantastic week of campaigning saw the teams out and about across Hackney North. Having mobilised our... Reports\nXtinction Rebellion Climate Change Hustings: Mildmay Club - Tuesday 26th November 26th November 2019 Tuesday 26th November saw the Hackney North & Stoke Newington PPC’s assemble for the only hustings scheduled for the Constituency during this Election campaign... Reports\nHackney North & Stoke Newington Campaign RoundUp Week 1: 24th November 2019 Hackney North & Stoke Newington Campaign RoundUp Week 1: A great start to the official launch to my Campaign in Hackney North and Stoke Newington. Having... Reports",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_conservative-home-we-need-urgently-overhaul-our-flood-response-more-layers-bureaucracy-are-not/content_18.html": "This winter the spectre of flooding has once again become a critical issue across many areas of the country. With flooding becoming more frequent, properties that previously flooded once in a generation, or have never before, flood whenever water levels rise.\nThere is much that can be done pre-emptively to reduce the impact felt so devastatingly by communities and businesses whose homes and livelihoods are left ruined once the flood waters recede.\nOver the course of this winter, following storms Babet and Henk, I have spent time speaking to many of the local flood groups, agencies, and affected residents in Huntingdon who are working hard to mitigate the danger of flooding in the region.\nLocal flood groups, staffed by residents, are a good first line of defence; all too often, however, they are also the last. They rely upon their own initiative, with self-taught expertise that varies from group to group: shouldering the responsibility for alerting the authorities of rising water levels, being the first to raise the alarm to nearby homeowners, and ensuring vulnerable residents are moved to safety or at least prepared for the worst.\nThe issue is exacerbated by the variety of solutions required to combat the rising waters. Across the many villages I have visited in Huntingdonshire I am yet to see two properties which use the same combination of flood prevention measures. Much of residents’ experience as to which solution works best is the result of hard-learned lessons and processes of trial-and-error.\nThis highlights just how complex the issue is. There is no one-size-fits-all solution, each is bespoke with a dependency upon multiple factors.\nWatercourse maintenance is a “riparian responsibility” set in common law dating back to the Tudor period. Riparian responsibilities fall upon anyone who owns or tenants land adjacent to a watercourse, with the centreline of the watercourse denoting the boundary. That responsibility entails receiving the flow of water from upstream and ensuring the free flow of that water downstream.\nIn practice this means responsibility for removing vegetation from riverbanks to aid the flow of water and to ensure no other obstructions are in place. Clear enough. The feasibility of actually this along the length of a watercourse is less clear, particularly with regard the build-up of obstructions, natural or otherwise, within the water itself.\nCambridgeshire alone has 8,000 miles of watercourses; the task of providing oversight to the manual works required is at best enormous and at worst unfeasible.\nThese responsibilities are split between Cambridgeshire Lead Local Flood Authority, Anglian Water, Cambridgeshire Highways, National Highways, Internal Drainage Boards and the Environment Agency, not to mention District Councils as part of Cambridgeshire’s Local Resilience Forum.\nAs we can see, the management of our watercourses is therefore a frustratingly kafka-esque labyrinth of common law, convention, legal responsibility, and good manners that relies upon all stakeholders to be appropriately well-informed: a situation that clearly isn’t always the case.\nAnd whilst the Flood and Water Management Act 2010 outlines the responsibilities of agencies within flood risk management, it doesn’t cover the maintenance of watercourses.\nIn response to the recent flooding Labour have already, somewhat cynically, grasped the nettle pledging to establish a Flood Resilience Taskforce. Whilst this may sound hugely promising to those whose lives are too often afflicted by the issue, the proposal itself offers little more than the existing framework with a shiny new logo.\nLabour plan to implement a top-down overhaul of “local resilience forums” and identification of vulnerable areas. Nowhere does it mention that they will make extra funding available. At a local level the plans for what needs to be done are well-documented, it is the ability to implement these plans that prevents it.\nThe Government have already committed to spend £5.2bn in England by 2027 to prevent flooding; there is clearly funding available. Yet much of it appears to be opaque and inaccessible to the groups who know best how it should be spent.\nWe must take a collegiate approach to distributing this funding based on analysis and research, not allocated by funding formulae which fail to take the unique foibles of each area’s requirements into account. Rather than provide a high-level framework with yet more layers of bureaucracy for volunteers to navigate, as Labour have suggested, we need to ensure we have holistic solutions in place.\nAs our weather becomes ever more unpredictable and extreme, coupled with greater development near to vulnerable areas that could exacerbate the issue, it is vital that we understand how this multi-agency approach can be better integrated. We need to establish a strategic approach to multi-agency interoperability, and remove the burden from volunteers who endeavour to stop their communities from flooding but are met with obstructions and frustrations in applying for the necessary funding or grants.\nOur current system is dependent first and foremost on self-help, with the onus on residents, landowners, and flood groups to conduct the work to maintain our watercourses and take the appropriate Property Flood Resilience measures. At a local, tactical level, it is vital that we bring these stakeholders together in order to provide a collective view of what is needed.\nWaiting until homeowners are hastily erecting flood barriers to prevent their houses from flooding fails those who stand to lose the most.\nAdditional funding is of course the simplest solution to the issue. But redesigning the end-to-end framework for flood resilience is an exercise in streamlining bureaucracy that would bear tangible, visible results. If we are to expect an army of industrious self-taught volunteers to be the first line of defence to mitigate environmental extremes, the least we could do is provide them with the resources to fix the problem whilst the sun is (literally) shining.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_meeting-health-secretary-victoria-atkins-discuss-rebuild-hinchingbrooke-hospital/content_37.html": "This week I had the opportunity to meet with the Secretary of State for Health, The Rt Hon. Victoria Atkins MP in Westminster. This was an important chance to discuss local health issues impacting Huntingdon and to relay the output of meetings from the previous week with the CEO of North West Anglia NHS Foundation Trust Hannah Coffey and CEO of Cambridgeshire and Peterborough Integrated Care Board Jan Thomas.\nAlongside conversations about GP access and NHS dentistry it was important to highlight the Government's commitment to its New Hospital Programme within which Hinchingbrooke Hospital is set to be rebuilt following the investigation into RAAC levels. Whilst the work is proposed we must ensure that commitment to deliver the funding is maintained. The new theatre block at Hinchingbrooke is scheduled to open in June 2024 and going forward should become part of the wider rebuild set to take place over the next few years.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_cdn-cgi_l_email-protection/content_39.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_campaigns_joined-approach-flood-prevention/content_29.html": "Environmental changes have led to flooding from the River Great Ouse and our other watercourses devastating homes and businesses. As your MP I will fight for the funding to implement proposed plans to mitigate flooding, push to improve our flood defences and implement a joined-up approach.\nHaving met with the County Council's Flood Risk Team and many of the local flood groups it is clear a holistic approach across the constituency is needed.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_tackling-antisocial-behaviour-grafham-litter-pick/content_12.html": "It was great to join volunteers in Grafham this weekend as part of their regular litter pick organised by the Parish Council. It's hugely important to ensure villages like Grafham maintain their character and so often that responsibility comes down to self-help. It's very easy to take for granted how picturesque our villages are as we pass through them without appreciating the hard work from local residents that goes into maintaining them.\nHaving retrieved 10+ bags of rubbish including fly-tipped furniture and several televisions it's clear that we need to tackle antisocial behaviour, even in places where it may not be immediately apparent.\nYou can read more about my plan to tackle antisocial behaviour within my 6-point plan for the constituency.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_little-about-ben/content_8.html": "Ben Obese-Jecty is the Conservative MP for Huntingdon\nI was raised in a family with strong Conservative values that were instilled in me at a very young age. I grew up watching my parents work hard to create a supportive family environment in which I could thrive. They taught me to believe that people from any background should have both the responsibility and the opportunity to progress as far as they are able, that I was no different to anybody else, and that application and hard work are the cornerstones of success. Those values were shaped by my parents making great sacrifices to give our family the best start in life despite circumstances being challenging and life being a real struggle at times. Their commitment to ensuring that we were a strong family imbued in me those values required to be a success. The values of duty, personal responsibility, selflessness, hard work and pride, were taught to me by my parents.\nA former Army Officer, I commissioned from the world’s foremost military leadership institution, The Royal Military Academy Sandhurst, as an officer in the 1st Battalion The Duke of Wellington's Regiment (West Riding), now The Royal Yorkshire Regiment, spending nine years in the Infantry and enjoying the opportunity to live and work across the UK. My time in the Army was characterised by the high tempo of operations experienced by the UK military over the past two decades.\nI volunteered for service as a Battle Casualty Replacement in Basra, Iraq, deploying at short notice and conducting dismounted counter-insurgency patrols, suspect vehicle interdictions and arrest operations in the north of the city and out towards the Iranian border only three months after completing my training.\nOn my next operational tour I was selected to serve as part of a mentoring team embedded with the Afghan National Army in Sangin, Afghanistan. My time in Helmand Province was eye-opening, experiencing both the complexity of a Battlegroup under siege and the intensity of dismounted close combat with an agile foe who used the civilian population as both camouflage and collateral. My service in the Army has been the catalyst behind my decision to serve in a political capacity.\nFollowing my service I moved to the private sector. I have worked in financial services continuously since leaving the British Army and have worked with both US and UK banking institutions across a wide range of aspects rising to Vice President.\nI have recently completed my three year term sitting as a member on the Veterans Advisory and Pension Committee, appointed by the Minister for Veterans the Rt Hon Johnny Mercer MP. The role has been a rewarding one, working to improve the lives of veterans and servicepersons.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_about-rss/content_33.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_xtinction-rebellion-climate-change-hustings-mildmay-club-tuesday-26th-november/content_19.html": "Tuesday 26th November saw the Hackney North & Stoke Newington PPC’s assemble for the only hustings scheduled for the Constituency during this Election campaign. The Climate hustings were organised by Xtinction Rebellion and hosted by the Mildmay Club in Stoke Newington.\nI was very pleased to receive an invitation to participate in Xtinction Rebellion’s Climate Hustings. The opportunity to debate a topic as prescient as the solution to Climate Change is both challenging and rewarding, offering the chance to hear opposing views , but also to advertise the Conservatives’ admirable record on Climate Change.\nWhilst I was not expecting anything other than a partisan crowd at an Xtinction Rebellion hustings, I was pleased to find an audience that was keen and eager to listen to the various opinions and plans being outlined. What is clear about the Climate Emergency is that each Party broadly agrees on the key issues at stake; Our differences centre around he manner, and speed, that we will achieve a resolution.\nThe hustings themselves were extremely well organised, though they were overshadowed by the absence of the incumbent MP, who failed to attend, despite having committed to the event some weeks before.I was extremely disappointed to hear that Diane Abbott was had chosen not to attend. Given that the hustings would be the only opportunity to challenge Ms Abbott as the incumbent MP, her late withdrawal and replacement by her deputy was initially taken at face value, having informed the organisers that she had ‘National Obligations’ to attend to. That she subsequently chose to reveal on Twitter, that far from having a pressing issue of national importance, she had instead chosen to campaign in Westminster in support of the Labour PPC there, should indicate to constituents that Ms Abbott feels no need to place herself under scrutiny nor the need to earn her votes. It has not gone unnoticed that the Shadow Home Secretary has been conspicuous by her absence from both the local and national stages throughout this General Election campaign.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_category_Westminster-News/content_17.html": "GET YOURSELD TESTED! 26th March 2025 Get yourself tested! It was great to welcome the Man Van to Parliament today in order to raise awareness of early prostate cancer diagnosis. The Man Van was... ArticlesLocal NewsWestminster News\nMars Wrigley's Future in Huntingdon 18th March 2025 Last week in Westminster I met with Adam Grant, the UK General Manager for Mars Wrigley to discuss their local plans and commitment to Huntingdon. We’re all... Westminster News\nMeeting with Minister for the Armed Forces 13th March 2025 This morning I met with the Minister for the Armed Forces, Luke Pollard MP. It was very useful to meet with Luke to discuss a number of Defence topics, within... Westminster News\nBen Pushing For Alconbury Weald Station 13th March 2025 A very productive meeting with new Transport Secretary Heidi Alexander this afternoon. It was hugely useful to discuss local public transport issues... Westminster News\nFirst Parish/Town Council Roundtable 11th March 2025 Yesterday I hosted a roundtable session with Parish and Town Council leaders in Westminster. It was hugely valuable to welcome Huntingdon Town Council, Brampton... Westminster News\nUpdate on the Police Allocation Formula 7th March 2025 Following my debate in January and ongoing discussions with the Government regarding the urgent need to review the Police Allocation Formula which would... Westminster News\nFirst Meeting of All Party Parliamentary Group 26th February 2025 On Monday we saw the first meeting of the All Party Parliamentary Group on Prostate Cancer. Prostate Cancer is a very personal issue for me. With a family... Westminster News\nWhitehall gridlocked by 1,400 tractors for the Save British Farming protest 10th February 2025 An incredible sight today with the entirety of Whitehall gridlocked by 1,400 tractors for the Save British Farming protest today against the Government’s... Westminster News\n\"Huntingdon's Potential is Huge\" Driving Growth for the UK: Pivotal role for Cambridgeshire and Peterborough 28th January 2025 A real pleasure to represent Huntingdon in yesterday’s panel as part of “Driving Growth for the UK: Pivotal role for Cambridgeshire and Peterborough”. It was a... Westminster News",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_heart-radio-cambridgeshire-speaking-about-impact-recent-flooding-locally/content_10.html": "I was on Heart Radio Cambridgeshire earlier today addressing the ongoing flooding across Huntingdonshire with parts of Brampton already severely affected and St Ives also impacted.\nGiven the continued rain, both across Huntingdonshire and upstream, the floodwater is anticipated to continue to be high for several more days and could worsen.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_huntingdon-neuropathy-centre/content_21.html": "Earlier this week I visited The Huntingdon Neurotherapy Centre to meet with Anna Dutton.\nThe neurotherapy centre provides a range of spaces, activities and services that range from medical relief to community action.\nThe star of the show is the hyperbaric chamber which provides users with an hour of a pressurised oxygen-rich atmosphere to conduct hyperbaric oxygen therapy (HBOT).\nYou can find out more about the chamber here:\nhttps://huntsneuro.org/oxygen-therapy/\nAnna has been instrumental in securing additional funding via grants from The National Lottery, Green Business, Sports England and John Lewis.\nThe centre is always on the look out for volunteer help, whether it be lending a hand transforming the communal garden or helping in the kitchen, through to training and operating the hyperbaric chamber. There’s no shortage of roles to be filled. Alternatively, they are also looking for sponsors to pay for new chairs for the hyperbaric chamber.\nIf you would like to volunteer please do make contact with Anna. Similarly, if you would also like to hire the centre as a community space.\nThank you to Anna and the team for their time and for showing me everything the centre has to offer.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_category_Opinions/content_4.html": "BBC Politics Live: Discussing the impact of NSIP Solar Projects on rural communities 12th November 2024 “So what’s your message to local villages in my constituency who are now going to have a huge solar farm built on their doorstep? And it’s a Nationally... Opinions\nTimes Radio: Ayesha Hazarika's Weekend Political Panel 27th October 2024 Really enjoyed making my Times Radio debut on Ayesha Hazarika’s political panel this evening, discussing some of the weekend’s political stories. Opinions\nHeart Radio Cambridgeshire: Speaking about the impact of recent flooding locally 1st October 2024 I was on Heart Radio Cambridgeshire earlier today addressing the ongoing flooding across Huntingdonshire with parts of Brampton already severely affected and St... Opinions\nBBC Radio Cambridgeshire: Interview with Amir Suleman on life as a new MP 8th August 2024 Great to be on BBC Radio Cambridgeshire this morning with Amir Suleman, discussing my first few weeks as an MP in Westminster. Also key local issues; the... Opinions\nConservative Home: Conservatives put veterans’ affairs in the Cabinet – why did Labour take it out? 18th July 2024 Ben Obese-Jecty is the Member of Parliament for Huntingdon and a former British Army Infantry Officer. As a veteran, the issue of veterans’ affairs is one that... Opinions\nBBC Politics East: Discussing Natural England’s impact on infrastructure projects and new housing development 14th April 2024 It was a real pleasure to make my BBC debut on Politics East this morning for the first show in their new studio. It was great to sit down with Amelia Reynolds... Opinions\nConservative Home: We need urgently to overhaul our flood response – but more layers of bureaucracy are not the answer 7th February 2024 This winter the spectre of flooding has once again become a critical issue across many areas of the country. With flooding becoming more frequent, properties... Opinions\nThe Telegraph: It’s not racist to criticise the violence of Notting Hill Carnival 30th August 2023 Susan Hall is right. The event can't go on as it is Anyone who has braved the Notting Hill Carnival will know that it is an experience you’re unlikely to forget... Opinions\nGB News: Ben Obese-Jecty discusses Greenpeace's stunt occupying on Rishi Sunak's constituency home 5th August 2023 Ben Obese-Jecty appears on GB News Breakfast with Martin Daubney and Anne Diamond to discuss Greenpeace's stunt, occupying the roof of the Prime Minister's... Opinions",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_kilimanjaro-trip-fundraiser-local-cadets/content_9.html": "Great to drop-in to the Corn Exchange last night for the Cambridgeshire Army Cadet Force fundraiser for their forthcoming expedition to Mount Kilimanjaro.\n14 cadets will be visiting Kilimanjaro orphanage before making the climb over six days.\nThis is a fantastic opportunity for the cadets and illustrates the incredible opportunities that the Army Cadets can offer. For some of the cadets this is the first time they will ever have been abroad.\nCongratulations to Lesley, Colin, Jay and all the team for their efforts in delivering this. The value added by dedicated support from Army Cadet Officers, Instructors and volunteers often goes unnoticed and without them the ACF wouldn’t be able to offer the opportunities it does.\nYou can contribute to the fundraiser here:\nhttps://www.gofundme.com/f/cambridgeshire-army-cadet-force-mount-kilimanjaro-trip?attribution_id=sl:23b82627-1356-42d8-87df-4a64c16a1058&utm_campaign=man_sharesheet_dash_ai&utm_content=amp1v1&utm_medium=customer&utm_source=copy_link",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_meeting-policing-minister-chris-philp-mp-discuss-police-funding-cambridgeshire/content_23.html": "This week I had the opportunity to follow up on my discussion last week with the Home Secretary the Rt Hon James Cleverly MP regarding the issue of the funding formula for police in Cambridgeshire.\nOn Tuesday I sat down with the Policing Minister Chris Philp MP to discuss the need for a review to the funding formula. Whilst Cambridgeshire now has record numbers of police officers, up 18% on 2010, its status as one of the fastest growing regions in the country means we will need increasing numbers of police officers in order to keep safe our growing urban population as well as maintaining a presence and ensuring our rural communities are also kept safe.\nI will continue to push for a review of the funding formula and a fairer allocation of funding to support our police going forward.\nYou can read more about my plan at the link below:",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_ben-welcomes-government-boost-police-funding-across-cambridgeshire/content_20.html": "- Having delivered on their manifesto commitment to recruit 20,000 new police officers, the Conservative Government are making sure the police have the funding they need.\n- That is why next year police forces will receive up to £843 million to better protect the public, so that every officer and community has the support and resources they need to cut crime, protect the public and build confidence in policing.\n- The Conservative Government is ensuring the police have the necessary resources to clampdown on crime, making our communities better and safer places to live.\nBen Obese-Jecty welcomed additional police funding totalling £196.7 million for Cambridgeshire which is an increase of £11.3 million on last year–6.1 per cent. This funding is part of a total of £843 million to better protect the public. Additional funding will help make sure that crime is effectively tackled by the police and people are kept safe in Huntingdon.\nThis new funding is a 30.7 per cent rise in cash terms compared to 2019-20, as part of the Conservative Government’s long-term efforts to cut crime and keep our communities safe. The proposed package for 2024-25 could see a total of up to £18.4 billion pledged to support the police to cut crime, tackle anti-social behaviour and pursue county lines gangs.\nThis announcement comes weeks after the Conservative Government’s introduction of five new pieces of legislation to keep our streets safe. These will ensure criminals are locked up for longer, victims are protected, with police and intelligence services given further powers to protect us, delivering on the promise to clamp down on crime.\nThe Conservatives have already delivered on their commitment to recruit 20,000 more police officers, putting more police on our streets and cracking down on crime. Since the Conservatives came to office in 2010, their zero-tolerance approach to crime has worked, with crime down by 50 per cent, excluding fraud. Meanwhile, in areas run by Labour Police and Crime Commissioners, crime was 34per cent higher last year than in Conservative run areas.\nThe Conservative Government is laser focused on taking the long-term decisions required to tackle crime in our communities, whilst continuing to support victims in Huntingdon and across the country.\nCommenting, Ben Obese-Jecty said:\n“This additional funding for our police from the Conservative Government is excellent news for Huntingdon. This funding, alongside the 230 new police officers in Cambridgeshire, will make our streets safer and help cut crime. “The Conservatives are taking a tough stance on all crime and delivering the long-term decisions needed for a brighter future.”\nCommenting, Home Secretary James Cleverly said:\n“Our communities deserve a well-funded and equipped force, dedicated to making our country safer. “Progress has been made, with overall crime down and 136,000 violent offences prevented since 2019, but we will continue to invest in policing. “That is why we are putting up to £843 million more into keeping our streets safe, so that every officer and community has what they need to cut crime, protect the public and build confidence in policing.”",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_bbc-politics-live-discussing-impact-nsip-solar-projects-rural-communities/content_26.html": "“So what’s your message to local villages in my constituency who are now going to have a huge solar farm built on their doorstep? And it’s a Nationally Significant Infrastructure Project and will be railroaded through by this Government.” Labour’s answer? “Sometimes that means that some areas will have to deal with renewable energy.” Today I was on BBC PoliticsLive and once again the topic of energy infrastructure was discussed. The Labour MP for Barking, Nesil Caliskan has little sympathy for those in Great Staughton and Hail Weston who stand to be impacted should the 1,900-acre East Park Energy solar farm be given the green light by this Labour Government.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_privacy/content_27.html": "This document outlines how Ben Obese-Jecty MP processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Ben Obese-Jecty MP\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Ben Obese-Jecty MP.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Ben Obese-Jecty MP, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Ben Obese-Jecty MP via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_bbc-politics-east-discussing-natural-englands-impact-infrastructure-projects-and-new-housing/content_5.html": "It was a real pleasure to make my BBC debut on Politics East this morning for the first show in their new studio. It was great to sit down with Amelia Reynolds for some really important discussions regarding Natural England and their impact upon large infrastructure projects such as the Norwich Western Link connecting the Broadland Northway with the A47 where a super colony of Barbastelle bats is being protected, potentially causing the £274m project to be halted as well as the impact upon new housing via the enforcement of nutrient neutrality legislation as well as discussion around the ever broadening responsibilities of local councils.\nYou can watch the episode on BBC iPlayer HERE.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_myplan/content_16.html": "The next General Election will mark a change in Huntingdon. For the first time in more than 20 years Huntingdon will have a new Member of Parliament.\nWith the election likely to take place this Autumn its hugely important that voters know what their candidates stand for. Promoting investment, preventing flooding, tackling crime, delivering our new hospital. These are just some of the priorities I will address as I stand to be your new Member of Parliament for Huntingdon.\nHuntingdon is a town that is set to grow significantly over the next decade, bringing with it the opportunity to create thriving towns and vibrant villages across the constituency. But alongside that growth it is also vital that we maintain and upgrade our infrastructure to support it, ensuring our roads and public transport can cope with a larger population, that public transport links our towns with our villages and new developments; that everyone can access GP and dentistry services; that working people have good quality employment opportunities. With the right plan Huntingdon can become a real success story.\nMany of you will have met me already, on the doorstep or out and about in the town, spoken to someone who's met me or seen me out walking the dog. I live in Huntingdon and know the issues we face here in the constituency, not only in Huntingdon but also across our villages and rural communities.\nOver the past few months since my last leaflet I have been working hard meeting constituents, businesses, organisations and campaign groups, understanding which issues are most important and how I can best support people locally. You may recall that my previous leaflet asked local residents to let me know their priorities and where efforts should be focused. I have listened to those views and the issues raised are addressed here by my plan for Huntingdon.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_kemi-st-ives/content_14.html": "It was great to welcome Kemi Badenoch to St Ives yesterday, campaigning for Paul Bristow for the Cambridgeshire and Peterborough Mayoralty and for our County Council Candidates, Craig Smith and Martin Gill.\nWith Paul as Mayor we can finally have a full-time Mayor who doesn’t spend time doing a second job and is focused 100% on delivering for this region.\nCraig and Martin will make fantastic local councillors. Both live in their respective divisions and so know well the challenges in St Ives, Wyton and Needingworth.\nWith postal votes having arrived last week voting has already started. Whoever you intend to vote for please make sure you do vote.\nThese elections really do matter if you want to see an improvement to local services and an end to the Labour-Lib Dem-Independent coalition running the County Council and a full-time Mayor you’ll actually see, then vote for Craig, vote for Martin and vote for Paul.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_category_Local-News/content_36.html": "Centre 33 - Helping Our Young People 22nd April 2025 It was great to pop by to Centre 33 in Huntingdon just before the Easter break to find out more about the work they do and the services they provide supporting... Local News\nKemi in St Ives 20th April 2025 It was great to welcome Kemi Badenoch to St Ives yesterday, campaigning for Paul Bristow for the Cambridgeshire and Peterborough Mayoralty and for our County... Local News\nDid You Know Houghton Mill Still Makes Flour? 20th April 2025 A fantastic visit to Houghton Mill earlier this week to meet with the National Trust and find out more about the site. In its current guise the mill dates back... Local News\nKilimanjaro Trip Fundraiser for Local Cadets 19th April 2025 Great to drop-in to the Corn Exchange last night for the Cambridgeshire Army Cadet Force fundraiser for their forthcoming expedition to Mount Kilimanjaro. 14... Local News\nHuntingdon Neuropathy Centre 18th April 2025 Earlier this week I visited The Huntingdon Neurotherapy Centre to meet with Anna Dutton. The neurotherapy centre provides a range of spaces, activities and... Local News\nA New Lease of Life for St James' Church? 16th April 2025 It was great to meet with the team behind Spaldwick Common Ground Community Project this week to discuss their plans to create a vibrant, inclusive, and... Local News\nMalcolm's Retreat - Supporting Those Affected by Cancer 16th April 2025 It was great to be able to meet with Damien and James yesterday to hear about their charity The Malcolm Whales Foundation and also to visit Malcolm’s Retreat... Local News\nVisit to Woodgreen Pet Charity 15th April 2025 It was a huge privilege to have the opportunity to visit Woodgreen. As the owner of a rescue dog myself (and I’m sure many of you have seen me out and about... Local News\nSupporting Pidley Lorry Group 11th April 2025 This week I met with the Pidley Lorry Group to discuss the ongoing issue of HGVs using Pidley as a rat-run. Whilst I was there I saw first-hand how bad the... Local News",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_campaigning-warboys-darryl-preston-our-police-and-crime-commissioner/content_34.html": "We’ve been out campaigning for Darryl across the region as our Police and Crime Commissioner for Cambridgeshire and Peterborough.\nIn the past three years as the incumbent Police and Crime Commissioner Darryl has overseen nearly 400 new officers for Cambridgeshire police, neighbourhood crime is down, household burglary by 37%, knife crime by 25%.\nAs a former police officer Darryl has the knowledge and experience to do the job. It's vital that he's re-elected on Thursday May 2nd rather than risk the Labour candidate winning.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_campaigns_improving-our-transport-infrastructure/content_32.html": "Across Huntingdonshire we have seen a huge number of newly built homes, commercial and industrial units, with further developments planned. As your MP I will work to ensure that we upgrade our road infrastructure to meet the increasing level of traffic.\nWe have already seen significant upgrades to our major roads with the upgraded A14 between Cambridge and Huntingdon, but the junctions to access the A14 from nearby villages west of Huntingdon continues to be an issue, with several accidents and near misses; the dangerous junctions that cross the A14 desperately need to be made safe. We have also seen the impact of increasing numbers of cars on local roads East of St. Ives with the constant traffic approaching Harrison Way roundabout. With further developments planned in Needingworth and Somersham this traffic, and that crossing the Great Ouse out of the constituency beyond Earith, will only worsen without seeking solutions to the issue.\nI will also push for an overhaul of our bus routes to better integrate our towns with our villages and new developments as rural services have not improved despite Labour Mayor Nik Johnson trebling the bus precept.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_did-you-know-houghton-mill-still-makes-flour/content_3.html": "A fantastic visit to Houghton Mill earlier this week to meet with the National Trust and find out more about the site.\nIn its current guise the mill dates back to the 18th Century and along the way has variously been a youth hostel and now also has a campsite in Waterclose Meadows next door. It also has a hydroelectric generator which offsets 50% of its power usage.\nThe mill is still a working mill and still makes flour traditionally from locally sourced wheat at weekends. You can buy the flour in the shop and it’s also used to make the cakes and scones in the tearoom. The mill also provides a learning resource for schools . You can even have your wedding ceremony there.\nThere are also a host of outdoor activities to do including canoeing and paddleboarding.\nMy thanks to Lydia and Emma for showing me round, and also for letting me have a go at making flour by hand; it really is much harder than it looks!",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_meeting-minister-armed-forces/content_31.html": "This morning I met with the Minister for the Armed Forces, Luke Pollard MP.\nIt was very useful to meet with Luke to discuss a number of Defence topics, within which I was able to follow up on my question to the Prime Minister last week regarding the continued presence of the United States Air Forces Europe (USAFE) at bases in England, particularly locally in East Anglia.\nWith the developing geopolitical situation and a potential change in focus for the new US administration from Europe and Russia to the Indo-Pacific and China I am seeking reassurances from the Government that we will not see a reduction in force structures.\nWith 90% of US service personnel living in our communities rather than on base there would potentially be a significant impact on local communities, both here and in other USAFE locations such as West Suffolk.\nVery useful to ensure any potential issue is on the radar of the Defence Front Bench.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_conservative-home-conservatives-put-veterans-affairs-cabinet-why-did-labour-take-it-out/content_30.html": "Ben Obese-Jecty is the Member of Parliament for Huntingdon and a former British Army Infantry Officer.\nAs a veteran, the issue of veterans’ affairs is one that is close to my heart. Having served a three-year term on the Veterans Advisory and Pensions Committee, finishing earlier this year, I have seen how important it is that we continue to champion policies and initiatives that add value to our ex-services community.\nAmid the recent spate of appointments to the new cabinet there were few surprises, but a notable exception from Sir Keir Starmer’s first cabinet meeting was the Minister for Veterans Affairs.\nUnder the Conservatives, Johnny Mercer attended cabinet as part of the Government’s promotion of the role; Labour’s decision to restructure its governance of veterans and demote the role is yet to be fully explained.\nIn the newly-elected (and rapidly promoted) Al Carns, Labour does have a well-respected minister who knows the Ministry of Defence well.\nBut therein lies the issue: the Office for Veterans’ Affairs sits within the Cabinet Office for good reason. Labour have decided to separate it from the Minister for Veterans’ Affairs, which itself now sits within the Ministry of Defence and no longer attends cabinet; representation of veterans at Cabinet now comes from the Defence Secretary.\nInformation regarding Labour’s plans to support veterans is scarce and there are only two sentences in Labour’s manifesto which address the topic:\n“Labour will ensure veterans have access to the mental health, employment, and housing support and in other areas they need. We will also scrap visa fees for non-UK veterans who have served for four or more years, and their dependents.”\nThe first sentence is broad enough to sound like plausible support for veterans, but the issue is that all these aspects are already covered by existing government schemes.\nOp Courage was launched in January 2024 as an NHS mental health specialist service designed to help serving personnel, veterans and their families. Op Fortitude was launched by the Office for Veterans’ affairs in July 2023 as a centralised referral pathway into veteran supported housing. It is funded by the Armed Forces Covenant to support veterans at risk of becoming homeless.\nRegarding employment, the previous government launched the Defence Employer Recognition Scheme and the ‘Great Place to work for Veterans’ scheme as well as offering National Insurance contributions relief as an incentive to employ first-year veterans.\nGiven there are already specific schemes in place to address each aspect of support for veterans in the Labour manifesto, it is not unreasonable to ask: what precisely Labour intends to do differently?\nIn recent years I have written a number of pieces, both for Conservative Home and elsewhere, proposing the waiving of visa fees for the dependants of Commonwealth veterans. Indeed, it was pleasing to see the policy included in both Conservative and Labour manifestos. But for Labour, this is the sole specific veterans policy in the entire document.\nLabour must be pressed to outline what their plan for veterans actually is. What will make a difference to veterans’ lives that isn’t already in place? Can Labour guarantee that current levels of support will be maintained, or will we see cuts to services as Labour tightens its belt to create the fiscal headroom to fund its pledges elsewhere?\nThe Conservative Manifesto outlined a broad slate of proposals to enhance services for ex-servicemen and woman, but beyond these there are even bigger areas that Labour should be looking at if they are serious about veterans.\nThe primary function that the new Minister for Veterans’ Affairs should undertake is an end-to-end review of all welfare services under Veterans UK, including a review of the Veterans UK brand itself.\nThis should be coupled with a through-life review of veterans’ welfare services, and personnel made aware of them whilst still serving. Effectively communicating the support available and how it is accessed is a key aspect of encouraging self-referral, but at present information is at best patchy and often poorly communicated via social media platforms and opaque websites.\nA better online platform could alleviate this access issue. The Government must enhance the Veterans Gateway to provide a single point of entry into the welfare space. At present, such services for veterans are largely interacted with separately, despite the fact that many veterans who require assistance have needs that are closely interlinked.\nA one-stop shop Veterans Gateway would be able to provide ex-service personnel with ease of access to the welfare services they provide, and the Government with a simpler way of tracking the services that had been accessed. Coupled with the rollout of Veterans ID cards that evidence eligibility, a holistic and joined up approach to veterans welfare, facilitated by a platform that simplifies access, could avoid people falling between the cracks.\nThe role of the Veterans Advisory and Pensions Committees should also be reviewed. Despite a Veterans Advisory and Pensions Committee Bill being passed last year, the role of the VAPCs is yet to be clearly defined and the body has suffered from a lack of investment. With the Minister for Veterans’ Affairs now under the MoD, ownership of the VAPCs would be a sensible thing to place directly under that ministerial brief.\nGiven the opportunity to leverage the knowledge and experience of veterans in an official advisory capacity across 12 regional panels, the Government should be encouraged to clearly define their remit and make them a key conduit into defining policy and providing grassroots feedback from the breadth of their local experience. (The current disconnect frustrated me hugely during my own tenure as a committee member.)\nIt remains to be seen how effective Labour’s inchoate veterans’ policy turns out to be. The absence of specific detail is a significant concern, as is the lack of representation at cabinet by the minister. There is a suspicion that, despite their previous fanfare, Labour will not prioritise veterans.\nBut with a Veterans’ Affairs Minister who knows better than most the debt that we owe our troops, it should be hoped that they will have a champion within their ranks who will have the moral courage to fight for veterans.\nThough the cohort of veterans within parliament is smaller than it was prior to the election, it is now younger. It also sports members on both sides of the house who have more recent armed forces experience and crucially, more recent experience of the often-difficult transition to civilian life.\nParliament is well placed to champion veterans’ affairs – I know the opposition benches certainly will be.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_contact-0/content_13.html": "By email: [email protected] By phone: 0207 219 7338\nIf you are a constituent you will be given priority but please check that you have included your full name and postal address in your message as we are unable to progress your correspondence without this information.\nPlease note that my office operates a Zero Tolerance Policy.\nContacting Your Local Authority\nIf your concern relates to any of the public services listed below, you should contact your local council in the first instance.\n- Adult & Family Learning\n- Benefits\n- Council Tax Collection\n- Environmental Health\n- Highways\n- Housing\n- Leisure Facilities\n- Licensing\n- Museums & Libraries\n- Planning Permission & Disputes\n- Refuse Collection\n- Refuse & Waste Disposal Sites\n- Schools\n- Social Services\n- Strategic Planning Matters\n- Street Cleaning\n- Town Planning\nOur local authorities are Huntingdonshire District Council, Cambridgeshire County Council, and Cambridgeshire and Peterborough Combined Authority.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_bbc-radio-cambridgeshire-interview-amir-suleman-life-new-mp/content_7.html": "Great to be on BBC Radio Cambridgeshire this morning with Amir Suleman, discussing my first few weeks as an MP in Westminster.\nAlso key local issues; the potential delay to rebuilding Hinchingbrooke Hospital and Angela Rayner’s approval of the Envar Medical Waste Incinerator.\nYou can catch up with the interview on BBC Sounds.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_times-radio-ayesha-hazarikas-weekend-political-panel/content_25.html": "Really enjoyed making my Times Radio debut on Ayesha Hazarika’s political panel this evening, discussing some of the weekend’s political stories.\nReally enjoyed making my Times Radio debut on Ayesha Hazarika’s political panel this evening, discussing some of the weekend’s political stories.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_campaigns_tackling-crime-antisocial-behaviour-rural-crime/content_6.html": "This year Cambridgeshire Police will receive a budget increase of 6.1% and an uplift of 206 officers. As your MP I will work closely with the Chief Constable to tackle key areas, including county lines drug dealing in our towns, antisocial behaviour, rural crime and domestic violence.\nHaving already discussed policing priorities here with the Chief Constable I am well aware of the challenges the force faces, particularly with regards to resources. As such I will champion a change to the funding formula that currently sees Cambridgeshire receive a smaller share than other forces.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_campaigns_rebuilding-hinchingbrooke-hospital/content_22.html": "Hinchingbrooke Hospital is a vital healthcare resource both locally and beyond. As your MP I will fully support Hinchingbrooke's plans to build a brand new hospital and will campaign to secure the funding needed for the redevelopment of the site.\nIn addition to this I will campaign for a new access road from Views Common, vital to tackling local traffic issues.\nI recently met with the Hospital's Chief Executive Hannah Coffey to discuss the construction of the new block, housing seven state-of-the-art operating theatres, pharmacy and pathology services, that will form part of the proposed new hospital. Whilst this demonstrated what could be built Huntingdon, and the surrounding area, urgently need a new hospital that is fit for purpose.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_news_meeting-cambridgeshire-police-chief-constable-nick-dean-discuss-local-policing/content_11.html": "It was hugely important to have the opportunity to meet with the Cambridgeshire Constabulary Chief Constable Nick Dean and discuss the nature of the policing challenges his force faces, both across the county and here within Huntingdon.\nWe discussed how policing locally is prioritised and how as the constituency's new MP, I could best support the force and the Police and Crime Commissioner in ensuring that Cambridgeshire Police are allocated the resources necessary to enable the force to remain effective.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_privacy-notice/content_2.html": "Privacy Notice\nThis privacy notice relates to the personal data processed by the Office of Ben Obese-Jecty, Member of Parliament for Huntingdon, in relation to casework and policy queries.\nWho is the Data Controller?\nThe Data Controller is Ben Obese-Jecty, Member of Parliament for Huntingdon.\nWhat does the Office of Ben Obese-Jecty MP do?\nThe office discharges the duties and functions of an elected Member of Parliament. This includes processing constituency casework and responding to policy queries. In order to do this work we must process constituents’ personal data.\nHow do we process data?\nThe office processes constituents’ data under the lawful basis of public task. In instances where this lawful basis is not sufficient and explicit consent is required, a member of the office will contact you to establish your consent.\nWe are committed to ensuring that the information we collect and use is appropriate for this purpose and does not constitute an invasion of your privacy.\nWill we share your data with anyone else?\nWe will not use your personal data in a way that goes beyond your reasonable expectations in contacting us.\nIf you have contacted Ben about a personal or policy issue we may pass your personal data on to a third-party in order to deal with your enquiry. Third parties may include local authorities, government agencies, housing associations, hospitals, health trusts, regulators etc. Any third-parties that we may share your data with are obliged to keep your details securely, and to use them only for the purpose for which they were originally intended. When those third-parties no longer need your data in order to fulfil this service, they will dispose of the details in line with GDPR.\nUnder certain conditions outlined in law, we may disclose your information to third parties, (such as local or law enforcement authorities) if it is necessary and proportionate for lawful, specific purposes. In some circumstances we are legally obliged to share information, for example under a court order.\nWe may also pass your data on to third-party services providers contracted to us (such as casework management systems) in the course of dealing with you. If they act as data processors, we have contracts in place with them. This means that they cannot do anything with your personal information unless we have instructed them to do so. They will hold your information securely and retain it for the period we instruct. When they no longer need your date to fulfil this service, they will dispose of the details in line with our procedures.\nWe will not share your information with any third-parties for the purposes of direct marketing.\nHow long will you keep my personal data?\nUnless specifically requested by you, we will hold your data for the period during which Ben Obese-Jecty is your Member of Parliament and for no longer than four months after this time.\nCasework and policy queries are often revisited to provide the best service and representation for constituents and we retain records in order to ensure that this is possible.\nFollowing an election, if your MP changes we will retain information for a period of four months to allow you to request a copy of the data that we hold, or let us know if you would like us to transfer your data.\nWhat rights do I have to my personal data?\nAt any point, whilst we are in possession of or processing your personal data, you (the data subject) have the following rights:\n-\nRight of access – you have the right to request a copy of the information that we hold about you.\n-\nRight of rectification – you have the right to correct data that we hold about you that is inaccurate or incomplete.\n-\nRight to be forgotten – in certain circumstances you can ask for the data we hold about you to be erased from our records.\n-\nRight to restriction of processing – where certain conditions apply you have the right to restrict the processing of your data.\n-\nRight of portability – you have the right to have the data we hold about you transferred to another organisation.\n-\nRight to object – you have the right to object to certain types of processing, such as direct marketing.\n-\nRight to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n-\nRight to judicial review – if our office refuses your request under rights of access we will let you know why. You have the right to complain.\nHow can I contact someone about my data?\nYou can get in touch with our office by letter, email or telephone using the details at the foot of this page.\nPlease note that we will ask for identification should you choose to exercise any of the above legal rights in relation to the personal data we hold.\nPostal Address: Ben Obese-Jecty MP, House of Commons, Westminster, SW1A 0AA.\nTelephone: 0207 219 3000\nEmail: [email protected]",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_campaigns_regenerating-our-high-streets-town-centres/content_38.html": "Huntingdon should be a thriving town centre at the heart of our community. As your MP I will work with BID Huntingdon to regenerate our town centre, fill the empty shop units and improve their variety.\nI will champion our local businesses and help create a night-time economy in order to increase footfall and draw more visitors, making this a destination town.\nI believe there is a fantastic opportunity as the town grows, with thousands of new people and families making their home here.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_newsletter/content_28.html": "Stay Connected with Ben Obese-Jecty: Your Monthly Update\nI’m excited to share my brand-new monthly newsletter with you! This will be your go-to source for updates on all my activities—both in Parliament and within our community. From addressing local concerns to focusing on national issues, I’ll keep you updated on the strides we’re making together.\nSign up to stay informed and make sure your voice is always included in the conversation!",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk/content_1.html": "My Local Plan for Huntingdon Promoting Business Investment & Jobs Huntingdon is a region with enormous potential. As your MP I will work to… Rebuilding Hinchingbrooke Hospital Hinchingbrooke Hospital is a vital healthcare resource both locally and beyond… Improving our transport infrastructure Across Huntingdonshire we have seen a huge number of newly built homes,… A joined up approach to flood prevention Environmental changes have led to flooding from the River Great Ouse and our… Tackling crime, antisocial behaviour & rural crime This year Cambridgeshire Police will receive a budget increase of 6.1% and an… Latest News Centre 33 - Helping Our Young People It was great to pop by to Centre 33 in Huntingdon just before the Easter break… Kemi in St Ives It was great to welcome Kemi Badenoch to St Ives yesterday, campaigning for… Did You Know Houghton Mill Still Makes Flour? A fantastic visit to Houghton Mill earlier this week to meet with the National… Kilimanjaro Trip Fundraiser for Local Cadets Great to drop-in to the Corn Exchange last night for the Cambridgeshire Army… Huntingdon Neuropathy Centre Earlier this week I visited The Huntingdon Neurotherapy Centre to meet with… Ben on Facebook Ben on Twitter\nPromoting Business Investment & Jobs Huntingdon is a region with enormous potential. As your MP I will work to…\nRebuilding Hinchingbrooke Hospital Hinchingbrooke Hospital is a vital healthcare resource both locally and beyond…\nImproving our transport infrastructure Across Huntingdonshire we have seen a huge number of newly built homes,…\nA joined up approach to flood prevention Environmental changes have led to flooding from the River Great Ouse and our…\nTackling crime, antisocial behaviour & rural crime This year Cambridgeshire Police will receive a budget increase of 6.1% and an…\nCentre 33 - Helping Our Young People It was great to pop by to Centre 33 in Huntingdon just before the Easter break…\nDid You Know Houghton Mill Still Makes Flour? A fantastic visit to Houghton Mill earlier this week to meet with the National…\nKilimanjaro Trip Fundraiser for Local Cadets Great to drop-in to the Corn Exchange last night for the Cambridgeshire Army…\nHuntingdon Neuropathy Centre Earlier this week I visited The Huntingdon Neurotherapy Centre to meet with…",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_zero-tolerance-policy/content_24.html": "Zero Tolerance Policy\nAggressive or Abusive Behaviour\nMPs and their staff have the right to carry out their work without violence, abuse or harassment. Any behaviour, verbal or physical, which causes staff to feel uncomfortable, embarrassed or threatened is unacceptable.\nThis Zero Tolerance policy includes aggression or threats made in person, over the telephone, or in written communication.\nWe consider threatening behaviour to be the attempted or actual aggressive threatening physical actions made towards any member of staff; and the use of aggressive, threatening or abusive language (including raising of the voice, swearing and shouting).\nWe consider the use of inflammatory statements, remarks of a racial or discriminatory nature, and unsubstantiated allegations to be abusive behaviour.\nUnreasonable Demands\nA demand may be unreasonable if handling it could take up an excessive amount of staff time. MPs offices are small and have limited resources, this could stop other constituents’ cases from being handled in time.\nExamples of unreasonable demands may include, but are not limited to:\n-\nDemands for responses within an unreasonable timeframe;\n-\nInsisting on seeing or speaking to someone more senior or a particular member of staff when that is not possible;\n-\nRepeatedly changing the substance of an enquiry or complaint, or raising new and unrelated concerns;\n-\nRepeated demands for a different response where a response on the issue has been provided previously.\nUnreasonable Levels of Contact\nThe number of times you contact us, or the duration of each contact, can cause problems for our staff.\nThe level of contact may become unacceptable when the amount of time spent talking to an individual on the telephone; responding to or reviewing and filing emails and written correspondence means we struggle to deal with your case, or with other people’s cases.\nHow We Manage Unacceptable and Unreasonable Behaviour\nIf we feel behaviour is unacceptable or unreasonable, we may take the following actions:\n-\nRestrict or end contact on the matter;\n-\nRestrict contact on all matters;\n-\nEnd contact entirely for a period of time;\n-\nReport incidents to the police (for example, if violence has been threatened);\n-\nTake any other action that we consider appropriate (in extreme cases, this may include blocking calls/ emails and returning correspondence).\nWhere staff are considering the above, or have had to take immediate action (for example, end a phone call), this will be reported to the MP who will then consider what further action (if any) is appropriate. We will always tell the person in writing the action we are taking and the reasons why.\nIn making this decision we may consider:\n-\nHow it affects our staff;\n-\nHow it affects the individual (including their personal circumstances and any reasonable adjustments);\n-\nThe extent to which we are able to engage or assist;\n-\nThe extent to which the process or subject matter has been exhausted.",
  "https_www_benobese-jecty_org_uk_/https_www_benobese-jecty_org_uk_cookies/content_35.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S"
}