{
  "https_www_socialism2024_org_uk_/https_www_socialism2024_org_uk_mehring_html/content_9.html": "Mehring Books (UK) is a specialist publisher serving readers in the UK and Europe. We are dedicated to producing high-quality editions of socialist books and pamphlets in the English language. Our titles cover a wide range of subjects, from history and philosophy to culture and contemporary politics.\nOur publishing house contributes to the intellectual and cultural environment by providing a body of literature which helps one intelligently comprehend the complex economic, political, and social problems that confront mankind today.\nRecent titles\nThis is the first in a seven-volume series by the Russian Marxist historian, Vadim Rogovin, on the history of the Soviet Union between 1922 and 1940. Rogovin traces the complex inner-party struggles of 1923–1927, analyzing contemporaneous official documents, speeches and articles, Soviet archival material, memoirs of participants in political life, and documents by members of the Left Opposition that were suppressed in the Soviet Union for many decades.\nMehring Books and the World Socialist Web Site announce the book launch of Vadim Rogovin’s Was There an Alternative? 1923-1927, Trotskyism: A Look Back Through the Years.\nThis webinar features an online discussion with David North, chair of the International Editorial Board of the WSWS, and close friend and comrade of Rogovin, to discuss the book and the remarkable life of its author.\nThe New York Times’ 1619 Project, launched in August 2019, mobilized vast editorial and financial resources to portray racial conflict as the central driving force of American history. By denigrating the democratic content of the American Revolution and of the Civil War, it sought to erode democratic consciousness and to undermine the common struggle of the working class of all ethnic backgrounds against staggering social inequality.\nThe book includes the WSWS refutation of the 1619 Project, interviews with seven leading historians, a lecture series on American history, and a record of the controversy.\nOn July 4, the World Socialist Web Site marked the 244th anniversary of the Declaration of Independence by hosting a discussion with five significant historians: Victoria Bynum, Clayborne Carson, Richard Carwardine, James Oakes and Gordon Wood.\nThe discussion, “The Place of the Two American Revolutions—Past, Present and Future,” moderated by Kings College Professor Tom Mackaman and WSWS International Editorial Board Chairman David North, made for a fascinating, thought-provoking experience.\nThe 1985-86 split with the British Workers Revolutionary Party initiated a rich period in the history of Trotskyism, marked by intense theoretical work, the elaboration of a world perspective based upon the principles of permanent revolution and internationalism foreshadowing the dissolution of the Stalinist regimes. The period examined in the lectures contained in this book facilitated the launch of the World Socialist Web Site and the turn to the working class, in preparation for the political struggles shaking the world today.\nWith the 1985-86 split, the Trotskyists in the ICFI were able to decisively defeat the post-war Pabloite opportunist tendencies and launch a rebirth of Marxist culture. Using internal and published party documents, this volume, which includes much source material, shows how political perspective and program are developed in a Marxist-Trotskyist party.\nThe complex issues facing the ICFI after the 1985-86 split included a scientific historical analysis of the globalization of production; the corporatist development of the trade unions; the opportunism of the bourgeois nationalist movements; the policies of perestroika and glasnost and the re-establishment of capitalism in the former Soviet states; the explosive growth of Chinese capitalism after the bloody events of Tiananmen Square; and the expanding militarism of the United States.\nAppendices include the 1988 Perspective Resolution of the ICFI, and other works cited in the lectures.",
  "https_www_socialism2024_org_uk_/https_www_socialism2024_org_uk_Events_html/content_3.html": "Socialist Equality Party Election Rally - Sunday June 30th\nThe Socialist Equality Party (SEP) is standing candidates in the British general election to build a socialist anti-war movement, based on the working class.\nMillions of workers and young people in the UK hate the Conservatives and Labour for their backing and arming of the Israeli state as it commits genocide, killing more than 38,000 Palestinians in Gaza, and they want an alternative.\nWhat is not as well understood is that Britain, the United States, and other imperialist powers are taking actions in Ukraine that could result in a nuclear catastrophe threatening to destroy all life on earth. The global capitalist system, whose insoluble global crisis is the underlying cause of genocide and war, is descending into barbarism.\nThe SEP is using this election to break the conspiracy of silence maintained by the capitalist media, the major parties, the trade unions and what passes for the “left” over the acute dangers facing the working class. We intend to build a socialist alternative.\nSunday June 30, 2pm\nYMCA Indian Student Hostel,\n41 Fitzroy Square,\nLondon W1T 6AQ\n(Nearest tube: Warren Street)\nPast events\nThe fight to free Assange is the fight against war\nPublic meetings held this month in Britain by the Socialist Equality Party (SEP) and International Youth and Students for Social Equality (IYSSE) provoked important discussion among workers and young people on the campaign needed to free WikiLeaks publisher Julian Assange. The meetings in London, Sheffield, Manchester and Inverness were addressed by SEP national secretary Chris Marsden and assistant national secretary Tom Scripps.\nAssange, who exposed war crimes by the US and its allies in Iraq and Afghanistan, has been imprisoned in London without charge for well over a decade. He faces imminent extradition to the United States under trumped-up Espionage Act charges that carry a 175-year prison term.\nHow can the Gaza genocide be stopped?\nThe Socialist Equality Party and the International Youth and Students for Social Equality co-hosted a series of meetings in February 2024 in London, Sheffield, Inverness and Manchester adressing the question “How can the Gaza genocide be stopped?”\nReports were delivered by SEP National Secretary Chris Marsden and Assistant National Secretary Tom Scripps. Lively discussion followed. Many expressed their thanks at hearing such frank political criticisms levelled against the perspective of the ceasefire marches and the Stop the War Coalition, which they had found increasingly frustrating.\nMay Day 2022 Online Rally\nSpeeches were made from the United States, Canada, Brazil, Sri Lanka, Germany, France, Turkey, Australia, New Zealand on the following topics:\n“The NATO-Russia war and the tasks of the international working class”, “The COVID-19 pandemic and the fight for socialism”, “The map of the class struggle vs. the map of war”, “Canadian imperialism, Hitler’s Ukrainian accomplices, and the NATO-Russia war”, “No to war and capitalist misery! For socialist revolution in Latin America!”, “The significance of anti-government popular protests in Sri Lanka and the tasks of the Socialist Equality Party”, “Class struggle in Sri Lanka in the “decade of socialist revolution”, “German imperialism rearms for World War III!”, “UK signs up for frontline in war against Russia”, “Lessons of the French election between Macron and Le Pen”, “Turkey’s role in the US-NATO war drive against Russia”, “Finance capital and the deepening crisis of global capitalism”, “Young people must turn to the working class and the fight for socialism!”, “Australian ruling class promotes anti-China campaign”, “The class struggle in the Asia-Pacific” and “The revolutionary role of the American working class”.\nGreetings were sent by the Young Guard of the Bolshevik-Leninists in Russia, statements by workers from around the world.\nMay Day 2021 Online Rally\nThe May Day rally both reflected and anticipated changes in the world situation produced by the coronavirus pandemic. The ICFI has defined the pandemic as a “trigger event” analogous to World War I, which is accelerating all the underlying contradictions of the world capitalist system. This includes, above all, the growth of the class struggle, of which the ICFI and its May Day rally are the most conscious expression.\nIn both its form and content, the rally was a global event. There was a significant international response to the call for the rally. More than 2,500 viewed the event from more than 75 different countries on every continent, including Antarctica. The fourteen speakers consisted of leading members of the ICFI from 10 countries, speaking in seven different languages—English, German, French, Tamil, Sinhalese, Turkish and Portuguese.\nThe Blairites' Anti-Semitism Witch-Hunt and the Failure of Corbynism\nOn Sunday November 15, 2020, the Socialist Equality Party (UK) held an online public meeting in response to Jeremy Corbyn’s suspension from the Labour party on grounds of anti-Semitism.\nSEP (UK) National Secretary Chris Marsden presented a report which explained the deeply reactionary character of the anti-Semitism witch-hunt in the Labour Party, which seeks to equate principled opposition to the Israeli state with hostility towards Jews. He delivered a powerful critique of “Corbynism”, which has facilitated this right-wing campaign.\nFree Julian Assange and Chelsea Manning!\nOn Sunday February 23, 2020, the Socialist Equality Party (UK) held a successful rally Sunday in London to demand the freedom of WikiLeaks founder Julian Assange and US whistleblower Chelsea Manning. The meeting was attended by more than 130 workers, youth and students who came from all over the UK.\nAt the event, socialists from the three imperialist countries trying to silence Assange and Manning outlined the fundamental principles and programmatic conceptions required in the fight to secure their freedom—Joseph Kishore, the SEP’s candidate for president of the United States; WSWS journalist Oscar Grenfell from the SEP (Australia); and SEP (UK) National Secretary Chris Marsden.",
  "https_www_socialism2024_org_uk_/https_www_socialism2024_org_uk_foundations_html/content_6.html": "This document, the Historical and International Foundations of the Socialist Equality Party (United Kingdom), was adopted at the founding congress of the Socialist Equality Party, held in Manchester from October 22-25, 2010. It reviews and examines the most critical political experiences of the British working class, centring in particular on the post-war history of the Trotskyist movement.\nFurther material on the history of the Socialist Equality Party and the International Committee of the Fourth International is available here.\n- The principled foundations of the Socialist Equality Party\n- Reform and revolution in British history\n- The theory of permanent revolution and October 1917\n- Stalinism and the degeneration of the Third International\n- The Left Opposition and the struggle against centrism\n- The Fourth International and the Workers International League\n- Preparing the Fourth International for war\n- Britain’s wartime government of “National Unity”\n- Healy takes up the struggle for the Fourth International\n- The Revolutionary Communist Party during the war\n- The aftermath of World War Two\n- The 1945 Labour government\n- Haston/Grant and the Morrow/Goldman faction\n- The East European “buffer states”\n- The vexed question of entrism in the Labour Party\n- Tony Cliff and the origins of the International Socialists\n- The emergence of Pabloism\n- Healy Joins the Struggle Against Pablo\n- The Open Letter\n- The struggle against the Lawrence Group\n- The 1956 intervention into the Communist Party\n- The founding of the Socialist Labour League\n- A determined orientation to the working class\n- The 1963 Reunification and the “Great Betrayal” in Ceylon\n- The SLL assumes leadership of the International Committee\n- The role of the International Marxist Group\n- The political difficulties facing the SLL\n- The Third Congress of the ICFI\n- The global revolutionary crisis of 1968-1975\n- Pabloism and Northern Ireland\n- Security and the Fourth International\n- The mass movement against the Heath government\n- Growing political disorientation in the SLL\n- The founding of the Workers Revolutionary Party\n- The global capitalist counteroffensive\n- The WRP’s ultra-left turn\n- The Thatcher government\n- The Workers League’s critique of the WRP\n- The WRP explodes\n- The International Committee expels Gerry Healy\n- The formation of the Workers Revolutionary Party (Internationalists)\n- The WRP breaks with the International Committee\n- The significance of the split\n- Globalisation and the perspective of socialism\n- Capitalist restoration in the USSR\n- The national question and self-determination\n- The fight for socialist consciousness\n- Renunciationism and the emergence of New Labour\n- The Socialist Equality Parties\n- The World Socialist Web Site\n- Imperialist War and Militarism\n- The world economic crisis and the tasks of the SEP",
  "https_www_socialism2024_org_uk_/https_www_socialism2024_org_uk/content_1.html": "War, the class struggle and the tasks of the Socialist Equality Party\nThis resolution was passed unanimously at the Seventh Congress of the Socialist Equality Party (UK), held November 29--December 2.\nThis resolution was passed unanimously at the Seventh Congress of the Socialist Equality Party (UK), held November 29--December 2.\nWe are publishing the opening report delivered to the Seventh National Congress of the Socialist Equality Party (UK) by Chris Marsden, its National Secretary. Marsden was re-elected to his position by the Congress, held November 29-December 2, 2024.\nWe are publishing the speech introducing the resolution “War, the class struggle and the tasks of the Socialist Equality Party” at the Seventh National Congress of the SEP (UK) given by Tom Scripps, its assistant national secretary. The resolution was passed unanimously. Scripps was re-elected to his position by the Congress.\nThis contribution was delivered by veteran Trotskyist Barbara Slaughter to the Socialist Equality Party (UK)'s Seventh National Congress\nWe are publishing the speech given by SEP National Committee member Tony Robson at the Seventh National Congress of the SEP (UK) on the work of the IWA-RFC in the UK.\nSubscribe here for regular updates on the party's work, key articles from the World Socialist Web Site, and notifications of upcoming events.\nReform UK has only been able to make a breakthrough due to the abandonment of any defence of the working class by the Labour government and the trade unions.\nHundreds of artists have signed an open letter opposing artistic censorship while Kneecap’s music downloads and ticket sales have rocketed.\nDes died on April 23 after suffering a catastrophic heart attack aged just 58.\nNHS Fightback is calling workers not to trust trade union leaders who have betrayed struggle after struggle and to build rank and file committees to take control of their own fate.\nWorkers in Britain must reject all forms of racism and nationalism and link their struggles with workers in Europe and throughout the world. Against the European Union and its pro-business governments, we stand for workers’ rule across the continent.\nFrom the beginning of the Brexit referendum campaign in 2016, the SEP called for an active boycott, opposing both the nationalist calls for an 'independent' Britain and the capitalist European Union, which has dictated savage austerity, militarism and attacks on refugees across the continent.\nAlmost two decades after the United States launched the “war on terror,” the entire world is being dragged into an ever-expanding maelstrom of imperialist violence. Millions have been killed by the wars of US imperialism and its allies in the Middle East and Africa, and tens of millions maimed or turned into refugees. A century after the end of World War I, these conflicts are once again metastasizing toward a catastrophic global conflagration.\nThe ICFI and SEP are fighting to build a new international anti-war movement of the working class. The fight against war is the fight against its source, the capitalist profit system.\nModerated by WSWS reporters Andrea Peters and Andre Damon, the interview covered the central themes of North’s book and a wide range of topics, from the significance of the dissolution of the USSR and the crisis of the world capitalist system to the pro-imperialist politics of the pseudo-left and the revolutionary role of the working class in the struggle against war.\nThe statement, published on February 18, 2016, outlines a socialist strategy for the building of an international anti-war movement of the working class to oppose the drive by the ruling elites to a new imperialist world war.\nLeon Trotsky founded the Fourth International as the World Party of Socialist Revolution in 1938, to oppose the Stalinist degeneration of the Communist (Third) International.\nThe Socialist Equality Party (SEP) is the British section of the Fourth International, the world party of socialist revolution founded by Leon Trotsky in 1938 and led today by the International Committee. The International Committee of the Fourth International (ICFI) represents the continuity of the struggle waged by Marx, Engels, Lenin and Trotsky to forge an independent revolutionary party of the working class for the overthrow of the capitalist profit system.\nAn appraisal, on the occasion of the eightieth anniversary of Trotsky’s assassination, of the work of the great theoretician and strategist of World Socialist Revolution during the final year of his life.\nOn Sunday, March 7, the World Socialist Web Site held an online meeting to mark the 150th anniversary of the birth of Rosa Luxemburg, the great revolutionary leader. The meeting examined Luxemburg’s role as a Marxist theoretician and political leader, and discussed the significance of her immense historical legacy to the contemporary struggle to build a Marxist leadership of the international working class.\nThe Biden administration is seeking to extradite Julian Assange, an award-winning Australian journalist, to face charges of espionage that carry a life sentence and possible death penalty. His only “crime” is the publication of document exposing the war crimes and diplomatic intrigues of US imperialism and its allies.\nWe urge all defenders of democratic rights and opponents of imperialist war to get involved and join the fight to free Julian Assange!\nAn international mass movement must be organized to stop the extradition of Julian Assange to the United States.\nThis speech was delivered by Socialist Equality Party National Secretary Chris Marsden to a public rally held in London on Sunday February 23 2020.\nSign up for the WSWS Free Julian Assange newsletter for updates on important news and events\nIn virtually every country, governments are seeking to crack down on the internet, prevent the spread of socialist and left-wing views, and stop workers from being able to communicate and organize online. They are collaborating with the giant social media and technology corporations including Facebook, Google and Twitter to engage in censorship.\nDavid North, chairperson of the International Editorial Board of the World Socialist Web Site, has sent the following open letter to Google executives Sundar Pichai, Lawrence Page, Sergey Brin and Eric Schmidt.\nIncreased content moderation has been sold as a tool to control the far right, but the World Socialist Web Site was among the first to sound the alarm.\nUnprecedented levels of social inequality, continuous wars and the drive to great-power conflict are incompatible with the maintenance of democratic forms of rule. Around the world, capitalist governments are building up the state apparatus, surveillance and censorship directed at the population.\nFrom the United States to Germany, fascist forces are being systematically promoted by the ruling class. Their elevation is part of preparations to violently suppress mass opposition in the working class to social inequality and war.\nAt this event, leading members of the SEP in the US, Germany and UK spoke on the national and global significance of the rise of fascism in America, its social and political origins, and the necessary strategy for the working class to fight back.\nDavid North, the National Chairman of the Socialist Equality Party (US) and the Chairman of the International Editorial Board of the World Socialist Web Site, addressed a meeting of students and workers at Wayne State University in Detroit on April 11, 2019. The meeting was part of the series “The Threat of Fascism and How to Fight It.”\nThe International Youth and Students for Social Equality (IYSSE) is the student and youth movement of the Socialist Equality Party. It fights to unite students and young people for peace, equality, the rights of the working class and socialism.\nOn December 10, 2022 the International Youth and Students for Social Equality (IYSSE) held an online rally, “For a Mass Movement of Students and Youth to Stop the War in Ukraine!”\nThis is the report delivered by Gregor Link to the 2022 International May Day Online Rally held on May 1. Link is a leading member in Germany of the International Youth and Students for Social Equality, the youth movement of the International Committee of the Fourth International and its affiliated Socialist Equality Parties.\nMarsden joined the Trotskyist movement in 1983 and has played a leading role in the work of the International Committee of the Fourth International for over three decades. He is also a member of the international editorial board of the World Socialist Web Site.\nThomas Scripps is the assistant national secretary of the Socialist Equality Party. He joined the Trotskyist movement in 2012.",
  "https_www_socialism2024_org_uk_/https_www_socialism2024_org_uk_Donate_html/content_5.html": "Please make a donation to support our work in 2025.\nThe Socialist Equality Party bases its perspective on the independent political mobilisation of the working class in Britain, in alliance with their brothers and sisters in Europe and internationally.\nUnlike all the other parties, the Socialist Equality Party receives no funds from big business or the trade unions. We rely entirely on the generosity of our members and supporters.\nYour donation can help us extend our reach—through meetings, leaflets, posters, mailshots and on social media.\nPlease make as large a donation as you can!\nThank you.\nChris Marsden\nNational Secretary\nSocialist Equality Party (Britain)\nIf you intend to donate more than £500, you must be registered to vote in the UK. Contact us if you require further information.\nCheques\nAlternatively, send a cheque to:\nSocialist Equality Party\nBox 106\n88 Queen Street\nSheffield S1 2FW\nPlease include your full name and address.",
  "https_www_socialism2024_org_uk_/https_www_socialism2024_org_uk_statementofprinciples_html/content_10.html": "Statement of Principles of the Socialist Equality Party (UK)\nThe World Tasks of the Socialist Equality Party\n1. The Socialist Equality Party (SEP) is the British section of the International Committee of the Fourth International, the World Party of Socialist Revolution founded by Leon Trotsky in 1938. The principles of the SEP incorporate the essential experiences of the revolutionary upheavals of the twentieth century and the corresponding struggle waged by Marxists for the programme of world socialist revolution. The socialist revolution, which signifies the forcible entrance of the masses into conscious political struggle, portends the greatest and most progressive transformation of the form of man’s social organisation in world history– the ending of society based on classes and, therefore, of the exploitation of human beings by other human beings. A transformation so immense is the work of an entire historical epoch. The principles of the SEP are derived from and necessarily reference the experiences of this epoch, which opened with the eruption of World War I in 1914, followed shortly thereafter by the conquest of state power by the Russian working class in the 1917 October Revolution.\n2. The Fourth International emerged from the implacable struggle waged by the Left Opposition, led by Leon Trotsky, against the bureaucratic degeneration of the Soviet Union and the betrayal of the programme of world socialist revolution by the dictatorial regime headed by Stalin and his henchmen. The political source of thatbetrayal, which in 1991 led ultimately to the dissolution of the USSR, was the substitution of nationalism for internationalism by the Stalinist regime. The Stalinist bureaucracy was not the product of the October revolution, but rather of the incipient capitalist counter-revolution. As Trotsky demonstrated, the bureaucracy was the “tool of the world bourgeoisie in the workers’ state”. His prognosis has been graphically confirmed by the transformation of the Chinese, Soviet and East European Stalinists into immensely wealthy oligarchs.\n3. The socialist revolution is international in scope. Wherever revolutionary struggles of the working class first develop, the social conflagration will inevitably assume global dimensions. The socialist revolution will not and cannot be completed within a national framework. It will, as foreseen by Trotsky in his Theory of Permanent Revolution, be completed on the world arena. As Trotsky wrote, “The socialist revolution begins on the national arena, it unfolds on the international arena, and is completed on the world arena. Thus, the socialist revolution becomes a permanent revolution in a newer and broader sense of the word; it attains completion only in the final victory of the new society on our entire planet.”\n4. This fundamental principle of the Fourth International, which primarily defines the programme and political identity of the SEP, was forged in the struggle against the Stalinist “theory” of “socialism in one country.” The strategy of the working class in Britain, as in all countries, must proceed from an analysis of world conditions. The era of national programmes ended with the outbreak of World War I. Almost a century later, given the colossal growth of the world economy and its global integration, world economic conditions and the exigencies of inter-imperialist and inter-capitalist rivalries are the principal determinants of national life. Therefore, as Trotsky explained, “the national orientation of the proletariat must and can flow only from a world orientation and not vice versa.”\n5. The programme of the Socialist Equality Party expresses the interests of the working class, the leading and decisive international revolutionary social force in modern capitalist society. The central task of the SEP is to win the support of British workers for the programme of international socialism. The SEP strives, on the basis of this programme, to unify and mobilize the working class for the conquest of political power and the establishment of a workers’ state in Britain. This will create, thereby, the objective preconditions for the development of a genuinely democratic, egalitarian and socialist society.\n6. These objectives can be realized only within the framework of an international strategy, the goal of which is the global unification of the workers of all countries and the creation of a United Socialist States of the World. In Europe, the SEP works closely together with our sister parties for the building of sections of the ICFI throughout the continent. Against the capitalist European Union, and the advocates of national sovereignty, or a Europe of the Regions, we advance the perspective of the United Socialist States of Europe.\nThe Crisis of Capitalism\n7. Capitalism, and the imperialist system that develops upon its economic foundations, is the main cause of human poverty, exploitation, violence and suffering in the modern world. As a system of socio-economic organisation, capitalism long ago exhausted its historically progressive role. The blood-drenched history of the twentieth century–with its two world wars, innumerable “local” conflicts, the nightmare of Nazism and other forms of military-police dictatorship, eruptions of genocide and communal pogroms–is an unanswerable indictment of the capitalist system. The number of victims claimed by capitalist-inspired violence runs into the hundreds of millions. And this figure does not include the consignment of the peoples of entire continents to unrelenting poverty, with all its associated miseries.\n8. The gigantic scale of the existing productive forces and the extraordinary advances in technology are more than sufficient not only to abolish poverty but also to guarantee every human being on the planet a high standard of living. Culture should be flowering amidst unprecedented material wealth. But, instead, conditions of life are deteriorating for the working class, and human culture, deprived of perspective and hope for the future, is in deep crisis. The source of the contradiction between what is and what should be is a global economic system based on private ownership of the means of production, and the irrational division of the world into rival nation-states.\n9. All efforts to raise the living standards of the working class and address serious social problems run up against the barrier of private ownership of the means of production, the anarchy of the capitalist market, the economic imperatives of the profit system, and, last but not least, the insatiable greed and money-madness of the ruling class itself. The claim that the capitalist market is the ideal mechanism for the efficient allocation of resources and the fulfilment of social needs stands discredited amid the endless series of speculative scandals and multi-billion dollar bankruptcies that have rocked the world economic system during the past decade. The boundary lines between “legitimate” financial transactions and criminal fraud have been narrowed to the point of being almost invisible. The separation of the process of personal wealth accumulation from the production and creation of real value is an expression of the general putrefaction of the capitalist system.\n10. The irreconcilable conflict between the profit system and the very survival of humanity finds its most noxious expression in the crisis of global warming and the natural environment. The cause of this crisis lies not, as is falsely claimed by the media and the petty bourgeois Green and environmental movement, with population growth. Nor is it the result of science and technology–whose development is critical to the advance of human civilization–but, rather, with their misuse by an irrational and obsolete economic order. All scientific evidence points to the fact that nothing short of the socialist reorganisation of the world economy–in which the environment would no longer be held hostage to either the profit motive or destructive nationalist interests–will achieve the reductions in greenhouse gases necessary to prevent disaster.\n11. The solution to the global economic crisis and the deteriorating social position of the working class lies not in the reform of capitalism, for it is beyond reform. The crisis is of a systemic and historical character. As feudalism gave way to capitalism, capitalism must give way to socialism. The key industrial, financial, technological and natural resources must be taken out of the sphere of the capitalist market and private ownership, transferred to society and placed under the democratic supervision and control of the working class. The organisation of economic life on the basis of the capitalist law of value must be replaced with its socialist reorganisation on the basis of democratic economic planning, whose purpose is the satisfaction of social needs.\nImperialism and War\n12. While the economic system operates on a global scale, with industry and finance controlled by transnational corporations, capitalism remains rooted in a system of nation-states. In the final analysis, the national state serves as a base of operations from which the ruling class of each country pursues its interests on the world stage. Led by the United States, the uncontrollable drive of the main imperialist states for geo-political dominance, spheres of influence, markets, control of vital resources, and access to cheap labour, leads inevitably to war. The British bourgeoisie participated fully in the criminal US-led invasions of Afghanistan and Iraq. It sought to utilise its relations with Washington in order to extend its interests in the Middle East and the Caspian Basin–a region containing the bulk of the world’s oil resources. Britain endorsed the doctrine of “pre-emptive war” unveiled by the Bush administration in 2002–in violation of legal precedents established at the Nuremberg war crimes trial of 1946. In what marks a return to the brutality and violence that characterised Britain’s colonial past, the aim was to legitimise war as an instrument of policy.\n13. The Socialist Equality Party unequivocally condemns the “War on Terror” as a fraudulent pretext for the use of military violence abroad and the destruction of democratic rights at home. The SEP rejects as slander the labelling as “terrorists” of all those who resist the occupation of their country by foreign armies. It defends the basic right of people to defend themselves, their homes and their countries against neo-colonial invaders. This principled stand does not lessen the SEP’s opposition to violent acts that target innocent civilians in either the occupied countries or any other part of the world. Such terrorist acts are politically reactionary and serve only to enrage, disorient and confuse the public. They deepen sectarian and communal divisions within the occupied country. When practised internationally, terrorism undermines the struggle for the unity of the working class, and plays into the hands of the British establishment, which seizes on such events to justify and legitimize the resort to war.\n14. The SEP demands the immediate withdrawal of all British forces, contractors and other mercenaries from Iraq, Afghanistan and all its military bases overseas. We call for an end to threats against Iran and other countries, which, for one or another reason, are regarded as obstacles to the predatory designs of British imperialism. The UK ranks third in the world table of military spending, after the US and China. In addition to being a nuclear power, it has the second highest power projection in the world—defined as the capacity of a state to conduct expeditionary warfare. Efforts to whip up patriotic sentiment behind support for “our boys” in Afghanistan or elsewhere are aimed at justifying the use of brute force on a world scale, while placing society on a permanent war footing and intimidating the opponents of imperialist militarism. Against this, the SEP encourages and supports the widest mass protests against militarism and war. It makes clear, however, that the causes of war are embedded in the economic structure of society and its political division into nation-states. This means that the struggle against imperialist militarism and war can be successful only to the extent that it mobilizes the working class on the basis of an international revolutionary strategy and programme.\nThe Capitalist State and Parliamentarianism\n15. The essential precondition for the implementation of socialist policies is the conquest of political power by the working class and the establishment of a workers’ state. While the working class must make use of all democratic and legal rights available to it in the struggle for power, vast historical experience has demonstrated that it cannot carry out the socialist reorganisation of society within the framework of the existing institutions of bourgeois democracy and the capitalist state. The classic Marxist definition of the state as an instrument of class rule, consisting “not merely of armed men but also of material adjuncts, prisons, and institutions of coercion of all kinds” (Engels), is even truer today than it was a century ago. The state is not, as reformists habitually assert, a neutral arbiter of social conflict; its very existence testifies to the fact that society is split into irreconcilably antagonistic classes. The bourgeois state is an instrument that upholds the political dictatorship of the capitalist class. The British people exercise no effective supervision or control over these repressive institutions. Indeed, parliamentary rule can be swept aside on the say so of the monarch or the prime minister should they determine there is a “serious” threat to human welfare, the environment or national security.\n16. While employing democratic rhetoric to legitimize its rule within Britain, and to justify its use of violence all over the world, the bourgeoisie has enacted a raft of coercive powers that have established the legal framework for a police state. Under the guise of the “war on terror” habeas corpus has been abrogated by the extension of detention without trial, free speech curtailed and the presumption of innocence jettisoned. The right to asylum and the provisions of the Geneva Convention that were the outcome of the universal revulsion generated by the crimes of Nazism have been gutted. The British state, including its secret services, has colluded in torture and extraordinary rendition by the US and has perpetrated similar crimes.\n17. The “Mother of Parliaments” has degenerated into a façade for the monopolisation of political life by the financial oligarchy. The right to vote means little under conditions in which all the official parties are the representatives of big business. The existing electoral system is designed to enforce this anti-democratic set-up, being deliberately weighted against smaller parties. In the name of “checks” and “balances”, the dictatorship of capital is in fact reinforced by a system of institutionalised privilege, at the apex of which stands the Monarchy, the House of Lords and the Church of England. Likewise, invoking the existence of a “free press” conceals the domination of the major media outlets and the state broadcasting service by powerful corporate and vested interests. Independent comment is further curtailed by acts of direct state censorship such as D-notices and super-injunctions, or the threat of Britain’s sweeping libel laws. Moreover, there are indications that the Internet will be subjected to increasingly heavy-handed regulation.\nThe Fight for Workers’ Power\n18. The defence of democratic rights is inseparably bound up with the struggle for socialism. Just as there can be no socialism without democracy, so there will be no democracy without socialism. Political equality is impossible without economic equality. Like the struggle against war, the fight to defend and expand democratic rights requires the independent political mobilization of the working class, on the basis of a socialist programme, to conquer state power.\n19. The establishment of workers’ power requires far more than the election of socialist candidates to the existing institutions of the bourgeois state. New forms and structures of genuine participatory democracy–arising in the course of revolutionary mass struggles and representative of the working class majority of the population–must be developed as the foundations of a workers’ government; that is, a government of the workers, for the workers, and by the workers. The policy of such a government, as it introduces those measures essential for the socialist transformation of economic life, would be to encourage and actively promote a vast expansion of democratic working class participation in, and control over, decision-making processes. It would favour the abolition of existing institutions that either curtail democratic processes or serve as centres of conspiracy against the people (such as the Monarchy, Privy Council, standing army, and national-security apparatus). These and other necessary changes of a profoundly democratic character, to be determined by the masses themselves, are possible only in the context of the mass mobilization of the working class, imbued with socialist consciousness.\nThe Political Independence of the Working Class\n20. The struggle for power requires the unconditional political independence of the working class from the parties, political representatives and agents of the capitalist class. The working class cannot come to power, let alone implement a socialist programme, if its hands are tied by politically enfeebling compromises with the political representatives of other class interests. First and foremost, this necessitates a conscious political break with Labourism. The Labour Party was formed by the trade unions in 1906 as a means of representing their interests in parliament and ameliorating the worst excesses of capitalism. However, from its inception, the Labour Party was a bourgeois party, explicitly opposed to Marxism and the class struggle. Throughout its history, it has consistently defended the interests of British imperialism, promoted nationalism and class collaboration. Under conditions where the bourgeoisie operated within the framework of national regulation and was able to grant certain limited concessions and reforms the Labour Party advocated a social reformist programme, which served to subordinate the working class to the capitalist state. With the shattering of these conditions by the development of globalised production, the Labour Party, like its social democratic counterparts throughout the world, repudiated any connection with the working class and became the explicit advocate of the free market, international competitiveness and the destruction of past social reforms. It now openly functions as the ruthless representative of finance capital and big business. Among the paramount political responsibilities of the Socialist Equality Party is to advocate, encourage and promote a decisive and irrevocable break by the working class with the Labour Party.\n21. The SEP’s opposition to Labour and the present parliamentary set-up does not imply support for the various organisations defining themselves as “socialist”, “independent” or Green. These invariably function as adjuncts of the Labour and trade union bureaucracy, insisting they continue to represent the interests of the working class. Equally, the SEP is not obliged to lend support to any opposition movement or party that may emerge in the future, irrespective of the policies it advances. From the standpoint of the interests of the working class, such protest movements, while they may appeal to certain political and social discontent, offer no genuine political and programmatic alternative. Indeed, they can be utilised by the bourgeoisie in order to engineer a political shift or to create a politically impotent safety valve for mounting class tensions.\n22. In evaluating political tendencies, the SEP considers the decisive criteria to be not their episodic position on one or another question, but, rather, their history, programme, perspective, and class basis and orientation. History provides countless examples of the working class being led into a political blind alley through the formation of electoral alliances that required, for the sake of ephemeral gains at the ballot box, that workers sacrifice their most essential political, social and economic interests. The “Popular Front” alliances formed by the Stalinists and Social Democratic parties in the 1930s provide the most tragic examples of the consequences of the short-sighted and treacherous sacrifice of historic and long-term interests in the pursuit of broad-based, multi-class and, therefore, debilitating coalitions of incompatible social interests.\nAgainst Opportunism\n23. In its approach to all political questions and in its selection of the appropriate tactics, the Socialist Equality Party upholds the fundamental interests of the working class, based on a scientific understanding of the law-governed nature of the capitalist system and the political dynamics of class society, and a systematic assimilation of the lessons of history. It is this approach that places the SEP in irreconcilable opposition to opportunist politics, which, in the pursuit of short-term tactical gains, sacrifices the long-term interests of the working class. Time and again opportunists have defended their betrayal of principles by claiming to be realistic politicians, not guided by “inflexible” dogmas and who understand how to adapt their practice to the requirements of any given situation. Time and again, such “realistic” politics have led to disaster – precisely because they were based on superficial, impressionistic, non-Marxist and, consequently, unrealistic and false appraisals of objective conditions and the dynamics of the class struggle.\n24. But opportunism is not merely the product of an intellectual and theoretical error. It has substantial socio-economic roots in capitalist society, and develops within the workers’ movement as an expression of the pressure of hostile class forces. All significant manifestations of opportunism–from that of Bernstein, which arose within the German Social Democracy at the end of the 19th century, and that of Stalin, which grew inside the Bolshevik Party in the 1920s, to that of Michel Pablo and Ernest Mandel, which developed in the early 1950s inside the Fourth International, and, finally, to the opportunism of the British Workers Revolutionary Party that led to its break from the ICFI in the mid-1980s–can be traced to the influence exerted by bourgeois and petty-bourgeois social forces upon the working class. This is the underlying cause and significance of revisionism and opportunist politics. The struggle against such tendencies is not a distraction from party building, but, rather, the highest point at which the fight for Marxism in the working class is engaged.\nSocialist Consciousness and the Crisis of Leadership\n25. The Socialist Equality Party, as a section of the ICFI, defends the classical Marxist conception–developed systematically by Lenin in the construction of the Bolshevik Party and carried forward by Trotsky in the struggle to found and build the Fourth International–that revolutionary socialist consciousness does not develop spontaneously in the working class. Socialist consciousness requires scientific insight into the laws of historical development and the capitalist mode of production. This knowledge and understanding must be introduced into the working class, and this is the principal task of the Marxist movement. This was precisely the point that Lenin emphasized in What Is To Be Done? when he wrote: “Without revolutionary theory there can be no revolutionary movement.” Apart from the efforts of the revolutionary party to introduce Marxist theory into the workers’ movement, the predominant form of mass working class consciousness will remain at the level of trade unionism, defined by Lenin as the “bourgeois consciousness” of the working class. Denigration of the struggle for revolutionary consciousness, which is usually combined with demagogic attacks on intellectual and Marxist “elitism,” is the stock-in-trade of reactionary academics and political opportunists.\n26. The victory of socialism–and, therefore, the survival and progressive development of human civilisation–requires the construction, on the foundations of Marxist theory, of the Fourth International, the World Party of Socialist Revolution. Socialism will not be realised merely as the inevitable outcome of an unconscious historical process. The entire history of the 20th century testifies against such fatalistic “inevitabilism,” which is a caricature of historical materialist determinism and has nothing in common with the dynamic interaction of cognition, theory and practice exemplified in the work of Marx, Engels, Lenin and Trotsky. Capitalism survived the 20th century not because objective conditions were insufficiently mature for socialism, but rather because the leadership of the mass working class parties was “insufficient” for socialist revolution. The working class again and again entered into epic struggles. But these struggles, misled by the Stalinists, social democrats, centrist and reformist organisations, ended in defeats.\n27. Capitalism exists today because of the betrayals of the working class by the Labour and Stalinist parties and the trade unions. “The world political situation as a whole is chiefly characterised by a historical crisis of the leadership of the proletariat.” These words, with which Leon Trotsky began the founding document of the Fourth International, remain supremely relevant as a definition of contemporary political reality. There is not a single mass organisation in the world today that presents itself as an opponent of the existing world capitalist order, let alone summons the working class to revolutionary struggle. This has created a surreal environment, in which the anger and discontent of the working class is suppressed by the old, politically sclerotic organisations. But as Trotsky also wrote in the founding document of the Fourth International, The Transitional Programme: “The orientation of the masses is determined first by the objective conditions of decaying capitalism and second by the treacherous politics of the old workers’ organisations. Of these factors, the first of course is the decisive one: the laws of history are stronger than the bureaucratic apparatus.”\nMarxist Theory and the Working Class\n28. The contradictions of the capitalist system will drive the working class into struggles that pose the revolutionary reorganisation of society. These struggles will assume an explicitly international character, arising objectively from the advanced level of the global integration of the productive forces. Therefore, the great strategic task of the modern epoch is the forging of the political unity of the workers of all countries as the decisive international revolutionary force.\n29. The Socialist Equality Party bases its activity on an analysis of the objective laws of history and society, particularly as they are manifested in the contradictions of the capitalist mode of production. Rooted in philosophical materialism, Marxism insists on the primacy of matter over consciousness. “The ideal is nothing else than the material world,” wrote Marx, “reflected by the human mind, and translated into forms of thought.” The materialism of Marx is dialectical, in that it regards the material world and the forms of its reflection in thought not as an aggregate of fixed objects and concepts, internally undifferentiated, but, rather, as a complex of processes, in constant movement and interaction, with antagonistic and divergent tendencies.\n30. The SEP seeks to develop, within the advanced sections of the working class, a scientific understanding of history, a knowledge of the capitalist mode of production and the social relations to which it gives rise, and an insight into the real nature of the present crisis and its world-historical implications. The SEP strives to transform the material potential for social revolution created by an objective historical process into a class-conscious and self-confident political movement. Applying the method of historical materialist analysis to world events, the SEP anticipates and prepares for the consequences of the intensification of the world capitalist crisis, lays bare the logic of events, and formulates–strategically and tactically–the appropriate political response. The SEP insists that the progressive and socialist transformation of society can be achieved only through the mass struggle of the politically conscious working class. The actions of isolated individuals, resorting to violence, can never serve as a substitute for the collective struggle of the working class. As long political experience has shown, acts of individual violence are frequently instigated by provocateurs and play into the hands of the state.\n31. The SEP upholds under all conditions the essential revolutionary socialist principle: to tell the working class the truth. The programme of the party must be based on a scientific and objective assessment of political reality. The most insidious form of opportunism is that which justifies itself on the grounds that the workers are not ready for the truth, that Marxists must take the prevailing level of mass consciousness–or, more precisely, what the opportunists imagine it to be–as their point of departure, and adapt their programme to the prejudices and confusion existing among the masses. This cowardly approach is the antithesis of principled revolutionary politics. “The programme,” declared Trotsky in 1938, “must express the objective tasks of the working class rather than the backwardness of the workers. It must reflect society as it is, and not the backwardness of the working class. It is an instrument to overcome and vanquish the backwardness. That is why we must express in our programme the whole acuteness of the social crisis of the capitalist society, including in the first line the United States.” The first responsibility of the party, Trotsky continued, is to give “a clear, honest picture of the objective situation, of the historic tasks which flow from this situation, irrespective of whether or not the workers are today ripe for this. Our tasks don’t depend on the mentality of the workers. The task is to develop the mentality of the workers. That is what the programme should formulate and present before advanced workers.” These words define precisely the approach taken by the SEP.\nThe Trade Unions and Syndicalism\n32. The opportunists’ aversion to telling the workers the truth is always connected to their efforts to provide political cover for, and preserve the authority of, the old reactionary, bureaucratised and thoroughly corporatist trade unions that, together with the Labour Party, maintain the subordination of the working class to the capitalist system. The SEP aims to develop within the working class an understanding of the social and political function of these organisations, which the opportunists insist represent working people. The Trades Union Congress and its affiliated unions are controlled by and serve the interests of a substantial stratum of middle-class functionaries whose personal income is derived from their active and conscious role as facilitators of the corporate exploitation of the working class.\n33. During the past quarter century, the trade unions have played a major role in breaking strikes, lowering wages, eliminating benefits, cutting jobs and shutting down factories. During this process, they have been fully integrated into the apparatus of corporate management and the state. While membership has plummeted to an historic low, trade union revenues and the salaries of their functionaries have continued to rise. They have benefited financially from their involvement in numerous commercial ventures and control of vast union assets, which insulates them from the concerns of their own members and makes them indifferent to the suffering of the working class, the younger generation above all.\n34. Against the efforts of the opportunists to maintain the subordination of workers to the unions by promoting the syndicalist conception that they can be reinvigorated through rank-and-file pressure, the Socialist Equality Party calls for a rebellion against and break with these corrupt organisations. This does not mean that the SEP abstains from work inside the unions, to the extent that such activity is required to gain access to and assist the workers jointly oppressed by their employers and the union functionaries. But the SEP conducts such work on the basis of a revolutionary perspective, encouraging at every point the formation of new independent organisations–such as factory and workplace committees–that truly represent the interests of the rank-and-file workers and are subject to democratic control.\nClass Unity Versus Identity Politics\n35. Another form of opportunism, which has played a significant role in undermining the struggle for the unity of the working class and lowering class consciousness, is the promotion of innumerable forms of “identity politics”–based on the elevation of national, ethnic, racial, linguistic, religious, gender, and sexuality above class position. This shift from class to identity has been at the expense of an understanding of the real causes, rooted in the capitalist system, of the hardships that confront all working people. At its worst, it has promoted a competition among different “identities” for access to educational institutions, jobs and other “opportunities” which, in a socialist society, would be freely available to all people without such demeaning, dehumanising and arbitrary distinctions. The promotion of women-only lists and racial quotas by the advocates of “positive discrimination” and “affirmative action” has benefited, for the most part, a relatively small layer of the middle class, while dividing and weakening the working class. The SEP demands full equality for all people, and defends unequivocally their democratic rights. All forms of discrimination based on national, ethnic, racial, religious, or linguistic heritage, or on gender, sexual orientation or disability, must be abolished. The SEP advances this essential democratic component of its programme within the context of the fight for socialism, based on the political unification of all sections of the working class.\nFor the Rights of Immigrants and Asylum Seekers\n36. An essential precondition for the forging of this unity is the unconditional defence of the democratic rights of immigrants living in Britain. All the official parties and the media incite xenophobia, witch-hunting asylum seekers in order to divert attention from their own responsibility for the economic and social crisis. The Socialist Equality Party stands for the right of workers of every country to live and work where they choose. We condemn and oppose the entire reactionary framework of “border controls” and anti-immigrant legislation, and call for full democratic and citizenship rights for all immigrants, including those classified as “illegal.”\nAgainst Islamophobia and anti-Muslim discrimination\n37. The “war against terror” has been utilised to encourage anti-Muslim sentiment and to target communities for surveillance and repression. Muslims born and raised in Britain are routinely portrayed as being a hostile presence and the “enemy within”. This campaign has been accompanied by calls for the banning of the veil and other religious and cultural symbols in public places, following the example already set in several European countries. This is redolent of the treatment meted out to the Jews in the 1930s. The SEP denounces all those who lend succour to this chauvinist campaign on the spurious basis of concern for “western democratic values” and women’s rights, which invariably translates into support for war. We stand for the unity of working people, irrespective of the religious beliefs they may hold.\nThe United Socialist States of Europe\n38. The claim made by national chauvinists, usually endorsed by the trade unions, that the answer to the loss of jobs within Britain is to be found in protectionism, is false. As a practical matter, in the age of globalisation there can be no return to economic nationalism. At the same time, the invocation of “free trade” by the representatives of the transnational monopolies is as fraudulent as all their other tributes to “freedom.” The SEP advocates neither protectionism nor “free trade,” but fights instead for social ownership of the productive forces, the elimination of national borders, and the creation of a planned, rationally integrated global economy.\n39. As a major step toward the achievement of that goal, the SEP advocates the establishment of the United Socialist States of Europe. The SEP is opposed to the European Union and its institutions. They function as the instruments of the continent’s major corporations and banks through which to pursue trade war against their rivals at the expense of the jobs, social conditions and democratic rights of the working class. Only by ending the domination of capitalism and its political representatives over Europe is it possible to prevent it fracturing into antagonistic national states, and to utilise its vast wealth and productive forces for the benefit of society.\nAgainst Nationalism and Separatism\n40. The SEP unconditionally opposes British imperialism’s control over Northern Ireland. The preservation of colonial rule over the Six Counties, and Britain’s military presence, is a continued source of political reaction. This has not been altered fundamentally by the Good Friday Agreement of 1998, and the incorporation of Sinn Fein into the “power sharing” arrangements at Stormont. However, the SEP is not the advocate of Irish nationalism. Partition and the creation of the Republic of Ireland ended for all time the pretence that the Irish bourgeoisie constituted an anti-imperialist force. Almost a century later, Ireland’s entire history proves that it is class oppression that is the fundamental problem that must be overcome. The struggle against national oppression and all other anti-democratic measures is subsumed into the struggle of the working class for a new social order. It requires the unification of British workers with their brothers and sisters throughout Ireland, Catholic and Protestant, against imperialism and its local representatives on both sides of the border.\n41. There is nothing legitimate, let alone progressive in the emergence of Scottish and Welsh separatism. It expresses the interests of a layer of the aspiring middle class who are seeking to make their own relations with local capital, the transnational corporations and the European Union. The experience of the working class with such movements has been catastrophic, as shown in the bloody fratricidal conflict in the former Yugoslavia and the development of numerous right-wing movements throughout Europe. The SEP opposes all those who portray Scottish or Welsh nationalism as the basis for the construction of a new workers’ party, and who support the efforts of the Scottish National Party and Plaid Cymru to attribute the problems in these countries to “English” rule. Such claims obscure the essential social interests that dictate policy in these countries. The SEP is equally hostile to the efforts being made by sections of the bourgeoisie and the media to whip up “little Englander” nationalism. There are no common interests between working people and their oppressors, whatever flag they wave.\nDemocratic Centralism\n42. The revolutionary struggle of the working class requires organisation, and organisation is impossible without discipline. But the discipline required for revolutionary struggle cannot be imposed bureaucratically from above. It must develop on the basis of an agreement, freely arrived at, on principles and programme. This conviction finds expression in the organisational structure of the Socialist Equality Party, which is based on the principles of democratic centralism. In the formulation of policy and the appropriate tactics, the fullest democracy must prevail within the party. No restraints, other than those indicated by the party’s constitution, are placed on internal discussion of the SEP’s policies and activities. Leaders are democratically elected by the membership, and are subject to criticism and control. Those candidates for leadership who cannot abide criticism should ponder the words of James P. Cannon, the founder of the Trotskyist movement in the United States: “The truth never hurt anyone, provided he was on the level.” But if the formulation of policy requires the broadest discussion and open and honest criticism, its implementation demands the strictest discipline. The decisions arrived at democratically within the party are binding on all members. Those who object to this essential element of centralism in the implementation of decisions, who see in the demand for discipline a violation of their personal freedom, are not revolutionary socialists but anarchistic individualists, who do not understand the implications and demands of the class struggle.\nClass Consciousness, Culture and the World Socialist Web Site\n43. The fight for socialism demands an enormous growth in the political, intellectual, and cultural stature of the workers’ movement, in Britain and internationally. In contrast to the practitioners of pragmatic and opportunist politics, the SEP is convinced that only a movement working at the highest theoretical level will prove capable of attracting the working class to its banner, preparing it for the struggle against capitalism, and, beyond that, the construction of a socialist society. While bourgeois politicians seek to drag the working class down to their own intellectually debased level, the SEP strives to raise the working class up to the level required by its historic tasks. Not only politics, but also science, history, philosophy, literature, movies, music, the fine arts, and all areas of culture fall within the domain of socialist education. The SEP’s most important instrument for the development of socialist consciousness within the working class is the World Socialist Web Site. With its daily analysis of world political and economic developments, exposure of the social realities of capitalism, coverage of workers’ struggles, commentary on vital questions of culture, discussion of historical and philosophical themes, and examination of critical issues of revolutionary strategy, tactics and practice, the WSWS plays a decisive role in forging the contemporary world Marxist movement.\nRevolutionary Strategy and Transitional Demands\n44. The strategic aim of the Socialist Equality Party is to educate and prepare the working class for the revolutionary struggle against capitalism, the establishment of workers’ power and the creation of a socialist society. Our aim is not the reform of capitalism, but its overthrow. The attainment of this goal, however, requires the most careful and detailed attention to the conditions of life of the broad mass of workers, and the formulation of demands that address their needs. The SEP recognizes the necessity of establishing, in practice, a link between the perspective of socialist revolution and the concrete struggles in which the working class is engaged. In this effort, the work of the SEP is guided by the approach advocated by Leon Trotsky in the Transitional Programme: “It is necessary,” he wrote, “to help the masses in the process of the daily struggle to find a bridge between present demands and the socialist programme of the revolution. This bridge should include a system of transitional demands, stemming from today’s conditions and today’s consciousness of wide layers of the working class and unalterably leading to one final conclusion: the conquest of power by the proletariat.”\n45. Such demands include universal employment, unrestricted access to quality medical care and education, decent housing, the cancellation of repossessions and evictions, automatic adjustment of wages in line with inflation, the democratisation of the workplace, unrestricted inspection by the public of the financial records of corporations and financial institutions, establishment of restraints on executive salaries, reduction of working hours with no loss of pay, imposition of a genuinely progressive income tax and significant restriction on the transfer of massive personal wealth via inheritance, nationalisation and the establishment of democratic workers’ control of large corporations vital to the national and global economy, dismantling of the national “volunteer” army and the transfer of authority to popular militias controlled by the working class and with elected officers, and other demands of a democratic and socially beneficial character.\n46. Transitional demands will play an important role in the political mobilisation of the working class to the extent that they form part of a broader campaign to develop socialist consciousness. The Transitional Programme is not an á la carte menu, from which demands are arbitrarily selected, without the appropriate political context or reference to broader political goals. If the Transitional Programme is to serve as a bridge to socialism, the destination cannot be kept a secret from the working class.\nThe Working Class and the Socialist Revolution\n47. The work of the SEP is imbued with an unwavering confidence, grounded in advanced scientific theory and rich historical experience, in the revolutionary role and destiny of the working class. But the victory of the socialist revolution depends upon the conscious struggles of workers. The emancipation of the working class is, in the final analysis, the task of the working class itself. As Engels put it so well, “Where it is a question of a complete transformation of the social organisation, the masses themselves must also be in on it, must themselves already have grasped what is at stake, what they are fighting for, body and soul.” Thus, socialism can only be established when the workers themselves want it; and, conversely, when that decision is made, beneath the blows of crisis-stricken capitalism, there is no force on earth that will stop British workers from taking their place in the vanguard of the world socialist revolution.",
  "https_www_socialism2024_org_uk_/https_www_socialism2024_org_uk_join_html/content_7.html": "Join the Socialist Equality Party\nThe Socialist Equality Party is a political party of and for the working class. It seeks not to reform capitalism, but to create a socialist, democratic and egalitarian society through the establishment of a workers’ government and the revolutionary transformation of world economy. We seek to unify workers in the internationally in the common struggle for socialism—that is, for equality and the rational and democratic utilization of the wealth of the planet.\nFill out the form to get more information on how to join the SEP, or to build a section of the International Committee of the Fourth International in your country.",
  "https_www_socialism2024_org_uk_/https_www_socialism2024_org_uk_home_html/content_4.html": "War, the class struggle and the tasks of the Socialist Equality Party\nThis resolution was passed unanimously at the Seventh Congress of the Socialist Equality Party (UK), held November 29--December 2.\nThis resolution was passed unanimously at the Seventh Congress of the Socialist Equality Party (UK), held November 29--December 2.\nWe are publishing the opening report delivered to the Seventh National Congress of the Socialist Equality Party (UK) by Chris Marsden, its National Secretary. Marsden was re-elected to his position by the Congress, held November 29-December 2, 2024.\nWe are publishing the speech introducing the resolution “War, the class struggle and the tasks of the Socialist Equality Party” at the Seventh National Congress of the SEP (UK) given by Tom Scripps, its assistant national secretary. The resolution was passed unanimously. Scripps was re-elected to his position by the Congress.\nThis contribution was delivered by veteran Trotskyist Barbara Slaughter to the Socialist Equality Party (UK)'s Seventh National Congress\nWe are publishing the speech given by SEP National Committee member Tony Robson at the Seventh National Congress of the SEP (UK) on the work of the IWA-RFC in the UK.\nSubscribe here for regular updates on the party's work, key articles from the World Socialist Web Site, and notifications of upcoming events.\nReform UK has only been able to make a breakthrough due to the abandonment of any defence of the working class by the Labour government and the trade unions.\nHundreds of artists have signed an open letter opposing artistic censorship while Kneecap’s music downloads and ticket sales have rocketed.\nDes died on April 23 after suffering a catastrophic heart attack aged just 58.\nNHS Fightback is calling workers not to trust trade union leaders who have betrayed struggle after struggle and to build rank and file committees to take control of their own fate.\nWorkers in Britain must reject all forms of racism and nationalism and link their struggles with workers in Europe and throughout the world. Against the European Union and its pro-business governments, we stand for workers’ rule across the continent.\nFrom the beginning of the Brexit referendum campaign in 2016, the SEP called for an active boycott, opposing both the nationalist calls for an 'independent' Britain and the capitalist European Union, which has dictated savage austerity, militarism and attacks on refugees across the continent.\nAlmost two decades after the United States launched the “war on terror,” the entire world is being dragged into an ever-expanding maelstrom of imperialist violence. Millions have been killed by the wars of US imperialism and its allies in the Middle East and Africa, and tens of millions maimed or turned into refugees. A century after the end of World War I, these conflicts are once again metastasizing toward a catastrophic global conflagration.\nThe ICFI and SEP are fighting to build a new international anti-war movement of the working class. The fight against war is the fight against its source, the capitalist profit system.\nModerated by WSWS reporters Andrea Peters and Andre Damon, the interview covered the central themes of North’s book and a wide range of topics, from the significance of the dissolution of the USSR and the crisis of the world capitalist system to the pro-imperialist politics of the pseudo-left and the revolutionary role of the working class in the struggle against war.\nThe statement, published on February 18, 2016, outlines a socialist strategy for the building of an international anti-war movement of the working class to oppose the drive by the ruling elites to a new imperialist world war.\nLeon Trotsky founded the Fourth International as the World Party of Socialist Revolution in 1938, to oppose the Stalinist degeneration of the Communist (Third) International.\nThe Socialist Equality Party (SEP) is the British section of the Fourth International, the world party of socialist revolution founded by Leon Trotsky in 1938 and led today by the International Committee. The International Committee of the Fourth International (ICFI) represents the continuity of the struggle waged by Marx, Engels, Lenin and Trotsky to forge an independent revolutionary party of the working class for the overthrow of the capitalist profit system.\nAn appraisal, on the occasion of the eightieth anniversary of Trotsky’s assassination, of the work of the great theoretician and strategist of World Socialist Revolution during the final year of his life.\nOn Sunday, March 7, the World Socialist Web Site held an online meeting to mark the 150th anniversary of the birth of Rosa Luxemburg, the great revolutionary leader. The meeting examined Luxemburg’s role as a Marxist theoretician and political leader, and discussed the significance of her immense historical legacy to the contemporary struggle to build a Marxist leadership of the international working class.\nThe Biden administration is seeking to extradite Julian Assange, an award-winning Australian journalist, to face charges of espionage that carry a life sentence and possible death penalty. His only “crime” is the publication of document exposing the war crimes and diplomatic intrigues of US imperialism and its allies.\nWe urge all defenders of democratic rights and opponents of imperialist war to get involved and join the fight to free Julian Assange!\nAn international mass movement must be organized to stop the extradition of Julian Assange to the United States.\nThis speech was delivered by Socialist Equality Party National Secretary Chris Marsden to a public rally held in London on Sunday February 23 2020.\nSign up for the WSWS Free Julian Assange newsletter for updates on important news and events\nIn virtually every country, governments are seeking to crack down on the internet, prevent the spread of socialist and left-wing views, and stop workers from being able to communicate and organize online. They are collaborating with the giant social media and technology corporations including Facebook, Google and Twitter to engage in censorship.\nDavid North, chairperson of the International Editorial Board of the World Socialist Web Site, has sent the following open letter to Google executives Sundar Pichai, Lawrence Page, Sergey Brin and Eric Schmidt.\nIncreased content moderation has been sold as a tool to control the far right, but the World Socialist Web Site was among the first to sound the alarm.\nUnprecedented levels of social inequality, continuous wars and the drive to great-power conflict are incompatible with the maintenance of democratic forms of rule. Around the world, capitalist governments are building up the state apparatus, surveillance and censorship directed at the population.\nFrom the United States to Germany, fascist forces are being systematically promoted by the ruling class. Their elevation is part of preparations to violently suppress mass opposition in the working class to social inequality and war.\nAt this event, leading members of the SEP in the US, Germany and UK spoke on the national and global significance of the rise of fascism in America, its social and political origins, and the necessary strategy for the working class to fight back.\nDavid North, the National Chairman of the Socialist Equality Party (US) and the Chairman of the International Editorial Board of the World Socialist Web Site, addressed a meeting of students and workers at Wayne State University in Detroit on April 11, 2019. The meeting was part of the series “The Threat of Fascism and How to Fight It.”\nThe International Youth and Students for Social Equality (IYSSE) is the student and youth movement of the Socialist Equality Party. It fights to unite students and young people for peace, equality, the rights of the working class and socialism.\nOn December 10, 2022 the International Youth and Students for Social Equality (IYSSE) held an online rally, “For a Mass Movement of Students and Youth to Stop the War in Ukraine!”\nThis is the report delivered by Gregor Link to the 2022 International May Day Online Rally held on May 1. Link is a leading member in Germany of the International Youth and Students for Social Equality, the youth movement of the International Committee of the Fourth International and its affiliated Socialist Equality Parties.\nMarsden joined the Trotskyist movement in 1983 and has played a leading role in the work of the International Committee of the Fourth International for over three decades. He is also a member of the international editorial board of the World Socialist Web Site.\nThomas Scripps is the assistant national secretary of the Socialist Equality Party. He joined the Trotskyist movement in 2012.",
  "https_www_socialism2024_org_uk_/https_www_socialism2024_org_uk_Newsletter_html/content_8.html": "Sign up for the Socialist Equality Party newsletter\nUse this form to sign up for the Socialist Equality Party newsletter, and receive updates about our statements, news and upcoming events.\nUse this form to sign up for the Socialist Equality Party newsletter, and receive updates about our statements, news and upcoming events.",
  "https_www_socialism2024_org_uk_/https_www_socialism2024_org_uk_principles_html/content_2.html": "Statement of Principles\nMembership in the Socialist Equality Party is based on agreement with its Statement of Principles. The principles of the SEP incorporate the essential experiences of the revolutionary upheavals of the twentieth century and the corresponding struggle waged by Marxists for the program of world socialist revolution.\nHistorical and International Foundations\nThe programme of the Socialist Equality Party is of a principled, not of a conjunctural and pragmatic character. It is based on an analysis of the crisis of world capitalism and an assimilation of the strategic revolutionary experiences of the working class and the international socialist movement.\nThe Historical and International Foundations of the Socialist Equality Party was adopted by the Founding Congress of the SEP in 2008. It traces the historical events and strategic experiences of the working class and Marxist movement spanning more than a century.\nResolutions of the Socialist Equality Party (UK)\nThis resolution was adopted unanimously by the membership of the Socialist Equality Party in Britain at its Fifth National Congress, which was held online from October 24–27, 2020. It was amended by the incoming National Committee in consideration of fundamental contemporary developments in the United States.\nA pamphlet of the resolution can be purchased here.\nThis resolution was unanimously adopted by the Fourth National Congress of the Socialist Equality Party in Britain, which was held October 27-30, 2018.\nA pamphlet of the resolution can be purchased here.\nThe Socialist Equality Party (UK) held its Third National Congress in Sheffield from October 28 to October 31. The Congress unanimously endorsed the February 18, 2016 statement of the International Committee of the Fourth International, “Socialism and the Fight Against War,” and adopted two additional resolutions: “For a new socialist movement against militarism, austerity and war,” and “Jeremy Corbyn and the Labour Party: The strategic lessons.”\nA pamphlet of the resolution can be purchased here (please note that 'Jeremy Corbyn and the Labour Party: The strategic lessons' and 'For a new socialist movement against militarism, austerity and war' are contained within the same pamphlet).\nThe Socialist Equality Party (UK) held its Third National Congress in Sheffield from October 28 to October 31. The Congress unanimously endorsed the February 18, 2016 statement of the International Committee of the Fourth International, “Socialism and the Fight Against War,” and adopted two additional resolutions: “For a new socialist movement against militarism, austerity and war,” and “Jeremy Corbyn and the Labour Party: The strategic lessons.”\nA pamphlet of the resolution can be purchased here (please note that 'Jeremy Corbyn and the Labour Party: The strategic lessons' and 'For a new socialist movement against militarism, austerity and war' are contained within the same pamphlet).\nThe Second National Congress of the Socialist Equality Party (Britain) adopted this resolution unanimously on October 28, 2014.\nA pamphlet of the resolution can be purchased here.\nThe Socialist Equality Party (UK) held its First National Congress in Manchester, on November 17-19, 2012. The congress unanimously adopted four resolutions: “The Political Tasks of the Socialist Equality Party,” “The Socialist Equality Party and the Struggle Against Imperialist War,” “Defend Julian Assange and WikiLeaks,” and “Build the International Youth and Students for Social Equality.”\nA pamphlet of the resolution can be purchased here (please note that all resolutions of the First National Congress are contained within the same pamphlet).\nThe Socialist Equality Party (UK) held its First National Congress in Manchester, on November 17-19, 2012. The congress unanimously adopted four resolutions: “The Political Tasks of the Socialist Equality Party,” “The Socialist Equality Party and the Struggle Against Imperialist War,” “Defend Julian Assange and WikiLeaks,” and “Build the International Youth and Students for Social Equality.”\nA pamphlet of the resolution can be purchased here (please note that all resolutions of the First National Congress are contained within the same pamphlet).\nThe Socialist Equality Party (UK) held its First National Congress in Manchester, on November 17-19, 2012. The congress unanimously adopted four resolutions: “The Political Tasks of the Socialist Equality Party,” “The Socialist Equality Party and the Struggle Against Imperialist War,” “Defend Julian Assange and WikiLeaks,” and “Build the International Youth and Students for Social Equality.”\nA pamphlet of the resolution can be purchased here (please note that all resolutions of the First National Congress are contained within the same pamphlet)."
}