{
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_building-agritech-south-west/content_27.html": "From 2015 to 2018 I was director of farming for a company called Multibox. Multibox was an insect farming company based in the South West, technology built at our research facility is still used in insect farming today. The South West is a great place to start an Agritech business with a high density of farmers able to give you advice, fantastic centres of excellence like the Royal Agricultural University and great connectivity with corridors like the M5.\nWhat is insect farming?\nI spoke at the British Free Range Egg Producers conference about insect farming, in that speech I talk about how processed animal protein (PAP) was banned as livestock feed in the wake of the BSE crisis, but in 2017, the EU voted to reintroduce different forms of PAP into fish food and pet food. As of next year, insect feed will be allowed to be fed to poultry.\nI think there is little prospect of UK consumers ever actually eating insects on any scale. I can never see a chicken nugget becoming an insect nugget but farming insects for livestock feed did present a big opportunity.\nWhat are the challenges?\nThree main areas need more development until insect farming can be a practical option, diet & husbandry, scalable automated mass rearing systems, and downstream processing.\nThe main species being farmed at the moment is black soldier fly, which has a 21-day incubation period from egg to fly and produces a 2% weekly harvest. The optimum harvest day was day 18, which produced the maximum fat and protein content, and was not yet in chrysalis form.\nThe first challenge to make it commercially viable is getting the right feedstock for the insects. Industrial food waste (not household) was a good option but finding feedstock available all year round was quite a challenge. Cow manure would be excellent source of feed for insects, but it is not allowed by EU or UK governments.\nThere are currently 50 companies around the world at the moment farming insects; 27 are in Europe. The most common feedstock is fruit & veg derived products, but around 30% developed their own feed for insects from feed mills.\nThe main problem at the moment is no-one is at scale. Significant amounts of money have been raised. In the past year, the insect farming sector has raised $480 million in past year and has produced 6,000 tonnes, which equates to $80,000 investment per tonne manufactured.\nThere are other challenges too – such as how to deal with the vast quantity of frass (insect excrement) and NVQs. Cost of capital, labour, input material, and 130ppm ammonia are all other areas that need more consideration.\nWhat now?\n3 years on from my speech at the British Free Range Egg Producers conference the industry still hasn't reached critical mass. I left Multibox to become the first employee of Breedr, where I now lead the UK business which employs 24 people. Helping farmers across the UK be more productive and profitable.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_councils-should-focus-delivering-not-virtue-signalling/content_16.html": "Exeter City Council agreed last week to embrace the plant based food fad, which is surprising given that there are thousands of fantsatic farmers in Devon right on their doorstep. There is little evidence to support importing plant based alternatives like almond milk and avocados to replace British grown beef, lamb and dairy. Given the council has recently annouced it is £2.1 million over budget this year, you think they would focus on delivering for the community at affordable",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_lets-get-west-somerset-moving-add-your-name/content_5.html": "For too long, people in West Somerset have been left behind by poor transport links. If you live in Minehead, or Watchet and need to get to work, college, or a hospital appointment in Taunton, your options are limited, and far too often slow, unreliable, or overcrowded.\nMeanwhile, our roads are grinding to a halt. From summer gridlock on the A39 to holiday changeover chaos when thousands head to Butlins, congestion is holding us all back.\nIt doesn’t have to be this way.\nThe West Somerset Railway is a brilliant heritage asset, but with investment and political will, it could also serve as a lifeline. Reconnecting the line to the national network at Taunton would give local people a fast, clean, reliable travel option, cut car journeys, and boost our economy. It’s not about replacing steam, it’s about giving West Somerset the future it deserves.\nThis isn’t a pipe dream. There’s a physical rail connection already in place at Norton Fitzwarren. What we need now is community support to show how much local people want this link brought back into regular use.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_privacy/content_9.html": "This document outlines how James Wright processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is James Wright\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact James Wright.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of James Wright, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact James Wright via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_meeting-farmers-exmoor/content_13.html": "It was great to be invited by the NFU to meet with farmers and Ian Lidel-Granger MP on Exmoor last week. Hosted by Hiddon Farms a 1,500 acre beef and sheep farm on the Holnicote Estate. Lots of issues were discussed but focused on\n- Trade deals, this year the first lamb was exported to America for over a decade.\n- Progress on controlling TB and the future of the badger cull and potential cattle vaccines.\n- The merits and demerits of farm assurance schemes\n- Roll out of ELMs.\nDespite the cold weather it was good to see a wide range of different businesses and situations represented amongst the farmers and that Ian Lidel Granger MP was able to join us and share his thoughts on the matters of the day.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_about-rss/content_10.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_category_Opinions/content_32.html": "Opinion: Clarkson’s Farm provides an overdue insight into the struggles of rural Britain 1st March 2023 This article was originally featured by the Conservative Home website I bought two pigs with my student loan in my final year of University and grew my farm to... Opinions\nOpinion: A lack of vision for our national parks is failing residents 29th December 2022 As a councillor and former cabinet member for rural affairs in an area that contains some of Southdowns National Park, I know first hand how these unelected... Opinions\nOpinion: We cannot return to area based farming subsidies 4th November 2022 I started farming when I bought two pigs with my student loan eight years ago. Until recently, my wife and I farmed 155 acres of rented ground with 120 cattle... Opinions",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_chip-campaign/content_37.html": "I can't beat Labour on my own. I need your help. £5 buys a 50 leaflets, £10 pays for a days facebook adverts, £100 funds a letter to a village. Together we can turn the tide.\nThank you for all your support.\nI can't beat Labour on my own. I need your help. £5 buys a 50 leaflets, £10 pays for a days facebook adverts, £100 funds a letter to a village. Together we can turn the tide.\nThank you for all your support.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_welcome-family-rupert/content_18.html": "This week, Isobel and I welcomed our third son, Rupert, into the world. Life on the farm doesn’t slow for new arrivals and we started calving the next day. We wanted to thank the team at Royal Devon NHS for making it all happen. I hope the world Rupert inherits is safe, free, and full of opportunity.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk/content_1.html": "I'm James Wright and I'm proud to stand up for residents, communities and businesses in the South West where I grew up. Here, you can find my latest news, campaigns and more about me, including how to contact me. I'm here to help, so please don't hesitate to get in touch.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_contact/content_6.html": "Fill out the form below and I'll respond to your inquiry.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_feed/content_17.html": null,
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_opinion-clarksons-farm-provides-overdue-insight-struggles-rural-britain/content_39.html": "This article was originally featured by the Conservative Home website\nI bought two pigs with my student loan in my final year of University and grew my farm to one hundred and twenty cattle on rented land, becoming the first farmer in my family for a hundred years. As Jeremy Clarkson is finding, it is hard to get started in farming and it’s even harder to stay in it.\nAcross the UK, 30% of farm income is tied to the old EU-based Basic Payment Scheme. BPS would provide farmers with money for following basic rules and delivered little value to nature and favoured large estates, squeezing out smaller farmers.\nThis payment by 2027 will have disappeared to be replaced with DEFRA’s new flagship Environment Land Management. The new ELM’s payments will require delivery of public goods – new wildlife meadows or changes in farming practice that reduce outputs but benefit nature, it’s not free money anymore. The old scheme was not perfect and nor will the new one be, farmers more than ever are looking for ways to diversify their income to replace this lost revenue.\nIn the latest series of Clarkson’s Farm, Jeremy is exploring ways of securing his farms future by developing a new restaurant and proper parking for his incredibly popular farm shop, to replace the £80,000 a year of subsidy he currently receives. Despite the 50 jobs his restaurant will create, West Oxford District Council’s committee refuses his application and a planning appeal will cost him hundreds of thousands of pounds.\nAs a district councillor and former cabinet member for Environment and Rural Affairs, I have a huge amount of sympathy of Jeremy Clarkson. His battle with West Oxford District Council is a saga repeated across the country, by hard working farmers and rural business owners who must do battle at the cost of thousands of pounds and years of their lives with local authorities.\nI know first-hand the stories from farmers and rural dwellers in my district whose life choices have been stymied by draconian planning restrictions. It isn’t just the monied celebrities looking to diversify, it’s the hard-working tenant farmer who has planning permission denied for a house next to his barns or the rural community that wants a few industrial units to allow for economic development as the jobs created will ensure their children have a reason to stay in the area.\nThe most recent example in my patch is a vital game processing business who needed to move its premise or face closure. What sounds like an easy process led to a 2-year planning battle. Despite enormous support from local farmers, the local National Park and national organisations like the British Shooting Association, each time it came back to the committee, my fellow councillors would find another reason to delay or turn it down, last month after a long debate in which I was the lone voice of support, with the help of sympathetic councillors it finally won approval.\nThis business didn’t only provide an income for the 4-5 staff that worked there, as a processing business it supported hundreds of game keepers and retail outlets who sold the venison, pheasant and rabbit processed on the site to the public. Thankfully the business is now saved and will hopefully operate from its new premise for another 30 years.\nWhat many seem to forget is the countryside is not a museum, the landscape is managed to produce food and its farmyards are there to support that industry.\nOur countryside is of outstanding natural beauty, each part of the country has unique landscapes, wildlife, and cultural heritage; Exmoor with its incredible moors and views, the Suffolk farmland with rich bird life and Cotswolds with unique chalk grasslands. Whilst visitors may wonder at our landscape, residents are becoming increasingly frustrated by the failure of local authorities to support prosperity and deliver value for their communities.\nMany residents in our countryside feel that they are being denied the opportunity to make improvements to their homes or businesses because of strict planning regulations. Whilst these regulations are in place to protect the natural beauty and prevent overdevelopment, they are used by councils to keep our countryside frozen in time.\nI find Green & Liberal Democrats to be particularly hypocritical in these areas, using the power granted to them by being elected to a planning committee to bring ‘illiberal’ burden onto residents.\nThere are several changes that would benefit farmers and rural communities to planning policy:\n- Give economic development and job creation increased weighting in the National Planning Framework against factors like landscape harm\n- Reinstate permitted development rights for farmers in National Parks and ANOB but require designs to deliver significant economic benefit or affordable housing\n- Development sites that are of outstanding planning standard - net zero, high design fidelity and affordability should take precedence over local planning policies, where there is overbearing need for new homes\nIt isn’t just policies it is also culture, as a councillor I have had a number of planning training sessions looking at trees, traffic and landscapes but I have had none on the importance of valuing economic growth. It should be a requirement that as part of planning training, every councillor is shown how to deliberate planning applications that have negative impacts that are offset with wider community benefits.\nI hope that the next season of Clarkson’s farm brings resolution to Jeremy’s planning saga. Whether it is his thoughts on Bovine Tuberculous, Planning Policy or the Soil Police he is highlighting important issues that are facing the 11 million of us that live in rural Britain.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_somersets-liberal-democrat-council-tops-south-west-pay-league-54-officials-six-figure-salaries/content_34.html": "Local campaigner and Exmoor farmer James Wright has slammed Somerset’s Liberal Democrat-run council after new figures revealed it had the highest number of highly paid council officials in the South West, including one employee who received a staggering £277,500 last year. Despite the council declaring a financial emergency, increasing council tax by 7.5% and selling off assets.\nThe figures come from the TaxPayers’ Alliance Town Hall Rich List 2025, based on councils’ published accounts for 2023-24. The annual report reveals a record-breaking 3,906 council staff across the UK received over £100,000, and 1,092 took home more than £150,000 – the highest since records began in 2007.\n“While Somerset’s Liberal Democrat council raises council tax yet again, 54 of its staff are taking home six-figure salaries,” said Mr Wright. “One employee walked away with £277,500, more than £100,000 above the Prime Minister’s salary. It’s outrageous. At a time when the council is in financial difficulty and families are struggling with rising bills and local services are under pressure, this council has lost all sense of priorities.”\nSomerset tops the South West table for high pay, even as residents in towns and villages from Minehead to Watchet face potholes, delays to care services, and threats to rural bus routes and libraries.\n“This is the reality of Liberal Democrat mismanagement,” Wright continued. “They talk about community, but they’ve built a bloated bureaucracy funded by squeezing household budgets. It’s not just wasteful, it’s insulting to the people they’re meant to serve.”\nThe TaxPayers’ Alliance is calling for urgent reforms to deliver better value for money, including giving councils more flexibility in how they spend grant funding – and a halt to inflation-busting council tax hikes.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_category_Articles/content_7.html": "Join my campaign to cut puppy smuggling 24th October 2024 Every puppy deserves the best start in life. Unfortunately, in the last parliament, a law aimed at stopping puppy smuggling didn’t pass due to time constraints... Articles\nPlan to cut puppy smuggling in Bath 15th March 2024 Dog lovers in Bath will soon be assured about the health and welfare of their puppies thanks to a proposed new law. Plans for a new law to prevent puppy... Articles\nAndrew Wright 1958 - 2023 14th July 2023 I’m very sorry to say that my Dad, Andrew Wright, died suddenly on the 7th of July 2023. He was only 64 years old and the family and I will miss him immensely... Articles\nMy invite to the Coronation 8th May 2023 Watch my interview with the BBC on my Coronation experience here A few weeks ago I received an email with an invitation to the Coronation, I was convinced they... Articles\nCouncils should focus on delivering, not virtue signalling 18th December 2022 Exeter City Council agreed last week to embrace the plant based food fad, which is surprising given that there are thousands of fantsatic farmers in Devon right... Articles\n£2.6 billion investment into communities through our UK Shared Prosperity Fund 🇬🇧 10th December 2022 We're taking back control of EU funding with £2.6 billion investment into communities through our UK Shared Prosperity Fund 🏷️ Supporting local businesses 👷... Articles\nMeeting farmers on Exmoor 4th December 2022 It was great to be invited by the NFU to meet with farmers and Ian Lidel-Granger MP on Exmoor last week. Hosted by Hiddon Farms a 1,500 acre beef and sheep farm... Articles\nJames Wright welcomes funding to unlock rural mobility in Somerset 27th November 2022 Thousands of families and individuals are stiffled in their rural villages by insufficient public transport. In this modern age, we should take advantage of... Articles\nBuilding Agritech in the South West 12th November 2022 From 2015 to 2018 I was director of farming for a company called Multibox. Multibox was an insect farming company based in the South West, technology built at... Articles",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_south-west-overlooked-governments-ps15bn-funding-scheme/content_31.html": "Local campaigners have criticised the Government after the South West was almost entirely ignored in a new £1.5 billion fund designed to help struggling communities.\nThe Plan for Neighbourhoods scheme, which promises up to £20 million for 75 areas across the UK, aims to regenerate high streets, improve public spaces, and fund local services. Yet, only one town in the South West—Torquay—has been included, sparking anger among rural and coastal communities that feel left behind.\nJames Wright, a local campaigner and farmer, says the decision is yet another example of the South West being forgotten in national investment.\n“This funding could have made a huge difference to towns across Devon, Cornwall, and Somerset. We have some of the lowest wages in the country, businesses struggling with high costs, and families priced out by second homes. Yet Labour seems to think we don’t need investment.”\nWhile towns across the North and Midlands have received significant funding, Wright believes that the selection process ignored the real struggles of rural Britain.\n“Labour’s funding criteria prioritise big urban projects, completely missing the hidden deprivation in rural and coastal areas. A town like Minehead or Barnstaple might not look run-down like an ex-industrial area, but local people are struggling just as much, often more, because wages are lower and housing is unaffordable.”\nThe decision has also raised questions about whether the funding is politically motivated. Many of the areas selected are in Labour and battleground seats, while the South West, which has traditionally voted Conservative or Liberal Democrat, has been largely overlooked.\n“It’s hard to ignore that many of the towns picked for investment are places where Labour is trying to hold or win seats,” Wright added. “That’s not levelling up—it’s political game-playing.”\nWith investment due to start rolling out from 2025, campaigners are calling for a review of the selection process to ensure that rural and coastal communities get a fair deal.\n“The South West has been left behind for too long,” Wright said. “If we don’t stand up and demand investment, we’ll keep getting ignored.”",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_opinion-lack-vision-our-national-parks-failing-residents/content_38.html": "As a councillor and former cabinet member for rural affairs in an area that contains some of Southdowns National Park, I know first hand how these unelected, undemocratic bodies are harming resident’s rights to live and improve their lot.\nOur National Parks are areas of outstanding natural beauty, designated for their unique landscapes, wildlife, and cultural heritage, and are meant to be places where people can connect with the landscape. Whilst visitors may wonder at our parks, residents who reside in them are becoming increasingly frustrated by their failure to support prosperity and delivering value for their communities.\nI know first-hand the stories from locals whose life choices have been stymied by the draconian planning restrictions. Whether that is the tenant farmer who has planning permission denied for a house next to his barns or the community that wants affordable housing in their village on the boundary with the national park being rebuffed despite tasteful design.\nThe South Downs National Park is home to the Shoreham Cement works a large defunct quarry and cement mill. The site is located hundreds of metres from a dual carriage in an area where the local authority is being asked to deliver over a 1,000 new homes a year, largely on greenfield sites.\nThe National Park’s working group recently announced an 18 month delay due to financial constraints and its new emerging local plan does not intend to designate this fantastic brownfield site for development and instead will zone the majority of the site for rewilding. A failure of vision and a major let down for the community\nNational Parks are publicly funded and are facing financial head winds like all government departments. This pressure presents a golden opportunity for revenue generation whilst releasing residents from an overburdensome planning regime. National Parks should adopt an attitude of progress in keeping with community needs, working with local authorities that maximise a parks potential for social and economic development.\nThey should lead the way in planning standards. These permissions should be leading the way on conditions, focusing on keeping existing village character, longevity of materials and energy efficiency. There is an enormous potential locked up in our farmyards, industrial units and villages in our national parks.\nBoards for national parks are made up of local councillors and national appointees, often only those who see state control as an imperative apply. Exmoor National Park due to Somerset’s new unitary authority will be losing Conservative board members who represent wards in park to be replaced by Liberal Democrats from outside of the area.\nIt is vital that Conservatives put themselves forward if they live in National Parks when vacancies are advertised, together we might improve the lives for hundreds of thousands of people who live and work in our national parks by unlocking their potential.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_rachel-gilmour-mp-allegedly-insulted-local-workers-should-she-say-sorry/content_33.html": "Rachel Gilmour MP’s reported behaviour at Hinkley Point has left many asking. Does she owe them an apology?\nAccording to The Express, Gilmour lashed out at a security guard after being told her driving licence was invalid, calling him a “c*” and “obnoxious t***”, before sneering, “I bet he votes f*ing Tory.”\nDuring a film showcasing a local apprentice’s success, she reportedly dismissed it as “s***” and later told a constituent, “I’m not going to chat s*** with my constituents either.”\nHinkley Point provides thousands of jobs and powers homes across the country. If these reports are true, Gilmour has shown contempt for the people who keep protect our energy security.\nSo, should she apologise? Let me know what you think.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_events_feed/content_11.html": null,
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_rural-campaigner-demands-return-vital-community-funding/content_30.html": "In a blow to rural communities Labour has scrapped the Community Ownership Fund, a £150 million annual lifeline that allowed villages and towns to buy back community assets like pubs, sports clubs, community halls, and shops at risk of closure. At the same time, the government has cut the Rural Services Delivery Grant, leaving rural councils with less money to deliver essential services such as transport, social care, and housing.\nThe decision has sparked anger across the Westcountry, where many small communities have spent years fighting to save the heart of village life — now seeing their hopes dashed by a government that promised renewal but is delivering retreat.\nThe Community Ownership Fund recently supported Lynton and Lynmouth Town Councils in their bid to revitalise local toilets. Elsewhere, communities hoped to use the fund to create rural meeting places, cafés, and village shops. Now, with the fund scrapped, local ambition is being stifled once again.\nAcross Tiverton & Minehead, similar stories are unfolding — local people stepping up to save the spaces that knit their communities together, only to be abandoned by Whitehall.\nThe Rural Services Delivery Grant, which was introduced to reflect the higher cost of delivering services in large, sparsely populated areas, has also been cut. This forces councils like Somerset and Devon County Council to choose between raising council tax or cutting core services.\nJames Wright, local farmer and rural campaigner, said: “Labour has pulled the rug from under rural Britain. From families trying to save their village pub, to farmers feeding the nation, to councils struggling to keep buses on the road — this government has turned its back on us.\nWe don’t want favours. We want fairness. Rural Britain pays its taxes, builds its businesses, raises its children — just like everywhere else. What we’re getting from Labour isn’t support — it’s neglect. And people are right to feel betrayed.”\nThis marks the latest in a series of decisions that show how far rural Britain has fallen off Labour’s radar — from abandoning agricultural businesses in the Budget to failing to address school and GP closures in villages.\nJames and other rural campaigners are calling on Labour to restore funding and support for rural councils and communities, before more vital assets and services are lost forever.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_cookies/content_21.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_james-wright-calls-u-turn-labours-short-sighted-tourism-cuts/content_36.html": "Local entrepreneur, campaigner and farmer James Wright is calling for a U-turn on short-sighted cuts to UK tourism promotion. The UK’s flagship international tourism campaign has been hit with a 41% budget cut, despite tourism being the nation’s third largest industry, generating over £127 billion annually and supporting hundreds of thousands of jobs, particularly in rural communities.\nThe ‘GREAT’ campaign, which has helped showcase Britain’s countryside, food, culture, and attractions to global audiences, has seen its funding reduced from £60 million to just £35 million, according to a Financial Times report. This move comes as other high-impact promotional efforts, such as campaigns supporting British food and drink exports, have also faced steep reductions.\nCritics argue that the cuts undermine efforts to attract overseas visitors and threaten the survival of countless small businesses that rely on tourism, particularly in areas like Exmoor, Mid-Devon, and West Somerset, where tourism is a key economic driver.\nJames Wright, a farmer and entrepreneur from Exmoor, is calling for an immediate reversal of the cuts. “This is short-sighted in the extreme,” Wright said. “Tourism isn’t just a ‘nice-to-have’, it’s one of Britain’s biggest economic assets, and it pays its own way many times over. The ‘GREAT’ campaign was one of the most successful promotional efforts we’ve ever run. Cutting it now, when rural and hospitality businesses are already under pressure, is a huge mistake.”\nWright, who visited the Exmoor National Park Visitor Centre in Lynmouth this week, praised the work of local teams to promote the area, but warned that Labour’s broader economic priorities are misguided. “Instead of investing in sectors that bring in income and create jobs, they’re handing more money to the unions and expanding bureaucracy. It’s not just bad economics, it’s completely the wrong priorities.”\nWright is urging MPs and ministers to restore and strengthen funding for international tourism promotion, and to put Britain’s rural businesses at the heart of the country’s growth strategy.\n“If Labour are serious about growth, they should be backing the industries that already deliver it. Not pulling the rug out from underneath them.”\nThe cuts come at the same time as the closure of the Minehead Information Centre, a long-running hub on the seafront of one of Somerset’s most popular tourist towns. The centre has not reopened at all this year and has now permanently closed due to a lack of sustainable funding, leaving visitors without a dedicated source of local guidance and support.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_my-invite-coronation/content_26.html": "Watch my interview with the BBC on my Coronation experience here\nA few weeks ago I received an email with an invitation to the Coronation, I was convinced they had got the address wrong and after some clarification discovered that Isobel and I had been invited as a guest of the Royal Household Patronages. We were to watch the Coronation procession from the grandstand at the Queen Victoria Memorial. A once-in-a-lifetime opportunity!\nKing Charles has always been a Rural Champion. He was a pioneer of Organic Farming practices on the farm he rented at Home Farm in Cirencester, well ahead of his time and now leads the way on regenerative, sustainable farming. As the 'landlord' of the 52,000 hectare Duchy of Cornwall estate he stewarded the hundreds of farming families who call the estate home, supporting them to become profitable, productive and nature conscious farms.\nResponding to the needs of the rural communities, in 2010 he setup the Princes Countryside Fund which has given out £11.2 million to farmers and rural communities. PCF's programs like the Farming Resilence training support farmers to become more profitable and productive, securing the families farms future. We are told that King Charles has specifically requested farmers to attend the Coronation which is why we received an invitation.\nThe Coronation itself was an incredible celebration of Britain and the Commonwealth. We joined 4,000 other invitees of the Royal Household, due to the procession we needed to be in our seats by 8:30am and weren't allowed to leave till 15:00. Being a truly British event, it of course rained the entire day, however the atmosphere was fantastic. The coordination of the police, multiple regiments, calvary and commonwealth soldiers was beautiful, the fly-past was the icing on the cake. We returned home late in the evening full of joy and hope for our wonderful Nation.\nAfter years of political wrangling, pandemic strife and the death of her Majesty, it was wonderful to come together to celebrate the Coronation of the King.\nGod Save the King.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_join-fight-tiverton-minehead/content_22.html": "We must stop Labour from trashing our country. The Liberal Democrats keep voting to support them. I am working to stop Labour and send a Conservative MP to Westminster. Volunteering is easy, rewarding and meaningful, now more than ever.\nWho am I?\nI am a farmer, father, and technology entrepreneur. I believe Britain needs fewer career politicians and more Members of Parliament who have built businesses, worked the land, and faced real-world challenges. I live on Exmoor and I have spent my career creating jobs, driving innovation, and championing the rural economy.\nCan you join the team to help stop Labour?",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_cdn-cgi_l_email-protection/content_8.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news/content_14.html": "Let’s Get West Somerset Moving - Add Your Name! Friday, 2 May, 2025 For too long, people in West Somerset have been left behind by poor transport links. If you live in Minehead, or Watchet and need to get to work, college, or a hospital appointment in Taunton, your options are limited, and far too often slow, unreliable, or overcrowded. Meanwhile, our roads are grinding to a halt. From summer gridlock on the A39 to holiday changeover chaos when thousands head to... Local News\nWhy I’m Voting Conservative – And Why You Should Too 25th April 2025 On May 1st, you get to decide what kind of council Devon should have, one focused on keeping taxes low and services running well, or one obsessed with headlines... Local News\nMP Under Fire for Missing Historic Steel Debate While Shopping in Minehead 24th April 2025 Rachel Gilmour MP is facing criticism after failing to attend one of the most significant parliamentary sittings in recent memory, while reportedly shopping in... Local News\nJames Wright Calls for U-Turn on Labour’s Short-Sighted Tourism Cuts 17th April 2025 Local entrepreneur, campaigner and farmer James Wright is calling for a U-turn on short-sighted cuts to UK tourism promotion. The UK’s flagship international... Local News\nSomerset’s Liberal Democrat Council Tops South West Pay League with 54 Officials on Six-Figure Salaries 4th April 2025 Local campaigner and Exmoor farmer James Wright has slammed Somerset’s Liberal Democrat-run council after new figures revealed it had the highest number of... Local News\nExmoor Coaster Returns for 2025 – A Boost for Local Business 1st April 2025 The iconic Exmoor Coaster bus route is officially returning for the 2025 summer season, offering passengers a thrilling journey through some of the South West’s... Local News\nRural Campaigner Demands Return of Vital Community Funding 25th March 2025 In a blow to rural communities Labour has scrapped the Community Ownership Fund, a £150 million annual lifeline that allowed villages and towns to buy back... Local News\nWelcome to the family Rupert 19th March 2025 This week, Isobel and I welcomed our third son, Rupert, into the world. Life on the farm doesn’t slow for new arrivals and we started calving the next day. We... Local News\nSouth West Overlooked in Government’s £1.5bn Funding Scheme 13th March 2025 Local campaigners have criticised the Government after the South West was almost entirely ignored in a new £1.5 billion fund designed to help struggling... Local News\nRachel Gilmour MP Allegedly Insulted Local Workers Should She Say Sorry? 12th March 2025 Rachel Gilmour MP’s reported behaviour at Hinkley Point has left many asking. Does she owe them an apology? According to The Express, Gilmour lashed out at a... Local News",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_exmoor-coaster-returns-2025-boost-local-business/content_29.html": "The iconic Exmoor Coaster bus route is officially returning for the 2025 summer season, offering passengers a thrilling journey through some of the South West’s most dramatic scenery, including Porlock Hill, Countisbury Hill, and breathtaking Exmoor coastline.\nRunning from Minehead to Lynmouth and on to Ilfracombe, the open-top service offers unrivalled views and a unique way to explore the national park – all for just £3 a ticket.\nJames Wright, a local campaigner and farmer, welcomed the news: \"The return of the Exmoor Coaster is great news for local businesses that rely on the increased footfall during the summer. But to deliver real economic benefit, it’s vital the service runs for the full season—from Easter through to autumn half-term. It’s not just a scenic trip; it’s a lifeline for our rural economy.\"\nThe full timetable is due to be released soon, and tickets will be available via the usual channels.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_why-im-voting-conservative-and-why-you-should-too/content_2.html": "On May 1st, you get to decide what kind of council Devon should have, one focused on keeping taxes low and services running well, or one obsessed with headlines, vanity projects, and blaming everyone else.\nI’m backing the Conservatives – not out of tribal loyalty, but because I believe they’re the only party serious about the real issues facing families and businesses across Devon. Fixing the roads. Sorting out special educational needs. Supporting care for the elderly. Getting value for taxpayers’ money.\nYou’ll hear a lot of noise from the Liberal Democrats about how things are broken. But they’ve got a track record too. and it’s worth looking at. In Bath, which they run, they’ve borrowed tens of millions to put in bollards and unwanted cycle lanes. Residents complain they weren’t listened to. Roads have been narrowed, traffic has been made worse, and the debt left behind will cost residents for decades to come.\nThat's not responsible local government, it's political vanity dressed up as progress.\nHere in Devon, the roads absolutely need more investment, and the Conservatives have secured extra government funding to do just that. With over 8,000 miles of road to maintain, the most of any county in England, this isn’t a quick fix.\nOn children’s services and SEND provision, yes, there’s more to do – and that’s exactly why we’ve brought in new leadership, fought for more funding, and started to turn things around. The alternative is more noise from the sidelines, more leaflets, more finger-pointing, but no plan.\nThe same goes for adult care. Conservatives are working quietly with care providers and the NHS to make sure people aren’t stuck in hospital beds when they could be home. No one’s pretending it’s easy. But the idea that the Lib Dems can wave a wand and fix it all overnight, without raising your council tax or cutting elsewhere, just isn’t serious.\nThis is the difference. The Conservatives are focused on delivery, not drama. On getting the basics right, not chasing headlines. On lower taxes, not borrowing to build bollards.\nIf, like me, you want a council that concentrates on the essentials – roads, care, education, local jobs – and believes that taxpayers' money should be spent wisely, then vote Conservative on May 1st. Devon doesn’t need more slogans. It needs councillors who show up, take responsibility, and get on with the job.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_category_Local-News/content_25.html": "Let’s Get West Somerset Moving - Add Your Name! 2nd May 2025 For too long, people in West Somerset have been left behind by poor transport links. If you live in Minehead, or Watchet and need to get to work, college, or a... Local News\nWhy I’m Voting Conservative – And Why You Should Too 25th April 2025 On May 1st, you get to decide what kind of council Devon should have, one focused on keeping taxes low and services running well, or one obsessed with headlines... Local News\nMP Under Fire for Missing Historic Steel Debate While Shopping in Minehead 24th April 2025 Rachel Gilmour MP is facing criticism after failing to attend one of the most significant parliamentary sittings in recent memory, while reportedly shopping in... Local News\nJames Wright Calls for U-Turn on Labour’s Short-Sighted Tourism Cuts 17th April 2025 Local entrepreneur, campaigner and farmer James Wright is calling for a U-turn on short-sighted cuts to UK tourism promotion. The UK’s flagship international... Local News\nSomerset’s Liberal Democrat Council Tops South West Pay League with 54 Officials on Six-Figure Salaries 4th April 2025 Local campaigner and Exmoor farmer James Wright has slammed Somerset’s Liberal Democrat-run council after new figures revealed it had the highest number of... Local News\nExmoor Coaster Returns for 2025 – A Boost for Local Business 1st April 2025 The iconic Exmoor Coaster bus route is officially returning for the 2025 summer season, offering passengers a thrilling journey through some of the South West’s... Local News\nRural Campaigner Demands Return of Vital Community Funding 25th March 2025 In a blow to rural communities Labour has scrapped the Community Ownership Fund, a £150 million annual lifeline that allowed villages and towns to buy back... Local News\nWelcome to the family Rupert 19th March 2025 This week, Isobel and I welcomed our third son, Rupert, into the world. Life on the farm doesn’t slow for new arrivals and we started calving the next day. We... Local News\nSouth West Overlooked in Government’s £1.5bn Funding Scheme 13th March 2025 Local campaigners have criticised the Government after the South West was almost entirely ignored in a new £1.5 billion fund designed to help struggling... Local News",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_james-wright-welcomes-funding-unlock-rural-mobility-somerset/content_12.html": "Thousands of families and individuals are stiffled in their rural villages by insufficient public transport. In this modern age, we should take advantage of technology to solve the issue of rural mobility and that is why I am delighted that after a successful trial \"rural uber\" is being rolled out in several parts of the country in partnership local authorities.\nThis comes after the announcement by the Conservative government of the Rural Mobility Fund, worth £19.4 million, with awards for 17 projects. The second wave of funding, under the Bus Service Improvement Grant, has just been awarded, with more than £10 million for several parts of the country including Somerset. The National Bus Strategy which kick-started this proposal recommended a nimbler approach, and announced support for smaller “demand responsive” vehicles to supplement larger buses on fixed routes.\nResidents will book their journey via and app, the trade-off between convenience and price is performed by an algorithm. The first passenger to book through the app is given a guaranteed departure and arrival time. Other passengers are accepted if they can be accommodated without delaying the first ones. Eighty per cent of the journeys involve picking up at least one other group on the way, 50 per cent involve three or more bookings and 25 per cent four or more.\nIf you want to have a scheme in your Somerset village, email me and I will contact your local councillor [email protected]",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_about-james-wright/content_4.html": "James Wright is a farmer, father, and agri-tech entrepreneur. He believes Britain needs fewer career politicians and more Members of Parliament who have built businesses, worked the land, and faced real-world challenges. Living on Exmoor, James has spent his career, creating jobs, driving innovation, and championing the rural economy.\nMost of James’ professional life has been dedicated to growing businesses and supporting rural communities. He began in 2015 as Director of Farming for an insect protein company pioneering sustainable animal feed. Since 2018, leading a UK and EU business with their software now supporting over 6,500 small businesses to improve productivity and profitability.\nA lifelong Conservative campaigner, James joined the party at age 16 and has been active in every election since. He has served in multiple roles within local associations and was elected as a councillor in 2019. As the council’s youngest-ever cabinet member, he delivered investment in local businesses, and infrastructure, and reduced costs and regulation. Including securing £1.6 million in Levelling Up funding and launching a Nature Recovery Network to thousands of acres to produce food and conserve the environment.\nJames is the Director of Policy of the Conservative Rural Forum, advocating for rural businesses, towns, and communities nationally. In the 2024 general election, he stood as the parliamentary candidate for Bath, where he reduced the Liberal Democrat majority by 12% and outperformed the national swing by 5%.\nBeyond politics, James is deeply committed to his local community. He has volunteered as a Chaplain for the Farmers’ Community Network, supporting farmers through crisis, and served as a governor at Petroc College, helping young people and apprentices gain the skills they need for the future.\nJames grew up in Somerset and now farms beef and sheep on Exmoor with his wife, Isobel, and their two children. They met through their local church and share a passion for rural life. James attended Chichester University where he studied business and the Royal Agricultural University for a Postgraduate Certificate in Agriculture.\nIf you want to get in touch with James, you can email him at [email protected]",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_join-my-campaign-cut-puppy-smuggling/content_23.html": "Every puppy deserves the best start in life. Unfortunately, in the last parliament, a law aimed at stopping puppy smuggling didn’t pass due to time constraints.\nI’ve launched a petition to bring back the Animal Welfare (Importation of Dogs, Cats, and Ferrets) Bill. This law would ban the importation of puppies under six months old, stop heavily pregnant dogs from being transported, and prevent the sale of mutilated animals, like those with cropped ears.\nThe surge in puppy smuggling, which skyrocketed during the pandemic, has had devastating consequences for animal welfare. We need action.\nDo you agree? Let me know by completing my survey 👇",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_ps26-billion-investment-communities-through-our-uk-shared-prosperity-fund/content_20.html": "We're taking back control of EU funding with £2.6 billion investment into communities through our UK Shared Prosperity Fund\n🏷️ Supporting local businesses\n👷 Boosting skills and creating jobs\n🛍️ Levelling up our high streets\nI have secured over £800,000 of funding from the Rural Prosperity Fund for Horsham's rural businesses to benefit from.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_mp-under-fire-missing-historic-steel-debate-while-shopping-minehead/content_19.html": "Rachel Gilmour MP is facing criticism after failing to attend one of the most significant parliamentary sittings in recent memory, while reportedly shopping in Minehead.\nOn Saturday, 12 April, Parliament was recalled for an emergency session, the first of its kind since the Falklands War, to pass legislation aimed at saving British Steel and protecting more than 3,000 jobs. The Steel Industry (Special Measures) Act grants the government powers to keep blast furnaces running in Scunthorpe, preserving the UK’s last capacity to produce virgin steel.\nWhile MPs from across the political spectrum travelled to Westminster for the rare weekend vote, Tiverton & Minehead’s MP Rachel Gilmour was absent.\nHer non-attendance was noted both in Parliament and back home. Facebook user Maggie Hobbs, a resident of Minehead, posted on Sunday, “She was shopping in Minehead’s charity shops yesterday!”\nThat sentiment is echoed by local campaigner James Wright, who called the absence “a dereliction of duty.”\n“This wasn’t about party politics; it was about whether Britain can still make its own steel. The whole country was watching. And our MP didn’t even turn up,” Wright said. “If she had a good reason, let’s hear it. But from what I’m hearing, she was shopping while the country was trying to save its steel industry.”\nWright also pointed to the wider relevance of the vote for rural areas like West Somerset and Mid Devon, “Rural economies like ours rely on strong national supply chains, from steel in construction to jobs in transport and energy. When you let a key industry collapse, the ripple effects hit every corner of the country.”\nHe added, “This was the first Saturday sitting of Parliament since the Falklands War. If that doesn’t warrant showing up, what does?”\nThe closure of the Scunthorpe plant would have left the UK as the only G7 nation unable to produce its own primary steel, a material vital for everything from defence, agriculture and railways to wind turbines and hospitals.\nSupporters of British Steel argued that allowing such a collapse would not only jeopardise thousands of jobs but also expose the country to long-term economic and security risks by relying entirely on foreign imports for critical infrastructure.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_plan-cut-puppy-smuggling-bath/content_24.html": "Dog lovers in Bath will soon be assured about the health and welfare of their puppies thanks to a proposed new law.\nPlans for a new law to prevent puppy smugglers from importing poorly and ill dogs were backed in Parliament today. (Friday, March 15)\nUnder the Animal Welfare (importation of Dogs, Cats and Ferrets) Bill, people selling pets would be banned from importing puppies under six months old, while heavily pregnant dogs would also not be allowed to travel, while ‘mutilated’ animals, such as puppies with cropped ears, would also be stopped.\nThe plans have been brought forward in a Private Members Bill by North Devon MP Selaine Saxby who says a huge surge in puppy smuggling started during the Covid pandemic as owners struggled to find the puppies they wanted.\n“I am glad the Government is supporting this vital Bill and committed to its swift passage to safeguard the welfare of thousands of puppies, dogs, cats and ferrets that come into Great Britain from overseas each year,” she said.\n“I would like to thank the tireless campaigning from pet charities who have shared their views about this Bill.\n“I hope they are reassured by the measures outlined in the Bill which will stop this cruel trade by closing loopholes exploited by unscrupulous commercial traders.\n“We really are a nation of pet lovers, and this legislation will ensure the UK is leading the world when it comes to animal welfare.”\nThe Bill will also cover the importation of cats and ferrets into the country.\nConservative candidate for Bath James Wright, said they would be backing Selaine’s bill and said it would bring peace of mind to families looking for a new pet.\n“It is easy to see how many people across Bath and the country love their pets and the special place they hold in families’ hearts,” he said.\n“That’s why this Bill is so important – not just to stop criminal gangs profiting from the suffering of young animals – but to end the pain loving families feel when their beloved pet is found to be ill or in pain due to the way it was raised and brought into the country.\n“By ensuring pets can only be brought into this country in the proper and correct ways, this Bill will help bring puppy smuggling to an end.”\nThe Wright Family dogs on the edge of Bath\nFor more details about the bill, go to\nhttps://www.selainesaxby.org.uk/news/selaine-saxby-take-ending-puppy-smuggling-private-members-bill",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_accessibility/content_15.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_your-views/content_3.html": "Tweet Please let me know what issues matter to you by taking my survey, I want to know what is affecting you and your family. Somerset & Devon Survey Current Your Issues Your details Leave this field blank What is the most important question for you and your family right now? Does your council tax deliver value for money? Yes, I get what I pay for No, I don't feel the value Other… Enter other… How would you rate the availability of NHS, Denistry and Healthcare provision in your area? 1 2 3 4 5 6 7 8 9 10 Do you think there is enough affordable housing in your local area? Yes, there is sufficient affordable housing No, more affordable housing is needed Other… Enter other… Select are your top 3 most important issues Affordable housing for local families Supporting farmers and rural businesses Better public transport and road maintenance Access to healthcare and GP services Flood prevention and protecting the environment Strengthening schools and local education Tackling anti-social behavior and crime Boosting tourism and supporting small businesses Other… Enter other… In order to make this survey representative, how did you vote in the 2024 General Election? Conservative Labour Lib Dem Green Reform SNP (Scotland only) Plaid Cymru (Wales only) Independent Didn't vote Other… Enter other… This question contains special category data relating to your political opinion that may be shared with the wider Conservative Party for the purposes of Democratic Engagement with your permission. Please only answer this question if you consent to the processing of this data and sharing it with Conservative Party in accordance with our Data Protection and Privacy policy. If you do not answer this question then this data will not be shared. Again thinking ahead to the next local elections, as things stand today, what are the chances of you voting for each of these parties? Questions 0 1 2 3 4 5 6 7 8 9 10 Labour 0 1 2 3 4 5 6 7 8 9 10 Liberal Democrat 0 1 2 3 4 5 6 7 8 9 10 Conservative 0 1 2 3 4 5 6 7 8 9 10 Green 0 1 2 3 4 5 6 7 8 9 10 Independent 0 1 2 3 4 5 6 7 8 9 10 Reform Party 0 1 2 3 4 5 6 7 8 9 10 Other 0 1 2 3 4 5 6 7 8 9 10 On the scale of 0-10, 0 means there would be no chance of you voting for the party and 10 means you would be absolutely certain to vote for the party. This question contains special category data relating to your political opinion that may be shared with the wider Conservative Party for the purposes of Democratic Engagement with your permission. Please only answer this question if you consent to the processing of this data and sharing it with Conservative Party in accordance with our Data Protection and Privacy policy. If you do not answer this question then this data will not be shared.",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_andrew-wright-1958-2023/content_28.html": "I’m very sorry to say that my Dad, Andrew Wright, died suddenly on the 7th of July 2023. He was only 64 years old and the family and I will miss him immensely.\nAndrew had an incredible career spanning 43 years. Having achieved a Master’s degree in Geology from St Peter’s College, Oxford, he started out as a Petroleum Geologist for BP and managed to travel the world with them working in the former Soviet Union, South America, the Middle East, Africa, Pakistan, the Netherlands and Australia.\nFrom BP he continued to travel the world for companies like Neftex, Lasmo, Noble Energy, VOG Oil and Horizon Development, working in places like Aberdeen, Cameroon, Iraq and Iran. For a time he worked for the British Nuclear Group putting his supply chain management skills to use in the UK’s domestic energy production.\nBetween work, travel and raising a family he managed to find the time to secure an MBA from Cass Business School and an MCIPS qualification which he put to use regularly.\nHis life, although cut short, was full of adventure and certainly never dull having been kidnapped in Brazil, evacuated from Erbil during the rise of ISIS, inside the Soviet Union during its collapse, in Argentina when the Junta was toppled and having his appendix removed whilst in Iran. His travel would follow him home to - he loved pistachios and on one occasion brought some back from Iran. But he left it for so long in his office that caterpillars started to appear and it resulted in the office being fumigated.\nAt home, he was a staunch supporter of the Liberal Democrats and regularly helped out the local Wiltshire branch and he would tell you that he was a liberal before the Liberal Democrats even existed. He was a lifelong member of the RSPB and former summer warden at RSPB Minsmere. He loved cricket, Eccles cakes, Chelsea buns from Fitzbillies, and cooking.\nHe leaves behind his Mother, Sisters, Sons and Grandchildren.\nHis funeral is on the 11th of August 2023 at St. Nicholas, Winsley at 13:30 followed by refreshments at a local venue.\nIf you would like to, you can make a donation in memory of Dad to the RSPB. If you knew my father please send us photos, memories and stories to [email protected]\nAndrew J. B. Wright\n1958 - 2023",
  "https_www_james-wright_org_uk_/https_www_james-wright_org_uk_news_opinion-we-cannot-return-area-based-farming-subsidies/content_35.html": "I started farming when I bought two pigs with my student loan eight years ago. Until recently, my wife and I farmed 155 acres of rented ground with 120 cattle, commercial pasture-based farming, and we participated in a Sustainable Farming Incentive (SFI) trial. I am also Cabinet Member at Horsham District Council. The district is home to hundreds of farmers doing the best for their business and nature, and we are lucky enough to have the famous Knepp at the heart.\nThe council’s ecologist recently helped 27 farmers apply for a Landscape Recovery project, and I am proud to say that their project was one of the 22 selected to move forward. These farmers will rewet and improve over a thousand acres of farmed river brooks, delivering new habitats, improving water quality and exposing a generation of young people to nature.\nI campaigned to Leave the EU, and one of the reasons at the core of my argument was that the Common Agricultural Policy was not fit for purpose. Rules that had to support subsistence farming in France equally had to apply for enormous farms in Poland and landed estates in England. It wasn’t working for anyone and had warped farming businesses which weren’t delivering for nature or the nation’s food security.\nIts replacement announced in 2019, Environmental Land Management Scheme (ELMs), in many ways, has come on too slowly, but they are rolling out, and I was lucky enough to be part of a Sustainable Farming Incentive (SFI) trial. At the conference, I had the opportunity to speak to CEN members about my experience with SFI.\nIn order to meet our goals of reversing biodiversity loss, we need to maximise the uptake of ELMs. Fundamentally the amounts paid in SFI are too low, the cost of delivering SFI is significant, and the payments don’t allow for a profit margin.\nTo improve uptake, we need to increase payment rates. I suggest we look at doing that by encouraging those with highly productive land to focus on producing food, and improvements to hedges and margins should come as part of an integrated pest management plan.\nThe Landscape Recovery project in Horsham has 27 farmers who brought their ideas together to deliver an improved landscape. I would suggest that landed estates and NGOs owning land should be required to apply for LRs in partnership with farmers or match their funding request with private money. They are best placed to do this as they have large donor bases.\nWith the money we have freed up with these two changes, we can increase the payment rates. In my trial for our small farm, it only stacked up financially compared to Countryside Stewardship because we were given a £5,000 payment for taking part in interviews.\nWe must, at all costs, though avoid a return to area-based payments. Nothing could be worse than spending billions of taxpayers' money for no return to nature and losing food security.\nOriginally published on the Conservative Environment Network website - https://www.cen.uk.com/our-blog-list/2022/10/25/cllr-james-wright-we-ca…"
}