{
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_discussing-blm-global-social-leaders-festival-live-stream/content_38.html": "If you vote to stick with the plan. Conservatives will *DOUBLE free childcare.\nThis means parents will have access to *30 hours of free childcare* from the time their kids are 9 months old to the time they start school.\nIt's good for our economy and good for families.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_meeting-cable-car-planners-success/content_37.html": "On Wednesday, the 23rd I met with the team from Clifton Cable Co to discuss their ideas for a cable car system in Bristol to support local commuters and boost tourism.\nThe idea is for a cable car system to be installed around the City in strategic places to help alleviate the congestion problems that the City has, as well as to reduce the City’s Carbon footprint. The cable cars would be placed at Bristol Temple Meads and follow a route around the City to key areas such as the SS Great Britain, Ashton Gate & The Clifton Suspension Bridge.\nThe Idea is extremely cost effective as the installations have a short payback period as well as providing a much-needed source of tourist income.\nThis is a very appealing idea for the City and when coupled with improved bus, train, walking and cycling infrastructure. It offers a real alternative to the Mayor’s costly and impractical plan for a 'Bristol Underground.'\nI have already expressed my support of the project to WECA Mayor Tim Bowles and I will be holding further meetings with key stakeholders in the coming months to discuss the opportunities of this new mode of transport and explore if this is the right project for Bristolians.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_category_Opinions/content_11.html": "Equality of Opportunity: The Party of Social Reform. 10th June 2022 If there is one thing, we all know it is that Conservatism is a politic for stale, outdated and self-serving quasi-aristocratic egomaniacs committed to... Opinions\nLISTEN 17th November 2021 Following and incident being threatened with a knife Samuel speaks to BBC Radio Bristol about what could be done to improve the situation. Opinions\nWATCH: Samuel Speaks on BBC Points West about Knife Crime and the need for tougher laws 17th November 2021 Following an incident involving a knife being used the threaten Samuel he has since spoken with BBC Points West on what could be done to improve the situation... Opinions\nREAD: ‘Are you going to stab me then? 3rd November 2021 ‘Are you going to stab me then?’ - ex-mayoral candidate reveals he was threatened with a knife in Bristol park An ex-mayoral candidate for the West of England... Opinions",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_discussing-colston-statue-situation/content_34.html": "I was interviewed by ITV about the toppling of the Colston statue.\nWe must start recognising our whole history - for good and bad - is part of who we are as Britons today, and we must embrace it, and not shy away from it and be fearful of it because actually the good and the bad are what make us who we are and it will strengthen us.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_category_Local-News/content_18.html": "READ: Samuel Williams threatened with knife in Bristol park - BBC News 22nd October 2021 Ex-mayoral candidate Samuel Williams threatened with knife in Bristol park [F}ormer West of England mayoral candidate says he was shocked to be threatened with... Local News\nSamuel Williams Selected As WECA Mayoral Candidate 1st January 2021 I am delighted to announce that I will be standing as the Conservative candidate for the Mayor of the West of England Combined Authority. As a business leader... Local News\nDiscussing ways to tackle homelessness on Bristol TV 7th October 2020 It was wonderful to sit down with Bristol TV to speak about the Next Steps Accommodation Programme that has granted almost £2 million to Bristol to deliver key... Local News\nMeeting with Bristol Port Company. 28th September 2020 Today (Monday 28th) I visited the Bristol Port Company and discussed the important work that they do. During my visit to their two key sites Portbury Docks and... Local News\nMeeting with Cable Car planners - A success! 23rd September 2020 On Wednesday, the 23rd I met with the team from Clifton Cable Co to discuss their ideas for a cable car system in Bristol to support local commuters and boost... Local News\nDiscussing the Colston statue situation 17th June 2020 I was interviewed by ITV about the toppling of the Colston statue. We must start recognising our whole history - for good and bad - is part of who we are as... Local News\nDiscussing the Colston statue on Imperial Voice Radio 15th June 2020 I was on Imperial Voice Radio recently discussing the Colston statue and the BLM movement. You can listen to the discussion here Local News\nBCfm Online Mayoral Hustings 1st May 2020 I recently took part in the BCfm online hustings. You can watch me set out my case that Bristol deserves better. We need a better transport system that cuts... Local News\nSamuel Williams announced as Conservative candidate for Mayor of Bristol 25th October 2019 Author: Bristol24/7 A charity campaigner and communication specialist has been selected as the Conservative candidate to be the next mayor of Bristol. Williams... Local News",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_contact/content_7.html": "Skip to main content\nMain navigation\nHome\nAbout Samuel Williams\nNews\nCampaigns\nContact\nContact\nLeave this field blank\nCampaign Centre\n5 Westfield Park, Bristol BS6 6LT\n0117 973 6811\n[email protected]\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_campaigns/content_4.html": "Vote For Change in Bristol Central 🚨 It's time for change in Bristol Central! 🚨 I'm Samuel Williams, standing as your voice for change. For our business communities, young people, pensioners, and...\nFinancial Inclusion For All: The other FIFA Financial inclusion is a critical issue that affects millions of people in our society. Many individuals and families struggle to access affordable credit...\nSouth West Conservative BAME Forum The Conservative BAME Forum is an independent grassroots organisation with a mission to build stronger links between ethnic minority communities and the...\nSafer City: Bin The Blade Campaign The Safer City: Bin The Blade Campaign is a grass roots campaign with a clear goal to make our cities safer by standing for: Stronger laws surrounding the sale...\nBin The Blade: Write to your representative Write to Your Councillors, Mayor, PCC or MP To see lasting change it is important that we raise our concerns with our elected representatives. Please use the...",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_read-samuel-williams-threatened-knife-bristol-park-bbc-news/content_44.html": "Ex-mayoral candidate Samuel Williams threatened with knife in Bristol park\n[F}ormer West of England mayoral candidate says he was shocked to be threatened with a knife after challenging two suspected bike thieves.\nSamuel Williams was walking through Victoria Park, in south Bristol, when he spotted two teenage boys with a bicycle and bolt cutters.\nWhen he asked them about the bike, one of them pulled out what Mr Williams described as \"a very large blade\".\nHe said the rise in knife crime in Bristol was a \"huge concern\"....\nRead the full article via the BBC here",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_were-investing-families/content_6.html": "If you vote to stick with the plan. Conservatives will *DOUBLE free childcare.\nThis means parents will have access to *30 hours of free childcare* from the time their kids are 9 months old to the time they start school.\nIt's good for our economy and good for families.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_campaigns_safer-city-bin-blade-campaign/content_9.html": "The Safer City: Bin The Blade Campaign is a grass roots campaign with a clear goal to make our cities safer by standing for:\n-\nStronger laws surrounding the sale and purchasing of knives.\n-\nStronger action to enable the safe and lawful disposal of unwanted and illegal knives, whilst providing first aid equipment, training for those most at risk of facing knife crime and where appropriate support for families and victims of knife crime.\n-\nStronger prevention by offering safe and real alternatives to criminal activity and knife crime.\nKnife crime is a multifaceted issue that impacts us all. We believe that it is no one organisations responsibility but rather that it takes a whole, one city vision to make our streets safer.\nWe are inviting individuals, charities, community leaders, businesses, politicians, teachers, police officers and everyone in between to join together as we campaign for a safer, knife free, city. It is time to Bin the Blade.\nCore Campaign Actions\nStronger Regulation\nThe maximum penalty for an adult carrying a knife is 4 years in prison and an unlimited fine. You’ll get a prison sentence if you’re convicted of carrying a knife more than once.\nCurrent legislation surrounding the sale, hire and possession of knives in the United Kingdom is reasonably clear. However there is significant room within the legislation for the continued trade and ownership of non-banned large knives by those with solely illegal or dangerous intent.\nIt is illegal to:\n- bring into the UK, sell, hire, lend or give someone a banned knife or weapon\n- carry any knife in public without good reason, unless it has a manual folding blade less than 3 inches long\n- sell a knife to anyone under the age of 18, unless it has a manual folding blade less than 3 inches long\n- use any knife in a threatening way\nSee banned items here\nOur View:\nIt is right and proper that Knives most associated with violent and criminal acts are banned, including Disguised knives, Flick knives and Zombie knives.\nUnder legislation banning certain knives or weapons, a blade upto 50cm is permitted for sale and ownership. It is our view that whilst these knives are not banned under current legislation they hold no ‘real world’ purpose or value. That is to say they are neither design nor suitable for legitimate purposes such as country pursuits, culinary service, religious observance, artistic or historical importance.\nMost commonly these are mass produced, large and fixed bladed weapons, such as sheath knives, swords and machetes. Whilst it is illegal to carry these in public without good reason, minimal to no legislation restricts the sale, purchase, or registration of these weapons.\nIt is our view that more stringent regulation should be introduced at point of sale,\nrequiring of the purchaser:\n- A clear declaration of proof of identity, age and address\n- Intent of use statement\n- Acknowledgement of the law surrounding ownership and possession of knives\n- Mandatory consent that above details maybe passed onto law enforcement\nRequiring of the seller, whether physical or online:\n- To not withhold from Law enforcement personal information appertaining to the purchaser as it relates to the purchase of knives linked to criminal activity.\n- To take every reasonable step to dissuade the sale of knives to anyone who may go on to carry out a banned activity.\n- To ensure that the purchaser meets all requirements of legitimate sale as detailed above.\nStronger action\nIt is clear that action must be taken to reduce the number of knives already on our streets as well as upskill key citizens such as teenagers, gang members, teachers and community leaders with the knowledge and resources to provide life saving support when stabbings occur; as well as resourcing ongoing care following incidents of knife crime.\nTo that end we are campaigning for:\nOur View:\n- The introduction and strategic placement of ‘Knife Bins’ in such locations as schools, colleges and parks to enable the safe disposal of knives which risk being used in banned activities.\n- The introduction of catastrophic bleed kits in all schools, colleges and potential high-risk areas such as pubs and clubs.\n- Emergency first aid training for catastrophic bleeding and knife inflicted wounds for all teachers in schools and colleges. In addition, first aid training for young people and community members to be made freely available.\n- Further investment into community, family and victim support programmes.\nStronger prevention\nThe best way to tackle knife crime is to prevent the crime for taking place in the first place. It is our view that through the prevention and diversion of potential offenders away from a life conducive to illegal activities is key to tackling knife crime.\nTherefore we are campaigning for:\nOur View:\n- The introduction of Early Intervention mentoring programmes for at risk young people. Providing the mental, emotional, social, and physical support to enable well rounded citizens.\n- Greater investment into skills, training and apprenticeship opportunities for at risk young people to be introduced. Offering clear and real-world pathways from school into meaningful work.\nSupport the Campaign\n1) Write to Your Councillors, Mayor, PCC or MP\nClick here for a template to send to your representative.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_campaigns_skills-training-and-future-jobs-training-future-we-all-want/content_47.html": "As someone who has both studied at and worked in Further Education colleges, I understand their significance for the region. For too long we have contented ourselves with a linear ‘one size fits all’ approach to educational training, it is time to switch the narrative and focus on providing people in the West of England with the skills and training they desperately need to access the high value jobs they deserve. That’s why I welcome the devolved post-19 education budget enabling WECA to work collaboratively to deliver the skills, training and apprenticeship opportunities to meet the work opportunities across the region.\nAs your West of England mayor, I will close the gap between education and employment, marrying the needs of educators and businesses with those of the workforce of the future. Through conversations and consultations with both sectors across the region, The New Collaborative Future Skills Programme will make skills and training work for you and your future career. My plan is opportunity driven, allowing everyone, regardless of background to access the expertise and know how they need so as to upskill and access jobs.\nI commit to the Workforce For The Future programme, which will ensure that people and businesses are fully equipped with the tools and skills they need to develop, grow and remain the life-blood of the West of England’s economy. Additionally, I will drive forward our Future Bright initiative. This will allow those whose jobs have been affected by the pandemic and those looking for work to receive bespoke advice and support to develop their skills, increase their income and enhance their career prospects.\nOn top of this, these schemes will be complemented and operate in concordance with landmark Conservative initiatives such as the Kickstart Scheme, T-Levels, and greater apprenticeship funding.\nWe must also focus on nourishing and fostering skills growth at its roots, in education. As part of my commitment to all of you in the West of England, I will ensure a careers and enterprise advisor is available to every school in the region. This will make sure our young people are getting excellent advice about the breadth and diversity of careers options that are available across the region.\nApprenticeships and ongoing professional development continue to be vital to boosting our workforce and progressing in our careers. I will therefore work with employers to ensure that they can access the training they need to deliver provide the opportunities our region needs.\nEducation is the key to a fair and equitable society. Therefore as part of ‘Leading to Level-up’, I commit to continuing funding for new skills and language training. Working with our pioneering new Community Ambassadors we will ensure that those who desire training can access it. It is time to ensure that everyone, no matter their life experience can access equality of opportunity and make the most of a fresh start.\nI understand that many of us learn and work at different paces and as someone with dyslexia I understand that much of our education system can be difficult. Education does not stop with children and I want to be the first West of England Mayor to ensure adults with Special Educational Needs or Disabilities are supported to access the jobs they desire.\nIt is my firm belief that this robust and ‘whole-system’ strategy that balances both sides of the worker-employer equation, will facilitate deep and long lasting educational and economic growth. It is time that our approach to skills and jobs starts working for you. It is not time to risk our future, it is time for progress.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_campaigns_vote-change-bristol-central/content_15.html": "🚨 It's time for change in Bristol Central! 🚨\nI'm Samuel Williams, standing as your voice for change. For our business communities, young people, pensioners, and parents – I'm standing for everyone who calls Bristol home. 🏡\nOur city has incredible potential, but Labour's leadership has led to mismanagement and neglect. Don't believe the negative stories about Conservatives. We've delivered real support and investments. 💪\nThis election is about securing a future for Bristol Central. On 4th July, let's send a message to Westminster. Vote Conservative, vote for me, Samuel Williams! 🗳️",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_campaigns_our-sustainable-future/content_45.html": "I am committed to delivering a greener and more sustainable future.\nOur long-term green transition is far from simply a matter of reducing green-house gasses and improving biodiversity. Although of course centrally important, the region's future economy, jobs, skills, research and innovation are also inextricably connected to securing a greener and fairer world.\nIt is my view that through strong, innovative and collaborative leadership we can become a leading light in driving forward a restorative economy that takes seriously the challenges climate change presents whilst simultaneously taking hold of the very real opportunities the green industrial revelation offers us.\nHowever, unless our elected leaders are willing to tackle the issues head on and pioneer a way forward we cannot expect to deliver the change we all need. The last thing we need to secure our future is mudslinging politics or the methods of past politicians resurrected in the expectation of a different result.\nThe Conservative Government have worked tirelessly in this area leading in decarbonisation and setting a clear strategy towards a carbon Net-Zero future; as well as pledging to protect our seas, deal with plastic pollution, safeguarding our biodiversity and improving the air we breathe. A flourishing environment is at the heart of modern conservatism and it is at the heart of my campaign for a brighter future for the West of England too.\nWe must approach this from two broad perspectives; adaption and innovation.\n- Adaption is the challenge for us to do certain things differently. I will strengthen WECAs commitment to a green, just and affordable transition through a renewed and dedicated commitment to the Sustainable Development Goals as an integrated lens for decision making. This SDG lens will include everything from strategy to planning, transport and infrastructure preferences and planning. I will also continue to support initiatives such as the STEP Fusion bid, creating green energy for our region, as well as supporting initiatives to utilise tidal energy.\nWe have a significant need to develop homes across our region and I will therefore prioritise brownfield regeneration, safeguarding our green spaces. As we develop our Special Develop Strategy I will prioritise low carbon and nature friendly building which enables people to live in union with our natural environment.\n- My commitment to our region and indeed the planet is that under my leadership we will start taking the bold and innovative steps needed to safeguard our future.\nWe must support business to prepare for the future economy, provide the training future green jobs, build communities that safeguard our green spaces and make zero carbon transport a valid alternative to personal vehicles.\nI will launch the Build a Brighter World Award that will incentive innovations such as low carbon technologies and modern methods of construction.\nI will support a programme of retrofitting our buildings so as to reduce their carbon footprint.\nI will support tree planting and linear parks creating green corridors through our urban and rural areas utilizing our walking and cycle routes.\nWe are capable of leading the world in our environmental credentials and I am commitment to doing just that so that people, planet and profit thrive.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk/content_1.html": "Intro Video (background video that auto-plays without sound)\nSamuel P. S. Williams\nLet's get started\nIt’s clear, we need a society in which everyone can flourish, and for that to be possible we need a society in which everyone has an equality of opportunity to achieve everything they are capable of. It’s clear that it’s time to level-up.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_archived-campaigns/content_36.html": "Transport: Connecting our region, accessing opportunity Like many of you I grew up in the shadow of great monuments to innovation and connectivity, Brunel’s magnificent Clifton Suspension bridge, the grandeur of...\nSkills, Training and future Jobs: Training for the future we all want As someone who has both studied at and worked in Further Education colleges, I understand their significance for the region. For too long we have contented...\nHousing and Redevelopment: Building Home, creating communities It is no surprise that our region continues to grow and develop when we are fortunate enough to live in one of England’s most beautiful and diverse areas. It is...\nBusiness, Innovation and Economic Growth: We mustn’t risk our recovery Years ago, I founded my own business in Bristol and like many fellow local business owners, I have been shocked by the lack of commercially minded leadership...\nOur Sustainable Future I am committed to delivering a greener and more sustainable future. Our long-term green transition is far from simply a matter of reducing green-house gasses...",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_cdn-cgi_l_email-protection/content_27.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_campaigns_housing-and-redevelopment-building-home-creating-communities/content_48.html": "It is no surprise that our region continues to grow and develop when we are fortunate enough to live in one of England’s most beautiful and diverse areas. It is now time for us to develop a regional vision that moves beyond siloed thinking and starts to meet the needs of our growing communities for now and the years to come.\nI am the only candidate that can spearhead this vision, connecting our region and unlocking investment. I will take up the mantle and drive forward the Spatial Development Plan, which will set out a far-reaching 20-year vision for the future of our villages, towns, cities, and spaces. As part of this strategy and my commitment to the West of England, I pledge to set the course to meet our vision for over 100,000 new homes by 2040. However it is not enough to simply build new homes, these homes must be both sustainable and affordable to those who live within them. Therefore I will launch the Building a Brighter World Award incentivising innovation in modern methods of construction, decarbonisation and meeting housing need whilst also attracting inward investment. Communities not dormitories will be the guiding vision, as developments will prioritise mixed use spaces and connected services.\nDemocratization will also be key; as the West of England Mayor I will give you; the residents a say prioritising Community Led housing projects wherever possible. Under the umbrella of the Spatial Development Plan, residents will be able to inform and invest in the development of your communities, working in collaboration with developers, Councils and WECA to ensure locality is always at the forefront of these new ‘liveable neighbourhoods’ meaning we can live, work and shop without having to travel significant distances.\nI am resolutely committed to protecting, decarbonising, and conserving our precious green spaces. I will prioritise the regeneration of brownfield sites, making the most of our underused spaces building upon and taking further the work of WECA thus far. It is important that we invest in Modern Methods of Development, low carbon construction and sustainable technologies both for new and to retrofit current properties. That why I will work closely with government to unlock investment so that we can become a leading light in a sustainable future.\nI am sensitive to the problem of homelessness that continues to proliferate within our communities. As West of England Mayor, I will not shy away from this task. I will work closely with the Next Steps Accommodation Programme and I am pleased this Conservative Government has delivered Millions to tackle homelessness head on across the region. I commit the over £40 million dedicated to speed up building and meet the needs of all our communities between now and 2023. We have a lot of work to be do and it is time that we roll up our sleeves and get stuck in to allow everyone access to the home they rightfully deserve.\nStrong Conservative leadership will not risk our recovery. It will build back better for the entirety of the West of England.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_campaigns_south-west-conservative-bame-forum/content_19.html": "The Conservative BAME Forum is an independent grassroots organisation with a mission to build stronger links between ethnic minority communities and the Conservative Party at all levels. As the South West Chairman, Samuel works with the national and regional team to:\n-\nEmpower BAME members of the party across the country with tools and resources.\n-\nEnable BAME members to take an active role in community life as grass-root activists, councillors, party officers and parliamentarians.\n-\nIncrease the BAME representation and voice throughout the Conservative Party.\nThe Conservative BAME Forum seeks to represent the true interests of the BAME community in the Conservative Party. The BAME Forum acts as a bridge in translating the concerns of the community with the conservative policy makers and dispelling any biased and misleading information through awareness and education outreach programmes.\nJoin the SW BAME Conservative Forum\nOur Core Activities\nPolicy\nConduct Events, Webinars & talks on policy matters relevant to the BAME Community.\nOutreach\nUse of the party bodies and local associations to engage on the matters related to the community.\nInvolvement\nEmpower BAME community members to engage with conservative party & Take active roles within the party.\nEngagement with MPs\nWork closely with the MP’s and community; Act as a bridge, Provide MP’s with a regular dossier / updates on BAME matters.\nParty Membership\nEncourage community to join membership of the Conservative party so they have a say in party affairs including choice of candidates",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_read-are-you-going-stab-me-then/content_13.html": "‘Are you going to stab me then?’ - ex-mayoral candidate reveals he was threatened with a knife in Bristol park\nAn ex-mayoral candidate for the West of England has revealed how he was threatened with a knife in a Bristol park, as he called for tougher laws on the sale of large knives.\nSamuel Williams told the BBC how he had a knife drawn on him when he confronted two teenagers he suspected of stealing a bike in Victoria Park last month. Read the full article via Bristol World",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_discussing-ways-tackle-homelessness-bristol-tv/content_32.html": "It was wonderful to sit down with Bristol TV to speak about the Next Steps Accommodation Programme that has granted almost £2 million to Bristol to deliver key services to those sleeping rough and at risk of homelessness.\nLet's end homelessness in our city. We're Bristolians, we do big things.\nI also had a chance to speak about post covid economic regeneration, the need to pull together and also to support Tim Bowles as he leads West of England Combined Authority.\n(Video by Bristol TV)",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_samuel-williams-announced-conservative-candidate-mayor-bristol/content_30.html": "Author: Bristol24/7\nA charity campaigner and communication specialist has been selected as the Conservative candidate to be the next mayor of Bristol.\nWilliams says that he is keen to boost Bristol’s position as a world leader in technology, innovation, culture, the arts and environmental issues.\nHis priorities include building more homes, increasing school standards, improving air quality and tackling homelessness, ensuring Bristol is fit for the future.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_campaigns_financial-inclusion-all-other-fifa/content_25.html": "Financial inclusion is a critical issue that affects millions of people in our society. Many individuals and families struggle to access affordable credit, leaving them vulnerable to high-cost lenders and loan sharks. This problem disproportionately affects the poorest in our society, driving them further into debt and perpetuating the cycle of poverty.\nI firmly believe that everyone should have access to affordable credit, regardless of their income or financial situation. That's why I am campaigning for financial inclusion and access to affordable loans and actively working to launch the first No Interest Loan Scheme in the South West. By providing no and low-cost loans to those who need them most, we can help to break the cycle of debt and promote financial stability.\nAffordable loans can make a significant difference in people's lives. They can help to cover unexpected expenses such as a broken appliance, allowing families to avoid falling into debt. They can also help people to manage their existing debts, reducing stress and improving mental health.\nIn addition to providing affordable loans, I am committed to the belief that financial education and support services are essential for promoting financial inclusion. By helping people to manage their finances, we can empower them to take control of their financial future and break the cycle of poverty.\nI am calling on policymakers and financial institutions to prioritize financial inclusion and access to affordable loans. By working together, we can ensure that everyone has access to the financial resources they need to thrive. Let's create a society where financial inclusion is a reality, not a luxury.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_feed/content_23.html": null,
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_tackling-poverty-premium-call-government-action-towards-fairer-financial-system-leaves-no-one/content_22.html": "The devastating impact of poverty and the burden of debt on the most vulnerable in our society cannot be ignored. With household debt averaging at a staggering £60,363 in 2020 and 14.3 million people living in poverty in 2019/20, urgent action is needed to address this crisis. High-cost lenders, like payday loan companies, continue to take advantage of those in desperate situations, profiting from their misery. This is not acceptable, and it's time for the government to step up and implement policies that create a financial system that works for everyone, including the poorest and most marginalized.\nOrganizations such as Fair4AllFinance, Fair Finance, Big Issue Invest, Plend, BBRC, Resonance, and RefuAid are already leading the charge for financial inclusion, providing affordable loans that empower individuals to break free from predatory lending and combat the poverty premium. But their efforts alone are not enough. The government must take bold and decisive action to tackle this issue comprehensively.\nFirstly, the government should introduce regulations that cap the exorbitant interest rates and fees charged by high-cost lenders. It's unacceptable that vulnerable individuals are subjected to sky-high interest rates that trap them in a cycle of debt, pushing them further into poverty. By implementing strict regulations, the government can protect consumers and ensure that financial products and services are affordable and fair.\nSecondly, transparency in financial products and services must be prioritized. Many of us no matter out background lack the necessary financial literacy to understand the true costs and risks associated with certain financial products, leading to uninformed decisions that result in negative consequences. The government should require financial institutions to provide clear and easily understandable information about the terms, fees, and risks of their products, enabling consumers to make informed choices and avoid falling into debt traps. Furthermore, practical financial education must be introduced into core curriculum ensuring that debt minimizing and wealth generating activities are understood and exploited equally across society.\nThirdly, the government should allocate funding and support to organizations that promote affordable credit options, such as Fair4AllFinance, Fair Finance, and Big Issue Invest. These organizations are working tirelessly to provide fair and affordable credit to underserved communities, and they need adequate resources to expand their reach and impact. The government should partner with these organizations to drive innovation, share best practices, and scale up successful initiatives that promote financial inclusion.\nFurthermore, the government should prioritize financial education and empowerment programmes for individuals on low incomes. By equipping them with the necessary financial skills, knowledge and access to affordable credit, they can make informed decisions about their finances, budget effectively, and avoid falling into bad debt. Additionally, the government should invest in initiatives that promote affordable housing, transportation, and education, as these are critical factors in breaking the cycle of poverty.\nThe government must take decisive action to create a fairer financial system that leaves no one behind. Regulations that cap interest rates and fees, transparency in financial products and services, funding and support for organizations promoting affordable credit, and financial education programs are essential steps towards tackling the poverty premium and the cost of living crisis. It's time for the government to prioritize financial inclusion, protect vulnerable consumers, and create an environment where everyone has access to fair and affordable financial services.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_category_Articles/content_16.html": "We're investing in Families 27th June 2024 If you vote to stick with the plan. Conservatives will *DOUBLE free childcare. This means parents will have access to *30 hours of free childcare* from the time... Articles\nInvesting in Our NHS 27th June 2024 Its time to invest in our NHS, bring down waiting list and address pressing needs. Thats why conservatives are committed to transforming our NHS for the long... Articles\nRethinking Economic Policy: Building a Values-Based, High-Impact UK Economy 30th November 2023 In a world where economic policies often oscillate between short-term fixes and long-term aspirations, the UK's Autumn Statement 2023 serves as a baseline for a... Articles\nTackling Poverty Premium: A Call for Government Action Towards a Fairer Financial System that Leaves No One Behind 9th July 2023 The devastating impact of poverty and the burden of debt on the most vulnerable in our society cannot be ignored. With household debt averaging at a staggering... Articles\nBuild a Society that Works...for all 3rd May 2023 The COVID-19 pandemic and following cost of living crisis, exacerbated by the wider economic cost of the Ukraine war exposed the urgent need for a paradigm... Articles\nThe D word: Making Devolution work for our communities 13th December 2022 Devolution of political power, the process of transferring decision-making authority from central governments to regional or local authorities, has long been... Articles\nREAD: Restoring our communities means restoring representational democracy 23rd May 2022 Between 2019 and 2021 I was privileged to be selected as the Conservative candidate, first for the Bristol mayoralty and then, following the electoral... Articles\nThe Great Bristol Energy Debacle 9th November 2020 With the failings of this Labour city leadership negatively impacting the daily lives of so many of us, it is only reasonable that we are outraged by the... Articles\nDiscussing BLM on the Global Social Leaders Festival live stream 19th June 2020 I recently took part in the Global Social Leaders Festival live stream, discussing black lives matter. Articles",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_cookies/content_3.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news/content_14.html": "We're investing in Families Thursday, 27 June, 2024 If you vote to stick with the plan. Conservatives will *DOUBLE free childcare. This means parents will have access to *30 hours of free childcare* from the time their kids are 9 months old to the time they start school. It's good for our economy and good for families. Articles\nInvesting in Our NHS 27th June 2024 Its time to invest in our NHS, bring down waiting list and address pressing needs. Thats why conservatives are committed to transforming our NHS for the long... Articles\nRethinking Economic Policy: Building a Values-Based, High-Impact UK Economy 30th November 2023 In a world where economic policies often oscillate between short-term fixes and long-term aspirations, the UK's Autumn Statement 2023 serves as a baseline for a... Articles\nTackling Poverty Premium: A Call for Government Action Towards a Fairer Financial System that Leaves No One Behind 9th July 2023 The devastating impact of poverty and the burden of debt on the most vulnerable in our society cannot be ignored. With household debt averaging at a staggering... Articles\nBuild a Society that Works...for all 3rd May 2023 The COVID-19 pandemic and following cost of living crisis, exacerbated by the wider economic cost of the Ukraine war exposed the urgent need for a paradigm... Articles\nThe D word: Making Devolution work for our communities 13th December 2022 Devolution of political power, the process of transferring decision-making authority from central governments to regional or local authorities, has long been... Articles\nEquality of Opportunity: The Party of Social Reform. 10th June 2022 If there is one thing, we all know it is that Conservatism is a politic for stale, outdated and self-serving quasi-aristocratic egomaniacs committed to... Opinions\nREAD: Restoring our communities means restoring representational democracy 23rd May 2022 Between 2019 and 2021 I was privileged to be selected as the Conservative candidate, first for the Bristol mayoralty and then, following the electoral... Articles\nLISTEN 17th November 2021 Following and incident being threatened with a knife Samuel speaks to BBC Radio Bristol about what could be done to improve the situation. Opinions\nWATCH: Samuel Speaks on BBC Points West about Knife Crime and the need for tougher laws 17th November 2021 Following an incident involving a knife being used the threaten Samuel he has since spoken with BBC Points West on what could be done to improve the situation... Opinions",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_listen/content_35.html": "If you vote to stick with the plan. Conservatives will *DOUBLE free childcare.\nThis means parents will have access to *30 hours of free childcare* from the time their kids are 9 months old to the time they start school.\nIt's good for our economy and good for families.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_events_feed/content_41.html": null,
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_investing-our-nhs/content_5.html": "Its time to invest in our NHS, bring down waiting list and address pressing needs. Thats why conservatives are committed to transforming our NHS for the long term\n🚨 It's time for change in Bristol Central! 🚨\nI'm Samuel Williams, standing as your voice for change. For our business communities, young people, pensioners, and parents – I'm standing for everyone who calls Bristol home.\nIf you vote to stick with the plan. Conservatives will *DOUBLE free childcare.\nThis means parents will have access to *30 hours of free childcare* from the time their kids are 9 months old to the time they start school.\nIt's good for our economy and good for families.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_rethinking-economic-policy-building-values-based-high-impact-uk-economy/content_8.html": "In a world where economic policies often oscillate between short-term fixes and long-term aspirations, the UK's Autumn Statement 2023 serves as a baseline for a much-needed discourse on shaping a values-based, high-impact economy.\nWhile the statement makes strides in certain areas, it also falls short in key aspects that are crucial for fostering an economy rooted in societal values and sustainable impact.\nThe Autumn Statement 2023: A Starting Point, Not a Panacea\nThe Autumn Statement presents a series of measures aimed at economic recovery, with notable efforts in reducing inflation and supporting British businesses.\nHowever, this focus, while important, feels somewhat myopic in the grander scheme of building an economy that not only grows but also nurtures.\n- Inflation and Debt Reduction: The halving of the CPI inflation from over 11% to 4.6% is commendable. Yet, this achievement, while significant, is a single piece of a larger economic puzzle. In its vigorous pursuit of debt reduction, the government risks overlooking the need for expansive and innovative economic policies that can drive long-term sustainable growth.\n- Tax Cuts and Labor Market Reforms: The proposed tax cuts and reforms in the labor market, including incentives for the self-employed, are steps toward economic relief. However, they represent a reactive approach rather than a proactive strategy for building a workforce equipped for the future's challenges.\nBridging the Gap: From Economic Recovery to Societal Prosperity\nTo transition from a traditional growth-centric model to a values-based, high-impact economy, the UK needs to address several critical areas:\n- Green Technology and Sustainability: The statement lacks a bold vision for integrating green technology and sustainable practices into the fabric of the UK economy. Investing in renewable energy and eco-friendly innovations is not just an environmental necessity but an economic imperative for long-term growth.\n- Empowerment of Social Enterprises: There is a pressing need to support businesses driven by social goals, not just profit. Policies should incentivize and nurture social enterprises that contribute to societal well-being, creating a ripple effect of positive social impact.\n- Fostering Inclusivity and Diversity: An inclusive economy is a resilient one. Policies must aim to make economic growth inclusive by addressing disparities and promoting diversity in the workplace, ensuring that all segments of society benefit from economic progress.\n- Focus on Education and Skills Development: The future of the UK economy lies in its human capital. Investing in education and skill development is critical for preparing a workforce that is adaptable, innovative, and capable of driving a high-impact economy.\nA Call for a Holistic Approach\nThe Autumn Statement 2023, while a step forward, should be viewed as a foundational step rather than a comprehensive solution. For the UK to truly foster a values-based, high-impact economy, a more holistic approach is needed.\nThis approach should integrate economic growth with social and environmental stewardship, ensuring that the prosperity of the economy translates into the well-being of its society. The path ahead requires not just fiscal prudence but a bold reimagining of what constitutes true economic success.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_privacy/content_24.html": "This document outlines how Samuel P. S. Williams processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Samuel P. S. Williams\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Samuel P. S. Williams.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Samuel P. S. Williams, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Samuel P. S. Williams via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_build-society-worksfor-all/content_10.html": "The COVID-19 pandemic and following cost of living crisis, exacerbated by the wider economic cost of the Ukraine war exposed the urgent need for a paradigm shift in our communities. With projections of up to four million job losses and economic inactivity increasing to over 8 million, underscores the scale of the economic upheaval, while educational inequality and mental health challenges also worsened during lockdown and still 100,000 children are reported ‘missing’ from schools across the UK, who failed to return following lock down measures. Charities and social enterprises, crucial pillars of support in society, have been severely impacted, with a staggering 60% seeing a decline in income and 32% experiencing a shortage in volunteers.\nIt is clear that to \"build back better\", we require a fresh economic and social framework that supersedes the previous and current system, that realigns socio-economic success towards measures that mean real terms benefit to society as a whole rather than simply fulfilling the increasingly arbitrary and politicised notion of ‘growth’ at all costs - which rarely, if ever trickles down to improve the lives of the citizens who stack our shelves, drive our taxis, teach our children and change our bedpans. The high stimulus, low tax big business push of Tuss-o-nomics demonstrated in just a few short weeks how detrimental a myopic growth mindset can be to the very economy it is trying to grow; not least to fixed rate employees and Small and Medium sized Enterprises (SMEs) – the vast majority of the economy, which is often underserved in place of 7700 ‘large’ companies). To stress I am not one of the woke left ‘anti-growth coalition’; far from it, however I do believe that the real economy, and further SMEs ought to be the locus of our growth as opposed to the financial economy of large multi-national conglomerates.\nEven prior to the pandemic, and the invasion of Ukraine by Putin, the social framework of our communities were grappling with deep-seated issues. Neglected regions in the North and Midlands, as well as coastal and rural communities, were receiving inadequate support from successive administrations.\nThe failure of once-thriving industrial towns and British farming communities, like the one I grew up in in the Cotswolds, to thrive as labour and capital gravitated towards each other and metropolitan centres has left many communities lagging behind. Despite this, individuals are still and rightly, deeply attached to their hometowns despite facing barriers of poor mobility, skills and education training and networks, which make relocating to the metropolis an unviable prospect.\nTo preserve our rich communities, indispensable community organisations and innovative enterprises, a support structure must be put in place that goes beyond the ‘moving the furniture’ of modest rates changes or grants and requires a paradigm shift which places our communities at the centre of a new industrial complex.\nWhile the government's commitment to \"level up\" the country is a commendable first step, more must be done to bolster the role of communities. The time has come for a novel economic and social model that prioritises people and communities over mere economic growth. The reconstruction of our communities and country must not merely shield us from global pressures but lay the foundation for a more promising future for all.\nVarious strategies have been implemented to establish a new economic and social model that prioritizes people and communities rather than solely prioritizing economic growth. Let's delve into some examples of these strategies in detail.\nOne key approach that has been gaining popularity is community wealth building. In the United States, cities such as Cleveland and Preston have successfully implemented community wealth building initiatives. For instance, in Cleveland, the Evergreen Cooperative model was established, which is a network of worker-owned businesses that provides job opportunities and anchors wealth in the local community. The initiative has led to a 15% increase in the number of jobs and a 10% reduction in poverty rates in the targeted neighbourhoods.\nAnother strategy that has gained significant momentum is the circular economy. In Europe, the adoption of circular economy principles has the potential to generate an additional €1.8 trillion by 2030. According to the Ellen MacArthur Foundation, transitioning to a circular economy could create over 700,000 jobs in Europe alone. Moreover, the European Union's Circular Economy Action Plan aims to increase the EU's resource efficiency and strengthen its competitiveness, thereby contributing to a more sustainable future.\nThe de-growth movement, which advocates for a reduction in economic activity, is gaining popularity worldwide. Whilst some thinking around the de-growth movement is significantly problematic and calls for the whole implausible and undesirable anti-financialised society, some thinking within the movement ought to be considered. For instance, in Bhutan, the government measures progress using the Gross National Happiness Index instead of GDP, which prioritizes well-being, environmental conservation, and cultural preservation. Similarly, here in the United Kingdom, the Happy City Index, which measures well-being indicators such as community trust, access to nature, and life satisfaction, has been implemented in several cities.\nFurthermore, The New Social Covenant, authored by Danny Kruger, Conservative Member of Parliament for Devises in Wiltshire, sets out a vision for rebuilding society based on a renewed sense of civic responsibility and mutual support. The report advocates for the creation of a \"social covenant\" between citizens, government, and civil society, which seeks to restore trust and create a sense of shared responsibility.\nBorrowing from the Big Society, Kruger calls for the government to invest in strengthening local democracy, supporting social infrastructure, and promoting community-based organizations to create a more sustainable and inclusive society.\nFurthermore the report emphasizes the role of volunteers and civil society organizations in addressing social issues, such as homelessness, addiction, and social isolation. Kruger rightly argues that these organizations are better equipped to provide tailored and holistic support, and the government should support their efforts. Placing power and resource into the hands of the communities that understand the issues they face is a deeply conservative idea and furthers the move of Conservative governments over many years towards greater devolution to regional and local authorities.\nWhilst there is clearly no single ‘best’ way to deliver a new economic and social model that prioritizes people and communities, there are several key elements that can contribute to creating a more equitable and sustainable society which we must actively look to implement:\n- Local ownership and community wealth building: promoting local ownership of businesses and assets, supporting worker cooperatives and social enterprises, and investing in local infrastructure can help to create and keep wealth within our communities and reinvest into community needs.\n- Sustainable and circular economy: adopting circular economy principles, reducing waste, and promoting resource efficiency can lead to economic growth while reducing negative environmental impacts. Sometimes referred to as economic landscapes or systems, understanding that regions, whilst part of a national and international market, operates as a cohesive unit (which may need improving to greater or lesser extent) and this unit is deeply interconnected which if understood correctly can be a powerful driver of real growth, opportunity and innovation.\n- Focus on well-being and social value: measuring progress beyond economic indicators, prioritizing well-being and social value, and involving communities in decision-making processes can create more inclusive and participatory societies that maximise the opportunity within society rather than interventions dictated to communities.\n- Civic responsibility and social covenant: fostering a sense of civic responsibility and social covenant among citizens, government, and civil society can help to build trust, promote mutual support, and create a more resilient society.\nBy combining these elements and tailoring them to specific contexts, it may be possible to deliver a new economic and social model that prioritizes people and communities beyond economic growth alone. However, this will require a collaborative effort from all stakeholders, including government, businesses, civil society, and individuals, to achieve this vision.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_about-rss/content_20.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_d-word-making-devolution-work-our-communities/content_12.html": "Devolution of political power, the process of transferring decision-making authority from central governments to regional or local authorities, has long been seen as a way to improve community cohesion. By giving communities more control over their own affairs, devolution can help to foster a sense of ownership and responsibility among local residents. This, in turn, can lead to greater participation in the political process and a stronger sense of belonging.\nOne of the key benefits of devolution is that it enables communities to tailor their policies and services to their own unique needs and priorities. This can be particularly important for disadvantaged or marginalized communities that may have been neglected by central governments. By empowering these communities to make their own decisions, devolution can help to reduce social and economic inequality and promote more inclusive growth. In this way conservativism is inherently on the say of the most socially dispossessed.\nDevolution can also help to improve community cohesion by fostering greater collaboration and partnership between different levels of government. This can lead to more coordinated and effective policy-making, as well as increased accountability and transparency. In addition, devolution can create opportunities for communities to learn from each other and share best practices, leading to more innovative and effective solutions to local challenges.\nDespite these benefits, however, devolution can also present some challenges. In particular, there may be concerns about the capacity of local authorities to manage complex policy areas, as well as issues related to inter-jurisdictional coordination and financing. However these challenges can be addressed through effective planning and implementation, as well as through the provision of adequate support and resources to local authorities.\nBy empowering communities to take control of their own affairs, devolution can help to foster a greater sense of ownership and responsibility among local residents, leading to more vibrant and resilient communities. In this Cameron’s BIG Society was correct albeit poorly delivered however Devolution of power to local communities whilst remaining connected to the centre can deliver very meaning results.\nHere are some examples of the key successes of devolution in the UK:\n- Improved local decision-making: In Scotland, devolution has allowed the Scottish Parliament to introduce policies and services that are tailored to the specific needs and priorities of the Scottish people. For example, the Scottish Parliament has introduced free higher education for Scottish residents and has implemented policies to reduce health inequalities.\n- Enhanced collaboration and coordination: In Northern Ireland, devolution has facilitated greater collaboration and coordination between the Northern Ireland Executive and local councils, leading to more effective and efficient policy-making. For example, the Northern Ireland Executive has worked with local councils to develop a shared vision for the future of the region, which has helped to guide decision-making in key policy areas.\n- Increased accountability and transparency: In Wales, devolution has given the Welsh Assembly more control over the policy areas that affect the people of Wales. This has increased accountability and transparency in the political process, as the Welsh Assembly is accountable to the people of Wales for the decisions it makes.\n- Greater participation and engagement: In London, devolution has encouraged greater participation and engagement by local communities in the political process. For example, the London Mayor's Office has launched several initiatives to engage with local residents and businesses, including the \"Talk London\" platform, which provides a forum for Londoners to share their views on key issues.\n- Economic benefits: In some cases, devolution has also led to economic benefits. For example, the Manchester City Region, West Midlands and the West of England Combined Authority have seen significant investment in local infrastructure, including the development of new transport links and the construction of new housing. This has created jobs and boosted the local economy.\nBut what do we need to make sure the these successes are consistent and repeated rather than one off or ineffective?\n- Adequate resources and funding: In order to carry out their responsibilities effectively, local authorities need access to adequate resources and funding. This may require additional support from central governments, as well as the development of new financing mechanisms. Here regional and event localized social investment funds are offering a exciting new opportunity to delivered infrastructure through socially conscious private entities.\n- Capacity and expertise: Local authorities need to have the necessary capacity and expertise to manage complex policy areas and provide high-quality services to their communities. This may require investment in training and capacity-building programs for local officials. This should be budgeted for in devolution settlements to ensure that regions don’t go the same way as the BIG Society - good concept poor delivery.\n- Strong institutional frameworks: Devolution can only work effectively if there are strong institutional frameworks in place to support it. This may include clear lines of responsibility and accountability, as well as mechanisms for coordination and collaboration between different levels of government. The West of England Combined Authority has fallen victim to the lack of accountability and requisite leadership to bring together the necessary stakeholders under the correct frameworks resulting in woeful underperformance for the region.\n- Engagement and participation: Devolution is most effective when it is driven by the needs and priorities of local communities. This requires active engagement and participation by local residents in the decision-making process. This could be achieved through mechanism such as citizen assemblies or more organically but no less purposefully though elected councilors equipped to do the job.\n- Flexibility and adaptability: Devolution is not a one-size-fits-all approach, and local authorities need to be able to adapt to changing circumstances and respond to the unique needs of their communities. This requires a certain degree of flexibility and adaptability in the devolution process. There ought to be an ongoing and active dialogue between central government devolution investments and local authorities; Afterall the point ought to be to work as one unit contextualized to the local demographic.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_meeting-bristol-port-company/content_42.html": "Today (Monday 28th) I visited the Bristol Port Company and discussed the important work that they do. During my visit to their two key sites Portbury Docks and Avonmouth Docks we discussed the important role they play in not only Bristol’s economy but in the wider economy of the UK. The Bristol Port is one of the major importers and exporters of cars in the UK as well as helping to provide much of the animal feed to South West England.\nWe discussed the work the Port does to help reduce its environmental impact, such as it’s local wind turbines, investing in electric vehicles and minimising emissions. The Port works with other partners to increase recycling in the region by helping to convert household waste into reusable materials. We also discussed the community in and around the Port. I was hugely impressed by their commitment to local employment, apprenticeships and a job for life; as well as the onsite provision for the physical and mental health of staff. These are very positive actions from the Port as the recent pandemic has shown the importance of supporting and safeguarding our workforces.\nAfter the visit to the docks I held a joint meeting with West Of England Mayor, Tim Bowles where we reaffirmed our commitment to the port and discussed ways in which we can work closely together to help encourage a business friendly environment in the City and wider region.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_accessibility/content_26.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_campaigns_transport-connecting-our-region-accessing-opportunity/content_46.html": "Like many of you I grew up in the shadow of great monuments to innovation and connectivity, Brunel’s magnificent Clifton Suspension bridge, the grandeur of Temple Meads Station or the SS Great Britain. For me these windows into our regions past have been an inspiration to build upon and extend this great legacy, to ensure the West of England remains a byword for excellence in connectivity.\nHowever, it is abundantly clear that the current status quo is not good enough. We are fortunate to live in a complex mosaic of communities, both rural and urban, however whilst we are blessed in many ways, there is one thing these communities lack; connectivity. That is why I will launch a thorough, ‘no holds barred’ investigation into the future of transport across the West of England so that we can start delivering the future we all need.\nHaving grown up in rural Gloucestershire I am aware of the problems many face in getting around our region. Travelling from Thornbury to somewhere like Midsomer Norton has become more of a hardship than simply crossing the border into Wales. This needs to change. We cannot get left behind, or fail to access opportunities because of outdated infrastructure. We need a modern transport network that connects communities and prioritises pragmatism, not party politics.\nThat is why, I am outlining a practical and simple plan that caters for the entirety of our rural/urban region:\nI will introduce a digitally enabled and integrated transport network, meaning that for the first time all of us can cut through the confusion of bus times and rail timetables, putting your travel plans into your hands. Launching new ‘on-demand’ services will offer personalised transport for you, when you need it.\nI commit to mix mode highway improvements, that ensure our rural and sub-rural communities are connected to the services and opportunities we all want.\nVehicles are not an issue we should be afraid of, human caused carbon, air pollution and congestion are the issues we must combat and therefore providing a public transport system that is preferable to personal vehicles and working to decarbonise will out to us a new greener, cleaner and connected world.\nAs part of the MetroWest rail network I will deliver at least six new railway stations, built in Avonmouth, Ashley Down, Charfield, Henbury, North Filton and Portishead; much needed improvements and increased services. This will bring ‘turn-up and go’ services to people across the West of England, bring 80,000 more individuals closer to the railway network and creating more than 1 million extra journeys, whilst cutting congestion and helping residents get to decent, well paid jobs. A Labour mayor could scrap this project, leaving thousands left behind.\nIt is vital that we begin to drive towards decarbonisation. I celebrate the trails of initiatives such as the Voi electric scooters as a mode of urban travel and I will deliver a network of electric bikes, complemented by a new and innovative docking system. Further investment in our neighbours, traffic flow, park and rides and cycling and walking paths will create every opportunity for us to leave our cars at home and secure a greener and cleaner future.\nHowever, it is important that we take a holistic approach rooted in practical solutions. That is why as West of England Mayor I will not unduly penalise car owners but present a preferable mode of travel.\nThe Mayor of the West of England is the only person who is able to maintain a strategic overview of our whole region. To meet the needs of the whole region it is essential that we set a bold vision and deliver for our communities. Now is not the time to risk our recovery. Now is the time to secure our future progress.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_samuel-williams-selected-weca-mayoral-candidate/content_39.html": "I am delighted to announce that I will be standing as the Conservative candidate for the Mayor of the West of England Combined Authority. As a business leader and charity campaigner who lives in the south of Bristol, I believe I have a positive and dynamic vision for our region. I will support South Gloucestershire, Bristol and Bath & North East Somerset through the Covid economic recovery, I will strengthen our regions green credentials, secure the delivery of a free port in Avonmouth and ensure that towns, villages and rural areas are supported by building more train stations with better services.\nThe Combined Authority has a vital role to play in the continued Covid recovery, supporting businesses jobs and skills, particularly in our urban areas and I am keen to see our region go forward stronger than ever. Across WECA and the whole region we are well known for our ‘green’ credentials. I will prioritise the region becoming a leading light in growing an ecologically sustainable and commercially viable economy. With the establishment of a Collaborative Growth forum, business can develop a collaborative approach to regional growth alongside other stakeholders.\nHaving grown up just over the WECA border in rural Gloucestershire, I also know the impact of under supported rural areas and will make it a priority to ensure that towns, villages and rural areas are supported with better transport links. I will expand MetroBus, train and park and ride services to deliver this. The drive towards decarbonisation and reduced need for personal private vehicles is also a policy I fully support and will help to achieve as Mayor of the West of England. Greater investment in our high streets is also needed, ensuring that they have the necessary infrastructure they need to recover and grow.\nI want to thank Mayor Tim Bowles, who is standing down in May, for his dedicated work in establishing the authority from the ground up as well as strengthening our region. I will use the platform that he created to take the Authority to new heights, working closely with our neighbours and expanding the Authority to include North Somerset Council.\nHaving been selected as the Conservative candidate for Mayor of the West of England I will be stepping down as the Bristol Mayoral candidate. I look forward to working with my replacement and helping to elect more conservatives in our region.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_great-bristol-energy-debacle/content_28.html": "With the failings of this Labour city leadership negatively impacting the daily lives of so many of us, it is only reasonable that we are outraged by the mismanagement and weak leadership of Mayor Marvin Rees and his cabinet.\nA leadership that has stood-by whilst your hard-earned council tax contribution has been flittered away on the failing Bristol Energy company which has now had to be sold at great loss to the city.\nBristol Energy - the brain child of Mayor Ferguson - was launched to the public in 2016 with the intention of undercutting the big energy companies to provide Bristolians and those further afield with low cost gas and electricity. Whilst many of us recognise that the intention was good, the management of this highly risky council run enterprise has proved disastrous not only to the loss of jobs and the millions of pounds in public funds that could have been invested into our communities. The Bristol Energy debacle has highlighted the fact that Mayor Rees, who took office only months after the company started taking customers is out of his depth, doesn’t take decisive action, and has little regard for the people of Bristol who work hard to pay our council taxes that funded this catastrophic failure.\nOur communities have been hit by closing public conveniences, litter filled streets, rising crime rate, special educational needs services underfunded and poorly managed, thousands in need of housing, hundreds dying from polluted air and our economy fighting to survive the Covid-19 pandemic. Yet irrespective of these pressing social and economic needs, Bristolians money has been spent on a vanity project which ought to have been shut down years ago.\nWhilst you will hear Rees' administration pass the buck, the simple fact is that the great Bristol Energy experiment failed catastrophically, and your money has been lost entirely under the leadership of Labour’s mayor, Marvin Rees.\nBut don’t just believe me, let the figures speak for themselves:\n- Whilst Ferguson was mayor 6.3 million was invested into Bristol Energy\n- Labour's Mayor Rees has lost over 32 million and we’re still waiting for the final bill.\nDespite calls for transparency to understand what went wrong - Rees would not release the figures\nDespite calls for a public inquiry – the doors of city hall were firmly closed to the people of Bristol\nDespite calls for an apology – The blame gets passed everywhere but where it should fall, at the feet of Mayor Rees.\nAnd if the fate of this company was not clear enough, in 2018 Bristol Council even switched to British Gas. – Mayor Rees would not even use his own energy company but felt it was good enough for the rest of us.\nAfter bringing in the consultants, the Bristol Energy fire-sale has recouped 15.3 million, leaving a gaping hole in our cities public purse. Millions that could have been invested into safer streets, cleaner air, better education, sports and community facilities or the Covid-19 regeneration plan.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_equality-opportunity-party-social-reform/content_40.html": "If there is one thing, we all know it is that Conservatism is a politic for stale, outdated and self-serving quasi-aristocratic egomaniacs committed to preserving the status-quo…the leftist propaganda machine might say.\nIn fact Franklin D. Roosevelt said that \"A Conservative is a man with two perfectly good legs who, however, has never learned to walk forward.\" Opposed to innovation and progression and societal change.\nEven the conservative political theorist Michael Oakeshott characterised a conservative as someone who\nis to prefer the familiar to the unknown, to prefer the tried to the untried, fact to mystery, the actual to the possible, the limited to the unbounded, the near to the distant, the sufficient to the superabundant, the convenient to the perfect, present laughter to utopian bliss.\nIt should be no great surprise then that the Guardian publishes articles with titles such as ‘History Shows That Conservatives Can’t Hold Back Social Change’ - as if this is all Conservatives are seeking to do.\nHowever that faux-woke neo-Marxist messaging machine ought to actually stop to ask the question, Is it actually true that Conservatives are committed to preserving the status-quo; is it true that Conservatives prefer the actual to the possible; and are Conservatives opposed to social change as implied by Andy Beckett in his Guardian article?\nThe truth is the image of the Conservative as a dyed-in-the-wool social, political and moral traditionalist woefully misrepresents the rich heritage of conservative social reform and justice movements nurtured and flourished by the hands of Conservative politicians, activists and thinkers.\nLeft wing journalists have made a career out of tory-bashing and wokery and are well served by perpetuating anti-conservative propaganda despite it undermining the notion of free and fair press and with it the service journalists ought to play in safeguarding and supporting our democracy.\nWhilst it may come as a surprise to those blinded by the warm light of socialist fantasy, if one looks to almost any significant social reform; progressive, inclusive and aspirational policy in the past 200 years and you will find Conservatives at work to create a fairer country.\nTake Disraeli, an outsider and populist committed to giving voice to the masses when the masses had little voice in politics. Disraeli, of Jewish decent was a member of parliament from 1837 later becoming the leader of the Tory Party at a time when practicing Jews were forbidden from being a member of parliament, a travesty that continued until 1858 when the Jewish relief Act was passed. Beyond this Disraeli’s commitment to social reform is notable. The Factories Act safeguarded workers as well as restricted young children from these often-abusive work conditions. Furthermore, he pioneered improvements in housing, public health and slum clearances.\nPitt the younger and Wilberforce campaigned for the abolition of the slave trade, a law passed under Tory government.\nBaldwin and Chamberlain’s introduced pensions and benefits for the unemployed. Ahead of his time, Macmillan proposed a minimum wage, over 5 decades before one was eventually introduced. And by spreading the opportunity for home ownership and shared ownership to the poorest, the Thatcher government in the 1980s continued this tradition of giving people a real stake in society.\nDavid Cameron launched his flagship albeit somewhat fated ‘big society’ policy, committed to and devolving community services firmly into the hands of communities rather than the Westminster bubble. An inspired policy poorly executed, not least for the reason that those of us who almost overnight were handed the keys but neither training nor resources to run services such as libraries, youth clubs and communities’ centres quite simply didn’t know what we were doing. Training and resources were needed, something Barber’s Delivery Unit would have noted if only they had been maintained.\nTeresa May continued the Conservative social reforming tradition with her commitment to reforming issues such as gender equal parliament, and stop and search, stating that unless stop and arrest ratios improved, the stop and search powers of police, which disproportionately negatively impact black communities will be reduced.\nUnder the current Johnson government despite the overwhelming media focus, rightly, on Covid-19 vaccinations and delivering Brexit we are witnessing one of the most significant social reforming mandates in modern British politics. Where creating equality of opportunity especially for the most long-suffering underserved communities across the country is a central policy.\nA few weeks ago, my daughter was getting increasingly worked up because she could not find her glasses and the start of school was growing closer. After we had all run about the house looking in those most common spots like down the back of the sofa and on the bedside table, she laughed out loud because she realised, they were in fact on the top of her head. They were clear for all to see. The Conservative commitment to social reform is clear for all to see and it always has been. As a modern compassionate Conservative, I am immensely proud of this tradition and will work tirelessly to continue it. As for the propaganda machine, the greatest trick the left ever pulled was to convince the world that Tory’s are the nasty party. How wrong they truly are.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_bcfm-online-mayoral-hustings/content_29.html": "I recently took part in the BCfm online hustings.\nYou can watch me set out my case that Bristol deserves better.\n- We need a better transport system that cuts congestion\n- We need to champion protecting the environment and become a carbon negative council by 2030\n- We need to build homes and communities where people actually want to live\n- we need a better education system so young people are given the best start in life\n- we need a business friendly economy that works for all\n- we need to scrap the position of Mayor",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_campaigns_bin-blade-write-your-representative/content_21.html": "Write to Your Councillors, Mayor, PCC or MP\nTo see lasting change it is important that we raise our concerns with our elected representatives. Please use the template below to email your Councillors, Mayor, PCC or MP, raising your concerns about knife crime.\n- Write to your Councillors and MP here: WriteToThem\n- Write to Mark Shelford, Police and Crime commissioner here: [email protected]\n- Write to Marvin Rees, Mayor of Bristol here: [email protected]\n- Write to Dan Norris, Mayor for the West of England Combined Authority here: [email protected]\nDear___________\nI believe that Knife crime poses significant risk to the wellbeing of our communities. It sows fear between generations, communities and degrades cohesion. I believe that we must get tough of knife crime and commit to building a safer city.\nAs my elected representative I am writing to you to ask that you commit to doing everything within your influence and resource to end knife crime and implement the following actions:\n- Campaign for more stringent regulation at point of sale so as to dissuade purchases made with dangerous or illegal intent, and aid in the identification of perpetrators.\n- The introduction and strategic placement of ‘Knife Bins’ to enable the safe disposal of knives which risk being used in banned and illegal activities.\n- The introduction of catastrophic bleed kits in schools, colleges and potential high-risk areas such as pubs and clubs.\n- Emergency first aid training for catastrophic bleeding and knife inflicted wounds for all teachers in schools and colleges. In addition, first aid training for young people and community members to be made freely available.\n- The introduction of greater community, family and victim support services.\n- The introduction of early intervention mentoring programmes for at risk young people. Providing the mental, emotional, social, and physical support to enable well rounded citizens.\n- Greater investment into skills, training and apprenticeship opportunities for at risk young people to be introduced. Offering clear and real-world pathways from school into meaningful work.\nI thank you for your commitment in addressing this important issue and eagerly await your response. for further information and to pledge your support please visit Safer City: Bin The Blade Campaign | Samuel P. S. Williams (samuelwilliams.org.uk)\nYours faithfully",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_campaigns_business-innovation-and-economic-growth-we-mustnt-risk-our-recovery/content_43.html": "Years ago, I founded my own business in Bristol and like many fellow local business owners, I have been shocked by the lack of commercially minded leadership from our public leaders. When such innovation and expertise exists across the region our public servants should be listening learning and unlocking support so that business can get on with doing what it does best - creating wealth, jobs and opportunities for our whole region. In September last year the Labour led Bristol City Council sold Bristol Energy for £15 million, after racking up losses of over £40 million in the five years since it was set up. Many of us in the community shouldered this loss out of our pockets. As your Conservative Mayor of the West of England, I will plug the current fiscal leaks, ensuring that the wanton waste stops and that we have the business minded, fiscally responsible Conservative leadership that you all deserve. Investment of WECA funds will be tailored and targeted, delivering for the whole region, rather than for the personal pet projects.\nIn the West of England, we are blessed with an economy worth £38 Billion a year. It is time we unleash the potential right on our doorstep, by using joined up thinking to connect the tremendous assets we possess including the 45,000 businesses, to build a collaborative, clean and cutting-edge economy. I am the only leader that can realise this promise and unlock the West of England’s potential.\nAs your Mayor I will launch the Collaborative Future Business programme. I want to cut through the red tape to deliver cohesive and connected regional growth, that for too long has been shackled by political infighting or disjointed thinking. I want to deepen links with the West of England Gateway, and I will work tirelessly to secure a sizeable slice of the Conservative Government’s unprecedented regional investment initiatives.\nIt is vital that building back better mean fresh opportunities and not outdated solutions of the past. That is why I have pledged to launch the Building a Brighter World Innovation Award that will reward and encourage trailblazing innovation and ensure that the West of England can regain its rightful place as an international innovation hub As someone how has negotiated deals grown business internationally I am the only candidate with the experienced and business mindedness to secure the investment in our region that we need.\nI am acutely aware of the challenges the global pandemic has posed for many hardworking honest business people. I want to inject our entrepreneurs with optimism and set out a roadmap for recovery that steers well away from the pessimism of Labour politicians. That is why I will deliver the Rapid Redundancy Response Service and Talent Retention Scheme. This scheme will ensure that if businesses are forced to make redundancies, we can retain skills and talent in the region. furthermore, I will deliver over £100 Million of targeted support for businesses and skills over the next 4 years to foster long term sustainable growth and recovery.\nOur region is already world leading in creative industries, high tech and engineering innovations and we can continue to deliver growth as we innovate a greener and more prosperous future attracting inward investment, creating jobs and tackling the climate emergency.\nEconomic growth should benefit our whole region equally. 38% of our new innovations and enterprises are launched within our 50% most deprived communities. This type of innovation despite the odds acts as inspiration to us all. I will ensure our economic growth is fair and just by ‘Leading to level-up’ by boosting business growth programmes and funding through further supporting the Business Growth Hub. I will also build stronger community engagement through pioneering Community Ambassadors so that our multi-million pound investment in our region’s growth is open to and benefits us all.\nA vote for me is a vote for recovery. A vote for me is a vote to put money back in your pockets. A vote for me is a vote for the only business minded leader that can put the West of England’s economy back on the map. Let’s not risk our progress.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_discussing-colston-statue-imperial-voice-radio/content_31.html": "If you vote to stick with the plan. Conservatives will *DOUBLE free childcare.\nThis means parents will have access to *30 hours of free childcare* from the time their kids are 9 months old to the time they start school.\nIt's good for our economy and good for families.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_read-restoring-our-communities-means-restoring-representational-democracy/content_33.html": "Between 2019 and 2021 I was privileged to be selected as the Conservative candidate, first for the Bristol mayoralty and then, following the electoral postponements under covid-19, as the West of England Mayoral Candidate. Whilst I lost out on both - such is the ‘beauty of representative democracy’ -, under both positions I took every opportunity to meet as many different people and communities as I could. To my dismay I regularly encountered individuals and communities being left behind and underrepresented.\nIt is clear to me that if society is to work effectively then our elected representatives must be in the possession of three key requisites for success. That is, they must have the responsibility to speak, act and work for those they represent. This first requisite is fulfilled in their election because ‘the people’ - their local community - have spoken and placed upon them the responsibility to represent their interests. This is the core tenet of representative democracy.\nSecondly our representatives must have the resources to be able to do the job to which they are elected. This is not only financial but ought to be the wider ‘means’ of the public purse to serve us, the citizens. Lastly all our elected representatives ought to hold the right, or you may say ‘the power’, (although this doesn’t work so well for my alliteration) to make the changes needed. Whilst this latter requisite may seem obvious, and like the first appear to be innate to the position, it is unfortunately all too often not the case. No more so than under the current mayoral system operating within Bristol. Rather than the hopes and concerns of our communities being represented by those we elect to the very job. Councillors under the City Mayoralty are all too often little more than toothless figureheads atop a system bias to the will of the mayor.\nThis is not necessarily to state that the will of a mayor is corrupt, although it may be, but rather that the executive power of the mayoral system means that; put simply, the final say on almost everything goes to the mayor and not to councillors, not to communities and not to you. In other words, decisions about your communities are not made by those elected to represent your communities.\nSo what is the answer?\nWell certainly I support the introduction of citizens’ assemblies into the democratic make-up of local government decision-making across Bristol. I am committed to the idea that democracy must holistically express the views of those it represents – and for that to be achieved there must be an active willingness for decision-makers to listen and learn from all citizens and communities so that no one is left behind.\nAnd whilst citizens’ assemblies are politically en vogue, admittedly there are significant issues and chances for political bias to inform the process, such as who agrees the topics for discussion, what ‘experts’ are invited to contribute and ultimately what mechanisms are in place to hold the executive accountable to the findings of the assembly itself.\nCitizens’ assemblies at a local level are a valuable and, delivered correctly a desirable process. When akin to President Macron’s Grand Debat National in France, forming one part of our collective democratic conversation which includes online consultations, forums, public questions and representation by elected officials a rich grand tableau of local democracy beings to emerge.\nHowever It is particularly the latter, our elected representatives, that are so essential to holding the executive accountable to the voice of the people. And it is precisely this that is so difficult under the directly-elected mayoral system with a party-political biased cabinet. With powers only to basically ask the executive to think again or to call a matter to a full council meeting, scrutiny can easily fail to deliver any real results or hold an incumbent mayor to the will of citizens. By delivering a committee or leader and cabinet model, our city can benefit from the learnings of the great mayoral experiment but develop a representative cabinet committed to mutual accountability and deliberative public service which truly represent the people that government at all levels exist to serve.\nThis not the only issue with a mayoralty of Bristol. There is a far more obvious issue which we ought to acknowledge, that is the confusion of two elected mayors, with WECA and Bristol City both vying for government attention not infrequently to the cost of us all. As well as the unhelpful exclusionary thinking that suggests Bristol need not work with our neighbours in South Gloucestershire, Bath and North East Somerset and North Somerset, this 2 tiered mayoral system is often greeted with furrowed brow and perplexed look.\nThe West of England Mayoralty exists, with greater influence, to secure investment into our whole region so that as the whole region thrives, we might all benefit. The WECA Mayor is a figure head and catalyst for social and economic growth for Bristol and the whole region thereby delivering far greater results than any one particular representative council. If we are commitment to thriving businesses, job creation and cultural development; as well as communities served by local ward representatives we are undeniably better served by reforming our Bristol mayoral system and adopting an approach for local and regional unity. Sufficed to say this improved system must be a from what we have now.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_news_watch-samuel-speaks-bbc-points-west-about-knife-crime-and-need-tougher-laws/content_17.html": "Following an incident involving a knife being used the threaten Samuel he has since spoken with BBC Points West on what could be done to improve the situation.\nWatch more below.\nFollowing an incident involving a knife being used the threaten Samuel he has since spoken with BBC Points West on what could be done to improve the situation.\nWatch more below.",
  "https_www_samuelwilliams_org_uk_/https_www_samuelwilliams_org_uk_about-samuel-p-s-williams/content_2.html": "To me it is all quite simple - those who have ought to serve those who have not, and the truth is everyone has something that others do not therefore we must all play our part in this thing we call society.\nSamuel P. S. Williams is a British Conservative politician, businessman, and charity leader with a focus on international trade and development. He is the Conservative candidate for Bristol Central in the 2024 General Election.\nBefore being selected for Bristol Central, Williams ran as the Conservative candidate for Mayor of the West of England on May 6, 2021. He is a notable business leader and charity advocate, founding Hodos Consultancy Co., a consultancy dedicated to reforming traditional philanthropy and supporting social impact startups.\nRaised in rural Gloucestershire and homeschooled until age 11, Williams attended senior school in Cirencester and college in Cheltenham. Following in his grandfather's footsteps, he trained as an ordinand in the Church of England. He holds both undergraduate and postgraduate degrees from the University of Bristol, where he studied theology, restorative capitalism, and sustainable development.\nIn 2015, Williams founded Hodos Consultancy, collaborating with global firms and community-focused organizations, including Rolls Royce, Orange International, Heineken, Christian Aid, and CAFOD. With extensive experience in social impact investment and sustainable development, he has advised both UK and foreign governments. He played a key role in launching several ESG and climate adaptation and resilience investment funds and served as principal advisor for frontier markets impact investment for Catalytic Capital.\nHis dedication to international development and sustainable social investment is evident in his work across Africa, where he collaborates with senior business and government leaders to establish trade agreements and improve economic inclusion for disadvantaged communities. His efforts have taken him to Malawi, Zimbabwe, Ethiopia, Nigeria, Sierra Leone, Bangladesh, India, and more.\nSamuel's commitment to financial inclusion extends to his political activism, working to improve affordable credit provision and support the expansion of CDFIs and community banking. Passionate about education and being dyslexic himself, he advocates for additional SEND provision in both formal and informal schooling contexts. Samuel is also committed to maximizing the opportunities of the green industrial revolution and supports business innovations that address global climate challenges.\nWilliams founded BAMCON, the Black, Asian, and Minority Ethnic Conservative Forum, which later merged with the SW BAME Conservative Forum, where he serves as Chairman.\nSamuel Williams lives in Bedminster, Bristol, with his family."
}