{
  "https_robbryher_com_aboutrob_/https_robbryher_com_2018_01_31_neighbourhoodplanningessay/content_8.html": "Introduction\nThe introduction of neighbourhood planning (NP) has been met with critical discussion both inside and outside of planning literature. I will argue that NP processes have produced some positive participative practice but within a framework that does not allow for local autonomy or inclusive participative practice at the sub-local authority area. I will go on to recommend strategies for reforming the structures that have been put in place.\nWhat is neighbourhood planning?\nThe Conservative-Liberal Democrat Coalition Government (2010-15) introduced neighbourhood planning as part of the 2011 Localism Act (DCLG, 2011b). The preamble to the government’s neighbourhood planning guidance claims that NP “gives communities direct power”, allows them to “choose where they want new homes, shops and offices to be built” and provides “a powerful set of tools for local people to ensure that they get the right types of development for their community” (DCLG, 2014). Both academic and non-academic critique often includes the contention that the government has seen NP as a tool to encourage neighbourhoods to accept further development, particularly housing (Parker and Salter, 2017).\nIn direct practical terms, this new statutory power allows, in coordination with their local authority, any set of 21 citizens to become a “qualifying body”, designate a neighbourhood development plan area, write a neighbourhood development plan (NDP), put this plan out to consultation, have it assessed by an independent examiner, and then ask for the NDP to be approved by the local community through a referendum. NDP policies must conform with the Local Plan and the Government’s newly introduced National Planning Policy Framework (NPPF, 2012). The NDP then becomes a statutory part of the development plan, alongside the Local Plan for the area designated.\nParker et al (2015) suggest that NP is a significant statutory shift that local authorities cannot ignore and is unlikely to be abandoned. The 2011 Act was the culmination of a building political rhetoric around the terms localism and decentralisation for both government parties whilst in opposition, with Copus et al (2017) suggesting the localist political shift may relate to the effect of Scottish, Welsh and Northern Irish devolution on English provincial thinking. NP represents the first time a statutory right of this kind has been granted to communities at the sub-local authority area, but as we will now discuss is not the first instance of attempts to sub-localise the planning system.\nThe pre-2010 context of neighbourhood planning\nNP was thus a departure from the previous Labour government’s (1997-2010) policies if not its language of ‘new localism’. The unformalised ‘local strategic partnerships’ were the New Labour precursor of sorts to NP. However, specific sub-local authority governance structures such as parish councils and urban-based neighbourhood forums had hitherto not had any planning powers, leading to an unsatisfactory situation where local authorities could choose to adopt or ignore non-statutory sub-local plans (Gallent 2013). Parish Plans, produced since 2000, were an example of community-led planning used regularly prior to 2010, almost exclusively in rural areas. Parker and Murray (2012) state that pre-2010 consultations on these plans would “rarely carry quality criteria which are applied or enforced”. However, in April 2009, the Labour government did introduce a wide-ranging ‘duty to involve’ powers on local authorities (DCLG, 2008) and a Central-Local Concordat in conjunction with the LGA (HM Government and LGA, 2007, cited in Bailey and Elliott, 2009). The Coalition reforms can be said to, at least rhetorically, respond to New Labour’s ‘managerial’ localism (Sturzaker and Gordon, 2017), although Brookfield (2017) argues that the Coalition were echoing the New Labour rhetoric, and adopting a neo-liberal justification for localism.\nLocal autonomy’s non-existence\nPlanning literature in the aftermath of the 2011 Act refers largely to decentralisation and localism, rather than autonomy, perhaps for the reason that the former are concepts perceived as less political and more operational in orientation. There is no agreed definition of local autonomy within democratic theory, with Clark (1984) stating that its meaning “remains opaque”. However within the NP context we are clearly discussing any ‘autonomy’ that exists at the sub-local authority (i.e. neighbourhood) level. Internationally, the term ‘local autonomy’ is used synonymously with ‘local self-government’ (i.e. local government) with one 2014 assessment (see Ladner et al, 2016, 344) measuring the UK as 31st out of 39 European countries. Pratchett (2004) makes a strong claim that local autonomy and local democracy are conceptually not the same, with Clark (1984) defining two aspects of autonomy in governance terms. Immunity is “the power of localities to function free from the oversight authority of higher tiers of the state”. Initiative is “the power of localities to legislate and regulate the behaviour of residents”. These aspects are closely mirrored by Pratchett (2004) as “freedom from central interference” and “freedom to effect particular outcomes”, stating a further aspect, “reflection of local identity”, an addition that brings participatory governance into our analysis of autonomy’s definition. It’s clear that a qualifying body could affect particular outcomes in a positive way by delineating land use more specifically than its attendant Local Plan currently does. However, this does not in itself represent an autonomous state of affairs, merely an ability to change some aspects of the local authority’s development planning documentation in line with what already exists or will exist.\nI contend (under the auspices of traditional anarchist thought and the definitions of the aforementioned thinkers) that autonomy only exists independently of prescribed democratic and institutional structures, in arenas where local citizens make their own rules and practices, what Parker and Murray (2012) describe (from a non-anarchist perspective) as a “direct challenge to established decision-making models”. Indeed, Gallent (2013) differentiates democracy as a top-down, “provider-led” approach, and governance as a bottom-up approach (with the crucial caveat that it is liable to myopia and a lack of detail and coordination). The introduction, therefore, of NP can be said to have had a negligible effect on local autonomy, as NDPs are required to be submitted both to the local authority and the planning inspectorate (an executive agency of HM Government) for approval, as well as conforming closely and working within the Local Plan policies and the NPPF (Parker et al, 2015), with no variation on this pattern legally condoned. As local autonomous governance structures are thus only theoretically possible and currently non-existent, it is difficult to say whether “they” are constrained or not. Regardless, this conclusion does not preclude the possibility of improved public participation under NP, a subject to which we now turn.\nPublic participation in neighbourhood planning\nPublic participation has been part of planning law since the 1968 Town & Country Planning Act (HM Government, 1968), although it was almost immediately followed by the Skeffington Report (DoE, 1969) which critiqued the Act’s top-down solutions and recommended a far more neighbourhood-orientated approach (recommendations 1 and 2, appendix 1). Today, there are still charges that public participation can be tokenistic, with Parker and Murray (2012) describing participation opportunities as “little more than rhetorical bulwarks used by politicians seeking public support and legitimation for particular policies”. Certainly the Localism Act’s emphasis on delivering growth by a neo-liberal economic model could be characterised this way, but are there opportunities afforded by NP for authentic communicative practice?\nVigar et al (2017) posit two dominant schools of thought within communicative practice – a participative-deliberative tradition and a radical-agonistic one – suggesting that the latter is the dominant contemporary planning paradigm. Forester (1999) recognises the role of emotion in planning but takes the deliberative position, describing planners as crucial to facilitating any “joint gains” that can be made between “conflicting claimants” (p. 12-13).\nI agree with Parker et al (2015) that NP presents as a dialogic space (see Wegerif, 2016) of rational actors (see Rydin and Pennington’s (2000) five rational choice questions) but that in reality its public participation remit is limited and the design of its structures preclude agonist practice. Brookfield (2017) notes that planners are not ‘levelled down’ to the status of another stakeholder as is typically an interest of collaborative planning. Also, as Parker and Murray (2012, p.8) note, individuals don’t always act rationally or in some narrow self-interested sense, implying that some people engage if others (and particularly others ‘like them’) engage. Overall, for NP, “the benefits and problems of participation are likely to be mixed and fluid; reflecting the so-called fuzziness of neo-liberal institutions” (Parker et al, 2017). The design of NP, to which we now turn, is also one of the main factors in assessing NP’s public participation credentials.\nThe design of neighbourhood planning\nNeighbourhood planning has been communicated and legislated maximally but resourced minimally. The government’s 200 or so pilot areas each received £20,000 up front (Bailey and Pill, 2015). Up to £9,000 is available to qualifying bodies from DCLG through Locality’s website (2018), a sum which hypothetically allows payment of a living wage to a dedicated planning employee for a little over 27 weeks of full-time employment. The median time for an NDP to progress to referendum is 29 months (Parker and Salter, 2017), which makes it logistically unfeasible to offer anything other than part-time, freelance work to a planning consultant, who may or may not be able to work in the way that conveniences the designated neighbourhood forum (DNF). In one study (Parker et al, 2015), it was found that 69% of NDPs relied on consultant support. Staff resource from local authorities is not specified quantifiably in the legislation, so the DNF must negotiate support resources (DCLG, 2014). The local authority has responsibility for setting timetables and time limits, but the emphasis as regards advice and assistance is on what planning officers “consider appropriate” (which of course could be minimised to solely the aforementioned time factors) (DCLG, 2011b).\nThe concern expressed by some (e.g. Lord et al, 2017) about the risk of the de-professionalisation of planning comes to the fore in light of this design, with the overall neo-liberal framework not being hidden by the government (Parker et al, 2015) when they state that local authorities will have “more freedom to work with others in new ways to drive down costs” (DCLG, 2011a, p.7). Parker et al (2017) suggest that New Public Management theories lead to a “wider traducement of public sector planning” for a performative end. However, Brookfield (2017) notes two specific benefits for communities after an NDP has been adopted: the retention of 25% (as opposed to the regular 15%) of any Community Infrastructure Levy (CIL) raised on local development and (for plans that promote housing development) the New Homes Bonus, an unringfenced grant where government matches the Council Tax raised on each new home for six years. (Both positives are contingent, of course, on the NDP promoting rather than restraining development.) Parker (2017) also notes that local authorities receive a £30,000 ‘burdens’ payment on plan completion.\nAs regards inter-relational aspects of NP design, Davoudi and Cowie (2013) state that the self-selecting character of NP groups may result in the favouring of better educated, well-off and more vocal social groups who may have the time, capacity and inclination to engage. Although the NDP must go to referendum to be judged by the public, there are questions about the legitimacy of unelected bodies acting on behalf of the wider community before this occurs, particularly as the DNF proposes the extent of the area covered.\nOverall, there are some basic problems with NP design and with the necessity to conform to the Local Plan and NPPF, what Bailey and Pill (2015) call ‘framing and constraining’ activity. These tight controls on NDP content ensure that ideas, policies and priorities will be “rescripted” to ensure conformity, with their obligatory passage acting as a means of control on participants (Parker et al, 2015).\nThe application and practice of neighbourhood planning\nThe non-compulsory nature of NP will always mean patchwork rather than blanket coverage, with 2,228 projects applied for as of October 2017 and only 349 having been formally adopted into local development plans (Planning Resource, 2017), with only 10% of neighbourhoods who could have initiated NDPs doing so (Parker and Salter, 2017). Reasons for lack of uptake have been variously cited, but government assumptions about willingness and capacity, homogeneity and ability to put aside self-interest may also be a factor. The government’s professed light touch approach may have acted to create a degree of confusion rather than enable or expedite processes.\nThe government forecasts for overall take-up of NP, but not for regions or wider demographic factors (Parker and Salter, 2017). It is observable that the south (comprising just two of England’s nine regions) accounts for 41% of NP take-up (Parker and Salter, 2017). Only six of the neighbourhood areas to have passed referendum by October 2016 were in the 20% most deprived areas of England with 60.8% of plans being produced by those in the 40% least deprived areas (Parker and Salter, 2017). NP has undoubtedly been taken to more in rural, parished areas, although there are examples of large cities, such as Leeds (see Brookfield, 2017), taking a proactive approach, with council officers recommending to the executive board an overall approach to give equality of opportunity, although even in this instance there were participation challenges.\nOn the issue of whether NDPs have representational legitimacy, although 21 named local individuals are necessary to become a qualifying body, it has been noted (Parker et al, 2015) that a small group of people usually steer things, not the whole of the qualifying body or larger community. Davoudi and Cowie (2013) suggest that the key assessment criterion of this “symbolic representation” is the extent to which DNFs are accepted among local communities and trusted by them to draw up NDPs, highlighting the poor turnout at referenda as a sign of lack of acceptance, despite the figure (32.4%) being commensurate with local election turnout figures (Carpenter, 2016).\nThere are also clear examples of inequality of implementation. North Shields Fish Quay in North Tyneside was in 2011 part of the government’s ‘Frontrunner’ programme, but even after spending substantial time and effort on developing an NDP, opted instead to formulate a supplementary planning document as result of delayed guidance from government and the group’s “fatigue” (Parker and Salter, 2017).\nMore positively, some NDPs have taken the opportunity to advance socially and environmentally sustainable solutions, protect heritage assets, and ensure local housing needs, with slightly more control over the type, mix and location of new development than previously (Parker and Salter, 2017). The example of West Berkshire by Parker and Murray (2012) provides some clues for ensuring success. National funding was granted by the Countryside Agency and action was taken and resources allocated by the local authority chief executive, with the LA enjoying a good pre-existing reputation. This enabled trust to be built between the local authority and participants with a neutral agency (the Rural Community Council) providing a valuable brokering role. There is also evidence that – in contradistinction to my earlier analysis of funding – influence on LAs and a resulting access to resources and networks has emerged, an example of the ‘foot in the door’ thesis and allowing for “some limited orientation” (Parker et al, 2017). A counter-example in Exeter involved the DNF negotiation design changes of a development after their NDP adoption, but this could have been managed without the work going into the NDP, with the DNF opining that NP powers are “not as strong as promoted” (Lord et al, 2017) and that “the council did not have to consult us or check whether we were satisfied with their interpretation of neighbourhood plan policies…and they didn’t” (Sturzaker and Gordon, 2017). Blackpool and Manchester are also given as examples where NP has been said to have had negligible impact (Lord et al, 2017).\nParker et al (2015) report that more than two-thirds of people get involved with NP because they want more influence, greater say and to shape a local vision. By any reading, NP can be seen as a positive development in this regard, even if the process overall may struggle to meet these expectations. Parker et al (2017) show that “known co-production” (i.e. diverse actors working together on NDPs) is actually occurring. More critically, the government’s aim could be seen to be reducing local conflict through this consensus-building in order to increase housing supply (Gallent, 2013), although conversely a report from Turley (2014) found that the key theme of 55% of NDPs was the preservation and protection of what already exists (Lord et al, 2017). This suggests that NP may not currently be meeting government’s expectations.\nOn one analysis (Parker and Salter, 2015), it was recognised that planning skills were crucial but that for most groups the lack of this expertise delayed but didn’t prove fatal to their NDPs (Parker et al, 2015). The implication is that local authorities were then required to intervene or, for wealthier areas, private resources were utilised to fund a consultant tasked to plan-write. At this stage, community aspirations are likely to be rescripted into ‘planning language’, with some suggesting that this, combined with interactions with the local authority, led to a feeling of lost ownership. This “instruction from authority” and tendency for the instrumental pragmatism of “getting things done” can limit the “imagineering of alternatives” and has an effect on the rational choice realities mentioned earlier leading to a ‘why bother?’ result amongst some groups. Conservatism, self-regulation and self-censorship were observed in particular in the latter stages of the process (Parker et al, 2017).\nThere are instances where a Neighbourhood Development Plan (NDP) has informed a Local Plan (rather than vice versa), with over 1,138 areas being designated in areas with no up-to-date (post-NPPF) Local Plan (Parker and Salter, 2017). This represents an ability of DNFs to use NDPs to shape policy, and potentially re-opens our whole debate around local autonomy. The government guidance itself states that NDPs “can be developed before or at the same time as the local planning authority is producing its Local Plan”, yet simultaneously a draft NDP “must be in general conformity with the strategic policies of the development plan in force”, with additional guidance that qualifying bodies and local authorities should discuss and aim to agree the relationship between policies (DCLG, 2014). Anecdotally (Parker and Salter, 2017), some forums and parishes have slowed their processes to wait for a Local Plan to be adopted in order to know what policies they should follow. This ambiguity in precedence has been tested at examination, with one examiner comically citing Jean-Paul Sartre’s existentialism in defence of allowing an NDP to not conform to a non-existent Local Plan (Sturzaker and Gordon, 2017). In general, though, the LA-DNF relationship is characterised by Parker et al (2017) as a “critical dependency” rather than a “truly co-creative relationship”. Mutual exchange only delivers desired outcomes when there is trust, transparency and accountability and Gallent (2013) suggests that there is a structural hole that needs bridging by incidental mediators, giving the example of Ashford where housing (rather than planning) officers were effective at connecting group members to the local authority.\nSuperficially, it might be observed that a DNF’s powers can be described thus: “Although it cannot choose what to do, once given a specific task it can implement it in any way thought consistent with its tasks.” (Clark 1984, p. 201). Neighbourhood planning groups do choose what emphasis to take (if not exactly choosing what to do). Nevertheless, this gives the impression that their deliberations have a weight that the Localism Act ill affords them in terms of setting planning policy.\nParker et al’s (2015) assessment of their user experience study with Locality of 120 neighbourhoods uncovered a feeling that a local authority ‘duty to support’ needs to be operationalised through memoranda of understanding, which could set out clearer guidance for how to plan rather than just what to plan. The study also found that managing expectations and investing in the early stages to raise awareness in the community paid dividends. Parker et al (2017) believe the relations, knowledge and understanding built by NP may influence new forms of community engagement. More critically, Davoudi and Cowie (2013) argue that for inclusivity to improve we should consider not just how to incorporate marginal groups, but also how to limit the influence of privileged groups. Parker et al (2015) similarly query how we “proof” neighbourhood planning against dominant actors and a ‘managerialist’ consensus. Agonistic practice may have some of the answers in allowing dissensus to reveal power differences within the process (Vigar et al, 2017), but must be used sensitively by well-trained, ‘bridging’ mediators. The user experience study also noted the challenge of designating NP areas in urban settings, recommending a simplification of the process and more targeted, clear guidance for groups. The study also found that clarity around the referendum rules, consistency around resourcing, and clearer messages around the continuation of DNFs (with the view of reviewing or amending the NDPs) as further ways to practically improve the NP process (Parker et al, 2014).\nConclusion\nI have argued that neighbourhood planning does not act to constrict local autonomy, because local autonomy does not exist in the English democratic system at the sub-local authority level. Using Clark’s description of the concept of local autonomy, I have suggested that only a wholesale, near-revolutionary change in the British democratic system would allow for this conception to make sense on its own terms of “local self-rule”. NP is fundamentally a state-led and state-run activity, regardless of how specifically the initial bottom-up inception of processes occurs, as it is limited by both central and local state’s policy framework on what local communities can prescribe in their NDPs. However, this does not in itself preclude the possibility of public participation in NP.\nThere has been limited research thus far into the comparative uptake of local planning participation before and after the 2011 Act. Nevertheless, I have found substantive examples of neighbourhood planning producing forms of public participation which were hitherto unrealised. Even a mechanism so tightly scripted by state actors has the potential for delivering non-state actors’ priorities into local development schemes. My concerns with these processes are almost wholly to do with who is participating and how NP can be reformed and developed to ensure a greater breadth of uptake amongst diverse communities, urban areas and English “non-southern” regions. The cited example of Leeds gave me some hope that urban areas can respond to the current set-up through strong leadership to encourage a joined-up process at the local authority level.\nThus, I would contend that there is a need to directly link neighbourhood planning to strategic planning timetables, so that Local Plans and NDPs are concurrently produced. This could be linked to a statutory responsibility on all local authorities to review and consult on their Local Plan (a consolidated document covering all local and neighbourhood plans) every five years. This would dispel fears of a lack of consistency in a two-tier system (Lord et al, 2017), potentially widen the breadth of topics found in NDPs, and allow all councils to plan for ‘big bang’ engagement at regular intervals. Needless to say, this would require substantial financial investment and new revenue-raising powers for local authorities. It would be perceived as a retreat from ‘localism’ and a centralisation of power. However, to release greater participation and community dialogue (particularly in deprived areas), it is imperative that neighbourhood planning is well-resourced. This seems to be the only effective way to ensure a coherent planning system that allows local innovation, increased diverse and inclusive participation and outcomes that effectively and fairly balance local and national planning priorities.\nBibliography\nBailey, N. and Pill, M. (2015) Can the state empower communities through localism? An evaluation of recent approaches to neighbourhood governance in England. Environment and Planning C: Government and Policy, 33, pp.289–304\nBailey, S. and Elliott, M. (2009) Taking Local Government Seriously: democracy, autonomy and the constitution, Cambridge Law Journal, 68(2), pp. 436–472.\nBrookfield, K. (2017) Getting involved in plan-making: Participation in neighbourhood planning in England, Environment and Planning C: Politics and Space 2017, 35(3), pp. 397–416.\nCarpenter, B. (2016) Analysis finds average neighbourhood plan turnout of 32.4%. Available at: http://www.planningresource.co.uk/article/1406239/analysis-finds-average-neighbourhood-plan-turnout-324 [Accessed 8 January 2018]\nClark, G.L. (1984), A theory of local autonomy, Annals of the Association of American Geographers, 74(2), pp.195–208.\nCopus, C., Roberts, M and Wall, R. (2017) Local Government in England: Centralisation, Autonomy and Control. London: Palgrave MacMillan.\nDavoudi, S. & Cowie, P. (2013) Are English neighbourhood forums democratically legitimate? Planning Theory and Practice, 14(4), pp. 562–566.\nDavoudi, S. and Madanipour, A. (2013) Localism and neo-liberal governmentality, Town Planning Review, 84:5, pp. 551-561.\nDepartment for Communities and Local Government (2008) Communities in Control: real people, real power London: HM Government.\nDepartment for Communities and Local Government (2011) A Plain English Guide to the Localism Act. London: DCLG. Available at: https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/5959/1896534.pdf [Accessed 8 January 2018]\nDepartment for Communities and Local Government (2011) The Localism Act 2011. London: DCLG. Available at: http://www.legislation.gov.uk/ukpga/2011/20/schedule/10/enacted [Accessed 8 January 2018]\nDepartment of the Environment (1969) People and Planning: Report on the Committee on Public Participation in Planning. London: HM Stationery Office, pp. 51-53.\nForester, J. (1999) The Deliberative Practitioner: Encouraging Participatory Planning Processes, The MIT Press, Cambridge, Massachusetts, London, England\nGallent, N. (2013), ‘Re-connecting “people and planning”: parish plans and the English localism agenda’, Town Planning Review, 84, pp. 371–96.\nHM Government (1968) Town & Country Planning Act 1968. London: HM Stationery Office. Available at: http://www.legislation.gov.uk/ukpga/1968/72/contents/enacted [Accessed 8 January 2018]\nHM Government and Local Government Association (2007), Central-Local Concordat. Available at: http://webarchive.nationalarchives.gov.uk/20100403032639/http://www.communities.gov.uk/documents/localgovernment/pdf/601000.pdf [Accessed 7 January 2018]\nLadner, A., Keuffer N. and Baldersheim, H. (2016) Measuring Local Autonomy in 39 Countries (1990–2014), Regional & Federal Studies, 26:3, pp. 321-357.\nLocality (2018) Neighbourhood planning. Available at: http://locality.org.uk/projects/building-community/ [Accessed 8 January 2018]\nLord, A., Mair, M., Sturzaker, J., and Jones, P. (2017) ‘The planners’ dream goes wrong?’ Questioning citizen-centred planning, Local Government Studies, 43:3, pp. 344-363.\nParker G. (2017), The uneven geographies of neighbourhood planning in England. In: Brownill, S. and Bradley Q., eds., Localism and neighbourhood planning: Power to the people?, pp. 75-91.\nParker, G., Lynn, T. and Wargent, M. (2015) Sticking to the script? The co-production of neighbourhood planning in England, Town Planning Review, 86:5, pp. 519-535.\nParker, G., Lynn, T. & Wargent, M. (2017) Contestation and conservatism in neighbourhood planning in England: reconciling agonism and collaboration?, Planning Theory & Practice, 18:3, pp. 446-465.\nParker, G., Lynn, T., Wargent, M. and Locality (2014), User Experience of Neighbourhood Planning, published report, October 2014, London, Locality.\nParker, G. & Murray, C. (2012) Beyond tokenism? Community-led planning and rational choices: Findings from participants in local agenda-setting at the neighbourhood scale in England. Town Planning Review, 83(1), pp. 1–28.\nParker, G. and Salter, K. (2017) Taking Stock of Neighbourhood Planning in England 2011–2016, Planning Practice & Research, 32:4, pp. 478-490.\nPlanning Resource (2017) Map: neighbourhood plan applications. Available at: http://www.planningresource.co.uk/article/1212813/map-neighbourhood-plan-applications [Accessed 8 January 2018]\nPratchett, L. (2004), Local autonomy, local democracy and the ‘new localism’, Political Studies, 52, pp.358–375.\nRydin, Y. and Pennington, M. (2000) Public Participation and Local Environmental Planning: The collective action problem and the potential of social capital, Local Environment, 5:2, pp. 153-169\nSturzaker, J and Gordon, M. (2017) Democratic tensions in decentralised planning – Rhetoric, legislation and reality in England. Environment and Planning C: Politics and Space, 35(7), pp. 1324-1339.\nTurley Associates (2014). Neighbourhood Planning – Plan and Deliver? London: Turley Associates, London.\nVigar, G. Gunn, S. and Brooks, E. (2017) Governing our neighbours: participation and conflict in neighbourhood planning, Town Planning Review, 88(4), pp. 423-442.\nWegerif, R. (2016) What is dialogic space? Available at: http://www.rupertwegerif.name/blog/what-is-dialogic-space [Accessed 5 January 2018]",
  "https_robbryher_com_aboutrob_/https_robbryher_com_aboutrob_312936143_430641325907894_2728843171214445579_n/content_4.html": "Skip to content\nRob Bryher\nGreen Party Councillor for St George West, Bristol\n☰ Menu\nWays to keep in contact\nWhat I’ve been doing\nAbout Rob\n312936143_430641325907894_2728843171214445579_n\nLike\nLoading...\nLeave a comment\nCancel reply\nΔ\nSubscribe\nSubscribed\nRob Bryher\nSign me up\nAlready have a WordPress.com account?\nLog in now.\nPrivacy\nRob Bryher\nSubscribe\nSubscribed\nSign up\nLog in\nCopy shortlink\nReport this content\nView post in Reader\nManage subscriptions\nCollapse this bar\n%d\nDesign a site like this with WordPress.com\nGet started",
  "https_robbryher_com_aboutrob_/https_robbryher_com_socials/content_3.html": "You can get in contact with me in the following ways:\n- cllr.rob.bryher@bristol.gov.uk – this email address is for all general enquiries, but particularly for St George West residents who need help with a problem or want to bring something to my attention (i.e. casework).\n- 07386698740 – this is my council phone number. For complex casework enquiries, it’s always far better to write it down and email it to me so that I can immediately take action on it.\n- Bluesky (updated daily): https://bsky.app/profile/robbryher.bsky.social\n- Facebook (updated regularly with my main news): https://www.facebook.com/RobBryher\n- E-newsletter sign-up form (sent once a month): http://eepurl.com/iy4z8o\n- “What I’ve been doing” website page (updated every four months): https://robbryher.com/whatrobdoes/\n- I also have pages on the Bristol City Council website and the Bristol Green Party website.\n- I also hold regular councillor surgeries for residents of St George West. Drop-in at any time during the times shown. No appointment necessary:\n- Every 1st Tuesday of the month, 11am to 12 noon, Beehive Centre reception, 19A Stretford Road, BS5 7AW\n- Every 2nd Wednesday of the month, 1 to 2pm, St George Library, Church Road, BS5 8AL.",
  "https_robbryher_com_aboutrob_/https_robbryher_com_author_robertjessetelford/content_6.html": "I’m giving this website a bit of a refresh with a focus on my and the Green team’s campaigning in St George West ward.\nAuthor: robertjessetelford\nThe design and application of neighbourhood planning in England acts effectively to constrain local autonomy and inhibit public participation in planning. Discuss.\nIntroduction\nThe introduction of neighbourhood planning (NP) has been met with critical discussion both inside and outside of planning literature. I will argue that NP processes have produced some positive participative practice but within a framework that does not allow for local autonomy or inclusive participative practice at the sub-local authority area. I will go on to recommend strategies for reforming the structures that have been put in place.\nWhat is neighbourhood planning?\nThe Conservative-Liberal Democrat Coalition Government (2010-15) introduced neighbourhood planning as part of the 2011 Localism Act (DCLG, 2011b). The preamble to the government’s neighbourhood planning guidance claims that NP “gives communities direct power”, allows them to “choose where they want new homes, shops and offices to be built” and provides “a powerful set of tools for local people to ensure that they get the right types of development for their community” (DCLG, 2014). Both academic and non-academic critique often includes the contention that the government has seen NP as a tool to encourage neighbourhoods to accept further development, particularly housing (Parker and Salter, 2017).\nIn direct practical terms, this new statutory power allows, in coordination with their local authority, any set of 21 citizens to become a “qualifying body”, designate a neighbourhood development plan area, write a neighbourhood development plan (NDP), put this plan out to consultation, have it assessed by an independent examiner, and then ask for the NDP to be approved by the local community through a referendum. NDP policies must conform with the Local Plan and the Government’s newly introduced National Planning Policy Framework (NPPF, 2012). The NDP then becomes a statutory part of the development plan, alongside the Local Plan for the area designated.\nParker et al (2015) suggest that NP is a significant statutory shift that local authorities cannot ignore and is unlikely to be abandoned. The 2011 Act was the culmination of a building political rhetoric around the terms localism and decentralisation for both government parties whilst in opposition, with Copus et al (2017) suggesting the localist political shift may relate to the effect of Scottish, Welsh and Northern Irish devolution on English provincial thinking. NP represents the first time a statutory right of this kind has been granted to communities at the sub-local authority area, but as we will now discuss is not the first instance of attempts to sub-localise the planning system.\nThe pre-2010 context of neighbourhood planning\nNP was thus a departure from the previous Labour government’s (1997-2010) policies if not its language of ‘new localism’. The unformalised ‘local strategic partnerships’ were the New Labour precursor of sorts to NP. However, specific sub-local authority governance structures such as parish councils and urban-based neighbourhood forums had hitherto not had any planning powers, leading to an unsatisfactory situation where local authorities could choose to adopt or ignore non-statutory sub-local plans (Gallent 2013). Parish Plans, produced since 2000, were an example of community-led planning used regularly prior to 2010, almost exclusively in rural areas. Parker and Murray (2012) state that pre-2010 consultations on these plans would “rarely carry quality criteria which are applied or enforced”. However, in April 2009, the Labour government did introduce a wide-ranging ‘duty to involve’ powers on local authorities (DCLG, 2008) and a Central-Local Concordat in conjunction with the LGA (HM Government and LGA, 2007, cited in Bailey and Elliott, 2009). The Coalition reforms can be said to, at least rhetorically, respond to New Labour’s ‘managerial’ localism (Sturzaker and Gordon, 2017), although Brookfield (2017) argues that the Coalition were echoing the New Labour rhetoric, and adopting a neo-liberal justification for localism.\nLocal autonomy’s non-existence\nPlanning literature in the aftermath of the 2011 Act refers largely to decentralisation and localism, rather than autonomy, perhaps for the reason that the former are concepts perceived as less political and more operational in orientation. There is no agreed definition of local autonomy within democratic theory, with Clark (1984) stating that its meaning “remains opaque”. However within the NP context we are clearly discussing any ‘autonomy’ that exists at the sub-local authority (i.e. neighbourhood) level. Internationally, the term ‘local autonomy’ is used synonymously with ‘local self-government’ (i.e. local government) with one 2014 assessment (see Ladner et al, 2016, 344) measuring the UK as 31st out of 39 European countries. Pratchett (2004) makes a strong claim that local autonomy and local democracy are conceptually not the same, with Clark (1984) defining two aspects of autonomy in governance terms. Immunity is “the power of localities to function free from the oversight authority of higher tiers of the state”. Initiative is “the power of localities to legislate and regulate the behaviour of residents”. These aspects are closely mirrored by Pratchett (2004) as “freedom from central interference” and “freedom to effect particular outcomes”, stating a further aspect, “reflection of local identity”, an addition that brings participatory governance into our analysis of autonomy’s definition. It’s clear that a qualifying body could affect particular outcomes in a positive way by delineating land use more specifically than its attendant Local Plan currently does. However, this does not in itself represent an autonomous state of affairs, merely an ability to change some aspects of the local authority’s development planning documentation in line with what already exists or will exist.\nI contend (under the auspices of traditional anarchist thought and the definitions of the aforementioned thinkers) that autonomy only exists independently of prescribed democratic and institutional structures, in arenas where local citizens make their own rules and practices, what Parker and Murray (2012) describe (from a non-anarchist perspective) as a “direct challenge to established decision-making models”. Indeed, Gallent (2013) differentiates democracy as a top-down, “provider-led” approach, and governance as a bottom-up approach (with the crucial caveat that it is liable to myopia and a lack of detail and coordination). The introduction, therefore, of NP can be said to have had a negligible effect on local autonomy, as NDPs are required to be submitted both to the local authority and the planning inspectorate (an executive agency of HM Government) for approval, as well as conforming closely and working within the Local Plan policies and the NPPF (Parker et al, 2015), with no variation on this pattern legally condoned. As local autonomous governance structures are thus only theoretically possible and currently non-existent, it is difficult to say whether “they” are constrained or not. Regardless, this conclusion does not preclude the possibility of improved public participation under NP, a subject to which we now turn.\nPublic participation in neighbourhood planning\nPublic participation has been part of planning law since the 1968 Town & Country Planning Act (HM Government, 1968), although it was almost immediately followed by the Skeffington Report (DoE, 1969) which critiqued the Act’s top-down solutions and recommended a far more neighbourhood-orientated approach (recommendations 1 and 2, appendix 1). Today, there are still charges that public participation can be tokenistic, with Parker and Murray (2012) describing participation opportunities as “little more than rhetorical bulwarks used by politicians seeking public support and legitimation for particular policies”. Certainly the Localism Act’s emphasis on delivering growth by a neo-liberal economic model could be characterised this way, but are there opportunities afforded by NP for authentic communicative practice?\nVigar et al (2017) posit two dominant schools of thought within communicative practice – a participative-deliberative tradition and a radical-agonistic one – suggesting that the latter is the dominant contemporary planning paradigm. Forester (1999) recognises the role of emotion in planning but takes the deliberative position, describing planners as crucial to facilitating any “joint gains” that can be made between “conflicting claimants” (p. 12-13).\nI agree with Parker et al (2015) that NP presents as a dialogic space (see Wegerif, 2016) of rational actors (see Rydin and Pennington’s (2000) five rational choice questions) but that in reality its public participation remit is limited and the design of its structures preclude agonist practice. Brookfield (2017) notes that planners are not ‘levelled down’ to the status of another stakeholder as is typically an interest of collaborative planning. Also, as Parker and Murray (2012, p.8) note, individuals don’t always act rationally or in some narrow self-interested sense, implying that some people engage if others (and particularly others ‘like them’) engage. Overall, for NP, “the benefits and problems of participation are likely to be mixed and fluid; reflecting the so-called fuzziness of neo-liberal institutions” (Parker et al, 2017). The design of NP, to which we now turn, is also one of the main factors in assessing NP’s public participation credentials.\nThe design of neighbourhood planning\nNeighbourhood planning has been communicated and legislated maximally but resourced minimally. The government’s 200 or so pilot areas each received £20,000 up front (Bailey and Pill, 2015). Up to £9,000 is available to qualifying bodies from DCLG through Locality’s website (2018), a sum which hypothetically allows payment of a living wage to a dedicated planning employee for a little over 27 weeks of full-time employment. The median time for an NDP to progress to referendum is 29 months (Parker and Salter, 2017), which makes it logistically unfeasible to offer anything other than part-time, freelance work to a planning consultant, who may or may not be able to work in the way that conveniences the designated neighbourhood forum (DNF). In one study (Parker et al, 2015), it was found that 69% of NDPs relied on consultant support. Staff resource from local authorities is not specified quantifiably in the legislation, so the DNF must negotiate support resources (DCLG, 2014). The local authority has responsibility for setting timetables and time limits, but the emphasis as regards advice and assistance is on what planning officers “consider appropriate” (which of course could be minimised to solely the aforementioned time factors) (DCLG, 2011b).\nThe concern expressed by some (e.g. Lord et al, 2017) about the risk of the de-professionalisation of planning comes to the fore in light of this design, with the overall neo-liberal framework not being hidden by the government (Parker et al, 2015) when they state that local authorities will have “more freedom to work with others in new ways to drive down costs” (DCLG, 2011a, p.7). Parker et al (2017) suggest that New Public Management theories lead to a “wider traducement of public sector planning” for a performative end. However, Brookfield (2017) notes two specific benefits for communities after an NDP has been adopted: the retention of 25% (as opposed to the regular 15%) of any Community Infrastructure Levy (CIL) raised on local development and (for plans that promote housing development) the New Homes Bonus, an unringfenced grant where government matches the Council Tax raised on each new home for six years. (Both positives are contingent, of course, on the NDP promoting rather than restraining development.) Parker (2017) also notes that local authorities receive a £30,000 ‘burdens’ payment on plan completion.\nAs regards inter-relational aspects of NP design, Davoudi and Cowie (2013) state that the self-selecting character of NP groups may result in the favouring of better educated, well-off and more vocal social groups who may have the time, capacity and inclination to engage. Although the NDP must go to referendum to be judged by the public, there are questions about the legitimacy of unelected bodies acting on behalf of the wider community before this occurs, particularly as the DNF proposes the extent of the area covered.\nOverall, there are some basic problems with NP design and with the necessity to conform to the Local Plan and NPPF, what Bailey and Pill (2015) call ‘framing and constraining’ activity. These tight controls on NDP content ensure that ideas, policies and priorities will be “rescripted” to ensure conformity, with their obligatory passage acting as a means of control on participants (Parker et al, 2015).\nThe application and practice of neighbourhood planning\nThe non-compulsory nature of NP will always mean patchwork rather than blanket coverage, with 2,228 projects applied for as of October 2017 and only 349 having been formally adopted into local development plans (Planning Resource, 2017), with only 10% of neighbourhoods who could have initiated NDPs doing so (Parker and Salter, 2017). Reasons for lack of uptake have been variously cited, but government assumptions about willingness and capacity, homogeneity and ability to put aside self-interest may also be a factor. The government’s professed light touch approach may have acted to create a degree of confusion rather than enable or expedite processes.\nThe government forecasts for overall take-up of NP, but not for regions or wider demographic factors (Parker and Salter, 2017). It is observable that the south (comprising just two of England’s nine regions) accounts for 41% of NP take-up (Parker and Salter, 2017). Only six of the neighbourhood areas to have passed referendum by October 2016 were in the 20% most deprived areas of England with 60.8% of plans being produced by those in the 40% least deprived areas (Parker and Salter, 2017). NP has undoubtedly been taken to more in rural, parished areas, although there are examples of large cities, such as Leeds (see Brookfield, 2017), taking a proactive approach, with council officers recommending to the executive board an overall approach to give equality of opportunity, although even in this instance there were participation challenges.\nOn the issue of whether NDPs have representational legitimacy, although 21 named local individuals are necessary to become a qualifying body, it has been noted (Parker et al, 2015) that a small group of people usually steer things, not the whole of the qualifying body or larger community. Davoudi and Cowie (2013) suggest that the key assessment criterion of this “symbolic representation” is the extent to which DNFs are accepted among local communities and trusted by them to draw up NDPs, highlighting the poor turnout at referenda as a sign of lack of acceptance, despite the figure (32.4%) being commensurate with local election turnout figures (Carpenter, 2016).\nThere are also clear examples of inequality of implementation. North Shields Fish Quay in North Tyneside was in 2011 part of the government’s ‘Frontrunner’ programme, but even after spending substantial time and effort on developing an NDP, opted instead to formulate a supplementary planning document as result of delayed guidance from government and the group’s “fatigue” (Parker and Salter, 2017).\nMore positively, some NDPs have taken the opportunity to advance socially and environmentally sustainable solutions, protect heritage assets, and ensure local housing needs, with slightly more control over the type, mix and location of new development than previously (Parker and Salter, 2017). The example of West Berkshire by Parker and Murray (2012) provides some clues for ensuring success. National funding was granted by the Countryside Agency and action was taken and resources allocated by the local authority chief executive, with the LA enjoying a good pre-existing reputation. This enabled trust to be built between the local authority and participants with a neutral agency (the Rural Community Council) providing a valuable brokering role. There is also evidence that – in contradistinction to my earlier analysis of funding – influence on LAs and a resulting access to resources and networks has emerged, an example of the ‘foot in the door’ thesis and allowing for “some limited orientation” (Parker et al, 2017). A counter-example in Exeter involved the DNF negotiation design changes of a development after their NDP adoption, but this could have been managed without the work going into the NDP, with the DNF opining that NP powers are “not as strong as promoted” (Lord et al, 2017) and that “the council did not have to consult us or check whether we were satisfied with their interpretation of neighbourhood plan policies…and they didn’t” (Sturzaker and Gordon, 2017). Blackpool and Manchester are also given as examples where NP has been said to have had negligible impact (Lord et al, 2017).\nParker et al (2015) report that more than two-thirds of people get involved with NP because they want more influence, greater say and to shape a local vision. By any reading, NP can be seen as a positive development in this regard, even if the process overall may struggle to meet these expectations. Parker et al (2017) show that “known co-production” (i.e. diverse actors working together on NDPs) is actually occurring. More critically, the government’s aim could be seen to be reducing local conflict through this consensus-building in order to increase housing supply (Gallent, 2013), although conversely a report from Turley (2014) found that the key theme of 55% of NDPs was the preservation and protection of what already exists (Lord et al, 2017). This suggests that NP may not currently be meeting government’s expectations.\nOn one analysis (Parker and Salter, 2015), it was recognised that planning skills were crucial but that for most groups the lack of this expertise delayed but didn’t prove fatal to their NDPs (Parker et al, 2015). The implication is that local authorities were then required to intervene or, for wealthier areas, private resources were utilised to fund a consultant tasked to plan-write. At this stage, community aspirations are likely to be rescripted into ‘planning language’, with some suggesting that this, combined with interactions with the local authority, led to a feeling of lost ownership. This “instruction from authority” and tendency for the instrumental pragmatism of “getting things done” can limit the “imagineering of alternatives” and has an effect on the rational choice realities mentioned earlier leading to a ‘why bother?’ result amongst some groups. Conservatism, self-regulation and self-censorship were observed in particular in the latter stages of the process (Parker et al, 2017).\nThere are instances where a Neighbourhood Development Plan (NDP) has informed a Local Plan (rather than vice versa), with over 1,138 areas being designated in areas with no up-to-date (post-NPPF) Local Plan (Parker and Salter, 2017). This represents an ability of DNFs to use NDPs to shape policy, and potentially re-opens our whole debate around local autonomy. The government guidance itself states that NDPs “can be developed before or at the same time as the local planning authority is producing its Local Plan”, yet simultaneously a draft NDP “must be in general conformity with the strategic policies of the development plan in force”, with additional guidance that qualifying bodies and local authorities should discuss and aim to agree the relationship between policies (DCLG, 2014). Anecdotally (Parker and Salter, 2017), some forums and parishes have slowed their processes to wait for a Local Plan to be adopted in order to know what policies they should follow. This ambiguity in precedence has been tested at examination, with one examiner comically citing Jean-Paul Sartre’s existentialism in defence of allowing an NDP to not conform to a non-existent Local Plan (Sturzaker and Gordon, 2017). In general, though, the LA-DNF relationship is characterised by Parker et al (2017) as a “critical dependency” rather than a “truly co-creative relationship”. Mutual exchange only delivers desired outcomes when there is trust, transparency and accountability and Gallent (2013) suggests that there is a structural hole that needs bridging by incidental mediators, giving the example of Ashford where housing (rather than planning) officers were effective at connecting group members to the local authority.\nSuperficially, it might be observed that a DNF’s powers can be described thus: “Although it cannot choose what to do, once given a specific task it can implement it in any way thought consistent with its tasks.” (Clark 1984, p. 201). Neighbourhood planning groups do choose what emphasis to take (if not exactly choosing what to do). Nevertheless, this gives the impression that their deliberations have a weight that the Localism Act ill affords them in terms of setting planning policy.\nParker et al’s (2015) assessment of their user experience study with Locality of 120 neighbourhoods uncovered a feeling that a local authority ‘duty to support’ needs to be operationalised through memoranda of understanding, which could set out clearer guidance for how to plan rather than just what to plan. The study also found that managing expectations and investing in the early stages to raise awareness in the community paid dividends. Parker et al (2017) believe the relations, knowledge and understanding built by NP may influence new forms of community engagement. More critically, Davoudi and Cowie (2013) argue that for inclusivity to improve we should consider not just how to incorporate marginal groups, but also how to limit the influence of privileged groups. Parker et al (2015) similarly query how we “proof” neighbourhood planning against dominant actors and a ‘managerialist’ consensus. Agonistic practice may have some of the answers in allowing dissensus to reveal power differences within the process (Vigar et al, 2017), but must be used sensitively by well-trained, ‘bridging’ mediators. The user experience study also noted the challenge of designating NP areas in urban settings, recommending a simplification of the process and more targeted, clear guidance for groups. The study also found that clarity around the referendum rules, consistency around resourcing, and clearer messages around the continuation of DNFs (with the view of reviewing or amending the NDPs) as further ways to practically improve the NP process (Parker et al, 2014).\nConclusion\nI have argued that neighbourhood planning does not act to constrict local autonomy, because local autonomy does not exist in the English democratic system at the sub-local authority level. Using Clark’s description of the concept of local autonomy, I have suggested that only a wholesale, near-revolutionary change in the British democratic system would allow for this conception to make sense on its own terms of “local self-rule”. NP is fundamentally a state-led and state-run activity, regardless of how specifically the initial bottom-up inception of processes occurs, as it is limited by both central and local state’s policy framework on what local communities can prescribe in their NDPs. However, this does not in itself preclude the possibility of public participation in NP.\nThere has been limited research thus far into the comparative uptake of local planning participation before and after the 2011 Act. Nevertheless, I have found substantive examples of neighbourhood planning producing forms of public participation which were hitherto unrealised. Even a mechanism so tightly scripted by state actors has the potential for delivering non-state actors’ priorities into local development schemes. My concerns with these processes are almost wholly to do with who is participating and how NP can be reformed and developed to ensure a greater breadth of uptake amongst diverse communities, urban areas and English “non-southern” regions. The cited example of Leeds gave me some hope that urban areas can respond to the current set-up through strong leadership to encourage a joined-up process at the local authority level.\nThus, I would contend that there is a need to directly link neighbourhood planning to strategic planning timetables, so that Local Plans and NDPs are concurrently produced. This could be linked to a statutory responsibility on all local authorities to review and consult on their Local Plan (a consolidated document covering all local and neighbourhood plans) every five years. This would dispel fears of a lack of consistency in a two-tier system (Lord et al, 2017), potentially widen the breadth of topics found in NDPs, and allow all councils to plan for ‘big bang’ engagement at regular intervals. Needless to say, this would require substantial financial investment and new revenue-raising powers for local authorities. It would be perceived as a retreat from ‘localism’ and a centralisation of power. However, to release greater participation and community dialogue (particularly in deprived areas), it is imperative that neighbourhood planning is well-resourced. This seems to be the only effective way to ensure a coherent planning system that allows local innovation, increased diverse and inclusive participation and outcomes that effectively and fairly balance local and national planning priorities.\nBibliography\nBailey, N. and Pill, M. (2015) Can the state empower communities through localism? An evaluation of recent approaches to neighbourhood governance in England. Environment and Planning C: Government and Policy, 33, pp.289–304\nBailey, S. and Elliott, M. (2009) Taking Local Government Seriously: democracy, autonomy and the constitution, Cambridge Law Journal, 68(2), pp. 436–472.\nBrookfield, K. (2017) Getting involved in plan-making: Participation in neighbourhood planning in England, Environment and Planning C: Politics and Space 2017, 35(3), pp. 397–416.\nCarpenter, B. (2016) Analysis finds average neighbourhood plan turnout of 32.4%. Available at: http://www.planningresource.co.uk/article/1406239/analysis-finds-average-neighbourhood-plan-turnout-324 [Accessed 8 January 2018]\nClark, G.L. (1984), A theory of local autonomy, Annals of the Association of American Geographers, 74(2), pp.195–208.\nCopus, C., Roberts, M and Wall, R. (2017) Local Government in England: Centralisation, Autonomy and Control. London: Palgrave MacMillan.\nDavoudi, S. & Cowie, P. (2013) Are English neighbourhood forums democratically legitimate? Planning Theory and Practice, 14(4), pp. 562–566.\nDavoudi, S. and Madanipour, A. (2013) Localism and neo-liberal governmentality, Town Planning Review, 84:5, pp. 551-561.\nDepartment for Communities and Local Government (2008) Communities in Control: real people, real power London: HM Government.\nDepartment for Communities and Local Government (2011) A Plain English Guide to the Localism Act. London: DCLG. Available at: https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/5959/1896534.pdf [Accessed 8 January 2018]\nDepartment for Communities and Local Government (2011) The Localism Act 2011. London: DCLG. Available at: http://www.legislation.gov.uk/ukpga/2011/20/schedule/10/enacted [Accessed 8 January 2018]\nDepartment of the Environment (1969) People and Planning: Report on the Committee on Public Participation in Planning. London: HM Stationery Office, pp. 51-53.\nForester, J. (1999) The Deliberative Practitioner: Encouraging Participatory Planning Processes, The MIT Press, Cambridge, Massachusetts, London, England\nGallent, N. (2013), ‘Re-connecting “people and planning”: parish plans and the English localism agenda’, Town Planning Review, 84, pp. 371–96.\nHM Government (1968) Town & Country Planning Act 1968. London: HM Stationery Office. Available at: http://www.legislation.gov.uk/ukpga/1968/72/contents/enacted [Accessed 8 January 2018]\nHM Government and Local Government Association (2007), Central-Local Concordat. Available at: http://webarchive.nationalarchives.gov.uk/20100403032639/http://www.communities.gov.uk/documents/localgovernment/pdf/601000.pdf [Accessed 7 January 2018]\nLadner, A., Keuffer N. and Baldersheim, H. (2016) Measuring Local Autonomy in 39 Countries (1990–2014), Regional & Federal Studies, 26:3, pp. 321-357.\nLocality (2018) Neighbourhood planning. Available at: http://locality.org.uk/projects/building-community/ [Accessed 8 January 2018]\nLord, A., Mair, M., Sturzaker, J., and Jones, P. (2017) ‘The planners’ dream goes wrong?’ Questioning citizen-centred planning, Local Government Studies, 43:3, pp. 344-363.\nParker G. (2017), The uneven geographies of neighbourhood planning in England. In: Brownill, S. and Bradley Q., eds., Localism and neighbourhood planning: Power to the people?, pp. 75-91.\nParker, G., Lynn, T. and Wargent, M. (2015) Sticking to the script? The co-production of neighbourhood planning in England, Town Planning Review, 86:5, pp. 519-535.\nParker, G., Lynn, T. & Wargent, M. (2017) Contestation and conservatism in neighbourhood planning in England: reconciling agonism and collaboration?, Planning Theory & Practice, 18:3, pp. 446-465.\nParker, G., Lynn, T., Wargent, M. and Locality (2014), User Experience of Neighbourhood Planning, published report, October 2014, London, Locality.\nParker, G. & Murray, C. (2012) Beyond tokenism? Community-led planning and rational choices: Findings from participants in local agenda-setting at the neighbourhood scale in England. Town Planning Review, 83(1), pp. 1–28.\nParker, G. and Salter, K. (2017) Taking Stock of Neighbourhood Planning in England 2011–2016, Planning Practice & Research, 32:4, pp. 478-490.\nPlanning Resource (2017) Map: neighbourhood plan applications. Available at: http://www.planningresource.co.uk/article/1212813/map-neighbourhood-plan-applications [Accessed 8 January 2018]\nPratchett, L. (2004), Local autonomy, local democracy and the ‘new localism’, Political Studies, 52, pp.358–375.\nRydin, Y. and Pennington, M. (2000) Public Participation and Local Environmental Planning: The collective action problem and the potential of social capital, Local Environment, 5:2, pp. 153-169\nSturzaker, J and Gordon, M. (2017) Democratic tensions in decentralised planning – Rhetoric, legislation and reality in England. Environment and Planning C: Politics and Space, 35(7), pp. 1324-1339.\nTurley Associates (2014). Neighbourhood Planning – Plan and Deliver? London: Turley Associates, London.\nVigar, G. Gunn, S. and Brooks, E. (2017) Governing our neighbours: participation and conflict in neighbourhood planning, Town Planning Review, 88(4), pp. 423-442.\nWegerif, R. (2016) What is dialogic space? Available at: http://www.rupertwegerif.name/blog/what-is-dialogic-space [Accessed 5 January 2018]",
  "https_robbryher_com_aboutrob_/https_robbryher_com_whatrobdoes/content_2.html": "Here’s where I keep longer articles about all that I’ve been doing in my role as councillor for St George West.\nSummer 2024 (May to August 2024)\nAutumn 2024 (September to December 2024)\nWinter/Spring 2025 (January to April 2025)\nSummer 2025 (May to August 2025)\nAutumn 2024 (September to December 2025)\nWinter/Spring 2026 (January to April 2026)\nSummer 2026 (May to August 2026)\nAutumn 2026 (September to December 2026)\nWinter/Spring 2027 (January to April 2027)\nSummer 2027 (May to August 2027)\nAutumn 2027 (September to December 2027)\nWinter/Spring 2028 (January to April 2028)",
  "https_robbryher_com_aboutrob_/https_robbryher_com_2023_09_04_a-fresh-lick-of-paint/content_7.html": "A fresh lick of paint… Posted on September 4, 2023 by robertjessetelford I’m giving this website a bit of a refresh with a focus on my and the Green team’s campaigning in St George West ward. Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like Loading... Related Published by robertjessetelford View all posts by robertjessetelford",
  "https_robbryher_com_aboutrob_/https_robbryher_com_aboutrob/content_1.html": "I (he/him) have lived in BS5 since 2008 and I live with my wife and two small children.\nI joined the Green Party on the day Ed Miliband become leader of the Labour Party in September 2010. Like many of my generation, I was let down by both the Lib Dems and Labour, and I decided to throw my weight behind a party that had the same values as me, championed the right policies, and campaigned positively. 14 years later, I still believe passionately in the Green vision for a sustainable and equal society.\nMy priorities for the ward include increasing safety on local roads and crossings, working with St George Park groups and community organisations to improve the play park, toilets and provision of facilities, and supporting residents with problems they have with housing, waste or other council services.\nI chair the Development Control Committee A and I’m a member of the Transport and Connectivity Policy Committee. I also sits on the Downs Committee, the Bristol Airport Consultative Committee and the Standing Advisory Council for Religious Education (SACRE).\nI previously served as local councillor for Ashley ward (2013 to 2016) with a short period as the Green group leader (2015). I have chaired the Association of Green Councillors (2015) and the Local Government Association (LGA) Independent group’s electoral reform policy task and finish group (2015-16).\nI have an MSc (Distinction) in Urban Planning at the University of the West of England (UWE). My previous work experience is within local authority highways and transport development control and as a campaigner for low-car cities for a climate charity. On the citywide level, he is particularly focused on developing Bristol’s kerbside and parking strategy and expanding low-traffic/liveable neighbourhoods schemes to more areas of the city.\nMy policy interests are creating sustainable cities through good urban and transport planning, protecting and enhancing public services and open spaces, and constitutional and democratic reform.",
  "https_robbryher_com_aboutrob_/https_robbryher_com/content_5.html": "I’m giving this website a bit of a refresh with a focus on my and the Green team’s campaigning in St George West ward.\nThe design and application of neighbourhood planning in England acts effectively to constrain local autonomy and inhibit public participation in planning. Discuss.\nIntroduction\nThe introduction of neighbourhood planning (NP) has been met with critical discussion both inside and outside of planning literature. I will argue that NP processes have produced some positive participative practice but within a framework that does not allow for local autonomy or inclusive participative practice at the sub-local authority area. I will go on to recommend strategies for reforming the structures that have been put in place.\nWhat is neighbourhood planning?\nThe Conservative-Liberal Democrat Coalition Government (2010-15) introduced neighbourhood planning as part of the 2011 Localism Act (DCLG, 2011b). The preamble to the government’s neighbourhood planning guidance claims that NP “gives communities direct power”, allows them to “choose where they want new homes, shops and offices to be built” and provides “a powerful set of tools for local people to ensure that they get the right types of development for their community” (DCLG, 2014). Both academic and non-academic critique often includes the contention that the government has seen NP as a tool to encourage neighbourhoods to accept further development, particularly housing (Parker and Salter, 2017).\nIn direct practical terms, this new statutory power allows, in coordination with their local authority, any set of 21 citizens to become a “qualifying body”, designate a neighbourhood development plan area, write a neighbourhood development plan (NDP), put this plan out to consultation, have it assessed by an independent examiner, and then ask for the NDP to be approved by the local community through a referendum. NDP policies must conform with the Local Plan and the Government’s newly introduced National Planning Policy Framework (NPPF, 2012). The NDP then becomes a statutory part of the development plan, alongside the Local Plan for the area designated.\nParker et al (2015) suggest that NP is a significant statutory shift that local authorities cannot ignore and is unlikely to be abandoned. The 2011 Act was the culmination of a building political rhetoric around the terms localism and decentralisation for both government parties whilst in opposition, with Copus et al (2017) suggesting the localist political shift may relate to the effect of Scottish, Welsh and Northern Irish devolution on English provincial thinking. NP represents the first time a statutory right of this kind has been granted to communities at the sub-local authority area, but as we will now discuss is not the first instance of attempts to sub-localise the planning system.\nThe pre-2010 context of neighbourhood planning\nNP was thus a departure from the previous Labour government’s (1997-2010) policies if not its language of ‘new localism’. The unformalised ‘local strategic partnerships’ were the New Labour precursor of sorts to NP. However, specific sub-local authority governance structures such as parish councils and urban-based neighbourhood forums had hitherto not had any planning powers, leading to an unsatisfactory situation where local authorities could choose to adopt or ignore non-statutory sub-local plans (Gallent 2013). Parish Plans, produced since 2000, were an example of community-led planning used regularly prior to 2010, almost exclusively in rural areas. Parker and Murray (2012) state that pre-2010 consultations on these plans would “rarely carry quality criteria which are applied or enforced”. However, in April 2009, the Labour government did introduce a wide-ranging ‘duty to involve’ powers on local authorities (DCLG, 2008) and a Central-Local Concordat in conjunction with the LGA (HM Government and LGA, 2007, cited in Bailey and Elliott, 2009). The Coalition reforms can be said to, at least rhetorically, respond to New Labour’s ‘managerial’ localism (Sturzaker and Gordon, 2017), although Brookfield (2017) argues that the Coalition were echoing the New Labour rhetoric, and adopting a neo-liberal justification for localism.\nLocal autonomy’s non-existence\nPlanning literature in the aftermath of the 2011 Act refers largely to decentralisation and localism, rather than autonomy, perhaps for the reason that the former are concepts perceived as less political and more operational in orientation. There is no agreed definition of local autonomy within democratic theory, with Clark (1984) stating that its meaning “remains opaque”. However within the NP context we are clearly discussing any ‘autonomy’ that exists at the sub-local authority (i.e. neighbourhood) level. Internationally, the term ‘local autonomy’ is used synonymously with ‘local self-government’ (i.e. local government) with one 2014 assessment (see Ladner et al, 2016, 344) measuring the UK as 31st out of 39 European countries. Pratchett (2004) makes a strong claim that local autonomy and local democracy are conceptually not the same, with Clark (1984) defining two aspects of autonomy in governance terms. Immunity is “the power of localities to function free from the oversight authority of higher tiers of the state”. Initiative is “the power of localities to legislate and regulate the behaviour of residents”. These aspects are closely mirrored by Pratchett (2004) as “freedom from central interference” and “freedom to effect particular outcomes”, stating a further aspect, “reflection of local identity”, an addition that brings participatory governance into our analysis of autonomy’s definition. It’s clear that a qualifying body could affect particular outcomes in a positive way by delineating land use more specifically than its attendant Local Plan currently does. However, this does not in itself represent an autonomous state of affairs, merely an ability to change some aspects of the local authority’s development planning documentation in line with what already exists or will exist.\nI contend (under the auspices of traditional anarchist thought and the definitions of the aforementioned thinkers) that autonomy only exists independently of prescribed democratic and institutional structures, in arenas where local citizens make their own rules and practices, what Parker and Murray (2012) describe (from a non-anarchist perspective) as a “direct challenge to established decision-making models”. Indeed, Gallent (2013) differentiates democracy as a top-down, “provider-led” approach, and governance as a bottom-up approach (with the crucial caveat that it is liable to myopia and a lack of detail and coordination). The introduction, therefore, of NP can be said to have had a negligible effect on local autonomy, as NDPs are required to be submitted both to the local authority and the planning inspectorate (an executive agency of HM Government) for approval, as well as conforming closely and working within the Local Plan policies and the NPPF (Parker et al, 2015), with no variation on this pattern legally condoned. As local autonomous governance structures are thus only theoretically possible and currently non-existent, it is difficult to say whether “they” are constrained or not. Regardless, this conclusion does not preclude the possibility of improved public participation under NP, a subject to which we now turn.\nPublic participation in neighbourhood planning\nPublic participation has been part of planning law since the 1968 Town & Country Planning Act (HM Government, 1968), although it was almost immediately followed by the Skeffington Report (DoE, 1969) which critiqued the Act’s top-down solutions and recommended a far more neighbourhood-orientated approach (recommendations 1 and 2, appendix 1). Today, there are still charges that public participation can be tokenistic, with Parker and Murray (2012) describing participation opportunities as “little more than rhetorical bulwarks used by politicians seeking public support and legitimation for particular policies”. Certainly the Localism Act’s emphasis on delivering growth by a neo-liberal economic model could be characterised this way, but are there opportunities afforded by NP for authentic communicative practice?\nVigar et al (2017) posit two dominant schools of thought within communicative practice – a participative-deliberative tradition and a radical-agonistic one – suggesting that the latter is the dominant contemporary planning paradigm. Forester (1999) recognises the role of emotion in planning but takes the deliberative position, describing planners as crucial to facilitating any “joint gains” that can be made between “conflicting claimants” (p. 12-13).\nI agree with Parker et al (2015) that NP presents as a dialogic space (see Wegerif, 2016) of rational actors (see Rydin and Pennington’s (2000) five rational choice questions) but that in reality its public participation remit is limited and the design of its structures preclude agonist practice. Brookfield (2017) notes that planners are not ‘levelled down’ to the status of another stakeholder as is typically an interest of collaborative planning. Also, as Parker and Murray (2012, p.8) note, individuals don’t always act rationally or in some narrow self-interested sense, implying that some people engage if others (and particularly others ‘like them’) engage. Overall, for NP, “the benefits and problems of participation are likely to be mixed and fluid; reflecting the so-called fuzziness of neo-liberal institutions” (Parker et al, 2017). The design of NP, to which we now turn, is also one of the main factors in assessing NP’s public participation credentials.\nThe design of neighbourhood planning\nNeighbourhood planning has been communicated and legislated maximally but resourced minimally. The government’s 200 or so pilot areas each received £20,000 up front (Bailey and Pill, 2015). Up to £9,000 is available to qualifying bodies from DCLG through Locality’s website (2018), a sum which hypothetically allows payment of a living wage to a dedicated planning employee for a little over 27 weeks of full-time employment. The median time for an NDP to progress to referendum is 29 months (Parker and Salter, 2017), which makes it logistically unfeasible to offer anything other than part-time, freelance work to a planning consultant, who may or may not be able to work in the way that conveniences the designated neighbourhood forum (DNF). In one study (Parker et al, 2015), it was found that 69% of NDPs relied on consultant support. Staff resource from local authorities is not specified quantifiably in the legislation, so the DNF must negotiate support resources (DCLG, 2014). The local authority has responsibility for setting timetables and time limits, but the emphasis as regards advice and assistance is on what planning officers “consider appropriate” (which of course could be minimised to solely the aforementioned time factors) (DCLG, 2011b).\nThe concern expressed by some (e.g. Lord et al, 2017) about the risk of the de-professionalisation of planning comes to the fore in light of this design, with the overall neo-liberal framework not being hidden by the government (Parker et al, 2015) when they state that local authorities will have “more freedom to work with others in new ways to drive down costs” (DCLG, 2011a, p.7). Parker et al (2017) suggest that New Public Management theories lead to a “wider traducement of public sector planning” for a performative end. However, Brookfield (2017) notes two specific benefits for communities after an NDP has been adopted: the retention of 25% (as opposed to the regular 15%) of any Community Infrastructure Levy (CIL) raised on local development and (for plans that promote housing development) the New Homes Bonus, an unringfenced grant where government matches the Council Tax raised on each new home for six years. (Both positives are contingent, of course, on the NDP promoting rather than restraining development.) Parker (2017) also notes that local authorities receive a £30,000 ‘burdens’ payment on plan completion.\nAs regards inter-relational aspects of NP design, Davoudi and Cowie (2013) state that the self-selecting character of NP groups may result in the favouring of better educated, well-off and more vocal social groups who may have the time, capacity and inclination to engage. Although the NDP must go to referendum to be judged by the public, there are questions about the legitimacy of unelected bodies acting on behalf of the wider community before this occurs, particularly as the DNF proposes the extent of the area covered.\nOverall, there are some basic problems with NP design and with the necessity to conform to the Local Plan and NPPF, what Bailey and Pill (2015) call ‘framing and constraining’ activity. These tight controls on NDP content ensure that ideas, policies and priorities will be “rescripted” to ensure conformity, with their obligatory passage acting as a means of control on participants (Parker et al, 2015).\nThe application and practice of neighbourhood planning\nThe non-compulsory nature of NP will always mean patchwork rather than blanket coverage, with 2,228 projects applied for as of October 2017 and only 349 having been formally adopted into local development plans (Planning Resource, 2017), with only 10% of neighbourhoods who could have initiated NDPs doing so (Parker and Salter, 2017). Reasons for lack of uptake have been variously cited, but government assumptions about willingness and capacity, homogeneity and ability to put aside self-interest may also be a factor. The government’s professed light touch approach may have acted to create a degree of confusion rather than enable or expedite processes.\nThe government forecasts for overall take-up of NP, but not for regions or wider demographic factors (Parker and Salter, 2017). It is observable that the south (comprising just two of England’s nine regions) accounts for 41% of NP take-up (Parker and Salter, 2017). Only six of the neighbourhood areas to have passed referendum by October 2016 were in the 20% most deprived areas of England with 60.8% of plans being produced by those in the 40% least deprived areas (Parker and Salter, 2017). NP has undoubtedly been taken to more in rural, parished areas, although there are examples of large cities, such as Leeds (see Brookfield, 2017), taking a proactive approach, with council officers recommending to the executive board an overall approach to give equality of opportunity, although even in this instance there were participation challenges.\nOn the issue of whether NDPs have representational legitimacy, although 21 named local individuals are necessary to become a qualifying body, it has been noted (Parker et al, 2015) that a small group of people usually steer things, not the whole of the qualifying body or larger community. Davoudi and Cowie (2013) suggest that the key assessment criterion of this “symbolic representation” is the extent to which DNFs are accepted among local communities and trusted by them to draw up NDPs, highlighting the poor turnout at referenda as a sign of lack of acceptance, despite the figure (32.4%) being commensurate with local election turnout figures (Carpenter, 2016).\nThere are also clear examples of inequality of implementation. North Shields Fish Quay in North Tyneside was in 2011 part of the government’s ‘Frontrunner’ programme, but even after spending substantial time and effort on developing an NDP, opted instead to formulate a supplementary planning document as result of delayed guidance from government and the group’s “fatigue” (Parker and Salter, 2017).\nMore positively, some NDPs have taken the opportunity to advance socially and environmentally sustainable solutions, protect heritage assets, and ensure local housing needs, with slightly more control over the type, mix and location of new development than previously (Parker and Salter, 2017). The example of West Berkshire by Parker and Murray (2012) provides some clues for ensuring success. National funding was granted by the Countryside Agency and action was taken and resources allocated by the local authority chief executive, with the LA enjoying a good pre-existing reputation. This enabled trust to be built between the local authority and participants with a neutral agency (the Rural Community Council) providing a valuable brokering role. There is also evidence that – in contradistinction to my earlier analysis of funding – influence on LAs and a resulting access to resources and networks has emerged, an example of the ‘foot in the door’ thesis and allowing for “some limited orientation” (Parker et al, 2017). A counter-example in Exeter involved the DNF negotiation design changes of a development after their NDP adoption, but this could have been managed without the work going into the NDP, with the DNF opining that NP powers are “not as strong as promoted” (Lord et al, 2017) and that “the council did not have to consult us or check whether we were satisfied with their interpretation of neighbourhood plan policies…and they didn’t” (Sturzaker and Gordon, 2017). Blackpool and Manchester are also given as examples where NP has been said to have had negligible impact (Lord et al, 2017).\nParker et al (2015) report that more than two-thirds of people get involved with NP because they want more influence, greater say and to shape a local vision. By any reading, NP can be seen as a positive development in this regard, even if the process overall may struggle to meet these expectations. Parker et al (2017) show that “known co-production” (i.e. diverse actors working together on NDPs) is actually occurring. More critically, the government’s aim could be seen to be reducing local conflict through this consensus-building in order to increase housing supply (Gallent, 2013), although conversely a report from Turley (2014) found that the key theme of 55% of NDPs was the preservation and protection of what already exists (Lord et al, 2017). This suggests that NP may not currently be meeting government’s expectations.\nOn one analysis (Parker and Salter, 2015), it was recognised that planning skills were crucial but that for most groups the lack of this expertise delayed but didn’t prove fatal to their NDPs (Parker et al, 2015). The implication is that local authorities were then required to intervene or, for wealthier areas, private resources were utilised to fund a consultant tasked to plan-write. At this stage, community aspirations are likely to be rescripted into ‘planning language’, with some suggesting that this, combined with interactions with the local authority, led to a feeling of lost ownership. This “instruction from authority” and tendency for the instrumental pragmatism of “getting things done” can limit the “imagineering of alternatives” and has an effect on the rational choice realities mentioned earlier leading to a ‘why bother?’ result amongst some groups. Conservatism, self-regulation and self-censorship were observed in particular in the latter stages of the process (Parker et al, 2017).\nThere are instances where a Neighbourhood Development Plan (NDP) has informed a Local Plan (rather than vice versa), with over 1,138 areas being designated in areas with no up-to-date (post-NPPF) Local Plan (Parker and Salter, 2017). This represents an ability of DNFs to use NDPs to shape policy, and potentially re-opens our whole debate around local autonomy. The government guidance itself states that NDPs “can be developed before or at the same time as the local planning authority is producing its Local Plan”, yet simultaneously a draft NDP “must be in general conformity with the strategic policies of the development plan in force”, with additional guidance that qualifying bodies and local authorities should discuss and aim to agree the relationship between policies (DCLG, 2014). Anecdotally (Parker and Salter, 2017), some forums and parishes have slowed their processes to wait for a Local Plan to be adopted in order to know what policies they should follow. This ambiguity in precedence has been tested at examination, with one examiner comically citing Jean-Paul Sartre’s existentialism in defence of allowing an NDP to not conform to a non-existent Local Plan (Sturzaker and Gordon, 2017). In general, though, the LA-DNF relationship is characterised by Parker et al (2017) as a “critical dependency” rather than a “truly co-creative relationship”. Mutual exchange only delivers desired outcomes when there is trust, transparency and accountability and Gallent (2013) suggests that there is a structural hole that needs bridging by incidental mediators, giving the example of Ashford where housing (rather than planning) officers were effective at connecting group members to the local authority.\nSuperficially, it might be observed that a DNF’s powers can be described thus: “Although it cannot choose what to do, once given a specific task it can implement it in any way thought consistent with its tasks.” (Clark 1984, p. 201). Neighbourhood planning groups do choose what emphasis to take (if not exactly choosing what to do). Nevertheless, this gives the impression that their deliberations have a weight that the Localism Act ill affords them in terms of setting planning policy.\nParker et al’s (2015) assessment of their user experience study with Locality of 120 neighbourhoods uncovered a feeling that a local authority ‘duty to support’ needs to be operationalised through memoranda of understanding, which could set out clearer guidance for how to plan rather than just what to plan. The study also found that managing expectations and investing in the early stages to raise awareness in the community paid dividends. Parker et al (2017) believe the relations, knowledge and understanding built by NP may influence new forms of community engagement. More critically, Davoudi and Cowie (2013) argue that for inclusivity to improve we should consider not just how to incorporate marginal groups, but also how to limit the influence of privileged groups. Parker et al (2015) similarly query how we “proof” neighbourhood planning against dominant actors and a ‘managerialist’ consensus. Agonistic practice may have some of the answers in allowing dissensus to reveal power differences within the process (Vigar et al, 2017), but must be used sensitively by well-trained, ‘bridging’ mediators. The user experience study also noted the challenge of designating NP areas in urban settings, recommending a simplification of the process and more targeted, clear guidance for groups. The study also found that clarity around the referendum rules, consistency around resourcing, and clearer messages around the continuation of DNFs (with the view of reviewing or amending the NDPs) as further ways to practically improve the NP process (Parker et al, 2014).\nConclusion\nI have argued that neighbourhood planning does not act to constrict local autonomy, because local autonomy does not exist in the English democratic system at the sub-local authority level. Using Clark’s description of the concept of local autonomy, I have suggested that only a wholesale, near-revolutionary change in the British democratic system would allow for this conception to make sense on its own terms of “local self-rule”. NP is fundamentally a state-led and state-run activity, regardless of how specifically the initial bottom-up inception of processes occurs, as it is limited by both central and local state’s policy framework on what local communities can prescribe in their NDPs. However, this does not in itself preclude the possibility of public participation in NP.\nThere has been limited research thus far into the comparative uptake of local planning participation before and after the 2011 Act. Nevertheless, I have found substantive examples of neighbourhood planning producing forms of public participation which were hitherto unrealised. Even a mechanism so tightly scripted by state actors has the potential for delivering non-state actors’ priorities into local development schemes. My concerns with these processes are almost wholly to do with who is participating and how NP can be reformed and developed to ensure a greater breadth of uptake amongst diverse communities, urban areas and English “non-southern” regions. The cited example of Leeds gave me some hope that urban areas can respond to the current set-up through strong leadership to encourage a joined-up process at the local authority level.\nThus, I would contend that there is a need to directly link neighbourhood planning to strategic planning timetables, so that Local Plans and NDPs are concurrently produced. This could be linked to a statutory responsibility on all local authorities to review and consult on their Local Plan (a consolidated document covering all local and neighbourhood plans) every five years. This would dispel fears of a lack of consistency in a two-tier system (Lord et al, 2017), potentially widen the breadth of topics found in NDPs, and allow all councils to plan for ‘big bang’ engagement at regular intervals. Needless to say, this would require substantial financial investment and new revenue-raising powers for local authorities. It would be perceived as a retreat from ‘localism’ and a centralisation of power. However, to release greater participation and community dialogue (particularly in deprived areas), it is imperative that neighbourhood planning is well-resourced. This seems to be the only effective way to ensure a coherent planning system that allows local innovation, increased diverse and inclusive participation and outcomes that effectively and fairly balance local and national planning priorities.\nBibliography\nBailey, N. and Pill, M. (2015) Can the state empower communities through localism? An evaluation of recent approaches to neighbourhood governance in England. Environment and Planning C: Government and Policy, 33, pp.289–304\nBailey, S. and Elliott, M. (2009) Taking Local Government Seriously: democracy, autonomy and the constitution, Cambridge Law Journal, 68(2), pp. 436–472.\nBrookfield, K. (2017) Getting involved in plan-making: Participation in neighbourhood planning in England, Environment and Planning C: Politics and Space 2017, 35(3), pp. 397–416.\nCarpenter, B. (2016) Analysis finds average neighbourhood plan turnout of 32.4%. Available at: http://www.planningresource.co.uk/article/1406239/analysis-finds-average-neighbourhood-plan-turnout-324 [Accessed 8 January 2018]\nClark, G.L. (1984), A theory of local autonomy, Annals of the Association of American Geographers, 74(2), pp.195–208.\nCopus, C., Roberts, M and Wall, R. (2017) Local Government in England: Centralisation, Autonomy and Control. London: Palgrave MacMillan.\nDavoudi, S. & Cowie, P. (2013) Are English neighbourhood forums democratically legitimate? Planning Theory and Practice, 14(4), pp. 562–566.\nDavoudi, S. and Madanipour, A. (2013) Localism and neo-liberal governmentality, Town Planning Review, 84:5, pp. 551-561.\nDepartment for Communities and Local Government (2008) Communities in Control: real people, real power London: HM Government.\nDepartment for Communities and Local Government (2011) A Plain English Guide to the Localism Act. London: DCLG. Available at: https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/5959/1896534.pdf [Accessed 8 January 2018]\nDepartment for Communities and Local Government (2011) The Localism Act 2011. London: DCLG. Available at: http://www.legislation.gov.uk/ukpga/2011/20/schedule/10/enacted [Accessed 8 January 2018]\nDepartment of the Environment (1969) People and Planning: Report on the Committee on Public Participation in Planning. London: HM Stationery Office, pp. 51-53.\nForester, J. (1999) The Deliberative Practitioner: Encouraging Participatory Planning Processes, The MIT Press, Cambridge, Massachusetts, London, England\nGallent, N. (2013), ‘Re-connecting “people and planning”: parish plans and the English localism agenda’, Town Planning Review, 84, pp. 371–96.\nHM Government (1968) Town & Country Planning Act 1968. London: HM Stationery Office. Available at: http://www.legislation.gov.uk/ukpga/1968/72/contents/enacted [Accessed 8 January 2018]\nHM Government and Local Government Association (2007), Central-Local Concordat. Available at: http://webarchive.nationalarchives.gov.uk/20100403032639/http://www.communities.gov.uk/documents/localgovernment/pdf/601000.pdf [Accessed 7 January 2018]\nLadner, A., Keuffer N. and Baldersheim, H. (2016) Measuring Local Autonomy in 39 Countries (1990–2014), Regional & Federal Studies, 26:3, pp. 321-357.\nLocality (2018) Neighbourhood planning. Available at: http://locality.org.uk/projects/building-community/ [Accessed 8 January 2018]\nLord, A., Mair, M., Sturzaker, J., and Jones, P. (2017) ‘The planners’ dream goes wrong?’ Questioning citizen-centred planning, Local Government Studies, 43:3, pp. 344-363.\nParker G. (2017), The uneven geographies of neighbourhood planning in England. In: Brownill, S. and Bradley Q., eds., Localism and neighbourhood planning: Power to the people?, pp. 75-91.\nParker, G., Lynn, T. and Wargent, M. (2015) Sticking to the script? The co-production of neighbourhood planning in England, Town Planning Review, 86:5, pp. 519-535.\nParker, G., Lynn, T. & Wargent, M. (2017) Contestation and conservatism in neighbourhood planning in England: reconciling agonism and collaboration?, Planning Theory & Practice, 18:3, pp. 446-465.\nParker, G., Lynn, T., Wargent, M. and Locality (2014), User Experience of Neighbourhood Planning, published report, October 2014, London, Locality.\nParker, G. & Murray, C. (2012) Beyond tokenism? Community-led planning and rational choices: Findings from participants in local agenda-setting at the neighbourhood scale in England. Town Planning Review, 83(1), pp. 1–28.\nParker, G. and Salter, K. (2017) Taking Stock of Neighbourhood Planning in England 2011–2016, Planning Practice & Research, 32:4, pp. 478-490.\nPlanning Resource (2017) Map: neighbourhood plan applications. Available at: http://www.planningresource.co.uk/article/1212813/map-neighbourhood-plan-applications [Accessed 8 January 2018]\nPratchett, L. (2004), Local autonomy, local democracy and the ‘new localism’, Political Studies, 52, pp.358–375.\nRydin, Y. and Pennington, M. (2000) Public Participation and Local Environmental Planning: The collective action problem and the potential of social capital, Local Environment, 5:2, pp. 153-169\nSturzaker, J and Gordon, M. (2017) Democratic tensions in decentralised planning – Rhetoric, legislation and reality in England. Environment and Planning C: Politics and Space, 35(7), pp. 1324-1339.\nTurley Associates (2014). Neighbourhood Planning – Plan and Deliver? London: Turley Associates, London.\nVigar, G. Gunn, S. and Brooks, E. (2017) Governing our neighbours: participation and conflict in neighbourhood planning, Town Planning Review, 88(4), pp. 423-442.\nWegerif, R. (2016) What is dialogic space? Available at: http://www.rupertwegerif.name/blog/what-is-dialogic-space [Accessed 5 January 2018]"
}