{
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_campaigns_tackling-crime-and-anti-social-behaviour/content_7.html": "— Tackling crime and ASB – anti-social behaviour —\nBy investing in local policing in our villages, towns and cities – and targeting neighbourhood crimes such as burglary.\nPart one of Darryl Preston’s six-point plan to continue #WeCutCrime in Cambridgeshire and Peterborough.\nTackling crime and anti-social behaviour...\n...and thereby the fear of crime, must be the priority for the police.\nIt’s certainly my priority, which is why I launched #WeCutCrime as my campaign theme to highlight the importance of reducing crime rather than only reacting afterwards.\nFrom 1985 to 2015 I was a serving police officer – first in uniform in the Met and, from 1998, in Cambridgeshire, becoming a detective.\nMost of my time as a police officer, both in uniformed and detective roles, was spent fighting crime, from theft to homicide. I recall at my initial interview being asked ‘why do you want to join the police?’. I replied: ‘I want to catch criminals, help victims and keep people safe.’\nMy motivation for wanting to continue to be your Police and Crime Commissioner remains the same.\nNeighbourhood crime is down\nNeighbourhood and rural is crime is down by over 20% on my watch. This is good news, and if re-elected my number one priority will be to see crime continues to be tackled, here in Cambridgeshire and Peterborough. It is the best way of keeping people safe.\nFrom my experience I know the key to reducing crime is to have more police officers – more boots on the ground, frontline and detectives – to deter, detect and prevent. This is far more effective than just responding to one reported crime after another.\nRecord police numbers\nAnd that is why I have secured record police numbers, with 400 more warranted police officers compared to 2015.*\nThere is more that can be done\nThe police spend far too much time dealing with matters that are not crime related.\nThey are often used as ‘the emergency service of last resort’, dealing with issues such as mental health and social care, things that, frankly, other agencies should be dealing with.\nI know this because I have first-hand experience of managing mentally unwell people in police cells – this is simply not right. Those suffering from mental health should be dealt with by health professionals, leaving the police to fight crime.\nAs we grow, so should the police force\nCambridgeshire and Peterborough continues to be one of the fastest growing areas in the country with an expected population growth of a further 25% by 2031.*\nUnfortunately, the formula to allocate the central grant to our county for policing is archaic and unfair, which successive governments have failed to address.\nCambridgeshire constabulary gets a bad deal: the constabulary makes up about 1% of the national police spend and according to the force, we lose out by about £6m a year.\nThat would pay for at least 200 new officers, reducing crime and keeping us safe everywhere.\nPolicing for your priorities\nHaving spoken to local residents and police all over our county, I am very aware our local communities have differing crime priorities.\nSome crimes, such as house burglary – an abhorrent crime – and vehicle offences are, unfortunately, felt in all areas; other crimes, including agricultural theft and hare coursing, impact more on our rural areas.\nAnd in our towns and cities, anti-social behaviour, robbery, drugs, knife crime and serious violence are all too common.\nBut crime is crime, whether inflicted on an individual or a business.\nStealing from shops, violence and intimidation of staff and many other ‘business crime’ types are totally unacceptable.\nIf re-elected I would recognise this in setting strategic priorities with the Chief Constable.\nI will also be setting local priorities by listening to local communities and acting on your concerns.\nIf re-elected I will...\n1. Continue to invest in local visible policing to further tackle crime and ASB.\n2. Continue to work with our MPs to get a fairer central government policing grant paying for even more police officers.\n3. Continue to hold the Chief Constable to account for reducing overall crime and ASB in Cambridgeshire and Peterborough.\n4. Continue to listen to local communities and set local crime fighting priorities.\n5. Continue to work with local businesses and partners to reduce business crime.\n6. Continue to ensure tackling rural crime remains a priority and continue to work with rural communities and the NFU and invest in Countryside Watch.\n7. Continue to work with partners to ensure the police only have to deal with policing matters.\n8. Continue to cut bureaucracy and work with government to ensure the police have more time to prevent and solve crimes.\n9. Continue to back our police, keeping their high standards and ensuring they have the skills and confidence to keep us safe.\n* Sources\nDelivery of the Police and Crime Plan – report, 13th March 2024.\n10 year Cambridgeshire population growth.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election on 2nd May 2024. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_events_feed/content_15.html": null,
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news_dog-thefts-darryl-takes-lead-dog-protection/content_25.html": "There's been a spike in dog thefts throughout the country — very sad for the owners and all created by a rise in the value of dogs thanks to the Covid pandemic.\nStopping dog thefts and catching the criminals responsible is part of Darryl Preston's plan to #GetCrimeCut in Cambridgeshire and Peterborough.\nDog thefts\n“Any dog owner knows the real and intense pain felt when their pet is injured, dies or is stolen,” says Darryl Preston.\n“This is not surprising given a survey found that 90% of respondents considered their pets to be a family member,” he added.*\n“And while the government has already increased sentences for those who mistreat animals and has tackled puppy farming through ‘Lucy’s Law’, it now needs to toughen up the law on dog thefts.\n“It’s done so with Finn’s Law, which ensures police dogs (and horses) are viewed as the living, breathing, sentient beings they are, leading to more severe punishment – up to five years imprisonment – for their attackers.\n“If elected in May, I will work with our local MPs, Kit Malthouse, the Policing Minister and Priti Patel, the Home Secretary who has spoken out on this issue, to change sentencing guidelines to ensure our judicial system recognises the emotional and social value of our pets, so tougher sentences can be applied in our courts.”\nDognapping is a criminal activity\nDuring the Covid pandemic, dog ownership has risen significantly along with the cost and value of ‘man’s best friend’ as so-called 'dognappers' – who are common criminals – have recognised:\n- Over 2,000 dogs are stolen each year across the UK.\n- Tragically, only 1 in 5 stolen dogs are ever returned to their owner.\n- Less than 1 in 20 of dog thefts result in a conviction.\n- Over half are stolen from back gardens.*\nBecause punishments are often related to the monetary value of a dog, they usually result in trivial fines rather than imprisonment.\nDog theft should be a high risk activity\n“Although the Theft Act of 1968 allows a maximum penalty of up to seven years imprisonment, this never seems to happen,” said Darryl. “This makes dog theft ‘low risk / high reward’, attracting organised criminals who operate across police force boundaries.\n“Dog theft is a criminal menace. If elected, my PCC leadership will be one of targeting criminals, informing the public and working closely with the Chief Constable and government to give the people of Cambridgeshire and Peterborough the security they – and in this case, their pets – deserve,” he said.\n“And because, like drug dealing, this is a regional problem, I already have approval from the Conservative PCC candidates in Bedfordshire and Hertfordshire for my plan and I’ll be lobbying local MPs to ensure that the sentence given to dognappers reflects the severity of the crime.\nMy plan to combat dog thefts is:\n1. Work with our local MPs, the Policing Minister and the Home Secretary to change sentencing guidelines to ensure our judicial system recognises the emotional and social value of our pets, so tougher sentences can be applied in our courts.\n2. Recruit more police officers to enable the Chief Constable to investigate and target the organised crime groups which steal dogs.\n3. Invest in the Eastern Region Special Operations Unit to tackle organised crime gangs\n4. Improve public awareness of how to reduce their pet’s vulnerability to criminals, and to prevent others from buying stolen animals and fuelling this terrible trade.\nProtecting your pet\nCambridgeshire police say there are some simple things pet owners can do to prevent their theft and keep them safe:\n- Keep an ID tag on your dog at all times (your surname, mobile number and address only).\n- Secure gates using bolts at the top and bottom, along with a heavy-duty padlock and gate alarm.\n- Never leave your pet in the garden unattended.\n- Purchase a driveway alarm so you are alerted to any intruders, these can also be used in rear gardens and yards.\n- Make sure your dog is microchipped and their details are kept up to date so that they can be returned if they are stolen and subsequently found.\n- Avoid leaving a dog tied up outside a shop or left alone in a car, even for a few minutes.\n- Take lots of photographs of your dog to prove ownership if it’s stolen; pay particular attention to any distinguishing markings on your dog.\nIn addition, prevent theft on walks by varying walk times and locations and being suspicious of strangers who ask questions about your dog. Make a note of any suspicious, loitering vehicles.\nIf your dog is lost or suspected to have been stolen, it’s important to act quickly.\n- Report stolen dogs to the police via Cambs’ police report online page or by calling 101.\n- Tell your local dog warden.\n- Also notify your microchip database provider.\n* Sources\nSurvey found 90% of respondents considered their pets to be a family member.\nThe Kennel Club reporting over half of dogs are stolen from back gardens.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election in May 2021. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news_business-crime/content_31.html": "Crimes committed against businesses are not victimless – they have a devastating impact on all our communities.\nAnd because it's a crime, Darryl Preston's intention to #GetCrimeCut in Cambridgeshire and Peterborough includes a specific five point plan to tackle business crime.\nDarryl writes:\nBusiness crime\nI recently spoke with a shop owner in Cambridge who had started a new small business serving the local community. He had ploughed his own savings into the shop and any profits were to pay the bills.\nA couple of days after opening he was the victim of burglary, stock taken, £8,000 of damage and an on-going loss of earnings while the shop was closed for repair.\nA friend of mine owns a chain of convenience stores, employing hundreds of people, boosting local economies and serving local communities.\nNot a day goes by without a crime being committed; be it shoplifting, ram raids or the very worst crime – assaults on members of staff.\nCrimes committed against the convenience store sector cost £142m over the last year alone, equating to over £3,000 per store. In addition almost 89% of shop workers suffered some form of abuse.\nCybercrime too\nAnd there is a new and significant threat to businesses of all types – cybercrime.\nBe it cyber enabled (any crime that can be committed over the internet such as fraud) or cyber dependent (a crime that relies solely on computers such as ransom ware).\nAccording to ITPro, cybercrime is estimated to have cost UK businesses a staggering £87 billion since 2015 – no wonder it can have a devastating impact on any business, including employees and local communities.\nBusiness crime is not victimless\nPerhaps some people see business crime as less serious than other crimes. I do not.\nBusinesses are made up of people, working hard to feed their families and to pay the bills, contributing to the economy paying for the health service, education and all the other vital public services we need.\nIf elected, I will…\nIf elected on 6th May, I will support our local businesses in the fight against crime by:\n1. Making resources available to the Chief Constable to recruit many more police officers.\n2. Create business crime forums in consultation with organisations representing businesses such as (but not limited to) the Chamber of Commerce, Federation of Small Businesses and the Association of Convenience Stores – with the objective of cutting crime.\n3. Hold the Chief Constable to account for the investigation of crime against businesses.\n4. Work with the Home Office to ensure an effective whole system response to cybercrime.\n5. Invest in cyber and online prevention officers.\nSources\nAssociation of Convenience Stores' crime report 2021.\nITPro report on the cost of cybercrime.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election in May 2021. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_cookies/content_17.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_cdn-cgi_l_email-protection/content_13.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news_tackling-fly-tipping/content_26.html": "Fly tipping is a criminal offence – did you know it can carry a sentence of five years imprisonment and a £50,000 fine?\nAnd because it's a crime, Darryl Preston's intention to #GetCrimeCut in Cambridgeshire and Peterborough includes a specific six point plan to tackle fly tipping.\nDarryl writes:\nTackling fly tipping\nFly tipping a scourge in our cities, towns and rural areas. At worst it can have a detrimental impact on health; certainly it has an environmental and financial impact on law-abiding citizens – it can cost anywhere from £10,000 to £500,000 to clear a single site and criminals often return once a site has been cleared, repeating the cycle.\nIn addition, there have been several cases of fly tips being set on fire in residential areas, causing a significant risk to our communities.\nFly tipping is a crime – it’s anti-social and is totally unacceptable.\n31 a day\nLast year there were over 11,000 reported incidents of illegally dumped rubbish in Cambridgeshire and Peterborough – that’s 31 every day.\nIn most cases the local council foot the bill for clear up operations – but when this crime occurs on private land, it becomes the landowner’s responsibility, by law.\nThough some incidents of fly tipping are down to the selfishness of a few individuals, many are committed by unscrupulous criminals cashing in at the taxpayers expense and often involved in other crimes.\nIt’s a CRIME\nThe government has recognised serious organised crime gangs are involved and set up a national Joint Waste Crime Unit (JWCU), bringing together all law enforcement agencies, including the police, to crack down and bring offenders to justice.\nSome people have suggested to me fly tipping is not a police matter. However, I am standing to be the Police and CRIME Commissioner whose top priority should be to listen to the concerns of residents and businesses and act upon them.\nI have listened – and time and time again, residents in Peterborough and throughout Cambridgeshire are telling me fly tipping is a major concern.\nNew approach\nMore needs to be done to tackle this menace with the introduction of a zero tolerance approach to those who choose to flout the law, along with exploring preventative measures.\nOn the spot fines need to be increased for the ‘lower’ level crimes from the current £400 to £1,000.\nRepeat offenders should be sent to court and serious offenders should feel the fall penalty of the law, with prison sentences and having vehicles crushed and assets seized.\nIf elected, I will…\n1. Work with partners, including councils, environment agency, police, fire and rescue service, waste disposal operators, MPs and residents to produce a county-wide strategy of prevention and enforcement.\n2. Provide funds for covert cameras to be deployed in hotspot areas.\n3. Set aside funds from assets seized from criminals to support private landowners financially in the removal of illegally dumped waste.\n4. Work with councils to promote a Zero Tolerance campaign.\n5. Support legislative change for stiffer fines.\n6. Consult the Chief Constable on what support the police can offer to councils in investigating the most serious of cases and responding to ‘crimes in action’.\nPeterborough Conservatives take action\nIn a clampdown on fly tipping, Peterborough Conservatives have pledged to re-introduce free bulky waste collections if they retain control of Peterborough City Council after the local elections on 6th May – even though they brought in the charges 12 years ago.\n- Peterborough Conservatives pledge to re-introduce free bulky waste collections in fly-tipping clampdown – Peterborough Telegraph, 14th April 2021.\nSources\nCost of fly tipping (page 24).\nPeterborough fly tipping hot spot.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election in May 2021. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_campaigns_more-crime-prevention/content_21.html": "— More crime prevention —\nBy further investment to keep all our communities safe, with a focus on diverting young people away from crime – and combatting domestic and sexual violence.\nPart six of Darryl Preston’s six-point plan to continue #WeCutCrime in Cambridgeshire and Peterborough.\nMore crime prevention\nAs a young, uniformed frontline police officer in London, I took pride in being a ‘crime fighter’. I knew most of the criminals on my patch in west London and would make regular arrests for burglary, drugs, robbery and car theft.\nThis continued when I transferred to Cambridge in 1998.\nI had a slightly different uniform, but the same job with the same inherent issues impacting communities. I had always understood prevention was better than cure, but largely saw my job as catching criminals.\n12 year old burglar\nI recall, when working in Cambridge, there was a prolific burglar, 12 years old and a one-person crime wave.\nIn the early hours of one morning and following a burglary, I went to his address to ‘enquire his whereabouts’. He was asleep on the stairs. He had no bed, no food in the house, a single incapable parent who used drugs and younger siblings who would no doubt be tomorrow’s generation of criminals.\nShortly after, and now a CID officer, I worked in the child protection team in Cambridge and would often be dealing with children at significant risk of harm through abuse and neglect – and quite often the same kids as the burglar asleep on the stairs.\nChampioning the voice of victims\nMy point is this: I did then, and still do, champion the voice of victims.\nBurglary is a particularly nasty and impactive crime, a violation of our home, precious family belongings are forever taken away from us and a sense of not being safe in the one place we should be.\nI know this because I have dealt with many burglaries as a police officer and have been a victim myself, a couple of days following the birth of my son when we were all asleep upstairs.\nThe police did their job and caught the criminal who burgled my house and I was grateful, though this was small compensation as the damage had been done. Prevention would have been far better for all.\nPrevention, not cure\nAs for the burglar asleep on the stairs, well I arrested him and he eventually went to a young offenders institute only to be released shortly afterwards. He went on to being a one-person crime wave.\nAnd now? Well, he is a career criminal, having cost us all by the crimes he has committed and the expense of the criminal justice system, probably hundreds of thousands of pounds of tax payers money.\nBut, had there been effective early intervention, there would be less victims of burglary, a young child may have flourished and we would have saved a lot of money.\nPrevention needs a ‘whole system’ approach – partners coming together from different agencies, communities, businesses and charities to problem-solve at local, regional and national levels.\nStrong leadership as PCC\nI promised to make prevention a priority when I became your Police and Crime Commissioner in 2021.\nAnd I did just that.\nI have led the countywide response to preventing crime. During my current term of office I have invested £21.5m in crime prevention and victims services, extra money secured from government or from the proceeds of crime, the ill-gotten gains of criminals.\nI have invested £13.3m to keep our streets safer, targeting sex offenders who cause so much harm to women and girls along with projects to cut burglary and anti social behaviour.\n£6.9m has been invested in crime and disorder reduction, funding projects with partners that would have kept the 12-year-old burglar from committing crime.\nAnother £1m has been directed to keeping our roads safe, including vehicles and equipment for enforcement.\nAnd, £200K to support over 60 local youth projects, keeping our children out of harms way.\nBut, does it work?\nSir Robert Peel founded the Metropolitan Police in 1829 and set nine principles of policing which are as relevant today as they were then. One of the principles states…\n‘That the test of police efficiency is the absence of crime and disorder, and not the visible evidence of police action in dealing with them.’\nDoes it work?\nYes, as these figures for Cambridgeshire and Peterborough show…\n- Neighbourhood crime is down 24%.\n- The abhorrent crime of burglary down 37%.\n- Anti-social behaviour down 30%.\n- Knife crime down 25%, with 54% fewer hospital admissions.\n- Rural crime down 21%.\n- Bike theft down 56% – and our roads are safer.\nIf re-elected in May, I will show that strong leadership – and...\n1. Continue to ensure effective crime prevention strategies are in place across Cambridgeshire and Peterborough.\n2. Continue to support our Community Safety Partnerships by investing in people and projects.\n3. Continue to lead the countywide High Harms Board.\n4. Make further investments in business crime prevention, from cyber threats to shoplifting.\n5. Continue to fund services combatting domestic and sexual violence.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election on 2nd May 2024. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news_darryl-prestons-two-pronged-approach-reducing-crime-peterborough-and-cambridgeshire/content_29.html": "“It will take a long time to gain an understanding of policing if you have no knowledge of it,” Darryl Preston, PCC candidate.\nFrom a teenage cadet starting out with the Met to a senior detective and now politician, Darryl Preston has an intimate knowledge of policing – as he told the Peterborough Telegraph:\nThe Conservative candidate to be the next Cambridgeshire Police and Crime Commissioner is rare in that he is a former officer standing for the county’s most senior policing role, rather than a local councillor, and he is never shy in referring to his many years of experience when outlining what he believes are the best ways to tackle crime.\nThe answer? A two-pronged approach of 'robust enforcement' and 'early intervention,' he tells the paper.\nBorn and raised in London, Mr Preston started out with the Met Police as a 17-year-old, taking on a frontline policing role before moving onto armed protection which saw him guard Margaret Thatcher – “I can say she was a very polite and nice person,” he recalled.\nA move to Cambridgeshire in 1998 for a better standard of living followed, which resulted in a fresh start with Cambridgeshire police that saw him begin with frontline and neighbourhood roles, before moving into detective work.\nAfter leaving the force he joined the Association of Police and Crime Commissioners as a senior policy manager, working with the Home Office on areas including serious organised crime, violence, county lines drugs, forensics and armed policing – a far cry from his family life in Ely where he acts as a taxi for his two children and enjoys walking his dogs around the Fens.\n“It will take a long time to gain an understanding of policing if you have no knowledge of it,” Mr Preston said. “Your main role is to hold the chief constable to account while delivering an efficient police service. So my view, having had policing experience, and experience at the Association of Police and Crime Commissioners, is a real advantage. I believe I can hit the ground running on day one.”\nThe first day would be in May, with the immediate focus turning to a particular area.\n“There is one overriding priority, and I think this is the primary response of the police, and that’s cutting crime,” Mr Preston said..\nYou can read how Darryl will go about this on the Peterborough Telegraph's website.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election in May 2021. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_why-its-worth-voting-darryl-preston/content_20.html": "Darryl Preston...\nA solid record of helping the police to keep you safe and cut crime.\nDid you know I used to be a policeman?\nI have dedicated my life to protecting the public, working in both frontline and neighbourhood policing.\nFrom 1985 to 2015 I was a serving police officer – first in the Metropolitan Police.\nAnd then for 20 years, from 1998, in Cambridgeshire, initially in uniform before becoming a senior detective.\nSince 2021 I have been the Police and Crime Commissioner for Cambridgeshire and Peterborough. I am also the National Association of Police and Crime Commissioners’ Lead for forensics and biometrics.\nSo what do I do as your PCC?\nMy job is to represent you in local policing to keep you and your family safe.\nI am responsible for an efficient and effective police service in Cambridgeshire and Peterborough.\nThrough my police and crime plan, I set the police and crime objectives, the police budget and issue crime and disorder reduction grants.\nI hold the Chief Constable to account for his policing operations – PCCs have no direct control over police operations: that is wholly the responsibility of the police force.\nBut if I feel your priorities are not being met or operations are not being effective, I will say so and have the power to dismiss the Chief Constable if needs be.\nKeeping you and your family safe\nI also work with local police and other partners to make sure they are focused on your priorities – and there is a co-ordinated approach to preventing and reducing crime.\nFrom the very start, my plan has been to prioritise the issues which matter most to local people – increasing police numbers and keeping you safe.\nA very important part of this has been tackling the blight of drugs and gangs, rural crime and anti-social behaviour – along with other local issues such as road safety and fly tipping.\nRecord number of police officers\nWe now have a record number of officers – 1,732 in post at the end of March 2024, almost 400 more than in 2015. I am particularly proud 44% of the new officers are women.\nA direct result of having so many more officers is reflected in how crime has gone down across the county and in Peterborough in the last 12 months compared to pre-Covid times…\n- Neighbourhood crime – DOWN 24%.\n- Household burglary – DOWN 37%.\n- Anti-social behaviour (ASB) – DOWN 30%.\n- Robbery – DOWN 13%.\n- Rural crime – DOWN 21%.\n- Recorded knife crime – DOWN 25%... with 54% fewer hospital admissions.\n- Theft from vehicles – DOWN 36%.\n- Personal robbery offences – DOWN 15%.\n- Theft from the person offences – DOWN 12%.\n- Hare coursing and poaching – DOWN 48%.\n- Cycle theft – DOWN 56%.\n£185 million budget\nYou may be surprised to know the budget for policing Cambs and Peterborough is over £185 million – it is my responsibility to set and manage it.\nI have also made the most of obtaining additional funding – £6.6 million in the last three years.\nThis has been spent on local initiatives – in the last 12 months some 114 projects have been supported.\nThey have often been quite small and very localised, usually centring on community safety, supporting victims and witnesses of crime and tacking drugs and serious violence.\nEqually important have been projects concerned with making our streets and roads safer, bike safety and combating bike theft.\nThere have also been several youth projects to divert our children away from crime.\nPlease vote to retain me as your PCC on Thursday, 2nd May\nMy effectiveness as the Police and Crime Commissioner for Cambridgeshire and Peterborough shows through…\n- A growing but stable police force.\n- A significant reduction in neighbourhood and rural crime across the county and in Peterborough.\n- A budget run without deficit.\nI am passionate about keeping all of our communities safe.\nI will continue to work for you and with you, listening to you and ensuring the Chief Constable responds to your needs.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news_category_Local-News/content_23.html": "Tackling retail crime 23rd April 2024 I've made tackling retail crime a priority Crime is crime and retail crimes are not victimless – which is why I made tackling retail crime a priority. Darryl... Local News\nBacking our police 18th April 2024 I always back the police The police need our backing – so they have the confidence to carry out their duties to keep us all safe. Darryl Preston writes: A... Local News\nFirearms licensing 17th April 2024 Firearms licensing delays are being reduced An important function of policing is the issuing of firearms licenses as prescribed in the Firearms Act 1968. Darryl... Local News\nReducing crime in Cambridgeshire and Peterborough 8th April 2024 Reducing and preventing crime When elected as Police and Crime Commissioner in May 2021, Darryl Preston committed to reducing crime, particularly neighbourhood... Local News\nDarryl Preston elected PCC for Cambs and Peterborough 8th May 2021 Darryl Preston has been elected as Cambridgeshire and Peterborough's next Police and Crime Commissioner. His tag #GetCrimeCut was reflected in is acceptance... Local News\nBusiness crime 3rd May 2021 Crimes committed against businesses are not victimless – they have a devastating impact on all our communities. And because it's a crime, Darryl Preston's... Local News\nTackling fly tipping 13th April 2021 Fly tipping is a criminal offence – did you know it can carry a sentence of five years imprisonment and a £50,000 fine? And because it's a crime, Darryl Preston... Local News\nNo one should suffer abuse at the hands of their loved one – Darryl Preston reflects on his policing experience 28th March 2021 Much has been done in recent years to reduce domestic abuse – and rightly so. But still it goes on – Darryl Preston's intention to #GetCrimeCut in... Local News\nDog thefts – Darryl takes the lead on dog protection 2nd March 2021 There's been a spike in dog thefts throughout the country — very sad for the owners and all created by a rise in the value of dogs thanks to the Covid pandemic... Local News",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_campaigns_fighting-blight-drugs-and-violence/content_9.html": "— Fighting the blight of drugs and violence —\nBy investing and leading in the county’s response to combat gang- and knife-related crime.\nPart four of Darryl Preston’s six-point plan to continue #WeCutCrime in Cambridgeshire and Peterborough.\nFighting the blight of drugs and violence\nSerious organised crime is the biggest security threat to our country – conservatively estimated to cost the UK economy £47 billion a year.*\nThe criminals responsible for serious organised crime cause devastating harm to individuals, businesses and communities – here in Cambridgeshire and Peterborough and across the UK.\nThese criminals lead lavish life styles at the expense of misery to others, a misery which all too often manifests in our local communities.\nMuch of the serious violence, knife and gun crime is as a result of illegal drugs supply with criminals exploiting young vulnerable boys and girls to run ‘county lines’ networks.\nDrug users will often commit other crimes to feed their habits, including burglary, robbery, shoplifting, vehicle and bike theft – crimes we can all fall victim to and make us feel unsafe in our communities.\nI know what I'm talking about\nFor the past three years, I have led the County’s response to organised crime, drugs and serious violence, chairing the countywide High Harms Board.\nI am pleased to report that knife crime is down by 26%, bucking national trends, along with 54% fewer hospital admissions for knife injuries.*\nAnd prior to becoming your Police and Crime Commissioner, I sat on the national county lines working group, attended the national taskforce on serious violence chaired by the Home Secretary, worked closely with the National Crime Agency and was senior policy lead at the Association of Police and Crime Commissioners for Serious Organised Crime.\nSo I know what I’m talking about, both strategically and tactically as I have also been a frontline police officer locking up these criminals.\nThis is not a scourge which just impacts our cities – there are county lines operating in towns and villages right across Cambridgeshire and Peterborough.\nChild abuse too\nThere are many other types of serious organised crime, including criminal networks which sexually abuse children for gratification and financial reward, enabled by the internet.\nThis is cyber-enabled crime, a new and increasing threat to us all. We are more likely to be a victim of cyber-enabled crime, such as fraud, then any other crime.\nAnd, of course, rural and business crime, with high-cost plant and machinery stolen by sophisticated organised criminals.\nDisruption and confiscation\nWe need to continue to keep our county and country hostile to organised criminals, putting them in jail where we can, disrupting them when we can’t and hitting them where it hurts most – by confiscating all their ill-gotten gains.\nIf re-elected I will…\n1. Continue to support and fund the Eastern Region Special Operations Unit (ERSOU), the team leading the fight to tackle serious organised crime across our region.\n2. Continue to engage with and support the National Crime Agency, encouraging more operations to fight serious organised crime in our county.\n3. Continue to lead the county response to tackle organised crime by chairing the countywide High Harms Board.\n4. Continue to lead the county’s implementation of the government from Harm to Hope drug strategy by being the county senior responsible owner.*\n5. Further invest in serious violence reduction, focussing on early intervention with additional youth services keeping children and young people safe.\n* Sources\nNational Crime and Policing Measures – Cambridgeshire.\nNew strategy to tackle organised crime.\nFrom harm to hope: a 10-year drugs plan to cut crime and save lives.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election on 2nd May 2024. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news_no-one-should-suffer-abuse-hands-their-loved-one-darryl-preston-reflects-his-policing/content_28.html": "Much has been done in recent years to reduce domestic abuse – and rightly so.\nBut still it goes on – Darryl Preston's intention to #GetCrimeCut in Cambridgeshire and Peterborough includes a specific eight point plan to combat domestic abuse.\nDarryl writes:\nReducing domestic abuse\nI have not been a victim of domestic abuse and was raised in a loving home where violence and abuse of any kind was simply not tolerated. As a husband and parent I hold those same values.\nHowever, as a frontline police officer I attended hundreds of domestic abuse incidents and as a detective led domestic abuse investigation teams.\nI have witnessed some of the very worst of human nature, whereby a person is abused by the person they love and should be loved by in their homes – the place where we should all be safe.\nA quote to remind us of old attitudes\nMuch has been done in recent years to reduce domestic abuse – and rightly so.\nWhen I worked in the Domestic Abuse Team in Cambridge, we kept a quote on the wall to remind us, as if we needed to be, of the importance of protecting people, both women and men, from domestic abuse.\nMany years ago, when challenged about the capital’s high murder rate, a former Police Commissioner of the Metropolitan Police said:\n‘It is not as bad as it seems when you consider many of those murders are domestics.’¹\nIn our view it was worse, for it seemed as many could, and indeed should, have been prevented with the appropriate interventions.\nA shocking number\nAlthough the multi-agency response to domestic abuse has improved and significant strides have been made in reducing this crime, around 2.3 million adults – women and men – suffered abuse last year. That is almost certain to rise this year due to the pandemic.\nBut the most troubling figure is that an average of more than two women die each week as a result of this crime.\nThis is simply not acceptable.\nThe government has recognised this with a significant investment up and down the country, with £76 million last year and an additional £125 million this year to local councils for safe accommodation and support, with an extra £40 million fund to support victim services.\nCambridgeshire and Peterborough have benefited significantly from this substantial funding having been awarded over £1.5 million.\nWe will also see new legislation.\nIf elected, I will…\nI am passionately committed to reducing domestic abuse and supporting victims. If elected, I will:\n1. Recruit many more police officers to respond to and investigate domestic abuse cases.\n2. Invest significant sums in domestic abuse victim’ services and support Independent Domestic Violence Advisors (IDVAs).\n3. Introduce electronic tags with GPS tracking devices for perpetrators of domestic abuse and related offences – including stalking, harassment, physical abuse, sexual abuse and coercive control – on perpetrators released from prison to protect victims and address the behaviour of offenders.\n4. Invest in awareness campaigns and support work with children and young people to change attitudes to domestic abuse.\n5. Invest in charities providing services to reduce domestic abuse and protect victims.\n6. Support the police in the use of prevention of domestic violence protection notices and orders to protect victims.\n7. Ensure support is available for ‘harder to reach’ communities, including in rural areas and BAME groups.\n8. Listen to those impacted by domestic abuse and, working together, be willing to try new ways of reducing this crime.\n¹ To the best of my recollection.\nSources\nWhite Ribbon – ambassadors and champions.\nPublic sector executive articles: councils allocated £125m to support domestic abuse victims.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election in May 2021. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news_reducing-crime-cambridgeshire-and-peterborough/content_30.html": "Reducing and preventing crime\nWhen elected as Police and Crime Commissioner in May 2021, Darryl Preston committed to reducing crime, particularly neighbourhood crimes such as household burglary.\n\"Crime is crime, whether against the person, their home, business or possessions. My intention to #WeCutCrime in Cambridgeshire and Peterborough includes a specific six point plan to reduce crime.\"\nHe writes:\nAs an ex senior police officer, I know reducing crime takes a two-pronged approach – preventing crimes from happening in the first place and robust enforcement when they occur.\nThese two themes became central to my Police and Crime Plan.\nMy first promise was to recruit many more police officers.\nCambridgeshire Constabulary now has a record 1,732 police officers – exceeding government targets.\nSome say this is just replacing those lost as a result of austerity.\nIn Cambridgeshire that is simply not true: in fact we have 400 more police officers compared to 2015, a 30% increase.\nAs a result crime is down:\n- Neighbourhood crime – DOWN 24%.\n- Household burglary – DOWN 37%.\n- Anti-social behaviour (ASB) – DOWN 30%.\n- Rural crime – DOWN 21%, hare coursing down 73%\n- Recorded knife crime – DOWN 25%... with 54% fewer hospital admissions.\n- Bike theft – DOWN 56%.\n- Roads are safer with serious injuries and fatalities down.\nBut this is not just about enforcement – preventing crime, and road accidents, matters as much as catching criminals.\nSecured £21.5m of additional funding\nI have listened to the concerns of local people and led multi-agency partnerships to act on those concerns.\nAnd over the past three years I have secured £21.5m of funding from government – additional to the annual central government grant – to prevent crime and support victims.\nThis money has been invested in over 100 projects to keep our communities safe, in our cities, towns and villages.\nThrough working with our Community Safety Partnerships, we are seeing the results locally – the tackling of county lines and knife crime – with some great initiatives in our schools; reduction of shoplifting in our high streets; preventing fly tipping with mobile CCTV equipment and then successfully prosecuting the offenders.\nBike thefts down\nIn 2021 I promised to tackle bike theft. In my view this was a public confidence issue in policing as many thought the police just did not care.\nWell, they do now with bike theft massively down across our county.\nAnd as a result of my commitment to tackle rural crime, the Chief Constable bolstered the Rural Crime Action Team (RCAT).\nAlong with my investment in Cambridgeshire Countryside Watch and new legislation, rural crime is down – with the blight of hare coursing down a huge 73%.\nAnd I have done more to protect business\nI have run webinars on cyber crime prevention and invested in the Eastern Cyber Resilience Centre a police owned company, helping businesses keep safe from cyber attack.\nThe constabulary now has dedicated retail crime officers – along with prevention packs funded by my office, shoplifting is down 14%.\nFor more information on my achievements to date, please read my last annual report to the Police and Crime Panel.\nHowever, I know there is more to do and that is why I am committed to maintaining more police and keeping our streets safe.\nIf re-elected on 2nd May I will…\n- Further tackle crime and ASB – with even more investment in local policing.\n- Put Communities first – ensuring the police are visible.\n- Work to make our roads safer – with further investment to reduce speeding and prevent casualties.\n- Continue the fight against drugs and violence – with further investment in prevention to reduce demand, dismantle county line drug gangs and their associated violence.\n- Maintain my commitment to tackle rural crime – with further investment in rural safety.\n- Prevent crime – with further investment in early intervention schemes, including beating the scourge of domestic and sexual violence.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election on 2nd May 2024. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_accessibility/content_8.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news_feed/content_22.html": null,
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_contact/content_2.html": "Skip to main content\nDarryl Preston\nfor Cambridgeshire & Peterborough\nMain navigation\nAbout Darryl\nMy plan\nYour views\nNews\nContact\nDarryl Preston\nfor Cambridgeshire & Peterborough\nContact\nLeave this field blank\n[email protected]\nDarryl Preston Police&Crime Commissioner for Cambs&PE\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by Darryl Preston on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news_firearms-licensing/content_11.html": "Firearms licensing delays are being reduced\nAn important function of policing is the issuing of firearms licenses as prescribed in the Firearms Act 1968.\nDarryl Preston writes:\nChief Constables are responsible in law for firearms licensing decisions in their force – they grant and authorise firearm and shotgun certificates.\n- Certificates are given to applicants with a good reason for possessing a firearm or shotgun and who are assessed as suitable.\nI acknowledge the concerns raised regarding the recent delays in firearms licencing renewal applications and have been actively engaging with the Chief Constable to address this matter promptly.\n- We are fully aware of the issue and he is implementing measures to improve the situation.\n- The delays stem from the implementation of new Statutory Guidance by the Home Office in February 2023, coupled with updated professional practice standards from the College of Policing in August 2023 following tragic cases involving firearms licence holders, including the Plymouth shootings in 2021.\nAdditional requirements\nThese changes introduced additional requirements for assessing the suitability of applicants for firearms licenses, leading to a surge in demand on licensing units across all police forces, including Cambridgeshire.\nEfforts are underway to enhance the capacity of the combined Bedfordshire, Cambridgeshire and Hertfordshire firearms licencing unit to meet these new demands, including additional recruitment, and the allocation of additional budgetary resources – which have been made permanent in the 2024/25 budget.\nFurthermore, the introduction of a new case management system and the establishment of an Independent Advisory Group are planned, aimed at streamlining processes and ensuring compliance with regulatory standards.\nI understand the importance of timely processing of applications and give assurance every effort is being made to address the situation.\nPlease be assured this matter remains a priority – and that I am committed to achieving a satisfactory resolution.\nIf re-elected on 2nd May I will…\n- Ensure the firearms licensing department is sufficiently well resourced to deliver certificate variations, renewals and grants in a timely manner – 95% of all renewals and grants (except those involving serious safety concerns, which may require more investigation) are completed within 12 weeks.\n- Set up an Independent Advisory Group, where key stakeholders can give feedback to the force on its decisions and performance with respect to firearms licensing.\n- Ensure Cambridgeshire Constabulary is compliant with the College of Policing authorised professional practice in relation to firearms licensing.\n- Make reference to the above commitments in the Police and Crime Plan, which will be published within the statutory timeframe.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election on 2nd May 2024. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_about-darryl-preston/content_6.html": "Darryl Preston...\nA solid record of helping the police to keep you safe and cut crime.\nDid you know I used to be a policeman?\nI have dedicated my life to protecting the public, working in both frontline and neighbourhood policing.\nFrom 1985 to 2015 I was a serving police officer – first in the Metropolitan Police.\nAnd then for 20 years, from 1998, in Cambridgeshire, initially in uniform before becoming a senior detective.\nSince 2021 I have been the Police and Crime Commissioner for Cambridgeshire and Peterborough. I am also the National Association of Police and Crime Commissioners’ Lead for forensics and biometrics.\nSo what do I do as your PCC?\nMy job is to represent you in local policing to keep you and your family safe.\nI am responsible for an efficient and effective police service in Cambridgeshire and Peterborough.\nThrough my police and crime plan, I set the police and crime objectives, the police budget and issue crime and disorder reduction grants.\nI hold the Chief Constable to account for his policing operations – PCCs have no direct control over police operations: that is wholly the responsibility of the police force.\nBut if I feel your priorities are not being met or operations are not being effective, I will say so and have the power to dismiss the Chief Constable if needs be.\nKeeping you and your family safe\nI also work with local police and other partners to make sure they are focused on your priorities – and there is a co-ordinated approach to preventing and reducing crime.\nFrom the very start, my plan has been to prioritise the issues which matter most to local people – increasing police numbers and keeping you safe.\nA very important part of this has been tackling the blight of drugs and gangs, rural crime and anti-social behaviour – along with other local issues such as road safety and fly tipping.\nRecord number of police officers\nWe now have a record number of officers – 1,732 in post at the end of March 2024, almost 400 more than in 2015. I am particularly proud 44% of the new officers are women.\nA direct result of having so many more officers is reflected in how crime has gone down across the county and in Peterborough in the last 12 months compared to pre-Covid times…\n- Neighbourhood crime – DOWN 24%.\n- Household burglary – DOWN 37%.\n- Anti-social behaviour (ASB) – DOWN 30%.\n- Robbery – DOWN 13%.\n- Rural crime – DOWN 21%.\n- Recorded knife crime – DOWN 25%... with 54% fewer hospital admissions.\n- Theft from vehicles – DOWN 36%.\n- Personal robbery offences – DOWN 15%.\n- Theft from the person offences – DOWN 12%.\n- Hare coursing and poaching – DOWN 48%.\n- Cycle theft – DOWN 56%.\n£185 million budget\nYou may be surprised to know the budget for policing Cambs and Peterborough is over £185 million – it is my responsibility to set and manage it.\nI have also made the most of obtaining additional funding – £6.6 million in the last three years.\nThis has been spent on local initiatives – in the last 12 months some 114 projects have been supported.\nThey have often been quite small and very localised, usually centring on community safety, supporting victims and witnesses of crime and tacking drugs and serious violence.\nEqually important have been projects concerned with making our streets and roads safer, bike safety and combating bike theft.\nThere have also been several youth projects to divert our children away from crime.\nPlease vote to retain me as your PCC on Thursday, 2nd May\nMy effectiveness as the Police and Crime Commissioner for Cambridgeshire and Peterborough shows through…\n- A growing but stable police force.\n- A significant reduction in neighbourhood and rural crime across the county and in Peterborough.\n- A budget run without deficit.\nI am passionate about keeping all of our communities safe.\nI will continue to work for you and with you, listening to you and ensuring the Chief Constable responds to your needs.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk/content_1.html": "Tackling crime and ASB Communities come first Safer roads Fighting the blight of drugs and violence Keeping our rural communities safe More crime prevention Find me on Facebook Contact [email protected]Darryl Preston Police&Crime Commissioner for Cambs&PE News for you Tackling retail crime I've made tackling retail crime a priority Crime is crime and… Backing our police I always back the police The police need our backing – so they… Firearms licensing Firearms licensing delays are being reduced An important…",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news/content_24.html": "Tackling retail crime Tuesday, 23 April, 2024 I've made tackling retail crime a priority Crime is crime and retail crimes are not victimless – which is why I made tackling retail crime a priority. Darryl Preston writes: As Police and Crime Commissioner for Cambridgeshire and Peterborough I have visited many retailers across our county, both large and small, talking to shop owners and staff at a local and national level. Theft – shoplifting –... Local News\nBacking our police 18th April 2024 I always back the police The police need our backing – so they have the confidence to carry out their duties to keep us all safe. Darryl Preston writes: A... Local News\nFirearms licensing 17th April 2024 Firearms licensing delays are being reduced An important function of policing is the issuing of firearms licenses as prescribed in the Firearms Act 1968. Darryl... Local News\nReducing crime in Cambridgeshire and Peterborough 8th April 2024 Reducing and preventing crime When elected as Police and Crime Commissioner in May 2021, Darryl Preston committed to reducing crime, particularly neighbourhood... Local News\nDarryl Preston elected PCC for Cambs and Peterborough 8th May 2021 Darryl Preston has been elected as Cambridgeshire and Peterborough's next Police and Crime Commissioner. His tag #GetCrimeCut was reflected in is acceptance... Local News\nBusiness crime 3rd May 2021 Crimes committed against businesses are not victimless – they have a devastating impact on all our communities. And because it's a crime, Darryl Preston's... Local News\nTackling fly tipping 13th April 2021 Fly tipping is a criminal offence – did you know it can carry a sentence of five years imprisonment and a £50,000 fine? And because it's a crime, Darryl Preston... Local News\nNo one should suffer abuse at the hands of their loved one – Darryl Preston reflects on his policing experience 28th March 2021 Much has been done in recent years to reduce domestic abuse – and rightly so. But still it goes on – Darryl Preston's intention to #GetCrimeCut in... Local News\nDog thefts – Darryl takes the lead on dog protection 2nd March 2021 There's been a spike in dog thefts throughout the country — very sad for the owners and all created by a rise in the value of dogs thanks to the Covid pandemic... Local News\nDarryl Preston's two-pronged approach to reducing crime in Peterborough and Cambridgeshire 25th February 2021 “It will take a long time to gain an understanding of policing if you have no knowledge of it,” Darryl Preston, PCC candidate. From a teenage cadet starting out... Local News",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_campaigns_communities-come-first/content_16.html": "— Communities come first —\nBy ensuring the police are visible, listening to local concerns and responding quickly.\nPart two of Darryl Preston’s six-point plan to continue #WeCutCrime in Cambridgeshire and Peterborough.\nCommunities come first\nOne of the first questions I’m asked when talking to residents is 'What does a Police and Crime Commissioner (PCC) do and why do we need one?'\nWell, having been a serving police officer for 30 years, I then worked as a senior policy manager for the Association of Police and Crime Commissioners in Westminster, supporting and representing all PCCs across the country.\nAs your elected PCC for the past three years, I have a special insight into the role.\nThe PCC’s major functions are...\n- Responsibility for the policing budget – currently £185m a year for the Cambridgeshire and Peterborough constabulary.\n- Setting strategic priorities via a police and crime plan.*\n- Holding the Chief Constable to account for the running of an effective and efficient police force.\n- Commissioning services such as victim support.\nIn addition, the PCC...\n- Must take account of the national strategic policing requirement set by the Home Office.\n- Appoints – and can dismiss – the Chief Constable.\nBut, in my view, the most important role of the PCC is to be the elected representative of the communities they serve, listening to the concerns of all the residents in their policing area and acting on those concerns.\nIt is this part of the job that should define a good PCC – communities should know who their PCC is and see they are making a difference in keeping us all safe.\nTo that end, the PCC must be accountable to all the residents they serve – working with and for you.\nI’m a crime fighter\nAt heart I'm a crime fighter, not a politician.\nThough good governance is a key aspect to the job, this should not be an ‘admin role'. If re-elected I will continue to work hard to ensure all your voices are heard and the police act on your concerns.\nThis applies to all our communities – in our towns and cities, in our villages and rural communities.\nIf re-elected I will...\n1. Continue to consult with local residents, businesses, partners (councils, schools, health, fire, ambulance and other agencies) and charitable organisations to draw up the priorities in the police and crime plan for Cambridgeshire and Peterborough.\n2. Continue to engage with residents and make sure police action tackles residents’ concerns and priorities. I will be visible, out and about meeting residents and businesses – in Cambridgeshire and Peterborough – to ensure local issues are identified and action is taken.\n3. Continue to hold surgeries with residents in all parts of the county.\n4. Continue to ensure the police are engaging with and visible to local communities, responding to local concerns.\n5. Further Invest in the 101 police telephone contact system and online services, making sure everyone can contact the police when they need to.\n6. Continue to include victim support, crime prevention, road safety and an attack on organised crime as key parts of my police and crime plan.*\n* Current police and crime plan\nPolice and crime plan for Cambridgeshire and Peterborough, 2021 to 2024.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election on 2nd May 2024. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news_tackling-retail-crime/content_4.html": "I've made tackling retail crime a priority\nCrime is crime and retail crimes are not victimless – which is why I made tackling retail crime a priority.\nDarryl Preston writes:\nAs Police and Crime Commissioner for Cambridgeshire and Peterborough I have visited many retailers across our county, both large and small, talking to shop owners and staff at a local and national level.\n- Theft – shoplifting – and burglary (including ram raids) along with abuse and assaults on shop workers has a significant impact on business owners, retail workers and indeed the wider community.\nIt impacts us all.\nThe point I always make is that retail – and business – crimes are not victimless, they are crimes.\nWhich is why I made tackling retail and business crime a priority – to assure business owners and workers the police will respond effectively.\n- As a result, Cambridgeshire Constabulary has a dedicated police resource embedded in the local policing team and I have funded initiatives such as Shopwatch.\nThe policy of Cambridgeshire Constabulary is to investigate ALL shoplifting offences\nTo expel a myth quoted by the Labour party, the policy of Cambridgeshire Constabulary is to investigate ALL shoplifting offences, regardless of value, where there are reasonable lines of enquiry.\nIf re-elected on 2nd May I will…\n- Ensure tackling retail and business crime remains a priority in the police and crime plan.\n- With record numbers of police officers, further invest in visible local policing.\n- Continue to ensure police investigate all business crime where there are reasonable lines of enquiry.\n- Hold the Chief Constable and wider criminal justice system to account for enforcing tough new laws of assault on shop workers.\n- Hold the Chief Constable to account for implementing the national retail crime action plan.\n- Continue to support the national work of Operation Pegasus, a partnership between retailers and policing, set up to centralise intelligence on serious and organised crime groups involved in retail crime.\n- Continued investment for our Community Safety Partnerships to tackle further all business crime.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election on 2nd May 2024. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_privacy/content_19.html": "This document outlines how Darryl Preston processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Darryl Preston\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Darryl Preston.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Darryl Preston, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Darryl Preston via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news_backing-our-police/content_5.html": "I always back the police\nThe police need our backing – so they have the confidence to carry out their duties to keep us all safe.\nDarryl Preston writes:\nA primary role of the Police and Crime Commissioner, as set out in legislation, is to listen to the public and ensure the police respond to their concerns.\nWe are fortunate we have a system of policing by consent in this country – consent not by all, but certainly by the far majority of good, honest law-abiding citizens.\nAnd this is laid down in the Peelian principles established in 1829 and still relevant today:\n'The power of the police to fulfil their functions and duties is dependent on public approval of their existence, actions and behaviour, and on their ability to secure and maintain public respect.\n'The police are the public and that the public are the police.'\nExperience gained through 30 years' police service\nAs an ex police officer with 30 years of service, I am fully aware of the need for public support.\nI recall as a young 21-year-old police officer I attempted to arrest a much larger drunken individual who had been assaulting members of the public in a busy street.\nI was on my own and the individual did not want to be arrested, resulting in, well, a rather one-sided wrestling match. I remember to this day that an unknown (to me) member of the public stopped their car, jumped out and assisted me to detain the individual.\nThis is just one of many stories I can tell where ordinary members of the public came to my aid.\nWe have 1,732 warranted police officers\nIn Cambridgeshire and Peterborough we have 1,732 warranted police officers, along with Police Community Support Officers and other staff, who put themselves on the line every day to keep us safe.\nHolding that warrant card means they can no longer walk away from the dangers most of us can and they will experience some of the worst (and the best) of humanity.\nThe vast majority are professional, ethical and brave and a credit to the uniform they wear.\nThey are also my public, and I have and will listen to them.\nTo be clear, I have made ethical policing a priority and this was before some of the abhorrent national cases we have seen in recent times.\nWe need high levels of vetting and re-vetting and Chief Constables need to be able to sack those who let the police service and public they represent down.\nBut, I will back our police, so they have the confidence to carry out their duties, using all the legislative tools in the box, to keep us all safe.\nIf re-elected on 2nd May I will…\n- Ensure sufficient police numbers are maintained.\n- Continue to fight for fairer funding for Cambridgeshire Constabulary.\n- Support at least inflationary pay increases.\n- Continue to support the Cambridgeshire Police Federation in their call for equal pay to officers in surrounding forces.\n- Maintain a good working relationship with Unison, supporting staff members.\n- Campaign for a fairer and swifter complaints system that benefits the police service and the public.\n- Call for stiff sentences for criminals who assault the police.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election on 2nd May 2024. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_news_darryl-preston-elected-pcc-cambs-and-peterborough/content_27.html": "Darryl Preston has been elected as Cambridgeshire and Peterborough's next Police and Crime Commissioner.\nHis tag #GetCrimeCut was reflected in is acceptance speech when he said said his priorities were \"cutting crime, protecting the public and supporting the victims of crime\".\nDarryl's acceptance speech:\nI would like to start by saying thank you to the residents of Cambridgeshire and Peterborough for putting your faith in me.\nI would also like to thank my campaign team and colleagues across the county. This is our victory.\nTo serve as your Police and Crime Commissioner is a privilege – a privilege that carries great responsibility, and an honour I do not take lightly.\nI understand that responsibility, and that is to represent you, all the residents of our great county, giving you a voice in keeping all of our communities safe.\nIn a few days time I will take an oath, enshrined in law, and swear that:\n‘I will act with integrity and diligence in my role and, to the best of my ability, will execute the duties of my office to ensure that the police are able to cut crime and protect the public.’\nCutting crime, protecting the public and supporting victims – those are my priorities – because I have listened and they are your priorities:\n- More police in our cities, towns and rural areas keeping us safe.\n- Better prevention – focussing on early intervention in our most troubled families.\n- Safer roads – reducing fatal and serious injury accidents.\n- Protecting our rural communities with more investment.\n- Fighting organised crime, catching the very worst criminals who cause so much misery to us all.\n- And putting you – the people of Cambridgeshire and Peterborough first, ensuring the police listen to your concerns and act upon them.\nAnd I will do this without favour or prejudice, as I did as a police officer, serving all our communities, keeping us all safe.\nThank you.\nResults\nFour people contested the election: Nicky Massey, Labour, Susan Morris, Reform UK, Rupert Moss-Eccardt, Liberal Democrat and Darryl Preston, Conservative.\n- PCCs are elected using the supplementary vote system, with voters making a first and second choice.\n- If no candidate gets more than 50% of the first-choice votes, all except the top two candidates are eliminated.\n- At that stage the second votes of those residents whose first choice has been eliminated are counted.\nIn the first round, Darryl took the lead with 99,034 votes (42.9%)\nMs Massey received 72,313 votes (31.3%), Mr Moss-Eccardt 51,490 votes (22.3%) and Ms Morris 8,031 votes (3.5%) – Morris and Moss-Eccardt were therefore eliminated.\nFollowing the second count, Darryl won 114,053 votes, Ms Massey 102,195 votes.\nAlthough the role of Police and Crime Commissioner is non-political, the elections are contested by political parties. Since the position was created in 2012, all holders in Cambs and Peterborough have been Conservative: Sir Graham Bright (2012-2016), Jason Ablewhite (2016-2019), Ray Bisby (appointed in 2019 and did not seek election) and, now Darryl Preston.\nResult detail\nPCC election results, 8th May 2021.\nVideo of Darryl's acceptance speech\nDarryl Preston was the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election on 6th May 2021. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_about-rss/content_3.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_campaigns_safer-roads/content_18.html": "— Safer roads —\nBy investing in prevention and enforcement to reduce further casualties on our roads.\nPart three of Darryl Preston’s six-point plan to continue #WeCutCrime in Cambridgeshire and Peterborough.\nSafer roads\nHaving had to deal with fatal road collisions when I was a police officer, I am acutely aware of the devastating impact this has on families, friends and local communities.\nIndeed, I dealt with far too many serious injury and fatal incidents on our roads – and having to deliver that message to loved ones was, for me, the hardest job in policing\nThey used to be called road traffic accidents – but of course most are not: they are avoidable by all of us taking personal responsibility and driving safely.\nTalking to residents, road safety is a significant concern in our villages, towns and cities and that is why I made this a priority when elected in 2021. I have made available significant resources to our road safety partnership – Vision Zero – and to the Chief Constable for additional enforcement. As a result, serious injury and fatal collisions on our roads have fallen year on year since 2021 – but more still needs to be done.\nPartnership working is the key\nto tackling speeding and road fatalities\nIt is clear we need even more preventative actions. We need to be more data lead and utilise the information we collate from collisions to inform our decisions.\nAt the same time, we need to continue surveying our roads, making sure they are safe through technical solutions such as speed reduction and better road design\nI know that Cambridgeshire County Council and Peterborough City Council are working very hard on this. They have my full support and I am determined to make sure we continue to make our roads safer.\nListening to local concerns\nNot only will I continue to work with all the partners involved in road safety, I will also be listening to what residents have to say. People know their communities better than anyone and I will put forward their ideas:\n- Campaigns to reduce speeding, dangerous and drink / drugs driving.\n- Community Speedwatch groups.\n- And, in consultation with and agreement of local communities, reducing speed limits in residential areas to 20 mph where there is a good case to do so.\nHowever, we do also need robust enforcement of our road traffic laws by the police – catching those who break the law and deterring others.\nRoad safety really matters to me\nMy plan if re-elected, is\n1. Continue to support the Cambridgeshire and Peterborough Road Safety Partnership.\n2. Continue to make resources available to the Chief Constable to ensure casualty reduction and enforcement of road traffic laws.\n3. Continue to drive the use of innovative technology, data analysis and artificial intelligence to prevent accidents from happening.\n4. Continue to listen to local communities and support local campaigns to reduce speeding and dangerous parking.\n5. Continue to support the lowering of speed limits in residential areas but also in between villages where there is a good case to do so and is supported by local residents.\n6. Continue to invest in local road safety schemes through as safer communities fund.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election on 2nd May 2024. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_your-views/content_14.html": "It is very important for me to understand what you think about Policing in Cambridgeshire and Peterborough.\nPlease fill in this survey and tell me what matters to you:\nIt is very important for me to understand what you think about Policing in Cambridgeshire and Peterborough.\nPlease fill in this survey and tell me what matters to you:",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_campaigns_keeping-our-rural-communities-safe/content_12.html": "— Keeping our rural communities safe —\nBy working with rural communities – and investing in our Rural Crime Action Team and Countryside Watch.\nPart five of Darryl Preston’s six-point plan to continue #WeCutCrime in Cambridgeshire and Peterborough.\nKeeping our rural communities safe\nThere is a perception by some that rural crime is not a priority – that it is about people trespassing on farmers’ land and letting dogs chase hares.\nThis is simply not the case – and that is why I promised to make tackling rural crime a priority when I was elected as your PCC in May 2021.\nAnd I have done just that – overall rural crime is now down by 21%* with the Constabulary reporting a massive 73% drop in hare coursing since pre-Covid times.\nRural Crime Action Team bolstered\nThe Chief Constable bolstered the Rural Crime Action Team (RCAT) and I have significantly invested in Countryside Watch. In addition, along with our MPs, I lobbied for tougher laws in relation to hare coursing.\nThis resulted in new legislation enabling the police to prosecute more offenders, confiscate their dogs and provide for tougher sentences – making Cambridgeshire and Peterborough hostile to these criminals.\nRural crime cost the UK £49.5m in 2022/23, with organised criminals using sophisticated methods to steal high value agricultural equipment, livestock and other property, including GPS thefts.*\nUnfortunately, given that most of our county is rural with a significant agricultural heritage, Cambridgeshire and Peterborough is not immune with an estimated cost of around £2m+ to our farming communities.\nThe £2m+ in Cambridgeshire is just the value of the equipment and livestock stolen – it doesn’t take into account the huge cost of damage to crops, fences and buildings.\nThe real cost is incalculable\nIf you add the massive amount of time wasted and all the extra costs involved in reporting, replacing, fixing and preventing, the real figure surrounding this criminal activity runs into many, many millions of pounds.\nAnd then there’s the worry, too.\nCrime, and the fear of crime, deeply impacts our rural communities where many people – farmers in particular – are more remote and can feel less safe knowing that help may not be close at hand.\nSerious threats by criminals and actual bodily harm to those defending their property and livelihoods has also been all too common.\nMore than just the terrible slaughter of hares\nThough massively reduced, hare coursing continues to be a problem in our county.\nThe criminals responsible can be highly intimidating and aggressive: large amounts of illicit cash changes hands during an ‘event’ and they care nothing for damaging crops and property, and will drive like maniacs to avoid being caught.\nIllegal encampments are another concern many residents have raised with me, impacting both our rural and urban communities.\nFly-tipping – another menace\nFly tipping, although dealt with by your district council, is another criminal activity, which disproportionately affects the countryside.\nThat is why I have worked with our local councils, investing in mobile CCTV and other preventative projects, along with supporting land owners impacted by this crime with ‘clear up’ costs.\nIf you witness any of these activities taking place, you should always call the police on 999 and report it as a crime in progress.\nHere to represent all who abide by the law\nIf re-elected, I will continue to support and represent all our residents, including law-abiding members of the travelling community.\nBut I will not support those who cause disruption to our settled communities and break the law. I will hold the police to account for using new powers introduced by parliament to keep all our residents safe and prevent crime.\nI know many farmers and residents in our rural communities are mostly pragmatic and understanding the police cannot be everywhere.\nBut, they should expect a swift and robust police response when problems occur, along with a visible presence in our rural communities to deter crime from happening in the first place.\nIf re-elected I will:\n1. Continue to make resources available to the Chief Constable to support the Rural Crime Action Team.\n2. Continue to invest in Cambridgeshire Countryside Watch ensuring even more crime prevention.\n3. Continue to work with the National Rural Crime Network and National Farmers Union on plans to reduce crimes such as GPS thefts.\n4. Explore the use of technology to reach smaller communities quicker and ensure the Chief Constable deploys the resources where and when they are needed.\n5. Continue to invest in our community safety partnerships, tackling local issues such as fly tipping.\n6. Continue to engage with and hold regular meetings with our farming communities.\n* Sources\nDelivery of the Police and Crime Plan – report, 13th March 2024.\nDarryl Preston is the Conservative candidate in the Cambridgeshire and Peterborough Police and Crime Commissioner election on 2nd May 2024. There's more about Darryl on the About Darryl Preston page.",
  "https_www_darrylpreston_org_uk_/https_www_darrylpreston_org_uk_myplan/content_10.html": "My plan to continue #WeCutCrime in Cambridgeshire and Peterborough\n- Tackling crime and anti-social behaviour\nInvesting in local policing in our cities, towns and villages – and targeting neighbourhood crimes such as burglary.\n- Communities come first\nEnsuring the police are visible, listening to local concerns and responding quickly.\n- Safer roads\nInvesting in prevention and enforcement to reduce further casualties on our roads.\n- Fighting the blight of drugs and violence\nInvesting and leading in the county’s response to combat gang- and knife-related crime.\n- Keeping our rural communities safe\nWorking with rural communities – and investing in our Rural Crime Action Team and Countryside Watch.\n- More crime prevention\nFurther investment to keep all our communities safe, with a focus on diverting young people away from crime – and combatting domestic and sexual violence."
}