{
  "https_www_pamcox_co_uk/https_www_pamcox_co_uk/content_1.html": "My Latest...\nMy story\nColchester has been my home for over 20 years. I raised my family here and sent my children to local state schools. I'm a city councillor and teach at the University of Essex.\nI was brought up in Southend in a family dedicated to public service. My mum had been a midwife in the East End before becoming a nurse, health visitor and then a public health manager. My dad left school at 15 and was apprenticed as a carpenter before joining the church and becoming a minister. They had grown up in hardship and felt it their duty to step up and gave back. They were pragmatic and principled, and they passed on those values to their children.\nBoth my sisters became nurses in south Essex. One is now a diabetes specialist, the other supports community nursing. I went to university, did a PhD and became an academic. I’ve specialised in the history of marginalised women and girls and their treatment by the criminal justice and care systems.\nI’ve advised the Victims Commissioner on the code of victims’ rights, worked with Colchester City Council on tackling the causes of anti-social behaviour, and evaluated Hertfordshire Police's work tackling violence against women. I was a lay member of the Suffolk Family Justice Panel for several years and I worked with local authorities and third sector organisations to develop new services for mothers in Ipswich whose babies had been taken into care. I’m proud to say that other services inspired by that work have since been rolled out across the country.\nI’ve also presented two BBC television series on social history: one on servants and another on shopgirls.\nFirst elected as a city councillor in 2021, I see my role as driving local change. In my role as\nPortfolio-holder for Culture and Heritage I worked to attract more visitors to Colchester.\nAs a ward councillor, I've worked to tackle the causes of anti-social behaviour, to support community gardens, allotments and orchards, and revive the New Town youth club.\nIn short, I have a proven track record in creating progressive change. I want to take that to the\nnational level and create a better, fairer Colchester.\nMy Pledges To You\nMy Work for Colchester\nA local MP creating change\n-\nSet up a 'High Street task force' to revitalise our historic city centre\n-\nProtect our green spaces, river and country parks\n-\nReduce congestion and improve public transport\n-\nCelebrate Colchester’s proud record as a welcoming and diverse city\n-\nMake Colchester a great place to live, work and visit"
}