{
  "https_farahlondon_com_/https_farahlondon_com_project-we-care/content_7.html": "Farah London, founded 'Project We Care', as a initiative to give back to communities, people and to society as a whole. Project We Care, has undertaken projects including giving back to the homeless community, helping charities that support women and outreach to vulnerable youth that are targeted or gang afflicted through Project We Care, she mentors youth and works with community partners to support their efforts.\nFarah also works with schools to identify children living below the poverty line and buys coats, hats, gloves or essentials during winter months to ensure children have warm clothes.\nProject We Care, supports international disaster relief and collect donations in clothes and essentials for families who have lost everything, including the victims of 2018 earthquake in Mexico and the 2023 Türkiye one.\nThroughout the year, Farah arranges a special Barista Speciality coffee giving to the homeless community, including providing clothes, food, blankets and tents, alongside the best coffee in London.\n\"We Love NHS\" is an initiative started by Farah to support NHS workers. She delivered food to over 14 hospitals across London for the amazing NHS teams, including organizing a special Barista morning for staff ending their shifts and those beginning their workday.\nIt was an honoured to be selected by the University of Westminster to present a live brief to final-year International Business students. This assignment, which contributed to their final grades, was based on a real-world challenge from an existing family office client. The students were tasked with developing investment strategies for Saudi Arabia, Brazil, and Libya.\nOver 100 students participated in this exciting project during their final semester, delivering outstanding results—some of which are investment-ready. I commend the University of Westminster for its commitment to immersive learning and am grateful for the opportunity to contribute to the students' academic and professional growth.\nWe Love NHS and School Food Bank Drop",
  "https_farahlondon_com_/https_farahlondon_com_meet-farah-1/content_2.html": "Farah London DStG is a distinguished leader and visionary entrepreneur with a wealth of experience spanning over 26 years in corporate and entrepreneurial ventures across six continents. A Dame of the International Knightly Order Valiant of St. George and Deputy Commander of its London Branch, Farah is also a Freeman of the City of London and a member of the G20 Business 20 (B20) Brazil 2024 Trade & Investment taskforce. She was a mayoral candidate in the 2021 Mayor of London elections, showcasing her dedication to public service and leadership.\nAs the founder of bizNis International, an award-winning global platform, Farah has facilitated hundreds of millions of dollars in trade and investment between governments and businesses worldwide, playing a key role in driving global economic collaboration. Her expertise in geopolitical strategy extends to her role as Regional Head of MiKat Advisory, a leading firm specializing in risk mitigation and intelligence.\nFarah's career began in reinsurance, where she excelled as a broker at Lloyd’s of London before becoming an underwriter for one of the world’s largest international reinsurance companies. There, she managed multi-billion-pound policies across areas such as liability, energy, terrorism, political violence, kidnap and ransom, hospitality, and environmental liability.\nIn addition to her business acumen, Farah is deeply committed to philanthropy and civic service. She is a passionate advocate for global trade, community development, and international collaboration. A patriotic representative of the UK on the global stage, Farah’s endeavors reflect her dedication to empowering people and businesses worldwide.\nFarah was mayoral candidate for the Mayor of London Elections 2021, she ran as an independent candidate, entering the political arena as a candidate for the first time. She not only became a celebrated voice for the people across London, but she also highlighted the social injustices being suffered by businesses and residents. This earned Farah a total of 58,051 votes from the electorates, that believed in her vision for London. Farah continues to be a social advocate for important causes, committing to deliver items from her comprehensive manifesto for London, through private funding.\nFarah devotes herself to the community by being an active volunteer for several social justice programs and charity organisations, she has been volunteering for over 20 years. As a philanthropist, Farah has devoted significant resources and commitment to supporting charities and is personally active in assisting with projects that benefit important causes. She has been praised for the transformative benefits to people’s lives she has been able to achieve through her community work. Among the many causes she contributes to, she has a particular devotion to caring for the homeless.\nFarah has held several board positions during her career. Current boards she sits on include, a Founder and trustee of ‘Forever Paw Home’, a non-profit organisation, homing rescued dogs from the dog meat trade in Asia. She is also the Deputy Commander of the Order St George London Branch.\nA Board Member for the an environmental protection company, Bright Tide. In 2008 she was appointed to the board of the British Business Group (BBG), where she served a 5-year term as a board member and also Chair for the BBG’s Insurance Focus Group. She also served as the Director of the event committee for ‘Women in Insurance – WII’, a Non-Profit organisation empowering professional women in insurance in the UAE.\nIn 2013 she also sat on the board of the British Chamber of Commerce in Türkiye, as a senior advisory board member. She previously was on the board of the Royal Society of St. George, of which Her Majesty was patron, and the English Business Council.\nFarah London",
  "https_farahlondon_com_/https_farahlondon_com_videos/content_4.html": "Copyright © 2025 Farah London - All Rights Reserved.\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_farahlondon_com_/https_farahlondon_com_community/content_6.html": "Farah has been volunteering actively for over 20 years with a number of grassroot organisations and charities around the world. She also mentors youth in vulnerable communities across London to steer them away from drug dealing and involvement in gangs, assisting them to connect with their passions and either enrol in education or find the courage to become entrepreneurs. She is an active anti knife crime campaigner and provides support to victims families. She raises awareness for homelessness and through her initiative 'Project We Care', she often brings a professional barista to serve the homeless community, with all speciality Italian coffee. This includes organising an annual Christmas Street Party for the homeless every Christmas. Project We Care also supports vulnerable children living below the poverty line, and has supported the families by buying food, essentials and coats.\nMore recently, when lockdown was announced in March 2020, Farah ensured she could assist those most vulnerable by volunteering for four different charities, she was out volunteering every day providing help to those most in need. This included being a volunteer for a homeless charity Greenlight. She was an integral part of the team and they provided over 20,000 meals during the first lockdown, in Trafalgar Square. Farah assumed responsibilities of distribution of food directly to the homeless and also sat with the homeless to provide support and encouragement, of what was a very difficult time for many due to becoming homeless due to covid.\nShe assisted several homeless people through the app ‘Streetlink’, to find accommodation and help. Farah reached out to a medical clinic and had 40 volunteers tested for antibody test for free, this test was only available privately, so she managed to have all the test donated. She also volunteered to house newly made homeless due to COVID with Homeless Charity St Mungos. She went on the streets and approached rough sleepers directly, that recently became homeless and she brought them back to the base and St Mungos found them accommodation. She managed to have six people housed, including a highly vulnerable women, that had been recently abused and attacked on the streets, she was transferred to a women shelter for vulnerable people. She also housed two European nationals that were forced on the streets, after losing their kitchen jobs due to COVID. She also managed to house a sixth person, an elderly German man that came to London as a tourist in 2019, then lost all his money whilst being on vacation, and was forced onto the streets for one year in London, he had not slept in a bed or had a shower for one year. It touched her heart to see the joy when he was taken straight to private accommodation that same day.\nIn April 2020, the Government reached out for members of the public to come forward to volunteer to help the 3 million vulnerable people shielding in isolation, she immediately applied and was accepted and volunteered as an NHS Responder Volunteer during all lockdowns and till now. She made herself available at all hours and travelled out of her area to help those in need. She never stopped and felt a moral duty to help those in need, she has completed 2,373 hours of volunteering as an NHS Responder volunteer. Some of the vulnerable people shielding continued to use Farah for their needs, as they found her kind and she continued to assist them throughout all lockdowns and still till today.\nAnother role she undertook during lockdown, was volunteering for Westminster city council. She packed meals as part of a project for Unity Kitchen, where they were distributing meals for the most vulnerable in the council. She was part of the packing team would prepare 1000 meal boxes. Westminster City Council made Farah the face of their Community Award campaign for 2020, in recognition of all the work she had been doing during the lockdown.\nFarah wanted to recognise the police’s tremendous effort during the pandemic on the frontline, so Farah visited all the police stations in London (38 stations) including New Scotland Yard, and delivered donuts with the message ‘Thank You’ and Hero’ written. This was very much welcomed by the police and appreciated.\nFarah wanted to give back to our incredible frontline heroes during the pandemic, she started ‘We Love NHS Meal Drop’, where she fundraised from the community and businesses, that wanted to give thanks to the NHS. Farah started the initiative by finding a local chef and kitchen to support to make meals packaged safely and securely in an industrial kitchen, she then fundraised and managed to deliver meals to eight main hospitals in London, which included Guys Hospital, The Royal London Hospital, The Royal Free Hospital, Whittington Hospital, Croydon University Hospital, St Georges Hospital, St Thomas Hospital, Chelsea & Westminster Hospital. The meal drop included, Farah reaching out to a local pizza restaurant that kindly donated 100 pizzas for NHS staff and she delivered to two local hospitals. In another act of kindness, Farah arranged free teas, hot chocolate and coffee for NHS staff at the Royal London Hospital, to give thanks during the pandemic, the staff were very thankful.\nShe also fundraised to help families that could not afford food during the third lockdown, she managed deliver weekly food shopping for 50 families and delivered it to a school in Brixton, that had many families in need. Care leavers are close to Farah’s heart, as they are often neglected by society and thrown into the world at the deep end. She dedicates her time to provide mental support and most important to be a friend.\nFor Christmas Day each year, Farah has volunteered to organise a special day for Foster Care Leavers, providing an incredible day for up to 200 care leavers, full of love, food, entertainment and presents. Due to COVID the event could not be organised, so she assisted to make the event virtual, 200 care leavers received hampers of food and presents, and Farah arranged Christmas Day full of zoom entertainment.\nFarah has also given back to the international community, through her business, as she organised fund-raising events when most needed. A few fund raising events include during the unfortunate devastating earthquakes in Mexico City in November 2017, she organised a special Fund Raising event in Mexico City supported by the British Embassy Mexico City. The event was a huge success and raised USD 120,000 during the evening for earthquake victims.\nShe organised a charity Fashion Show in Istanbul Türkiye, that raised money for fallen soldiers’ families and fully sponsored and organised a special event for the Duke of Edinburgh Awards in Türkiye 16th October 2015, HRH Prince Edward was the guest of honour. They honoured young adults for completing the program and raised awareness with the local business community.\nFarah organised a Charity Auction dinner for the for St Vincent de Paul Society, that supports the homeless community, the event was held on the 21st October 2017 and was a great success in raising money.\nShe volunteered and assisted for the ‘Peace One Day’ 20th Anniversary held on the 21st September 2019. Peace one day is a non-profit organisation that campaigned for a global day of peace around the world and the UN officially declared 21st September 20 years ago a day of Peace, where even the Tailban put down their weapons. The concert was held at the Shakespeare Globe Theatre, several celebrities came to perform, including a concert by Sting.",
  "https_farahlondon_com_/https_farahlondon_com_privacy-policy/content_3.html": "Copyright © 2025 Farah London - All Rights Reserved.\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_farahlondon_com_/https_farahlondon_com_gallery/content_5.html": "Copyright © 2025 Farah London - All Rights Reserved.\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_farahlondon_com_/https_farahlondon_com/content_1.html": "Entrepreneur I Political Figure I Philanthropist\nEntrepreneur I Political Figure I Philanthropist\nFarah London DStG is a distinguished leader and visionary entrepreneur with a wealth of experience spanning over 26 years in corporate and entrepreneurial ventures across six continents. A Dame of the International Knightly Order Valiant of St. George and Deputy Commander of its London Branch, Farah is also a Freeman of the City of London and a member of the G20 Business 20 (B20) South Africa 2025 & Brazil 2024 Trade & Investment taskforce. She was a mayoral candidate in the 2021 Mayor of London elections, showcasing her dedication to public service and leadership.\nIn addition to her business acumen, Farah is deeply committed to philanthropy and civic service and a passionate advocate for global trade, community development, and international collaboration. A patriotic representative of the UK on a global stage, she drives international trade and investment.\nAs the founder of bizNis International, an award-winning global platform, Farah has facilitated hundreds of millions of dollars in trade and investment between governments and businesses worldwide, playing a key role in driving global economic collaboration. Her expertise in geopolitical strategy extends to her role as Regional Head of MiKat Advisory, a leading firm specializing in risk mitigation and intelligence. Farah’s endeavours reflect her dedication to empowering people and businesses worldwide.\nFarah's career began in reinsurance, where she excelled as a broker at Lloyd’s of London before becoming an underwriter for one of the world’s largest international reinsurance companies. There, she managed multi-billion-pound policies across areas such as liability, energy, terrorism, political violence, kidnap and ransom and environmental liability.\nFarah is a highly sought-after speaker known for her exceptional speaking skills and extensive experience as a moderator. She frequently presents at conferences around the world, captivating audiences with her inspirational and empowering delivery. Her impactful presence is available for global conferences and events,\nFarah London\nFarah would love to hear from you, please email her on info@farahlondon.com or complete the form below"
}