{
  "https_www_jonathanbrash_co_uk_/https_www_jonathanbrash_co_uk_my-story/content_4.html": "Growing up in Hartlepool it has given me so much. I want to give back.\nMy father moved to Hartlepool 40 years ago to serve Hartlepool as a family doctor. His compassion and commitment to public service shaped who I am and now I want to serve Hartlepool to make it the best place for all our children to grow up in.\nGrowing up in Hartlepool this town is in my heart. I met my wife, Pamela, here and I’m raising my family here. Our town’s future is my future and I only want the best for this wonderful place.\nMy father, a local GP for over 30 years, taught me the value of public service and I have always tried to emulate his compassion, empathy and desire to give back to our town.\nAs a director of a Hartlepool based children’s Charity I’ve worked to support some of the most disadvantaged young people in our town.\nAs a governor of two of our town’s primary schools, and previously of our sixth form college, education has always been of huge importance to me. Helping our young people secure the very best opportunities in life is the key to a prosperous future for our town and something I will work tirelessly to achieve.\nAs the owner of a Hartlepool based business I know the challenges that our local companies face. They are the backbone of our local economy and I will do everything I can to help them thrive.\nFor more than a decade I’ve served Hartlepool as a local councillor. The key to being an effective elected representative is to listen and to respond to the needs of local people. Hard work addressing residents' priorities is the job of a councillor or MP and what the people of Hartlepool expect. It is what I have and will continue to deliver.\nNothing is more important to me than my family’s future and that future is Hartlepool. I’ll work every single day to support our town, our people and our future. I’m from Hartlepool and I’m for Hartlepool.",
  "https_www_jonathanbrash_co_uk_/https_www_jonathanbrash_co_uk_my-work_110-announcement-backing-hartlepool-businesses/content_9.html": "- Jonathan Brash\n- Hits: 224\nANNOUNCEMENT - BACKING HARTLEPOOL BUSINESSES\n- Jonathan Brash\n- Hits: 224\nI’m putting my money where my mouth is!\nI’m delighted to announce that as part of my campaign to be our town’s next MP I’ll be getting my print work done in Hartlepool. The Print Factory - Hartlepool, based on Moreland St and which employs 10 people from the town, will be producing my first newsletter that will be going out in the new year.\nThis brilliant company has clients the length and breadth of the country - they’re a real Hartlepool success story and it was a pleasure to meet John and the team recently. As someone who is from Hartlepool and for Hartlepool, this is really important to me. I’m backing local businesses all the way.",
  "https_www_jonathanbrash_co_uk_/https_www_jonathanbrash_co_uk_my-work_109-backing-hartlepool-businesses/content_8.html": "- Jonathan Brash\n- Hits: 232\nBACKING HARTLEPOOL BUSINESSES\n- Jonathan Brash\n- Hits: 232\nThis week I had the pleasure of visiting The Little White Feather and hearing the inspirational and touching story of how the business came to be from its owner Olivia Mae Sherwood.\nDespite these tough times the company is going from strength to strength, with ongoing plans for expansion. We discussed the importance of Hartlepool’s independent business community to our town and how we have to fight to protect it.\nBased in The Arches Shopping Village you can find out more by visiting: https://thelittlewhitefeather.\nI’m trying to visit as many of our local businesses as I can, so please get in touch if you’d like me to pop along.",
  "https_www_jonathanbrash_co_uk_/https_www_jonathanbrash_co_uk_my-work_108-radio-hartlepool-reminder/content_10.html": "- Paul Thompson\n- Hits: 199\nRadio Hartlepool - Reminder\n- Paul Thompson\n- Hits: 199\nYou can hear my interview tomorrow morning (Saturday 23rd October) between 9-10am on the fantastic Radio Hartlepool, talking about the brilliant work of Hartlepool Ambulance Charity and my campaign to be our town’s next MP.\nYou’ll also hear from Shadow Health Secretary Wes Streeting who was interviewed on a recent visit to our town.",
  "https_www_jonathanbrash_co_uk_/https_www_jonathanbrash_co_uk_my-work/content_5.html": "- Jonathan Brash\n- Hits: 190\nWhy does unleaded petrol cost up to 6p cheaper at Tesco, Morrisons and Asda in the Tees Valley compared to Hartlepool?\nHartlepool’s Labour parliamentary candidate has asked to meet bosses of Morrisons as he calls on the town’s three biggest supermarkets to bring petrol prices in line with neighbouring towns.",
  "https_www_jonathanbrash_co_uk_/https_www_jonathanbrash_co_uk_my-promise/content_3.html": "A local voice\nI grew up in our town and I’m raising my family here. Hartlepool’s future is my children’s future and I will fight every day for our town, our people and our future.\nTaking back our communities\nWe need to make our town safe again by taking back our committees from the antisocial and criminal minority who think the rules do not apply to them.\nStanding up for our town\nHartlepool needs new investment in jobs, business and our public services. I will stand up for our town by being Hartlepool’s voice in Parliament, not Parliament’s voice in Hartlepool.\nFighting for fairness\nToo many of our children live in poverty, too many of our older people lack the care they need, too many of our families are struggling. I will fight for a fairer deal for our people.\nA new start\nSupporting local businesses to thrive, attracting new industry to invest, increasing support to our public services to deliver. This is what I will do to give Hartlepool a fresh start.",
  "https_www_jonathanbrash_co_uk_/https_www_jonathanbrash_co_uk_petrol-premium/content_6.html": "Time’s are tough enough without having to pay more just because we live in Hartlepool.\nYet, petrol prices are consistently higher here than just a few miles down the road. If you travel to Durham one of these retailers is charging fully 10p/litre less.\nThere is absolutely no justification for us paying more than someone living in Stockton or Middlesbrough.\nPlease add your name to my campaign to demand fair petrol prices for our town.\nName, email and postcode is required\nJonathan Brash\nCampaigning to be the next Labour MP for Hartlepool",
  "https_www_jonathanbrash_co_uk_/https_www_jonathanbrash_co_uk/content_1.html": "Together we can stand up for our town, our people and our future.\nI’m standing to be Hartlepool’s Member of Parliament because our town deserves a local voice who understands the concerns and aspirations of local people and who has the experience and dedication to get things done.\nI love my hometown and I’m raising my family here. Hartlepool’s future is my children’s future. I’m ready to fight for it.",
  "https_www_jonathanbrash_co_uk_/https_www_jonathanbrash_co_uk_my-work_111-why-does-unleaded-petrol-cost-up-to-6p-cheaper-at-tesco-morrisons-and-asda-in-the-tees-valley-compared-to-hartlepool/content_11.html": "- Jonathan Brash\n- Hits: 191\nWhy does unleaded petrol cost up to 6p cheaper at Tesco, Morrisons and Asda in the Tees Valley compared to Hartlepool?\n- Jonathan Brash\n- Hits: 191\nHartlepool’s Labour parliamentary candidate has asked to meet bosses of Morrisons as he calls on the town’s three biggest supermarkets to bring petrol prices in line with neighbouring towns.",
  "https_www_jonathanbrash_co_uk_/https_www_jonathanbrash_co_uk_support/content_2.html": "Show Your Support\nHome\nMy Story\nMy Promise\nMy Work\n.\nSupport our Hospital\nPetrol Premium\nAn experienced, local voice\nfrom Hartlepool, for Hartlepool.\nAn experienced, local voice\nfrom Hartlepool, for Hartlepool.\nFirst Name\nLast Name\nEmail\n*\nPlease fill the required field.\nSubject\nMessage\n*\nPlease fill the required field.\nTick if you would like to help with the campaign\nYes, I want to help out\nTick if you would like more information about the campaign\nYes, please get in touch and tell me more about Jonathan and his promises\nPHA+PHN0cm9uZz5Gcm9tOjwvc3Ryb25nPnt7Zmlyc3QtbmFtZX19IHt7bGFzdC1uYW1lfX08L3A+CjxwPjxzdHJvbmc+RW1haWw6PC9zdHJvbmc+e3tlbWFpbH19PC9wPgo8cD48c3Ryb25nPlN1YmplY3Q6PC9zdHJvbmc+e3tzdWJqZWN0fX08L3A+CjxwPjxzdHJvbmc+TWVzc2FnZTo8L3N0cm9uZz57e21lc3NhZ2V9fTwvcD4=\nAnti Spam Protection - Please enter the answer to this simple addition - 3 + 4 = ?\nSend Message\nJonathan Brash\nCampaigning to be the next Labour MP for Hartlepool\nFollow the campaign\nHome\nMy Story\nMy Promise\nMy Work\n.\nSupport our Hospital\nPetrol Premium",
  "https_www_jonathanbrash_co_uk_/https_www_jonathanbrash_co_uk_hospital/content_7.html": "Show Your Support\nHome\nMy Story\nMy Promise\nMy Work\n.\nSupport our Hospital\nPetrol Premium\nAn experienced, local voice\nfrom Hartlepool, for Hartlepool.\nAn experienced, local voice\nfrom Hartlepool, for Hartlepool.\nGet behind Hartlepool Hospital\nJonathan has secured cross party agreement to put differences aside and fight for our hospital.\nNow he wants your voice to be heard, so please add your name to the following petition.\n\"We, the undersigned believe our hospital is bigger than politics and demand that services are returned to our town.\"\nFirst Name\nLast Name\nPost Code\nEmail\n*\nPlease fill the required field.\nAre you happy to be contacted in the future\nYes, I am happy to be contacted in the future\nNo, I am happy to support the cause but would rather not be contacted again\nPHA+PHN0cm9uZz5Gcm9tOjwvc3Ryb25nPnt7Zmlyc3QtbmFtZX19IHt7bGFzdC1uYW1lfX08L3A+CjxwPjxzdHJvbmc+RW1haWw6PC9zdHJvbmc+e3tlbWFpbH19PC9wPgo8cD48c3Ryb25nPlN1YmplY3Q6PC9zdHJvbmc+e3tzdWJqZWN0fX08L3A+CjxwPjxzdHJvbmc+TWVzc2FnZTo8L3N0cm9uZz57e21lc3NhZ2V9fTwvcD4=\nAnti Spam Protection - Please enter the answer to this simple addition - 3 + 4 = ?\nSend Message\n0\nNumber of signatures to far.\nJonathan Brash\nCampaigning to be the next Labour MP for Hartlepool\nFollow the campaign\nHome\nMy Story\nMy Promise\nMy Work\n.\nSupport our Hospital\nPetrol Premium"
}