{
  "https_www_pauldonaghy_co_uk_/https_www_pauldonaghy_co_uk_contact/content_2.html": "You can visit me at one of my street surgeries which are advertised on my social media channels or contact me on one of the options below\nPhone\n07940165639\nEmail\nwashingtonandgatesheadsouth@reformuk.com\nSocials",
  "https_www_pauldonaghy_co_uk_/https_www_pauldonaghy_co_uk_washington-gateshead-south/content_4.html": "Washington & Gateshead South\nWashington and Gateshead South Constituency Map\nConstituency Information\nElectorate: 71775\nWards:\n-\n1 Birtley\n-\n2 Lamesley\n-\n3 Castle\n-\n4 Redhill\n-\n5 Washington Central\n-\n6 Washington East\n-\n7 Washington North\n-\n8 Washington South\n-\n9 Washington West\nDo you live in the area ?\nwould you like to Join me in Building a Better Future ?\nTogether, we can create positive change and serve the people of Washington & Gateshead South. Get involved and be a part of the movement.",
  "https_www_pauldonaghy_co_uk_/https_www_pauldonaghy_co_uk_promotional-material/content_3.html": "Promotional Material\nHelp spread the word about My campaign and the values I stand for by downloading banners, Sharing my work on social media and by telling your friends and family, you can also get involved in my campaign for real change in Washington & Gateshead South.\nHow Can I Help?\nWe rely on the support of our community to make a difference. Whether it's through donations, volunteering, or simply spreading the word, there are many ways to get involved.",
  "https_www_pauldonaghy_co_uk_/https_www_pauldonaghy_co_uk_news-media/content_6.html": "News & Media\n'When people arrive in this country we have a responsibility to look after them.'\n— GB News (@GBNEWS) November 23, 2021\n'We need to be prioritising local residents first.'\nSunderland City Councillor's Sam Johnstone and Paul Donaghy discuss calls for local councils to home migrant children. pic.twitter.com/uK281PwmGL",
  "https_www_pauldonaghy_co_uk_/https_www_pauldonaghy_co_uk/content_1.html": "Working For You\nI believe in prioritising the needs and concerns of the community above all else. With a strong focus on people before politics. I am dedicated to creating positive change and serving the people of The North East and the United Kingdom.\nI am not your \" Typical career politician \" that`s for sure, and that is what we need, someone who will put people before politics.\nI got involved with politics because I wanted to improve the lives of those around me, you can help me with that aim, We can improve the lives of everyone across Washington & Gateshead South\n\"I strive to create safer and more vibrant communities, where opportunities for growth and success are accessible to all.\nWe have immense potential that lies within our local area that can be expolred, that is my mission, I will always put Washington and Gateshead first\"\nWashington And Gateshead South\nBranch Chairman\nReform UK",
  "https_www_pauldonaghy_co_uk_/https_www_pauldonaghy_co_uk_my-priorities/content_5.html": "My Priorities\nAs mayor I will have the opportunity to make a significant positive impact.\nI will lead the efforts to improve infrastructure, promote economic development, and enhance quality of life across Northumberland, Tyne & Wear and Durham.\nIf the people of the North East select me as your Regional mayor I will drive positive changes, collaborate with stakeholders, councils and all political parties to create a positive vision for our cities, towns & villages.\nWe all want the best for our region but we may disagree on how best to reach that goal, it will be my job to keep the focus on the people`s priorities.\nBelow are just a few of my priorities, if you feel like there is something missing then please do get in touch.\nTransport\nOur Transport and Infrastructure has suffered from under investment and lack of joined up\nthinking. I propose A fully integrated North East public transport network that works for the people. with A single purchase ticket or pass for journeys to cover the region.\nA partially Publicly owned transport network that will prioritize affordability and reliability, ensuring that fares remain reasonable for passengers. with free transport for school age children during term time and continued reduced rate for Students.\nThis approach makes public transportation accessible to a wider range of people, including those with lower incomes and encourage those who would normally choose to use personal vehicles to use the network.\nI will ensure that essential services are available to all, especially in less profitable areas. A partially public-private transport network will harness the strengths of both sectors: public ownership for essential services and private innovation for efficiency and variety.\nPartial Public ownership of our new North East Network enables reinvestment of profits into improving services. Instead of shareholders’ pockets, these funds will go towards enhancing infrastructure, expanding networks, we will make decisions based on community needs and adopting cleaner technologies, we will not put all of our eggs in one basket with electric buses, however we will utilize this technology on certain routes where financially viable.\nI will prioritise connecting smaller villages & towns based on community needs with reliable public owned buses to ensure that services reach underserved areas, connecting people to jobs, education, and healthcare to all\nAs contracts, partnerships and franchise agreements with private operators come to an end we will ensure any new agreements define minimum service levels, quality standards, and financial arrangements that benefit the region, Failure will not be tolerated or rewarded.\nPoliticians and business leaders have been talking about re-opening the Leamside Line for years, Its time to stop talking and start delivering, this is one of the most important pieces of infrastructure for the economic future of the North East.\nReopening of the leamside Line would provide critical connections to both passenger and freight, connecting towns and cities across the North East, helping to drive the economy and growth of the region using existing infrastructure.\nI will scrap the Low emission scheme in Newcastle and Gateshead, this is a stealth tax that punishes businesses, furthermore there will be no low emission schemes anywhere in the North East on my watch, pollution does not stop because you pay a few quid, We do our bit for the environment by ensuring our public transport network is reliable, affordable and fit for purpose, reducing the dependence on motor vehicles.\nHousing\nI will address the pressing housing shortage in the North East by building more affordable local authority housing.\nThe UK population has grown by over 1.3 million in just 2 years. Yet only 425,000 homes have been built.The Office of National Statistics forecast the population to grow by nearly 7 million between 2021 and 2036, putting huge pressure on housing.\nThe North East needs Long-Term Vision and Collaboration between local authorities, developers, and communities, we must work together to build more affordable housing, this is crucial to ensure that individuals and families have access to safe and healthy homes at a reasonable cost.\nAs a Region, we have a responsibility to care for our own, Priority will always be given to those with a connection to the Area when it comes to access to social housing, with council housing waiting lists at an all time high it is time we ensured that everyone who needs a home gets one.\nI will Regenerate and Renew run down areas with sustainable housing and help promote eco-friendly practices such as using renewable energy sources, and efficient insulation to help drive down energy bills.\nI will ensure social equity by providing affordable housing options to low-income communities, positively impacting quality of life and overall well-being\nLocal economy\nWe must rebuild & regenerate our local economy across the region, not just the Town centres. but the unused shops littering our smaller high streets, regeneration does not mean building new sites especially when we have buildings and office space sitting empty, these can be utilised before anymore new sites are built, we have shopping areas across our towns and cities which are boarded up that many small businesses and even landlords can simply not afford to run or manage, I would therefore launch A Mayoral business support scheme available to small and start up business, We will make the North East the place to start up and grow small businesses, creating jobs, opportunities and regeneration across the region.\nSME Enterprise Zones in run down areas with a 1 year period of zero business rates on council owned property for new or existing businesses that are creating jobs and offering apprenterships, allowing businesses to grow. and encouraging business to chose the North East to build, Grow and expand.\nFurther business rate relief to existing businesses that benefit the local community and economy.\nI will work with councils to develop Local community shops which will provide pop ups for local businesses & artists to be controlled by the people in the local community which offers a range of benefits ensuring profits stay in the local area.\nOur rivers and ports which were once the envy of the world can once again bring careers and apprenterships to our Region, I would therefore work with the government to Compulsory purchase the Pallion ship yard in Sunderland,and work with a new operator to reinstate this strategic national asset.\nThe Pallion Shipyard in Sunderland is the country's largest fully undercover shipyard. Built in 1976, closed in 1989 and mothballed to this day, it is an asset that can provide skilled jobs to the wider region, with the shortage of capacity in the UK and the wider world and to help realise the UK Government's National Shipbuilding Strategy,\nThe demand and market for maintenance and repair of offshore vessels with capacity for 'passing trade' such as standard commercial ships, passenger ships, superyachts, fisheries vessels, general refit / conversion work. we need to bring this vital industry home, there is interest in the site for maritime purposes but the current owners and local council have repeatedly turned them away, we have this site of strategic importance on our doorstep and we must utilize this.\nEnvironment\nGreener does not mean destroying jobs and harming our economy, we all care about the environment, and we all want cleaner air, cleaner streets and a cleaner world for our children and future generations, however we must do this in a strategic and affordable way that protects jobs in our region, It is possible to strike a balance between environmental responsibility and economic prosperity.\nOther parties are obsessed with the destructive net zero agenda which is destroying jobs and industry across the world, It is making us all poorer and pushing up energy costs,\nCleaning up our parks, rivers and streams to maintaining healthy ecosystem and ensuring these vital areas are safe for both humans and wildlife.\nOrganize regular community clean up: litter picks with funding for volunteer groups & local clubs to remove debris that find their way into rivers. small actions can make a big difference to our communities\nI will work with local authorities and educational trusts to develop walking & cycling to school schemes which will benefit our children`s health and the local environment, I will introduce parking permit schemes in residential areas close to schools which will encourage parents to leave the car at home, this also addresses increased anti social behaviour at school run time which is an ever increasing issue.\nEvery public park in our region will have dedicated park wardens who will ensure public safety and that our parks are kept clean and tidy for future generations,\nYouth provisions & community\nToo many children and young people are being badly let down. with government cuts and poor financial mismanagement by local authorities, Youth provisions have been decimated in the last 20 years, With cuts from central government and wasteful council spending it is time to put this right.\nI will develop a mayoral fund for Youth & community projects to provide a platform for young people to learn new skills, activities, explore interests, and develop their talents.\nWorking with existing football, rugby, athletics and other sports clubs to develop playing Fields into a multi-sport / use sites for all, bringing together not just sport but other groups such as Scouts, cubs, guides, brownie’s and cadets, these sites can also be used for other community interest and support groups.\nI will asset transfer playing fields and other sites identified for potential use to charitable community trusts to be established by local groups ensuring everyone who wants to has the chance to take part. these community trusts will be required to provide Free activities during school holidays and places to those who could not usually afford to take part.\nWe can develop a sense of belonging, responsibility and pride in our local community, bringing us all together.\nOpportunities for personal development, social interaction, and skill-building, creating positive outlets and alternatives for youth in order to steer them away from engaging in ASB. by focusing on community development and addressing underlying causes, these provisions can contribute to reducing problems in our communities and promoting a safer enviroment for everyone.\nAdd comment\nComments\nwell said Paul Council housing should be for locals first\nThe waiting lists are a joke.\nMy daughter works full time and so does her partner but they can't afford to rent, can't get a council house so live at home with me and 2 yr old son\nWhy should people come here illegally get priority\nI attended the Transport hustings last night at Newcastle University, to be honest, as a lifelong Conservative party member I didn't expect much from you but I admit I was wrong,\nThank you for taking the time to speak with me at the end, best of luck\nIt was nice to talk to you yesterday, I have read through the youth provision section and agree 100%, that we need to tackle the root causes of ASB and giving our kids a fighting chance is the best place to start.\nCleaning up our river and parks again 100% agree,\nPriorities our residents for social housing before those who come here illegally again 100% agree.\nI would like to see more on the environment\nWe need the shipyard re-opening to provide good jobs & careers for local people &;improving river business usage. To do this we need Miller's Mob, the Sunderland Labour Council removing.\nI am happy to see you are not pandering to the NET ZERO mob like all the other candidates, you have our vote",
  "https_www_pauldonaghy_co_uk_/https_www_pauldonaghy_co_uk_about-me/content_7.html": "About Me\nPersonal\nI was born and raised in High Heaton, Newcastle My father was a painter and decorator and my mother was a shop manager, I have lived and worked all over the region from Heaton to Hexham, Sunderland to Creswell I love the North East it is in my DNA.\nI now live in Washington with My wife, who is a sister at Sunderland Royal hospital, we have 4 Children, Matthew, Abigail, Jacob & Melodie.\nWe also have Shadow the Labrador and Maggie the German shepherd who accompany me on many of my ward walks.\nI began my professional career in the Royal Navy, training as A chef I served around the world traveling to every continent.\nAs a royal navy veteran, I am proud to have served My country and proud to have been a part of such a prestigious and historic institution. The training, discipline, instilled a deep sense of pride which will never leave me,\nI have worked all over the UK and the world since leaving the Forces including Germany, France & London,\nI always know I am home when i see the angel of the North, it brings a smile to my face every time.\nI currently work as a Area operations manager for a Hotel chain, overseeing the daily operations and performance of multiple locations I support branch managers, as well as ensure compliance with company policies and procedures, analyze performance metrics, identify areas for improvement, and implement strategies to increase productivity and efficiency. I manage budgets, staffing, and resolving operational issues to ensure optimal performance.\nIn my spare time I enjoy playing rugby and watching Newcastle falcons, Mountain biking around Northumberland and kayaking.\nPolitical\nI didn`t get involved in politics until 2019, I joined the conservative party at the time because traditional British values are important to me Democracy, The rule of law. individual liberty, Mutual respect are all things that matter to me\nHowever the conservative party are no longer conservative, they no longer represent the values I, and many others Believe in, Reform UK do. I served as a Councillor for the Washington South ward 2021/2024, I was fortunate to be selected as the Reform UK candidate to contest the first North East Regional Mayor elections, finishing 4th with 41,147 votes, I came second in Sunderland beating the well funded Conservative candidate and the indipendent who was the favourite to win.\nOur flawed political system is a magnet for power-seekers rather than those seeking to serve the public, too few politicians are focusing on the public's interests. there is a real lack of quality councillors and MPs, many serve their own interest and those of the party they serve, with the public being an after thought.\nI believe in prioritising the needs and concerns of the community above all else. With a strong focus on people before politics. I am dedicated to creating positive change and serving the people of Washington, The North East and the United Kingdom, I want to shake up the political landscape both locally and nationally, like many people I beleive we need to have strong politicians with leadership skills and the ability to inspire and unite communities.\nI want to address these underlying issues by promoting transparency, accountability, and inclusivity in politics and help attract and retaining competent individuals as councillors and MPs, regardless of your political affiliation if you are willing to work along side me and others in the best interest of the community and the people we serve then you will have my respect and that of the public.\nI am committed to transparency, integrity, and accountability in politics, Reform UK have NO whip system which means I am free to vote and work in your best interest not that of any political party or union."
}