{
  "http_garethfairhurst_blogspot_co_uk_/http_garethfairhurst_blogspot_co_uk/content_1.html": "Many residents of Standish will have been through, or know the Bradley Lane railway bridge. This is the road that goes under the West Coast main line and towards the crown when coming from Standish.\nIt is a single car width and when cars get to the bridge they had to slow down to a snail's pace to see if there was any cars or pedestrians coming through from the other end. By slowing down it reduced the chances of any accidents as every one had to approach and go through with care.\nNow the Labour Cllrs have decided that they wanted to waste your money and putting traffic lights on there. This will stop traffic from one side by holding them back on a red traffic signal and allowing the other side through on a green light. But that is the first reason why in my opinion this now heightens the risk to an accident. I hope and pray I am proven wrong.\n|\nLooking from the Crown Side and where the Council may put double yellow lines |\nThe reason why I say the above is if the light is on a green light a car approaching will not slow down and will go through thinking that it is clear and they can proceed at the normal speed. But if there is someone walking through this will put them at a higher risk. Plus as we all have seen when a red light comes on cars very often try to put their foot down to get through. Again this heightens the risk if there is any one under or the other cars move off when their signal goes green on the other side. Don't forget about it before the traffic lights cars would slow down to a snail's pace or stop to look and this was, in my opinion, why we have never had any serious accidents that I know off.\nAs a born Standisher, of 50 years, I have lived here more than the two Labour Cllrs together and you ask why do they want this scheme? In my opinion it is clear that they do not served the community and come up with these schemes that put lives at risk without knowing the history and why things work and why things don't. A risk I believe the council share with me as they have installed new crash barriers now as well. What does that say? The Council should come clean with their risk report in the area.\nThe Cost\nBut then we come to the cost- how much has cost you, the taxpayers? £250,000 is what Wigan Council's budget shows on their website, although the council now say it is £220,000. This is before the delays. Quick thought, where is the extra £30,000 going? But then we ask where has this money come from? The Council have confirmed to me that it is out of the pot called the Section 106 money (s.106). This pot of money is developers pay to put new facilities and amenities in the area. Things we could do with are new classrooms, new doctors, dentist and I could go on. I guess you could too but the Council are wasting a quarter of a million of pounds just so the Labour Cllrs can try and say look we do something for our £40,000 a year they get as your local Cllr's, (They get £15,000 each and Cllr Parkinson gets about £6,000 extra for the deputy Mayor. Source Wigan Council).\nAnother sting in the tail - wait for it!\nSurely there can be nothing else that makes this crazy idea any worse? O yes the council and Cllrs are not being truthful to the residents on the terraced properties that live on the Crown Side. They have to park their cars in front of their properties, which they have done for decades. But in busy periods when the traffic is bad the side coming from the Crown and held on a red signal will back up and when the cars that come through from Standish side they will not be able to pass due to the parked cars and cars held on a red traffic signal. What do you get? Mayhem! How will the council fix this? I bet they put double yellow lines outside the residents properties, so it keeps the flow of traffic moving, but they have nowhere else to park.\nHere are the reasons I say this is a crazy, ill thought out political scheme that not only wastes money but also put residents lives at risk, for the reasons I say. And why?Just so Labour Cllrs can say look what we have done! As I say I pray I am wrong but I fear they could have made a accident black spot and I pray no one gets hurt or worse."
}