{
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_non-league-day-at-horley-town/content_35.html": "Non-League Day at Horley Town\n- Taylor O'Driscoll\n- Mar 25, 2023\n- 1 min read\nUpdated: Mar 27, 2023\nToday is Non-League Day which is an opportunity to go and support your local non-league football team while the top flight is on an international break.\nI went with Cllr Richard Biggs to watch Horley Town at their ground The New Defence in Court Lodge Road as they took on Frimley Green in the Combined Counties Premier League South Division. This is not the first time I have gone to see them but hoped it would be the first time I went and the Clarets won. It's safe to say they did it in style.\nThe Clarets score 8 against the visitors in a thrilling game of football with a very good atmosphere. Lee Peacock gave us a hat trick, Jake Roberts scored two, Adam James Grant and Josh Alder scored a goal each and Frimley scored an own goal. All of the goals were individually brilliant but the volley was my personal highlight! By full time, the Frimley goalkeeper turned as pink as his shirt from his performance, but he did get a few saves in before full time.\nIt was a lot of fun visiting The New Defence and will be back again to watch the Clarets for sure! You can follow Horley Town on Twitter here.\nOne of my key priorities is to support grassroots football clubs and I only know too well how tough it can be for clubs in Non-League so every person through the turnstiles helps! Make sure you go and watch your local team and show them your support.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_accessible-playgrounds-for-all/content_33.html": "Accessible Playgrounds for All\nThe families and carers of children with mobility issues and long-term health conditions have told me they feel left behind as a result of a lack of accessible play equipment for them to use.\nMost playgrounds aren't suited for those with these additional needs as there are design features which aren't always accessible. Wheelchairs would often have to pushed through sand and grass to get to the equipment, heavy gates into the play area are difficult for parents and carers to hold open while pushing a wheelchair through and the equipment most used is not only inaccessible but unsafe for someone with mobility issues to use.\nTandridge District didn't have any accessible playgrounds so I moved a motion at the Full Council meeting of 15 December 2022 getting the Council to commit to providing playground equipment for those in the District with mobility issues and long-term health conditions. This was agreed unanimously by the Community Services Committee of the Council and Oxted Parish Council opened the first inclusive playground in Tandridge in May 2023 at Barnett's Shaw Play Area. I attended the opening of this with Parish and District Councillors in Oxted.\nI am now campaigning for more accessible play areas in Surrey.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_supporting-local-high-streets/content_15.html": "top of page\nSupporting local businesses in our villages\nLocal high streets are the bedrock of our communities. They don't just boost the local economy but they bring people together, create crucial local jobs and make our communities stronger. I will push for further support for local businesses by working to attract investment to boost local high streets.\nI am an advocate for supporting local businesses and aim to highlight all of the fantastic small businesses in our villages.\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_about-taylor/content_2.html": "About Taylor\nI was born and grew up in Tandridge, growing up in social housing in Bletchingley. I was diagnosed with autism at the age of 3 and was educated at a special needs school, but I see my autism as a superpower. This is because it gives me a fresh perspective in tackling issues others may not see!\nMy achievements include successfully ensuring care leavers in Tandridge were exempt from paying Council Tax until they turn 25, ensuring everyone regardless of physical ability is able to access playgrounds, and delivering positive change for my community.\nI'm a passionate and committed community activist, having served as the Tandridge District Councillor for Westway from 2021 to 2024. I helped with the successful campaigns to elect a Conservative MP for East Surrey in 2019, Conservative Police & Crime Commissioner for Surrey in 2021, a Conservative County Councillor for Caterham Hill in 2021 and several Conservative Councillors in Horley, Croydon, Reigate and Tandridge. In my day job, I work in Communications.\nI believe in working with our communities to help them thrive and inspiring people to be the very best they can be. My aim is to make the world a better place to live in and I'm keen to play my part by serving my community.\nTo find out more about me, check out my CV and read my endorsements.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_cancelled-west-street-pedestrianisation/content_22.html": "CANCELLED: West Street pedestrianisation\n- Taylor O'Driscoll\n- Feb 19\n- 1 min read\nAfter campaigning from Marisa Heath, Michelle Watson, myself and local people, I am pleased that the West Street pedestrianisation has been cancelled.\nIt is disappointing however that the administration's energy has been directed at this proposal rather than what actually matters to residents and local businesses.\nMole Valley needs Dorking to thrive and 25 years of Liberal Democrat District Councillors in Dorking and 6 years of a Liberal Democrat council in Mole Valley has seen Dorking and the wider district go backwards. Social housing is in crisis, residents don't feel safe walking on their own local streets, playgrounds need investing in, Dorking high street is in need of support and now Mole Valley District Council is within two years of going bankrupt.\nInstead of focusing on vanity projects which boost the profile of their senior Councillors like pedestrianising West Street would have been, I suggest the Liberal Democrats running the District Council get a grip on these issues like a responsible council would.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_grassroots-football/content_24.html": "top of page\nMore support for grassroots football\nI'm a huge football lover and I believe that non-league and grassroots football is about more than just the game.\nLocal football clubs help bring people together and create community spirit. A local football club that's close to the heart of many in Whyteleafe were forced out their ground. Luckily, the community came together to form a phoenix club, which has thrived since.\nBut I feel grassroots football clubs shouldn't be under this pressure constantly. I'll work to ensure that grassroots football clubs are protected as much as possible.\nRead more about my Non-League Day 2023 visit to Horley Town FC\nRead more about my visit to Kiln Brow to watch Horley Town play Redhill.\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_the-first-accessible-and-inclusive-playground-in-tandridge/content_38.html": "The first accessible and inclusive playground in Tandridge\n- Taylor O'Driscoll\n- May 21, 2023\n- 1 min read\nIt was a pleasure to head to Barnett's Shaw in Oxted yesterday morning to attend the opening of the new inclusive and accessible playground. This was funded by Oxted Parish Council and was opened by Cllr Jackie Wren, Chairman of Tandridge District Council. It's the first accessible and inclusive playground in the whole of Tandridge.\nI particularly liked that there were sensory panels, a bucket swing and a wheelchair-accessible roundabout. All of these on a surface that is level to improve accessibility. This is a step in the right direction and will hopefully be the start of ensuring all play areas in Tandridge are accessible and inclusive for all.\nThank you to Oxted Parish Council and to Jackie for inviting me along and for setting the bar for other parishes in Tandridge to make sure every child can access play regardless of mobility issues, neurodivergence or long-term health condition.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_ockley-school-buildings-public-meeting/content_6.html": "Ockley School Buildings public meeting\n- Taylor O'Driscoll\n- Feb 28\n- 1 min read\nGreat to attend last night's Ockley School Buildings public meeting hosted by Ockley Parish Council to hear about the plans to repurpose the school buildings, which have been unused since the school closed in 2017.\nThe plan proposed will see a play centre for children under the age of 12 opened, which will provide a safe space to learn through play outside and indoors, alongside a cafe for adults and children to relax afterwards. I think it will be a fantastic asset for Ockley and will really help the children of the village and surrounding areas.\nIf you support this proposal, please head to this page to sign the petition, which will show the Diocese that the community is behind this proposal.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_privacy/content_7.html": "Privacy Policy and Data Protection\nThis document outlines how Taylor O’Driscoll processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Taylor O’Driscoll.\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Taylor O’Driscoll and his team.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Taylor O’Driscoll, or public interest.\nThese cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination and are not retained on the website. They are available for a limited period on the server for access only in the event of a police investigation.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Taylor O’Driscoll via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Wix.Com Limited and you can find their privacy policy here: https://www.wix.com/about/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nVersion: 2301S",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_what-we-can-do-to-address-littering/content_30.html": "What we can do to address littering\n- Taylor O'Driscoll\n- Mar 8, 2023\n- 2 min read\nMany residents have been in touch with me about littering, which is something I'm very keen to address.\nWhether it be the discarded afters of a takeaway, dog poo \"decorations\" on trees in green spaces or just general rubbish strewn across the pavement or verge, littering is not nice and has a negative impact on our community. I have been working to address it in both Westway and in Horley.\nWhile out dog walking, some residents haven't been cleaning up after their furry friends correctly after they've done their business on Kenley Aerodrome. We've seen poo bags being hung on trees. This is a real concern and I've raised this with the City of London Corporation, who own the land on Kenley Aerodrome, and asked them to install a new dog bin. Work is continuing to happen behind the scenes but there are positive signs that a new bin could be on the way.\nAlongside this, I am also working to get bins installed elsewhere at Hambledon Linear Park and Oakgrove among other places to further address littering.\nMy friend Cllr Hannah Avery has been pushing Reigate and Banstead Borough Council for more litter bins in Horley with residents feeding back sites for new bins, which the council are investigating the possibility of installing them. I personally am very keen to see new bins installed at Horley's bus stops to address littering there.\nSurrey Heath Borough Council have recently announced they will be adding QR codes to their bins which can be used to report overflowing to the council if scanned. This is a brilliant idea and something I would welcome in Horley and in Westway.\nI am also working on a project in the near future to further address littering in the community, so watch this space.\nIn the meantime, please use these links to report any issues with bins to the council:",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_what-taylor-stands-for/content_9.html": "top of page\nHome\nNews\nAbout\nTaylor's CV\nEndorsements\nWhat Taylor stands for\nTaylor's Campaigns\nTaylor's Views\nCampaign with Taylor\nEmail List\nContact\nPrivacy\nMore\nUse tab to navigate through the menu items.\nWhat Taylor stands for\nTaylor's Campaigns\nTaylor's Views\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_campaignwithtaylor/content_23.html": "I agree to Taylor O'Driscoll using the information I provide to send messages about local issues, campaigns and opportunities to get involved. There will be an easy way to opt out of future message with each one. For more information on how Taylor O'Driscoll handles your data and your rights, please see here.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_contact/content_14.html": "top of page\nGet in touch\nYou can contact Taylor through his social media through the links below or alternatively, you can email him at taylor@taylorodriscoll.co.uk\nbottom of page\nYou can contact Taylor through his social media through the links below or alternatively, you can email him at taylor@taylorodriscoll.co.uk",
  "https_www_taylorodriscoll_co_uk/http_www_taylorodriscoll_co_uk_privacy/content_29.html": "Privacy Policy and Data Protection\nThis document outlines how Taylor O’Driscoll processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Taylor O’Driscoll.\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Taylor O’Driscoll and his team.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Taylor O’Driscoll, or public interest.\nThese cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination and are not retained on the website. They are available for a limited period on the server for access only in the event of a police investigation.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Taylor O’Driscoll via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Wix.Com Limited and you can find their privacy policy here: https://www.wix.com/about/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nVersion: 2301S",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_surrey-connect-is-coming-to-tandridge/content_36.html": "Surrey Connect is coming to Tandridge\n- Taylor O'Driscoll\n- Sep 4, 2023\n- 1 min read\nI am delighted to share that Demand Responsive Transport is coming to Tandridge from today (Monday 4 September).\nThis is similar to an \"Uber for buses\" and means that there will be buses that will go anywhere in Tandridge without having to follow a fixed route and will also serve two bus stops in Redhill at the High Street and on Queensway.\nThe service will operate Monday to Friday 7am to 7pm and Saturday 8am to 6pm and you can book up to 7 days in advance or on the same day.\nAll you need to do to book a bus is to sign up for an account through the Surrey Connect app or website, or call 01883 701278.\nTo find out more about this, please see the Surrey Connect page here.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk/content_1.html": "top of page\nTaylor O'Driscoll\nI'm Taylor O'Driscoll and I'm a community activist. I want to make a difference, help my community to be the best it can be and make our country better. Here, you can find my latest news, campaigns and more about me, including what I stand for and how to get in touch.\nA new banking hub for Dorking\nI found out more at the recent exhibition\nMar 41 min read\nRoyal Mail not delivering Dorking Hills\nAnd what I'm doing to get it fixed\nMar 31 min read\nOckley School Buildings public meeting\nAn update on the school site in Ockley\nFeb 281 min read\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_council-tax-exemption/content_25.html": "Council Tax Exemption for Care Leavers\nWhen I was first elected to Tandridge District Council in May 2021, I was horrified to learn that it was the only local authority in Surrey that required care leavers to pay council tax from the age of 18. In my eyes, this was not right.\nWhen leaving care, care leavers don't often feel ready to live independently, with most non-care leavers leaving home at an average age of 23 compared to the age of 18 for care leavers.\nAlongside this, according to the Become Charity, care leavers often find themselves in debt due to poor financial education before or when they leave care. Children in care are often not always exposed to how a household budgets their finances, especially as a children's home's finances are managed by an office.\nIt was unjust that in light of all of this that Tandridge District Council was requiring its care leavers to pay council tax from the age of 18. So I moved a motion at the Full Council meeting of 22 July 2021 to exempt care leavers from paying Council tax until their 25th birthday from 1 April 2022. This passed with cross-party support from all political groups and as a result, care leavers in Tandridge now aren't required to pay Council Tax until they turn 25.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_public-transport-for-east-surrey/content_31.html": "Better Public Transport for East Surrey\nI am passionate about ensuring that residents can travel sustainably around East Surrey and rely less on private transport such as the car.\nI have actively campaigned for better rail services in East Surrey and when Southern reduced the number of trains serving Eastern Surrey, I joined forces with other Councillors in Tandridge, Croydon and Reigate & Banstead to send a letter to the Chief Executive of Govia Thameslink Railway demanding improved rail services in East Surrey. Alongside this, I raised a question to the Leader of Tandridge District Council at the Full Council meeting of 16 December 2021 about the reduction of services on the Caterham branch from four trains an hour to two in the December 2021 timetable change.\nI have also lobbied for better bus services in Eastern Surrey, advocating for a \"Uber for Buses\" demand responsive transport service in Tandridge, which was introduced in September 2023. Alongside this, I am actively campaigning for more frequent and cheaper bus services. I am campaigning to reverse the service reduction on the 20 bus route from Langshott to Crawley, to introduce a circular bus route between Caterham, Whyteleafe and Warlingham in a similar style to the 430 and 435 between Merstham, Redhill and Reigate, and to reduce bus fares so travelling around Surrey is truly affordable.\nI support the introduction of hydrogen buses on the Fastway bus network around Horley and would be keen to see more sustainable buses around East Surrey.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_football-at-kiln-brow-horley-town-v-redhill/content_26.html": "Football at Kiln Brow - Horley Town v Redhill\n- Taylor O'Driscoll\n- Feb 10, 2024\n- 1 min read\nGreat to spend this afternoon at Kiln Brow supporting Horley Town FC as they took on Redhill FC in the Combined Counties Premier South.\nGreat to watch the match with Cllr Rebecca Paul, Cllr Rich Michalowski and Cllr Samantha Marshall and it was a very end to end tie, with three goals being scored in the last 10 minutes.\nRedhill did end up winning 5-2 in the end, but hopefully Horley will get their revenge in the return fixture at The New Defence on April Fools Day!",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_protecting-pets-and-wildlife/content_8.html": "top of page\nIncreasing protections for pets and wildlife\nAnimals are loved by many in our community and are vital companions for so many of us. It isn't right that pets and animals suffer cruelty. I will work to ensure that there are better protections in the law for pets and wildlife in the UK, and stronger punishments for animal abusers.\nI am an active supporter of the Greyhound Trust, which has its National Greyhound Centre in Horley and do a fantastic job in homing greyhounds.\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_a-new-banking-hub-for-dorking/content_20.html": "A new banking hub for Dorking\n- Taylor O'Driscoll\n- Mar 4\n- 1 min read\nIt was lovely to attend the Banking Hub exhibition in the Dorking Christian Centre last month to learn about the much needed and very welcome facility that's coming to Dorking.\nIt will be open 9am to 5pm at a location to be confirmed, and it will have a counter where you can pay in cash, withdraw cash, check your balance, pay your utility bills and top up your gas and electric, as well as access change giving services if you're a registered business.\nThere will be community bankers on rotation attending where you can talk about more complicated matters. Below is the timetable of community bankers in Dorking's Banking Hub.\nMonday | HSBC |\nTuesday | Barclays |\nWednesday | Santander |\nThursday | NatWest |\nFriday | Lloyds Bank |\nUpdate, 4 March 2025: I'm pleased to confirm that the Banking Hub will open tomorrow (Wednesday 5 March) at Mole Valley District Council's offices.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_endorsements/content_17.html": "top of page\nEndorsements\n\"I know Taylor to be industrious and focused with a strong determination to get things done.\"\nDorothy Ross-Tomlin, former Surrey County Councillor for Horley West, Salfords & Sidlow and former Reigate & Banstead Borough Councillor for Salfords & Sidlow\n\"Taylor has been a breath of fresh air, and hears, listens and acts.\"\nSamantha, local mum in Horley\n\"Taylor is a fantastic advocate for our community.\"\nJulie, Westway resident\n\"Thanks to Taylor, Yorke Gate once again feels loved and looked after.\"\nBen, Westway resident\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_surrey-road-funding-increased-by-66million/content_28.html": "Surrey road funding increased by £66million\n- Taylor O'Driscoll\n- Oct 10, 2024\n- 1 min read\nEveryone uses Surrey's road network every day, so I know how important it is to invest in it. In a significant boost for our infrastructure, road funding in Surrey has increased to over £90 million, from £24 million previously.\nThis is fantastic news for Surrey residents, and this substantial financial investment will enable the resurfacing of 1,000 kilometres of roads across Surrey. The initiative aims to enhance road safety, improve driving conditions, and extend the lifespan of existing roadways, benefiting both local residents and commuters.\nThis investment is part of a broader effort to upgrade Surrey's transport network, ensuring that the region can accommodate growing traffic demands while maintaining the quality and reliability of its road systems.\nI will be pushing for this funding to used locally on a variety of initiatives across the local area, and will work with residents and the authorities to secure road safety initiatives on the A29 in Ockley and the A24 between Dorking and Beare Green. And of course, I will keep you updated on progress with this.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_taylorsviews/content_5.html": "top of page\nHome\nNews\nAbout\nTaylor's CV\nEndorsements\nWhat Taylor stands for\nTaylor's Campaigns\nTaylor's Views\nCampaign with Taylor\nEmail List\nContact\nPrivacy\nMore\nUse tab to navigate through the menu items.\nTaylor's Views\nSupporting our local businesses in our villages\nMore support for grassroots football\nProtecting the countryside and open spaces\nIncreasing autism awareness\nIncreasing protections for pets and wildlife\nPushing for better social homes\nFixing the potholes and pavements\nWorking with and supporting our villages\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_fly-tipping-a-blight-on-our-communities/content_32.html": "Fly tipping: A blight on our communities\n- Taylor O'Driscoll\n- Feb 8, 2024\n- 1 min read\nSalfords residents have raised with me that there has been fly tipping taking place recently.\nThe first fly tip was reported in Green Lane, Outwood, on the way to the Dog & Duck pub. I raised this with Tandridge Council officers and I'm pleased to confirm it has been removed.\nThe second fly tip which I visited was on Lonesome Lane, Salfords, and is truly disgusting with a mouldy tyre and a rotting mattress. I have raised this with Reigate & Banstead Council officers and asked for it to be cleaned up.\nFly tipping is a blight on our communities and one of my priorities is to work to stamp it out in our local area.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_taking-action-to-address-a-rat-infestation-in-social-housing/content_27.html": "Taking action to address a rat infestation in social housing\n- Taylor O'Driscoll\n- Feb 15, 2024\n- 3 min read\nReporting from The Tandridge Independent brought to the fore the shocking conditions residents in Blize Court and Manorview Court, Whyteleafe, were living in.\nL&Q, the housing association, have been aware of the conditions for two and a half years and done nothing. I've seen the condition of the blocks for myself and there was a smell of rotting flesh in the electrical switchboard and bin rooms, the stairs to the blocks were covered in blood from the rats.\nAlongside this, residents with accessibility needs were unable to get to their homes because the lifts weren't working because the rats were chewing the wiring.\nI raised a question at Tandridge District Council's Full Council meeting on 8 February and asked:\nReporting from The Tandridge Independent this month has raised awareness of the torrid conditions residents in Blize Court and Manorview Court in Whyteleafe are living in as a result of a rat infestation. Residents have had damage done to their cars. They are scared to use the lifts to get to their homes; instead having to use the concrete staircase. And one young resident had the traumatic experience of a rat falling on her head.\nResidents have repeatedly tried to raise their concerns with their housing association L&Q, and they have loudly ignored them. Members will agree with me that this is unacceptable.\nNo one in our community should be living in these squalid conditions. This proves to be yet another case where remote housing associations are not looking after residents in our district.\nWhat steps are this Council going to take to ensure that L&Q address the infestation at Blize Court and Manorview Court? And will this Council hold Housing Associations to account and ensure that residents in their properties live in decent, adequate housing free of mould and infestations?\nCllr Jackie Wren answered the question as Chairman of the Community Services Committee and said,\n\"Our Environmental Health Service received a complaint about rats and the bins being full at these properties shortly after Christmas. Officers take these matters very seriously and contacted the housing association, L&Q, who instructed their pest control contractor to attend and carry out treatments.\nDuring the Christmas holiday period refuse collections were not made on the usual dates but refuse was collected on the dates scheduled during this time, and collections have now returned to their normal days.\nAs part of their investigation, the Environmental Health Officers visited the properties on the 15th of January and I’m pleased to report that at that time, there was no evidence of rats or overflowing bins at the time of their visit, and they also observed that rodent bait boxes were in place. The Officers will continue to work with L&Q to ensure that this site is being monitored by their pest control contractor until the rodent matter is resolved.\nTenants who are concerned about mould growth in their homes should contact their service provider or landlord in the first instance to give them the opportunity to deal directly with the matter. If they fail to act within reasonable period of time, they can report it then to the Environmental Health Service who will investigate.\nHowever, Councillor O’Driscoll you have sent me some pictures recently taken at the site that show that the bin storage areas continue to be overflowing and they look a health hazard to me, bearing in mind some of the stuff that had been put around the bins I would not have thought very safe to be around a bin area, so I am going to forward those to the Environmental Health and request they return to do another site visit as quickly as they can and if need be, if it is still like that when they attend, that they get back in touch with L&Q.\"\nI followed up by asking if the Council will commit to sending an Environmental Health Officer to Blize Court and Manorview Court, and if the findings were the same as what I found, will a long overdue enforcement notice be served?\nCllr Wren said, \"I will personally get Environmental Health to go back to those premises and have a look, and see what the situation is as of now, rather than back in January, and if the findings are the same, if they can take measures to get L&Q to make that a safe environment for the people there, and, if need be, we can instruct them to put a notice on L&Q that they have to make that whole premises habitable.\"\nSince the meeting, I am pleased to confirm that Environmental Health have visited and have asked L&Q to take steps to rectify the infestation.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_royal-mail-not-delivering-dorking-hills/content_3.html": "Royal Mail not delivering Dorking Hills\n- Taylor O'Driscoll\n- Mar 3\n- 1 min read\nResidents in the villages of Dorking Hills have raised concerns with me about the frequency of post being delivered. Which is often every three weeks or longer in some places.\nA variety of time sensitive letters including hospital appointment confirmations, bills, wedding invitations and other correspondence is not being delivered in time. With so many residents reliant on the postal network to communicate with relatives and local authorities, this cannot go on.\nI've raised concerns directly with the highest levels of Royal Mail about the impact of the lack of post in the area covered by Dorking Delivery Office and asked them to sort it out.\nIf you have any concerns you'd like me to take up with Royal Mail directly, please feel free to get in touch and I will raise it with them.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_emaillist/content_10.html": "top of page\nSubscribe to my email list\nLocal residents tell me that being informed of important local matters is crucial, especially before it is too late to do anything about them. In order that I can effectively communicate with you about key issues that affect our area, please join my community email list.\nI promise to not spam you with excessive emails and will ensure that your details will not be passed onto anyone or any organisation under any circumstances.\nYou will be able to easily unsubscribe at any time. Every email sent will have a handy unsubscribe button at the bottom. Simply click it and you're off the list.\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_autism-awareness/content_13.html": "Increasing autism awareness\nHaving been diagnosed with autism at the age of 3, I have first-hand experience of what it's like to have autism and some of the challenges that are faced.\nI attended a SEND school growing up, and noticed how my parents struggled through a lack of support from local authorities in getting me into my school, which required me to travel over 90 minutes each way every day.\nHowever, since then, the progress being made by Surrey County Council has been positive with new schools being completed in Epsom and Redhill, which will help families in East Surrey. And the County Council's improvement plan for SEND provision is a role model for other counties, which should be celebrated.\nI'll work to ensure that there is more awareness of autism and to remove the barriers that are faced.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_fighting-for-tandridge-commuters/content_37.html": "Fighting for Tandridge Commuters\n- Taylor O'Driscoll\n- Dec 20, 2021\n- 2 min read\nUpdated: Dec 15, 2022\nI know that local residents are concerned about local rail services being reduced, particularly on the Caterham line, with the withdrawal of the London Victoria service and the reduction of the service from four trains an hour to two trains an hour in the latest timetable change.\nIn response to this, I raised a question at the last Full Council meeting of Tandridge District Council (16 December 2021) to Cllr Catherine Sayer, the Leader of Tandridge District Council asking if she will work alongside me to make representations on behalf of Tandridge residents to Govia Thameslink Railway.\nHere's my question in full.\nResidents are concerned about the reduction of service by Southern Rail on the Caterham Branch Line serving Caterham and Whyteleafe that took effect earlier this week, reducing the number of trains an hour from 4 to 2. While I'm hopeful this is only temporary during the pandemic, residents are also concerned about the removal by stealth of the direct Caterham to London Victoria services, which is requiring residents to change at East Croydon to get to Victoria. I share these concerns residents have. Will the Leader of the Council join us in expressing concern at these service reductions and take steps to address these concerns with Southern Rail?\nCllr Jackie Wren, Chairman of the Community Services Committee of the Council, answered the question on behalf of Cllr Sayer and said, \"Myself and other Members have become very aware of the adverse impact of Southern Rail’s service reductions upon Tandridge commuters. This is a District wide issue and the Leader will make representations to Southern Rail to express the Council’s concerns on behalf of its residents. We will also seek the support of Claire Coutinho MP in submitting these representations and would encourage residents to write to Claire to demonstrate the depth of feeling within our communities.\"\nMany residents will be feeling anxious about the reduction in service but I will continue to work to ensure that we get the best possible service from Southern and Thameslink in our area.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_supporting-our-villages/content_11.html": "top of page\nWorking with and supporting our villages\nOne of my fundamental beliefs is in working with our communities to help them thrive at a local level. It's my intention to work with Parish Councils and residents to secure the funding we need to deliver the facilities we need.\nEach of our villages has a unique identity and I will aim to be an accessible representative for each individual village, delivering on the priorities that matter to you.\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_protecting-open-spaces/content_16.html": "top of page\nProtecting the countryside and open spaces\nThe pandemic has shown how precious our countryside and open spaces are and how important it is they are protected, with health benefits linked to access to open spaces.\nI will work to ensure that the countryside and open spaces are protected to ensure everyone has access to nature, and enhanced so that local wildlife is able to thrive.\nLittering has been blighting our open spaces locally and has a negative impact on our villages. Read more about some of the action I have been taking to address this in the community.\nRead more about my work to address fly tipping in rural communities.\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_post_fighting-for-better-quality-social-homes/content_34.html": "Fighting for better quality social homes\n- Taylor O'Driscoll\n- Nov 2, 2022\n- 1 min read\nUpdated: Dec 15, 2022\nIt's been raised with me that the conditions in some of the housing stock in Tandridge is not good. I've been working with Tandridge District Council officers to ensure these concerns are addressed.\nSenior Council officers joined me to speak with residents in Newlands Court and were shown some of the issues in the block. These include bin sheds not being maintained, a broken tumble dryer left in the laundry room, broken lights in the corridors making residents feel unsafe and a lack of fire alarms in the communal areas.\nI am working with officers to fix the issues in Newlands Court and in other blocks across Tandridge, however more needs to be done to address the quality of social housing. Especially as it has been reported that some flats in other parts of the District have rough sleeping in the corridors, mould and a lack of fire alarms in communal areas.\nI will work to ensure that residents in social housing live in the best possible conditions and if you live in social housing and have any concerns about the condition of your home, please get in touch with me.",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_news/content_4.html": "top of page\nSearch\nA new banking hub for Dorking\nI found out more at the recent exhibition\nTaylor O'Driscoll\nMar 41 min read\nRoyal Mail not delivering Dorking Hills\nAnd what I'm doing to get it fixed\nTaylor O'Driscoll\nMar 31 min read\nOckley School Buildings public meeting\nAn update on the school site in Ockley\nTaylor O'Driscoll\nFeb 281 min read\nCANCELLED: West Street pedestrianisation\nPeople power wins!\nTaylor O'Driscoll\nFeb 191 min read\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_fixing-potholes-pavements/content_12.html": "top of page\nFixing potholes and pavements\nOur road network in Dorking Hills is crucial for connecting our communities. Therefore, I am keen to work with Surrey Highways to fix the potholes that have been blighting our roads and also make fix some of the uneven pavements in our villages.\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_campaigns/content_19.html": "top of page\nHome\nNews\nAbout\nTaylor's CV\nEndorsements\nWhat Taylor stands for\nTaylor's Campaigns\nTaylor's Views\nCampaign with Taylor\nEmail List\nContact\nPrivacy\nMore\nUse tab to navigate through the menu items.\nTaylor's Campaigns\nCouncil Tax Exemption for Care Leavers\nAccessible Playgrounds for All\nBetter Public Transport for East Surrey\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_better-social-homes/content_21.html": "top of page\nCampaigning for better social homes\nEvery resident deserves to live in decent conditions, but in recent years, residents have not been. Seeing the decrepit state of the flats in Regina Road, South Norwood was horrifying and the fact that then-Labour controlled Croydon Council didn't take action to address this was unjust and not right.\nHaving grown up in social housing myself and seeing my family's bathroom mouldy, decaying and barely functioning, I want to ensure that everyone in social housing lives in decent conditions.\nRead more about my campaign to fix the conditions in Newlands Court, Westway.\nRead more about my work to address a rat infestation in Blize Court and Manorview Court, Whyteleafe.\nbottom of page",
  "https_www_taylorodriscoll_co_uk/https_www_taylorodriscoll_co_uk_cv/content_18.html": "Taylor's CV\nPolitical\nElections\n-\n2021-2024: Councillor for Westway ward, Tandridge District Council\n-\n2024: Reigate & Banstead Borough Council candidate for Horley East & Salfords\nCampaigning\n-\n2024: Horley Campaign Lead for Marisa Heath, Parliamentary Candidate for Dorking & Horley\n-\n2022: Campaign Manager for Harry Baker-Smith, Tandridge District Council Candidate for Dormansland & Felcourt\n-\n2022: Campaign Manager and Election Agent for Fodi Foti, Tandridge District Council Candidate for Whyteleafe\n-\n2021: Assistant Social Media Manager for Lisa Townsend, Candidate for (now elected) Police & Crime Commissioner for Surrey\n-\n2021: Deputy Campaign Manager for Jeremy Webster, Surrey County Council Candidate for Caterham Hill\n-\n2019: Campaign Assistant for Claire Coutinho, Parliamentary Candidate (now MP) for East Surrey\nPositions of responsibility\n-\n2023-present: Digital & Communications Officer, Dorking & Horley Conservative Association\n-\n2023-2024: Deputy Chairman, Horley Conservatives\nDeputy Chairman for the Horley branch of East Surrey Conservative Association for the voluntary side responsible for membership recruitment and engagement.\n-\n2022-2024: Lead Conservative Party Spokesperson for Community Services, Tandridge District Council\n-\n2022-2024: Co-Chairman, East Surrey Young Conservatives\n-\n2020-2022: Digital Campaigning Officer, East Surrey Conservative Association\n-\n2020-2023: Vice Chairman, Caterham Hill Conservatives\nVice Chairman for the Caterham Hill branch of East Surrey Conservative Association for the voluntary side responsible for political strategy in Chaldon, Portley, Queen's Park and Westway wards.\nCareer\n2022-present: Communications Assistant\nTaylor works as a Communications Assistant working primarily in Internal Communications and Social Media.\nVolunteering\n2022-2023: Council Representative, Caterham Community Association\nCaterham Community Association manages a community centre in Caterham on the Hill for residents in the area to attend local clubs with members of all ages. It's also used by a local school for educational purposes.\n2020: Volunteer, Four Parish Response Team\nDuring the pandemic, the Four Parish Response team was set up by the Westway Centre in Caterham and aimed to support vulnerable residents living in Caterham, Westway, Whyteleafe and Chaldon. This could be through collecting and delivering shopping, checking in on residents and reducing social isolation.\n2019: Fundraiser, National Autistic Society\nThe National Autistic Society aim to help all of the 700,000 autistic people in the UK and their families. They run specialist schools across the country, help companies to be more autism friendly and aspire to empower autistic people to have a good quality of life and to change attitudes about autism in society. In 2019, I attempted the Tube Challenge in aid of the National Autistic Society and raised £250.\n2016-2017: Volunteer, The Sunnybank Trust\nThe Sunnybank Trust supports neurodiverse adults in North East Surrey to have opportunities, confidence and control over their lives. They aim to enable people with diverse abilities to feel safe and secure, facilitate friendship building and community support networks, and to empower people with diverse abilities in having a voice over their own future."
}