{
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_candidate-conference-opener-lessons-leadership-and-resilience/content_31.html": "Standing on the stage of the Conservative Party Conference in Birmingham, flanked by esteemed figures like Chairman Richard Fuller, Sir Andy Street, Lord Daniel Hannan, and Rt Hon. Penny Mordaunt, was an unforgettable moment in my journey as a leader and public servant. As the Parliamentary Candidate for Birmingham Ladywood, opening the conference was not only an honour but also a reflection of the grit, determination, and Conservative values that have guided me through life’s challenges.\nThe experience of addressing the party faithful, sharing my story, and reflecting on the resilience required in the political arena was humbling. It was also deeply inspiring—an opportunity to shine a light on the values that unite us as Conservatives and to reaffirm the importance of rising above adversity to achieve meaningful change.\nRising Above Challenges\nCampaigning in Birmingham Ladywood was no small task. The constituency is a historic Labour stronghold, with deeply entrenched challenges and years of neglect. But that didn’t deter me. As a candidate, I faced questions about what it means to be a Conservative in a diverse, urban constituency. I was met with scepticism but also with hope—hope that someone willing to listen and act could make a difference.\nThrough relentless door-knocking, community meetings, and countless conversations, I witnessed the struggles faced by ordinary people: rising crime, neglected infrastructure, and a lack of accountability from Labour leadership. I also saw immense potential—young people eager for opportunities, businesses craving support, and communities yearning for leadership that puts them first.\nThe campaign was not without its challenges. There were moments of doubt and days when the road ahead seemed steep. But each challenge reinforced my belief in the values that underpin our party: personal responsibility, equal opportunity, and the importance of community.\nRising Above Challenges\nCampaigning in Birmingham Ladywood was no small task. The constituency is a historic Labour stronghold, with deeply entrenched challenges and years of neglect. But that didn’t deter me. As a candidate, I faced questions about what it means to be a Conservative in a diverse, urban constituency. I was met with scepticism but also with hope—hope that someone willing to listen and act could make a difference.\nThrough relentless door-knocking, community meetings, and countless conversations, I witnessed the struggles faced by ordinary people: rising crime, neglected infrastructure, and a lack of accountability from Labour leadership. I also saw immense potential—young people eager for opportunities, businesses craving support, and communities yearning for leadership that puts them first.\nThe campaign was not without its challenges. There were moments of doubt and days when the road ahead seemed steep. But each challenge reinforced my belief in the values that underpin our party: personal responsibility, equal opportunity, and the importance of community.\nConservative Values in Action\nAs I shared on stage at the conference, these values are not just abstract principles—they are a roadmap for resilience. They guide us in times of uncertainty and remind us that progress is possible when we work together.\nThe story I told in Birmingham was not just my own but also that of countless others who believe in building a better future. It was a story of empowerment: how education transformed my life, how Conservative policies can lift individuals and communities, and how determination can overcome the most daunting odds.\nI spoke about the need for economic growth to support thriving cities, the importance of local leaders who understand their communities, and the urgency of creating opportunities for the next generation. These are the issues that matter—not just to Conservatives, but to everyone who believes in the potential of our nation.\nLessons for Leaders\nOpening the conference alongside some of the brightest minds and most accomplished leaders in our party was a reminder of the power of vision and collaboration. Sir Andy Street’s work in revitalising the West Midlands, Lord Hannan’s insights on trade and innovation, and Penny Mordaunt’s unwavering commitment to public service each underscore the importance of strong leadership.\nFor anyone seeking to lead—whether in politics, business, or community initiatives—the lessons are clear:\n- Stay Grounded in Values: Your principles are your compass, especially in challenging times.\n- Embrace Resilience: Leadership is not about avoiding obstacles but about facing them head-on and finding solutions.\n- Build Strong Networks: Collaboration and shared purpose are the keys to lasting impact.\n- Inspire Others: Leadership is about lifting others, creating opportunities, and fostering a sense of shared achievement.\nYour Turn to Lead\nThe Conservative Party Conference was a reminder that leadership is not about perfection; it’s about persistence and purpose. Whether you’re running a business, leading a team, or embarking on your own transformative journey, the principles of resilience, strategy, and collaboration can guide you to success.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_labours-parking-charge-gamble-cost-our-community/content_9.html": "There are days when I question the role of a councillor and the real impact we can have, especially when the council is run by a Labour administration that refuses to prioritise the needs of residents over balancing the books. Today is one of those days.\nLast night's meeting to scrutinise the parking hike left me deeply frustrated. Despite a petition signed by nearly 1000 members of the public, and heartfelt testimonies from a resident and a business owner on how these increases will affect them, Labour and the Liberal Democrats seemed more concerned with accusing us of wasting their time than addressing the actual issue.\nThe Labour council’s decision to increase car parking charges was based on an assumption that higher fees would encourage more people to use buses. However, this assumption was not supported by any evidence or data. As Conservative councillors, we felt it was our duty to challenge this decision and called it in for further scrutiny.\nWe called it in because businesses will be affected, as evidenced by the business owner who shared how this would impact his livelihood. We called it in because residents will be burdened by a new £675 parking permit. A local medical student movingly explained how this added cost would stretch his already tight budget to breaking point. We called it in because the council’s plan relies on unreliable public transport and does not provide any data to show this change will lead to the desired behavioural shift.\nLabour’s response? They claimed we had no evidence for the call-in and dismissed our concerns as mere opinions. They presented letters from bus companies supporting their decision but failed to conduct a pilot test, produce data, or consult the very residents and businesses affected by this policy. Instead, they relied on partnerships to justify squeezing more money out of residents.\nThis dismissive attitude was particularly hurtful because my fellow councillors and I worked tirelessly to speak directly to residents, shoppers, and businesses. We listened to their concerns, and within a single weekend, our petition against the hikes gathered nearly 1,000 signatures. That’s nearly 1,000 voices saying, “This is not right.” Voices Labour chose to ignore.\nAccording to the Labour council, living in the city centre comes with a premium. They argue that residents can simply walk to where they need to go. But what about those who work outside CMK? What about the medical student trying to make ends meet? What about the small business owner who just wants a fair chance to keep his business alive? Their pleas fell on deaf ears.\nLabour claims footfall in the city centre has increased and parking surpluses are up. But they ignore the struggles of small businesses, shared workspaces, and hospitality venues outside the core shopping areas. Their refusal to consult or engage with the people most affected shows how out of touch they are.\nI’m proud of the work we did—standing shoulder to shoulder with residents, business owners, and shoppers. Their support and the petition we built together show the strength of our community. But I am also deeply disheartened by the Labour council’s refusal to listen. This dictatorial leadership style—making decisions in isolation and ignoring the people they’re supposed to serve—is not what Milton Keynes deserves.\nThank you to everyone who signed the petition, shared their stories, and supported us. We will continue to fight for what’s right, even when it feels like we’re up against a brick wall. Your voices matter, and we will keep working to make them heard.\nThe petition can be found here:",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_breaking-barriers-women-conservative-candidates-local-government/content_15.html": "Politics today suffers from a pervasive lack of trust, particularly in the two mainstream parties, driving many toward other alternatives like -dare I say - Reform. For the Conservative Party, this challenge is especially pronounced: we must reconnect with our roots and redefine our brand. This rebranding must begin at the top but, more importantly, filter down to resonate authentically with people at the grassroots level.\nRebuilding trust requires more than rhetoric; it demands consistency, transparency, and tangible actions that reflect our core values. Without this, we risk not only losing members but also discouraging talented women from stepping forward to stand for public office.\nDespite these challenges, I remain hopeful. Women are vital to politics, bringing unique perspectives and skills. But too often, barriers prevent them from stepping into these roles. These challenges must be addressed if we are serious about creating a more inclusive and supportive environment for women in public life. Among the most significant barriers are:\n1. Addressing Racism, Misogyny, and Disrespect\nOne of the most common questions I hear is, “How do you deal with racism, misogyny, and similar challenges?” Unfortunately, these issues are deeply embedded, not just in politics but in many institutions. The constant undermining, disrespect, and double standards women face are degrading and exhausting.\nThese behaviours are not exclusive to any one party, but they must be acknowledged and tackled if we want to create a healthier political culture. While we cannot control how others behave, we can control how we respond.\nThese challenges are rarely personal but stem from a competitive culture in politics where one person’s success is seen as another’s failure. As women, we must remind ourselves that our voices matter. Change cannot happen unless we step forward and take action. By standing up, speaking out, and persevering, we pave the way for the next generation of women leaders.\n2. Balancing Roles and Building Resilience\nFor many women, the biggest barrier to participating in public life lies in balancing multiple roles—mother, wife, professional, and public servant. Political life often demands evening meetings at times when many women are managing family routines, like preparing dinner, helping with homework, or putting children to bed. Teachers, for instance, are marking papers and planning lessons for the next day.\nThese overlapping demands make it difficult for women to step into political roles without risking their well-being. Women often approach every responsibility with 200% commitment, and when they feel they cannot give their all, it weighs heavily on them. Dropping the ball feels like an unacceptable option, but when it does happen, where is the support structure to catch us? Too often, that support is insufficient or entirely absent.\nWomen in political groups often shoulder disproportionate responsibility, acting as “fixers” who carry the weight of others. This dynamic needs to change. Support structures must be strengthened, and group cultures should foster genuine solidarity. No one individual should bear the collective burden, and no one should feel isolated in their struggles.\nChange takes time. We cannot wave a magic wand to create a more supportive culture overnight. But we can control how we respond, how we manage our energy, and how we lift each other up. Women are among the most resilient individuals I know. We juggle children in one hand, work in the other, kick a football, and still find the strength to lead.\nBut resilience alone is not enough. We need systems and cultures that actively support women in leadership roles. By fostering mutual understanding and solidarity, we can create an environment where women feel empowered and supported in balancing their many responsibilities.\n3. Supporting Women in Local Governance\nA significant barrier for women considering roles in local governance is the lack of adequate financial support. These roles are often treated as part-time, yet the demands far exceed part-time hours. If local governance were paid sufficiently to be a primary job, it would open the door for a broader range of candidates, particularly women, to commit fully to these roles without juggling multiple jobs or financial pressures.\nUntil systemic changes are made, practical solutions are necessary. Meetings should be scheduled at reasonable times to accommodate caregivers. Late evenings or times that clash with family routines must be reconsidered.\nInstitutions must also provide tangible support for working parents, especially mothers. This could include offering areas where children are welcome, creating a creche at council buildings, or providing childcare during meetings. These measures would help remove a significant barrier for women who are forced to choose between family responsibilities and civic engagement.\nBy implementing these changes, local governance can set a powerful example, demonstrating its commitment to inclusivity and the value of women’s contributions.\nThe Call to Stand\nTo all women considering politics: your voice is needed. Your perspective is vital. If we want to see change, we must be the ones to make it happen. That begins with standing up, even in the face of challenges.\nThe road ahead is not easy, and attitudes will take time to shift. But we are the change-makers. Our strength lies in our ability to persevere and lead by example. Together, we can overcome these barriers—not just for ourselves, but for the generations of women who will follow.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_conservative-party-conference-2023-fusion-inspiration-and-determination/content_49.html": "Conservative Party Conference 2023: A Fusion of Inspiration and Determination\nThe Conservative Party Conference of 2023 has drawn to a close, leaving in its wake a palpable sense of inspiration, camaraderie, and purpose. This gathering was more than just a political event; it was a celebration of core conservative values and a testament to the unwavering dedication of its members.\nFor me, it felt like I was home. Whether it's catching up with old friends or meeting new ones during campaigns, training, or fundraising sessions, they all never fail to inspire and motivate me. Their presence in my life reminds me to that although we may have differing opinions, we all strive towards creating a better future for ourselves and our loved ones. It's a vision that only the Conservatives can turn into a reality.\nDespite the strikes that occurred during the conference days, a considerable number of members were still able to attend the event in Manchester. It was unfortunate to encounter the typical Labour protesters who resorted to insulting anyone passing by with derogatory terms. However, as the junior doctor strike happened, they did not hang around for too long and left. The sudden opening of the skies did not help either. I did ask whether there are Conservative protestors outside the Labour conference usually, but heard that we are better than that.\nThroughout the conference, attendees had the privilege of listening to speeches from distinguished figures, including the Home Secretary, the Chancellor, the Defence Secretary, and the eloquent James Cleverly, who shared their insights and visions for a brighter future. However, it was Penny Mordaunt's presence that truly lit up the stage. Her warrior maiden spirit and infectious enthusiasm injected a fresh wave of energy into the room. Mordaunt's winning attitude was a reminder that conservatism is not just about politics but a way of life characterised by determination and optimism.\nMordaunt's boundless energy and steadfast commitment to conservative values is truly inspiring. Her unwavering passion drives the party forward and reminds us all of the importance of our political journey.\nI happened to bump into Lord Ashcroft out in the wet streets of Manchester, who patiently listened to our questions and responded whilst also divulging some really good, yummy gossip (for another day) On that note, we left the world where it was and parted ways. I did buy his latest book, a biography on our Prime Minster, All To Play For, which is yet to be signed.\nI was fortunate enough to get the opportunity to interact with the Prime Minister himself. As he came down the steps after motivating volunteers and members at the Southern reception attendees, I shared a few words with him. In the midst of inviting him to Milton Keynes to support the battle for the 80:20 seats, the Prime Minister's reminder of an impending by-election served as a stark reminder of the challenges Conservatives face.\nThe forward plan outlined by the Prime Minister resonates strongly with the core values of Conservatism. Scrapping HS2 in favour of a more comprehensive plan, addressing the issue of illegal migration, bolstering the NHS, reducing the cost of living burden, and increasing the age for cigarette purchases are all initiatives that align with Conservative principles. This forward-thinking approach prioritises positive economic growth, social mobility, and giving us the which are at the heart of the Conservative agenda.\nAs I reflect on the Conservative Party Conference of 2023, it's clear that this gathering was more than just a political event. It was a rallying point for individuals united by their dedication to Conservative values. It was an opportunity to be inspired, motivated, and reminded of the importance of the Conservative cause. The fusion of light hearted enthusiasm and serious determination that permeated the conference serves as a powerful reminder that Conservatism is not just a political ideology; it's a way of life that strives to build a better future for all.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_conflict-rebuilding-communities-uk-foreign-aid-and-halo-trusts-impact-post-war-sri-lanka/content_37.html": "Having the opportunity to join a team of cross-party delegates on a visit to Sri Lanka was not just a professional endeavour for Cllr Shazna Muzammil—it was deeply personal. Growing up amidst a civil war, she was no stranger to the devastating effects of conflict. So, when she had the chance to visit Jaffna, a city that had endured the horrors of war, it struck a chord with her on a profound level. She expressed immense gratitude to the Coalition for Global Prosperity for providing her with this opportunity and making all the arrangements.\nSri Lanka, this small island in the Indian Ocean, has faced its fair share of challenges. The 30-year civil war, which finally came to an end in 2009, left behind a staggering toll of 80,000–100,000 deaths, according to UN estimates. And if that wasn't enough, the Boxing Day Tsunami of 2004 claimed over 35,000 lives in a matter of minutes, further adding to the island's woes.\nHer previous visits to Jaffna in the aftermath of the war painted a stark picture of the lingering effects of conflict. Every face she saw had pain and trauma etched on them, and the scars of battle were very much evident in the buildings and homes covered in bullet holes and collapsed roofs. Yet, amidst the rubble and remnants of war, there was always a glimmer of hope—the resilience of the Sri Lankan people.\nDuring her recent visit, she was truly surprised by the progress that had been made in Jaffna since the end of the civil war. The region seemed to have undergone a transformation, with signs of prosperity everywhere. Life had returned to the streets, and it was inspiring to witness the indomitable spirit of the people as they rebuilt their lives.\nThough the memories of conflict may linger, the people of Jaffna have demonstrated an unwavering determination to move forward. Their resilience is a testament to the human spirit's ability to triumph over adversity.\nAnd within this sphere sits the Halo Trust, clearing mine-ridden areas and making it safe for people to return to their homes. Halo has been in Sri Lanka for 22 years, and the UK Government has funded 18 of its 22 years as this largest global humanitarian demining organisation carries on its work in the northern and eastern parts of Sri Lanka. Halo works in collaboration with UNDP and the local authorities to resettle internally displaced people (IDPs), and there are still around 9000 people yet to be relocated in Jaffna alone. These people have had to move over and over, rebuild their lives, and then move again, and it is time they had their own homes where they can put down roots and bring up their families. The UK's funding is helping them.\nThe impact of Halo's work is nothing short of transformative. With 117 square kilometres of land released, thousands of individuals now have the opportunity to build their homes and communities. Over a quarter of a million mines and nearly a million unexploded ordnance have been safely removed. Over 280,000 people have now returned to land released by Halo and have begun to build communities.\nHalo's commitment to demining goes beyond simply clearing landmines—it extends to empowering the very communities affected by conflict. By providing jobs and opportunities to locals and internally displaced persons (IDPs), Halo is not only making areas safe but also fostering economic growth and resilience.\nRaj, one of the deminers, while teaching her the back-breaking skill of carefully clearing a mine, expressed his gratitude for the employment opportunity provided by Halo. Travelling over an hour to reach his workplace in Mahumalai, Raj emphasised the importance of having a job in a region where the employer also provided transport. For him, Halo's support means more than just a paycheck—it's a lifeline in rebuilding his life and providing for his family.\nStanding in the middle of a defence line that has only been partly cleared, Vic, also of the Halo Trust, spoke to her. His story serves as a poignant reminder of the enduring suffering endured by many in conflict-affected regions. Having been displaced at a young age, Vic vividly recalls the pain of being uprooted multiple times, leaving behind everything except the clothes on their backs. His words resonate with the countless others who have endured similar hardships, facing the harsh reality of displacement and loss. His voice still carries the pain of the war, very much not forgotten.\nDespite the challenges, Halo's impact extends even to those who once played a role in the conflict. An ex-LTTE cadre now contributes to the demining efforts, showcasing the transformative power of reconciliation and rehabilitation. The irony of his past involvement in laying mines is not lost, underscoring the complexity of conflict and the potential for redemption and healing.\nThey were also fortunate to visit a resettled community and speak to them. Sitting in a community center funded by UK’s foreign aid and built with the help of UNDP, they couldn't help but feel a sense of pride knowing that their efforts are making a tangible difference in the lives of vulnerable individuals. It reaffirmed her commitment to standing as a parliamentary candidate, knowing that the opportunities it provides to aid those in need across the globe are immeasurable.\nWhile strides have been made, much remains to be done in post-war Sri Lanka. Unfortunately, many parliamentarians are preoccupied with a looming general election and pressing economic challenges, leaving little room for engagement in crucial matters like infrastructure development and resettlement efforts. Additionally, the absence of local government representation following the riots further complicates matters. Amidst these challenges, organisations like Halo continue their vital work, but funding remains a pressing need. The road ahead feels daunting, but her commitment to supporting initiatives for peace and reconciliation in Sri Lanka must remain steadfast.\nDiscussions around aid budget cuts were constant chatter amongst her political colleagues from both parties, but there was unanimous agreement on one thing—the profound impact of the UK's presence on foreign soil. Their nation is revered as a beacon of influence, support, and hope, and their assistance is valued by nations far and wide. And as they witness the safe return of those who once sought refuge on their shores, they are reminded that their efforts to empower others abroad ultimately contribute to their own security here in the UK.\nOverall, her experience in Sri Lanka was a powerful reminder of the importance of aid efforts in regions affected by conflict and natural disasters. The progress that has been made in Jaffna is a testament to the resilience and determination of the Sri Lankan people, and the power of the UK’s foreign aid can be seen everywhere.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_campaigns_say-no-doubling-parking-charges-central-milton-keynes/content_35.html": "The Labour administration of Milton Keynes City Council is poised to impose steep increases on parking charges in central Milton Keynes, hitting residents and visitors with yet another financial burden.\n- The price of standard parking for the minimum stay of two hours will double from £1 to £2.\n- The price of premium parking for the minimum stay of 1 hour will go up to £2.50 from £2.00.\n- This decision will also impact E1 Employee permit holders. The daily E1 Permit charge rate will increase to £3 and the five-hour Permit charge will increase to £2.\nLast year was just the beginning. The Labour-Liberal Democrat-led Council already doubled the minimum stay requirements from one hour to two hours, which raised the minimum spend from 50p to £1. Now, they seek to double the cost of those two hours to an astonishing £2! This pattern of repeated financial strain on our community cannot continue.\nConservative Councillors believe it is unacceptable to expect residents and visitors of Milton Keynes to shoulder yet another increase—especially when many families are already struggling with the rising costs of living. Small businesses will be particularly hard hit as well; increased parking fees deter shoppers, making our city less attractive and jeopardising the livelihoods of local businesses.\nSign our petition today to stand united against these unfair parking charge increases. Let’s show the council that we demand reasonable parking fees that support our community, not undermine it.\nWe have just a few more days to get as many signatures as we can, so please do share it with friends, family and businesses so we can go to the meeting and speak up on behalf of you all.\n**This campaign has now closed. Update is available here: https://www.shaznamuzammil.org.uk/news/labours-parking-charge-gamble-cost-our-community\nThank you ever so much.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_petition-20mph-oxley-park-response-cabinet-member-cllr-townsend/content_24.html": "Petition for 20MPH in Oxley Park\nThis is an update on the Oxley Park 20MPH petition that was presented to the council in July 2023. Councillor Lauren Townsend, who is the Cabinet Member for Public Realm and Community Safety, has informed me that the scheme has been scheduled for consultation. If there are no objections, the implementation will take place in the first quarter of 2024-2025.\nI want to extend my gratitude to all the residents who supported and encouraged the petition. I understand that the process can be time-consuming and appreciate your patience.\nPlease find attached (Annex A) the document shared by MKCC on the process for speed limits and (Annex B) the matrix of scoring.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_category_Speeches/content_43.html": "Right of reply to my motion on English Devolution 22nd January 2025 I am incredibly proud that WE have brought it forward to initiate much-needed debate. While I still firmly believe that this decision to combine with BLMK does... Speeches\nMoving the English Devolution Motion 22nd January 2025 I move this motion, with both a sense of duty and frustration. This is a hugely important issue for our region, yet it’s one this administration chose not to... Speeches\nCllr Shazna Muzammil's response to Delegated Decision on Shenley Park 3rd October 2023 03rd October 2023 Thank you, Leader And to our residents, our sincere apologies for not being able to be there with you all today. I appreciate the council's... Speeches\nGirl Guides fringe event at Conference Sunday 1st October 2023 1st October 2023 Girl Guides fringe event at Conference Sunday 1st October 2023 (Spech in full) It’s a pleasure to be speaking at the girl-guiding fringe. My story begins in Sri... Speeches",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_category_Opinions/content_32.html": "Labour’s Broken Promises: An Attack on Working Families 4th November 2024 The British public deserves a government that keeps its promises and puts people at the heart of every decision. Yet the latest budget from Labour reveals a... Opinions\nHeating or Eating: Milton Keynes Pensioners Deserve Better 23rd September 2024 Last week, I spoke with Tess, a 70-year-old pensioner whose words still ring in my ears: “I will suffer.” As winter approaches, her fear isn’t just her own—it's... Opinions\nConservative Home: Leadership candidates must focus on the role of women in our party 13th August 2024 https://conservativehome.com/2024/08/13/shazna-muzammil-leadership-cand…... Opinions\nFrom Conflict to Rebuilding Communities: UK Foreign Aid and Halo Trust's Impact in Post-War Sri Lanka 14th March 2024 Having the opportunity to join a team of cross-party delegates on a visit to Sri Lanka was not just a professional endeavour for Cllr Shazna Muzammil—it was... Opinions\nThe Soft Power of the Monarchy: How King Charles's Diagnosis Highlights UK's Influence 12th February 2024 In a recent announcement from Buckingham Palace, the news of King Charles's cancer diagnosis has sparked widespread concern and a huge surge in public interest... Opinions\nConservative Party Conference 2023: A Fusion of Inspiration and Determination 4th October 2023 Conservative Party Conference 2023: A Fusion of Inspiration and Determination The Conservative Party Conference of 2023 has drawn to a close, leaving in its... Opinions\nEmpowering Women in Politics: Unleashing Their Full Potential 3rd October 2023 The recent Conservative Party Conference was an inspiring showcase of the power and potential of women in politics. Throughout the event, organisations like the... Opinions\nPersonal and political achievements and milestones 6th April 2023 Personal and political achievements are important milestones that define who we are as individuals and leaders. Shazna's personal journey has been defined by... Opinions",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_personal-and-political-achievements-and-milestones/content_53.html": "Personal and political achievements are important milestones that define who we are as individuals and leaders. Shazna's personal journey has been defined by courage, resilience, and unwavering determination, which she applied into her professional and political life experiences. Shazna's passion for making a difference on a larger scale led her to become involved in politics and volunteering.\nShazna's personal achievements are numerous, but first and foremost, she’s very proud of her two boys, who have grown up to be wonderful, kind, empathetic, and intelligent young men. Shazna's elder son works in the field of Artificial Intelligence and was hired straight out of university, now living and working in New York. Her younger son is studying politics and economics at the University of Bristol. Education is incredibly important to Shazna, who grew up without access to it. She is immensely proud to have completed her own education, gaining her MBA in her 30s and following it up with a PGDip in Development Management.\nShazna's passion for empowering women, based on her own experiences, is reflected in her successful lobbying efforts for 25% female representation in local government in Sri Lanka, alongside her colleagues at the Women's Chamber of Industry and Commerce. She also worked tirelessly in rural villages, advocating for girls' education, and connecting them with skill development opportunities to foster economic independence. Her work was recognized by the British High Commission in Sri Lanka, and she was invited for an intimate conversation with the FCDO heads when they visited the country. Furthermore, she was recognized as the Ambassador for Sri Lanka by Women Entrepreneurship Day (WED), a UN-affiliated organization in New York.\nVolunteering has been a significant part of Shazna's life, from her role as an Appropriate Adult supporting youth in custody to her mentorship of children with a parent in prison. During the pandemic, she trained as a vaccinator to assist with the government's vaccination rollout. She also raised funds for YiS, a young people's mental health charity in Milton Keynes, by auctioning art created by children about their lockdown experiences. Shazna loved seeing the children enjoy themselves and feel like they were part of something bigger, contributing towards a cause that is helpful to them.\nThrough her experiences in volunteering, Shazna gained valuable insights into how politics can be a powerful tool in addressing the needs of the vulnerable, which led her to stand as a councillor in Milton Keynes because she wanted to make a difference. In 2021, she stood as a paper candidate in a Labour ward, and in just three months, saw the Labour majority reduced from 380 to 183 and increased their vote from 796 to 1332. Shazna is very proud of the campaign she ran and was able to achieve her goal of bridging the gap and increasing her vote share in a Labour stronghold.\nThe following year, Shazna ran again in a different ward and defeated the Labour incumbent, even though the national outlook was not favourable to the Conservative Party. Shazna is very proud to represent her residents in the council and speak up for them and their young people in Milton Keynes. She is currently the Shadow Cabinet member for Levelling Up in the council and regularly speaks in council debates.\nShazna is a seasoned campaigner who believes that campaigning pays off in terms of votes, and she believes it's the best way to understand the concerns of constituents. She collaborates closely with local MPs and councillor colleagues, supporting their leaflets and surveys. She's also travelled to support by-elections and candidates across the South-East, including Peter Fleet, Anna Firth, Cllrs Puja Bedi and Dexter Smith, Hilary Scott, and Pinder Chauhan. Additionally, she participated in connect calling for the by-election in Chester for Liz Wardlaw.\nAs Secretary of the MKC federation since 2021, Shazna has achieved remarkable success. She founded and chaired the Milton Keynes CWO in November 2021 with only nine members to support campaigning and wider coverage for conservatives. The Milton Keynes CWO has now grown its membership, volunteers, and fundraising efforts. Shazna led the team that organized the 2022 Christmas party, which raised nearly £5000 for the Federation. As a result, Shazna was nominated onto the CWO South Regional Executive as fundraising officer.\nShazna is dedicated to prioritising community safety. She has collaborated with the Thames Valley Police (TVP) to eliminate crime and anti-social behaviour (ASB) in Westcroft, which was once a hotspot for such activities. Shazna, in conjunction with the parish council, took measures to improve the situation, including cleaning up an area used for ASB activities in Nuneham Grove and introducing an Amnesty Bin for knives in Westcroft. Over 100 knives have been collected since November. Shazna also persuaded the Charity Keeping Kids off the Street to start a boxing club, which now operates out of the Westcroft meeting place, providing a secure space for young people to engage in physical activity. She has also worked with TVP to increase foot and car patrols in the area. As a result of these actions, Westcroft is no longer a hotspot for crime and ASB, allowing the police to direct their attention to other areas that need it most.\nShazna has made significant contributions during her time at the Open University. One of her most notable achievements is the creation of the Accessibility Tool designed to identify accessibility concerns when creating modules. This tool was created with the aim of ensuring that disabled students, as well as those in secure environments who don't have access to online tools, are able to complete their studies with ease. Shazna also secured funding to conduct further research on the tool so that it could be rolled out across all OU faculties and possibly shared with other universities.\nIn addition to her work on the accessibility tool, Shazna was also asked to participate in an important program focused on transitioning lecturers onto permanent contracts while working closely with the UCU. Despite the challenges this program presented, Shazna embraced the opportunity and gained valuable experience that has added great value to her professional life.\nShazna has demonstrated a strong commitment to creating a more accessible and inclusive learning environment for all students while also working diligently to improve the conditions of her colleagues. Her efforts have made a significant impact at the Open University. Shazna's passion for making a difference on a larger scale led her to become involved in politics and volunteering, and her achievements and contributions have made a significant impact on the lives of many.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_campaigns_reducing-speed-limit-20mph-oxley-park/content_20.html": "I am proposing that the speed limit on Harlow Crescent, Hepburn Crescent and Fonda Meadows be lowered to 20 mph and that additional pavement pedestrian safety measures should be implemented.\nOxley Park is a residential area, with schools and parks used by residents on an everyday basis. There are large numbers of school-going children, members of the working population and retired persons living and walking in this newly-developed area.\nThe pavements are too narrow, the cars are too fast, there are no adequate crossing facilities, and there is insufficient parking space. Cars park on the pavement, putting pedestrians' lives at danger when they are forced to use the road to push prams or walk past. This is an accident waiting to happen, especially on bends, where visibility is reduced. I have seen this happen and cringed with worry for a new mum pushing her pram or kids playing on the pavements.\nIn and around Oxley Park, it is imperative to introduce 20MPH to prevent cars from speeding. Vehicles travelling at high speeds and turning into and out of side roads are less able to notice pedestrians and/or parked cars, frequently causing them to manoeuvre dangerously, endangering not only their own lives but the lives of others.\nThis needs to change now before any more life is put at risk.\nThis petition has now been submitted to council and we await more informaiton from the council on whether the petition, signed by residents will be acknowledged and the speed limit reduced to 20MPH.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_campaigns_save-kingsmead-green/content_26.html": "Residents and their children have used Kingsmead Green as a safe location for recreation and family get-togethers. Many locals are frustrated because the Shenley Park development across the border intends to use this green as a through route. As a local ward councillor, I will continue to collaborate with the council, developers, and people to discover alternate solutions. We were recently joined by our local MP, Iain Stewart MP, and Bucks MP, Greg Smith MP, as they visited our precious green and explored alternate development access options. We traversed the entire length of the bridle path to better grasp what this development means for both sides. We are grateful to our lovely residents, particularly Tonie Testa and Caroline, who spoke with the MPs about the development.\nThe good news is that both MPs agree with us that no through highways should be built through Milton Keynes, and they will continue to work with us to find other solutions.\nKingsmead Green is more than just a plot of land; it is the heart of our resident community. From celebrating the Queen's jubilee to our children playing securely, this green space contains innumerable fond memories.\nWe also want to raise awareness that this development comes on top of previous expansions, such as Salden Chase, which will further aggravate congestion in Milton Keynes if suitable infrastructure is not planned for. Furthermore, putting residences near grid roads is against established policy.\nWe are committed not to lose any more green places, which are essential for our physical and emotional health.\nWe are actively interacting with developers and all stakeholders, hosting meetings to ensure that the voices of our people are heard throughout this process. We will also continue to share any information we receive from our MPs on this.\nWe promise to keep our people updated every step of the way as we fight on. All of our residents' support is critical to ensuring the future of our open space for future generations. It is not over yet, and there's still lots more to do, regardless Thank You for your ongoing support.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_labours-broken-promises-attack-working-families/content_19.html": "The British public deserves a government that keeps its promises and puts people at the heart of every decision. Yet the latest budget from Labour reveals a stark departure from their election commitments, striking at the very core of public trust.\nLabour promised economic responsibility, pledging not to burden working people with higher taxes or introduce policies that would hurt families and businesses. But the reality has fallen far short. Today, we’re facing a staggering £40 billion tax increase, significant spending hikes, and a wave of borrowing that will leave future generations to pay the price. The Office for Budget Responsibility (OBR) recently dispelled the myth of Labour’s alleged £22 billion “black hole”—a financial gap largely created by their own spending decisions. Nearly half of this gap is linked to pay raises given to unions, showing Labour’s priorities lie more with union interests than with the public’s well-being.\nOne of the most alarming shifts is the £25 billion increase in employer National Insurance Contributions (NICs)—a clear violation of Labour’s campaign promises. According to the OBR, this added burden on businesses will hit employees the hardest, pushing down wages and reducing job opportunities. For communities like Milton Keynes—where 99.5% of businesses are small and medium-sized, supporting 136,000 private-sector jobs—this \"tax on jobs\" will be devastating. Businesses already grappling with rising costs will find it harder to grow, invest, and hire. The result? Fewer jobs, fewer pay raises, and fewer opportunities.\nAnother glaring oversight in this budget is the absence of meaningful AI-specific investment, despite Labour’s pledge to make AI central to Britain’s future economy. The government’s failure to mention the promised AI Opportunities Action Plan is especially disappointing for Milton Keynes, a city rooted in tech and innovation. This lack of commitment leaves critical sectors without the support needed to fuel the UK’s future growth.\nLabour inherited a thriving economy from the previous Conservative Government, the fastest-growing in the G7, but their recent actions represent a harmful deviation from prosperity. Despite higher NICs, increased stamp duty, and new VAT on independent school fees, public investment remains low at only 2.5% of GDP. These tax rises are not only punitive but add pressure on working families, leaving them with less. This, combined with Labour’s inability to secure significant investments, shows a government that seems more focused on union appeasement than on building a robust economy for everyone.\nThese measures don’t just affect businesses and workers; they also extend to essential public services. Care providers and waste management companies with council contracts will face higher costs, which will ultimately pass down to local councils and to you, the taxpayers.\nIn Milton Keynes, a city with ambitious plans to double its population and increase build-to-rent properties, the recent rise in stamp duty is expected to limit the availability of rental accommodations. This situation is likely to result in heightened competition for homes, which will consequently drive up rental costs and reduce the variety of choices available to renters.\nThe OBR warns that Labour’s borrowing-driven approach brings inflation risks, which in turn raises interest rates, mortgage costs, and puts further strain on public services. Rather than helping, these policies are piling on debt and driving up costs for everyone.\nEqually concerning is the delay and uncertainty surrounding the New Women and Children’s Hospital Programme, a much-needed new healthcare facility for the people of Milton Keynes. Labour’s silence on this crucial issue leaves communities unsure about the future of vital services. These decisions do more than hinder healthcare; they erode public trust and leave communities feeling abandoned.\nThe Labour Government has committed a shameful betrayal by breaking another promise, which was not to introduce a Family Farm Tax, which will severely undermine farmers’ ability to pass their farms on to the next generation. This tax threatens food security by forcing the sale of family farms and complicates British food production at a time when many farmers are already struggling with soaring costs and rising energy prices. This sudden tax increase isn’t just a hit on farmers; it’s a direct assault on working families and the very future of our agricultural community here in rural Milton Keynes and across the country.\nTax on education is a tax on aspiration. The rise in tuition fees is prompting young people to reevaluate their futures and limiting their opportunities. Additionally, VAT on independent schools is yet another blow to aspiration and access to quality education.\nThe working person and our children need the buses to get to work and school, and capping the fare at £3 is only going to hit them harder.\nIn all these policy reversals and Labour going back on their word, public trust in politics is reaching an all-time low. Trust is built on action, transparency, and fulfilling promises. Each broken promise widens the gap between the government and the people, shaking the foundations of our democracy. Trust is not borne when you say you won't hit the working person, and then you hit them anyway.\nEven pensioners, who’ve worked hard their entire lives and deserve a dignified retirement, have had their winter fuel support stripped away to cover union-driven wage increases. This is a breach of trust and an attack on the most vulnerable in our city. As living costs rise, our seniors are left out in the cold.\nIt’s time for Labour to rethink its approach. Britain needs policies that support growth without sacrificing stability, that protect future generations without undermining the present. Our country deserves a government that doesn’t gamble with the lives of working families and young people—a government that genuinely puts people first.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_what-devolution-and-why-should-you-care/content_30.html": "The UK government is rolling out devolution across the country. This involves creating new Strategic Mayoral Authorities (SMAs) to tackle big issues like transport, housing, and economic growth. These authorities will be led by elected mayors, who will have the power to secure more funding and make faster decisions for their regions. Fire and Policing may also sit with Mayors.\nSMAs are designed to operate at a large scale, often covering areas with populations of 1.5 million or more. However, smaller authorities may also be created where necessary.\nDevolution isn’t a new idea. London, Manchester, and the West Midlands already have elected mayors with varying levels of power. For example, Manchester’s mayor manages local healthcare, ensuring accountability in ways that didn’t exist before. Mayors often also oversee areas like planning and transport.\nThe Labour government has said it may use ministerial directives to force the creation of SMAs where local leaders fail to agree. This means Labour’s plans for local government reorganisation and aligning public service boundaries could move forward even without local support. While devolution aims to bring decision-making closer to home, this approach risks undermining its very principles, and it makes me uncomfortable.\nBut doing nothing is not an option. Doing nothing in fact, brings a much greater chance that we will be done unto. And so, we will need to look at what works for us.\nWhat is Devolution?\nDevolution means transferring powers from central government to local or regional authorities. Instead of a \"one-size-fits-all\" approach from Westminster, devolution lets mayoral-led authorities make decisions about areas like housing, transport, education, and healthcare.\nThe idea is simple: local leaders are better placed to understand and address the challenges and opportunities in their communities than people in Westminster.\nFor example, the East Midlands Mayoral Combined County Authority secured £38 million per year for 30 years. These funds were used for projects like clean energy initiatives, regenerating Derby City, and improving highways infrastructure.\nWhere would Milton Keynes sit?\nMilton Keynes is growing rapidly, which brings both opportunities and challenges. Issues like affordable housing, sustainable transport, education, and infrastructure need local solutions that reflect the city’s unique needs. Devolution offers the chance to address these challenges more effectively.\nHistorically, Milton Keynes has worked closely with nearby councils, including Bedford, Central Bedfordshire, Luton, West and North Northamptonshire councils. These partnerships including as board members of SEMLEP from 2011-2024, members of the Central Area Growth Board from 2018-24 until it was replaced by the South Midlands Authorities board have delivered real benefits, such as the South Midlands Growth Hub, which supported over 700 businesses, provided mentoring, and created nearly 200 jobs through grant schemes.\nThe proposed SMA, with an elected mayor, could build on these successes and give residents a direct say in their leadership. Here’s the population breakdown for the proposed South Midlands Authority (SMA): See image for population figures and map.\nBut, with the Government clearly pushing for a democratically ‘elected’ Mayor (and not an appointed one) within devolved authorities, giving residents the democratic power to choose their leader, Cllr Marland’s position has now changed, and he has decided that the relationship with West and North Northampton will not be viable. This is very much political game-playing because the two Northamptonshire councils are Conservative-led. And he has a better chance of becoming the mayor if it remained between BLMK.\nAnother thing to remember is that the Mayor will also have the power to introduce mayoral precept over and above council tax increases. Currently, we have Labour Mayors in London and Manchester who have introduced this, and when Andy Street (Conservative) was Mayor of West Midlands, he refused to introduce it and refused to tax residents more, as did Conservative Mayor Ben Houchen up in Tees Valley.\nWhat’s happening now?\nOn January 8th, Labour-led council in Milton Keynes and Labour-led council in Luton decided they would only collaborate with Bedford and Central Bedfordshire. This move excludes the Northamptonshire councils, jeopardising long-standing partnerships and millions of pounds worth of future investment that could have come into the region.\nKey dates to watch:\n• 10th January 2025: Deadline to submit the Expression of Interest to join the government’s priority programme.\n• January – March 2025: Consultation process and government review.\n• May 2025: Capacity funding begins (12 months before mayoral elections).\n• August – September 2025: Final agreement reached.\n• By September 2025: Full Council Meeting to agree on mayoral elections for May 2026.\n• May 2026: Mayoral elections held.\nThis timeline highlights how quickly decisions are being made, often without full debate or input from local councils.\nHow will it be implemented?\nWhilst a framework outlining what powers these authorities will hold, has been shared, how it will be implemented, we don’t know.\nQuestions around key services, such as the future of Fire and Police, remain unanswered. There is a fog around all of that, but those decisions will be made along the way (we hope) and hopefully, we will get all of that information in greater detail.\nYour Voice Matters\nDevolution is about bringing power closer to home and giving you a say in shaping the future of where you live. As your elected representatives, we are here to ensure your voice is heard and your needs are prioritised.\nWhile this process may feel rushed, we must engage to secure the best deal for Milton Keynes. Devolution isn’t about Labour’s political ambitions; it’s about delivering real benefits for residents. We need a plan that works for everyone, not a rushed proposal driven by party politics. Milton Keynes residents deserve better, and they should be prioritised above political ambitions.\nAs residents, your input is crucial, so please share your thoughts and join the conversation about our city’s future when the consultation opens. If I get any further updates, my fellow councillors and I will share them with you all on all communications platforms. And if you want more information, do reach out to us, and all our councillors will be more than happy to help answer any questions and signpost you.\nConservative Group Leader, Milton Keynes City Council",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_feed/content_36.html": null,
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_2-day-workshop-coalition-global-prosperity/content_60.html": "Supported by the esteemed Gates Foundation, Coalition for Global Prosperity (CGP) Future Leaders program is a ground breaking initiative aiming to create a network of cross-party candidates who are empowered to speak authoritatively on foreign policy matters and engage with senior political figures.\nThe workshop focused on various aspects of the UK's investment in development, geopolitical priorities, and international institutions. It provided a unique platform for us to enhance our knowledge, exchange ideas, and develop valuable connections within the realm of foreign affairs.\nOne of the most remarkable aspects of the Future Leaders program is its comprehensive approach to equipping participants with the skills and knowledge needed to excel in the world of foreign policy.\nThe 2 days came with a hugely impressive line up of speakers, which included Stephen Brien KBE, Sir Mark Lyall Grant, Professor Peter Katjavivi, Speaker of the National Assembly of Namibia, Sir David Omand GCB, former director of GCHQ who spoke on National Security and geopolitical risk, Julia Frifield, former Assistant Secretary of State for Legislative Affairs to President Obama and Lt Gen Richard Nuguee, Non-Executive Director for Climate Change and Sustainability at the MOD to discuss climate and national security.\nShazna loved the insightful session led by Jessica Cunniffe, a fellow Milton Keynesian, who eloquently presented strategies for effectively engaging with constituents on foreign affairs issues and building up on our speech writing skills.\nIn addition, it ended on a high with Professor Rana Mitter joining us for the final session. His expertise and perspective on China added another layer of depth to our discussions, leaving us inspired and motivated to play a significant role in shaping the future of foreign policy.\nThe dedication and passion of the organizers, speakers, and fellow attendees was truly impressive. It's evident that CGP is committed to fostering a generation of future leaders who will drive positive change and contribute to global prosperity and I was proud to have got the opportunity to be there.\nShaz looks forward to staying connected, to contribute to an essay collection and provide policy recommendations, and loved uniting with the incredible network of individuals who share a common vision for a brighter, more prosperous world.\nThank you 🙏 to the team including Ryan Henson Ryan Baldry Lois Toole",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_campaigns_put-end-unauthorised-encampments-tattenhoe-ward-milton-keynes/content_55.html": "Milton Keynes is facing a serious problem – unauthorised encampments are on the rise. As of August 2023, we have had 73 unauthorised encampments in Milton Keynes. The power to disperse illegal encampments sits with Milton Keynes City Council (MKCC) and Thames Valley Police (TVP). Milton Keynes Conservative Councillors have been liaising with the Council and the police as a matter of urgency when each of the illegal incursions that has taken place. However, the process is slow and tedious.\nWe, the undersigned, call upon Milton Keynes City Council to:\n· Sign the Thames Valley Police and Local Authority Joint Protocol for dealing with Unauthorised Encampments: without delay to ensure that Milton Keynes City Council and Thames Valley Police work together to effectively manage unauthorised encampments and minimise their impact.\n· Strengthen Barriers: Introduce strategic boulders and bollards to secure the entrances to redways, thereby deterring unauthorised vehicles from infiltrating, occupying, and setting up camps.\n· Expedite Resolution: Mobilize the Milton Keynes City Council Environmental Crime Team to enact swift measures for relocation, coupled with adherence to the extended period of prohibited return, recently extended from three months to 12 months.\n· Seek Sustainable Solutions: Consider a dedicated alternate site, designated for the encampment of travellers, somewhere that won't disrupt residents and encourage problems to occur.\nEvery year, taxpayers bear the weight of rising council taxes, while their homes, neighbourhoods, and families bear the brunt of the impact of violations. This cycle of intrusion and abuse must come to an end. Local residents demand action!\nAdd your voice to the growing list of residents in Milton Keynes demanding that the Labour/Lib Dems run Milton Keynes City Council take immediate action.\nPlease sign here:\nPetition · Put an End to Unauthorised Encampments in Tattenhoe Ward, Milton Keynes · Change.org\nMore information available on the following links.\nTVP on unauthorised-encampments\nMore info on S77 and S78 - Trespass and Nuisance on Land: The Criminal Justice and Public Order Act 1994 - Tables of Offences involving Trespass\nUnauthorised encampments: Police, Crime, Sentencing and Courts Act 2022 factsheet (Updated 20 August 2022)Unauthorised encampments: Police, Crime, Sentencing and Courts Act 2022 factsheet Updated 20 August 2022",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_campaigns_supporting-local-police-combating-asb-and-criminal-activities/content_23.html": "n today's fast-paced world, ensuring the safety and security of our communities has become more crucial than ever. One of the key pillars in maintaining law and order is our local police force. They work tirelessly day and night to protect us from various criminal activities, including anti-social behaviour (ASB).\nAnti-social behaviour encompasses a wide range of activities that can disrupt the peace and harmony of our neighbourhoods. From vandalism and graffiti to noise disturbances and public intoxication, ASB can have a detrimental impact on the quality of life for individuals and communities alike.\nRecognising the significance of our local police force, we are fortunate to have a group of individuals who truly embody the values of thoughtfulness, community focus, and unwavering commitment. Their dedication to serving and protecting our community is evident in their every action. One of the most admirable qualities of our local police is their thoughtfulness. They approach their work with a deep understanding of the impact their actions can have on individuals and the community as a whole. Whether it's responding to a call, conducting an investigation, or interacting with community members, they always take the time to consider the best course of action, ensuring that their decisions are fair, just, and in the best interest Communities flourish when they are able to foster a sense of safety and security. Working in close collaboration with our dedicated officers, I am committed to fostering a sense of unity among various agencies and residents to combat anti-social behaviour (ASB) and other criminal activities in our community.\nI connected with the TVP (Thames Valley Police) soon after my election and I was able to successfully arranged for a knife amnesty bin to be placed in my ward. This initiative aims to promote safety and reduce the presence of dangerous weapons in our community. Additionally, I took the initiative to rally together local residents who were eager to contribute towards the betterment of our neighbourhood. Together, we organised a cleanup effort to address a specific area that had been plagued by anti-social behaviour (ASB). By joining forces, we were able to restore the space and make it more welcoming for everyone. It is truly inspiring to witness the power of collaboration and community engagement in tackling important issues. I am grateful for the support of the TVP and the enthusiastic participation of my fellow residents.\nIn just a span of two months, our knife amnesty bin has made a remarkable impact, gathering an impressive collection of over 300 knives. This incredible response from the community is a testament to the urgent need for initiatives like ours, aimed at promoting safety and reducing the presence of dangerous weapons in our society. Thanks to the collective efforts of our community, we have successfully removed 300 knives from our streets.\nI also reached out to a wonderful local charity Keeping Kids Off the Street, and facilitated setting up of a free boxing class aimed at providing a safe and engaging activity for our community's children, ultimately keeping them away from the streets. They are helping so many children and families everyday and I am grateful for their support and presence.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_about-shazna-muzammil/content_45.html": "Shazna Muzammil is a Conservative councillor and group leader for Milton Keynes Conservatives and was the parliamentary candidate for Birmingham Ladywood in GE 2024.\nShazna was born in Sri Lanka. She relocated to Milton Keynes with her husband David, a veteran who served in the Parachute Regiment. Shazna is a mother to two boys and stepmother to a little girl. Shazna works full-time at the Open University and is a dedicated local councillor.\nThe inequality in academic and other opportunities accessible to Shazna and other girls compared to her brothers and all male cousins impacted her at a very young age. Education was not a priority for girls and Shazna was given away in marriage at an early age. She had to fight for divorce and fight for custody of her children before she could complete her education and gain an MBA at the age 35. She then went on to work in Sri Lankan villages, advocating education for girls and providing links to skill development, allowing them to become economically independent. She was recently recognised for her work and is now the recipient of a global award for Social and Women Empowerment.\nShazna’s previous roles as Head of Business Development at Wunderman Thompson Sri Lanka, followed by Internal and External Comms Head at MAS and throughout as a Board Member of the Women’s Chamber of Industry and Commerce, provided her with opportunities to connect women to mentors and businesses, which made huge differences to the lives of these women and communities. Moving to the UK brought about a lot of adjustments, and it also meant giving up all of her community work focused on empowering women, which was hugely important to her.\nEqual opportunity, skill-based education, self-reliance, independence, and shared responsibility to empower each other to excel are some of the Conservative values that resonate with her. As a young girl who grew up in an ethnic minority community where opportunities to excel were limited, Shazna knows what it's like to live without these values.\nEducation plays a significant role in her life, and she firmly believes that education can transform lives as it did hers. Shazna completed a PGDip in Development Management through The Open University after earning an MBA (Hons) from Cardiff Metropolitan University.\nAt the Open University in Milton Keynes, Shaz oversaw one of the most important projects for The Open University. Shaz also created the Accessibility Tool to enable module teams to pick up on any accessibility concerns that will hinder the progress of students in prison and disabled students during module creation rather than afterwards. This tool received funding for further enhancement and is now being used across the OU.\nVolunteering\nShazna volunteered as an Appropriate Adult in Milton Keynes, supporting young people arrested. She is also a volunteer vaccinator with St Johns Ambulance, a volunteer responder with the NHS and mentor with Children Heard and Seen.\nCampaigning and elections\nShazna stood as a candidate in local council elections held in 2021. Whilst this was a Labour ward, it did not stop her from conducting a passionate campaign about shared values and plans to reduce disparities in the ward. As a result, Shazna was able to reduce the Labour majority from 380 to 183 by increasing the Conservative vote from 796 to 1332.\nIn 2022, Shazna was elected as the local councillor for Tattenhoe. She beat the Labour incumbent to gain the seat for the Conservatives in the May local elections. She was the only one to gain a seat from Labour or Liberal Democrats here in Milton Keynes when the national outlook was bleak for Conservatives. She also campaigned for her colleagues running in other wards, organised action days with CWO and other regional associations, took part in connect calling campaigns and travelled nationally to support by-elections. In 2024, Shazna was selected unanimously to be the Group Leader of the Conservative Group in the council.\nShazna is the current Deputy Chair of Fundraising and Membership of the Milton Keynes Conservatives Federation, which she launched in November 2021 as the Milton Keynes Conservatives Women’s Organisation (MKCWO). As Chair of MKCWO, she has grown the membership from 9 to 36 and continues to grow. Shaz is the CWO South East Digital officer and area Chair for Buckinghamshire.\nShazna is a dedicated advocate for the local community, actively engaged in grassroots campaigning and door-knocking efforts across the country. Recognising the significance of staying connected, she maintains a strong online presence through Facebook, Instagram, and Twitter. Shazna encourages fellow residents to join and campaign alongside her and the Milton Keynes Conservatives.\nShazna says, “The current Labour leadership has failed the people of Birmingham Ladywood. The Labour MP has neglected her constituents, and the Labour Council's mishandling of funds has led to the closure of libraries and reduction of services, placing more burden on the residents. The Labour Police and Crime Commissioner has closed down police stations, resulting in increased crime and open drug dealing on our high streets. This situation is completely unacceptable. We should take pride in our city, and I am dedicated to restoring that pride by making our streets safe and holding the Labour Council accountable. I promise to listen to you, attract investment, and deliver the changes we desperately need here. We can rebuild our community where everyone feels secure and valued. Trust in me to be your voice and your champion. It’s time for change!!\"",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_empowering-women-politics-unleashing-their-full-potential/content_63.html": "The recent Conservative Party Conference was an inspiring showcase of the power and potential of women in politics. Throughout the event, organisations like the Conservative Women's Organisation (CWO) and Women2Win highlighted the significant contributions made by women in elected offices, from local councillors to Members of Parliament (MPs) and to those aspiring to stand, put themselves forward to fight a tough national and local election and aim to be elected. The gathering was a testament to the progress that has been made, and it's crucial to recognise and support women who aspire to represent the interests of the over 51% female population in the United Kingdom.\nA Shout Out to Inspirational Female MPs\nIt’s essential to acknowledge the pivotal role played by female MPs within the Conservative Party. Women like Dame Andrea Leadsom MP, Mims Davies MP, Pam Gosal MSP, Suella Braverman MP, Vicky Ford MP, Gillian Keegan MP, and Penny Mordaunt MP, to name a few, have been trailblazers, demonstrating that leadership and excellence know no gender bounds. Their dedication, commitment, and determination have paved the way for many aspiring women in politics, proving that women can and should have a significant presence in the political arena.\nThe Changing Landscape of Women in Politics\nThe political landscape in the United Kingdom has seen remarkable shifts over the years. More and more women are entering politics and making their voices heard. However, there is still much work to be done to ensure that women are not only encouraged but also fully empowered to participate at all levels of government.\nThe Importance of Women in Politics\nWomen bring a unique perspective and experience to the table, enriching the discourse and decision-making processes. Here are some reasons why supporting women in politics is crucial:\nRepresentation: Women make up over half of the UK's population. Their perspectives and concerns must be represented in the corridors of power to ensure that policies and decisions reflect the diverse needs of the entire population.\nDiverse Perspectives: Women often approach issues differently, considering factors that may be overlooked by their male counterparts. This diversity of thought leads to more comprehensive and effective policies.\nRole Models: Female politicians serve as role models for younger generations, inspiring them to pursue careers in politics and other leadership roles. Seeing women in positions of power can be a powerful motivator.\nEquality: Gender equality is a fundamental principle of democracy. It is essential that women have equal opportunities to participate in politics and hold leadership positions.\nConclusion\nThe Conservative Party Conference showcased the remarkable contributions of women in politics and the critical role of organisations like CWO and Women2Win. As we move forward, it is vital that we continue to support and empower women in politics. By doing so, we can ensure that the voices and perspectives of women are fully integrated into the political decision-making process, leading to a more equitable and inclusive society for all. It's time to unleash the full potential of women in politics and work towards a future where gender equality is the norm, not the exception.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_labour-governments-review-threatens-new-hospital-milton-keynes/content_64.html": "Our PR on the hospital review:\nFollowing the recent announcement this Friday, of the Labour Government's review into the New Hospitals Programme, there is growing concern that plans for the much-needed Milton Keynes Women and Children’s Hospital, lobbied for and secured in principle by former Conservative MPs Ben Everitt and Iain Stewart, are now under threat. Milton Keynes University Hospital too stated that the funding had already been agreed upon, and construction was set to be completed by 2030.\nNHP New Women’s and Children’s Hospital - MK View (mkuh.nhs.uk)\nThe hospital, which was promised to residents of Milton Keynes, is crucial for the city's future growth and development.\n\"Like many across Milton Keynes, I am deeply worried that this vital project could be cancelled as part of Labour’s review. This review appears to have been launched quietly and without transparency, which raises concerns that it is simply a way of shutting down a Conservative-led initiative to deliver 40 new hospitals across the country,\" said Cllr Shazna Muzammil Group Leader of the Conservative Group in Milton Keynes.\nThe Labour MPs in Milton Keynes, who won seats in the recent general election by promising to deliver this hospital, must now prove to the people of Milton Keynes that they are serious about their commitments. With the Labour Council pushing to nearly double the city’s population, potentially adding nearly half a million new residents, the infrastructure needs will be enormous. The Labour Government’s plans for new towns in and around the M1 and Milton Keynes further increases the need for this to materialise. Milton Keynes, growing at such a rapid pace, requires the essential health services to match.\n“We need this hospital now more than ever. The people of Milton Keynes voted for these 3 MPs based on their promises, and now it’s up to them to make sure Labour delivers. The health and wellbeing of our growing population in Milton Keynes depend on it,” Cllr Shazna Muzammil continued.\nThe question remains whether Milton Keynes' new MPs are committed to fulfilling the promises they made to their constituents. Cllr Shazna Muzammil has called on the newly elected MPs to show they are working in the best interests of Milton Keynes and to ensure this hospital is delivered.\n\"Labour must make it clear that they are not prepared to sacrifice the future health infrastructure of Milton Keynes for short-term political gain,\" Cllr Shazna Muzammil concluded.\nLabour Government's Review Threatens New Hospital for Milton Keynes (mkcommunityhub.com)",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_delegated-decision-shenley-park-spd-03-10-2023/content_50.html": "Update on Shenley Park Development\nThe council will be taking a decision on its response to the SPD by Buckinghamshire Council with regards to this development on the 3rd of October in Civic. Details of the meeting and the response by the Council is available here.\nhttps://milton-keynes.moderngov.co.uk/ieListDocuments...\nAfter which it will then be taken to consideration at the planning committee to be held on Thursday the 5th of October in the Chamber of Milton Keynes City Council.\nhttps://milton-keynes.moderngov.co.uk/ieListDocuments...",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_accessibility/content_13.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_restoring-pride-birmingham-ladywood-shazna-muzammils-commitment-conservative-parliamentary/content_54.html": "It is both an honour and a privilege for Shazna Muzammil to stand as the Conservative candidate for Birmingham Ladywood, a place that holds cherished memories from her childhood and where she has often brought her own children. Her journey into politics was driven by a simple, albeit cliché, desire to make a tangible difference in people’s lives, irrespective of their political affiliations.\nHer volunteer work with young offenders in custody marked a critical turning point, highlighting the urgent need for robust support systems for youth. This experience propelled her to successfully run for the local council, where she has strived to enact meaningful change.\nOver the past 14 years under Labour leadership, Shazna has witnessed the constituency of Birmingham Ladywood suffer from neglect and mismanagement: a bankrupt council, an invisible MP, and rising knife crime under a Labour Police and Crime Commissioner. This has left the streets unsafe, the neighbourhoods dirty, and the community spirit diminished. She is determined to reverse this decline and restore pride and prosperity to the community.\nHere’s her plan to bring about the change Birmingham Ladywood deserves:\nStrengthening the Local Economy: Economic vitality is foundational to community well-being. Shazna is committed to securing necessary investments that will create high-quality jobs and support local businesses, ensuring a prosperous economy that benefits everyone in Ladywood.\nMore Police for Safer Streets and Communities: Public safety is paramount. She will advocate for increased police presence and resources to tackle crime effectively, ensuring that the streets are safe for all residents.\nRegeneration and Housing: Prioritizing the needs of residents is key to successful regeneration. Shazna will focus on upgrading council homes to meet decent living standards and push for developments that respect the community’s needs and heritage.\nSaving Our Libraries and Investing in Education: Libraries are hubs of learning and community activity. Shazna will fight not only to save our libraries but also to extend their services. Investing in educational programs and skills training will provide both youth and adults with better opportunities for the future.\nCombatting Fly-Tipping and Making Our Area Clean and Tidy for All: Fly-tipping and litter blight beautiful areas, affecting community health and pride. She will implement stringent measures to keep neighbourhoods clean and tidy, ensuring that Ladywood is a welcoming place for all its residents.\nEnding Homelessness and Rough Sleeping: Every individual deserves a safe place to call home. Shazna is dedicated to eliminating homelessness in Ladywood by working with local organisations to provide suitable and sustainable accommodation options.\nShazna Muzammil’s commitment to the residents of Birmingham Ladywood is simple but unwavering: honesty, decency, integrity. As their representative, she will always show up for them, speak up for them, and stand by them. This is essential for reviving Birmingham Ladywood, making it a place where every resident is proud to call home.\nShazna is blessed to have the support of her family, which allows her to dedicate herself fully to these causes. She hopes the community will join her in this endeavour to transform Birmingham Ladywood for the better. Get in touch, join the campaign, and help do everything possible to restore the glory of this wonderful constituency. This is all of our journey.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_campaigns-0/content_52.html": "There are days when I question the role of a councillor and the real impact we can have, especially when the council is run by a Labour administration that refuses to prioritise the needs of residents over balancing the books.\nGirl Guides fringe event at Conference Sunday 1st October 2023 (Spech in full)\nIt’s a pleasure to be speaking at the girl-guiding fringe.\nMy story begins in Sri Lanka amidst an ethnic minority armed conflict.\nUpdate on Shenley Park Development\nThe council will be taking a decision on its response to the SPD by Buckinghamshire Council with regards to this development on the 3rd of October in Civic.\nUpdate on unauthorised encampments petition\nThe Milton Keynes Council and Thames Valley Police have teamed up by signing a joint protocol to tackle unauthorised encampments.\nPetition for 20MPH in Oxley Park\nThis is an update on the Oxley Park 20MPH petition that was presented to the council in July 2023. Councillor Lauren Townsend, who is the Cabinet Member for Public Realm and Community Safety, has informed me that the scheme has been scheduled for consultation.\nToday, our community came together to support the preservation of Kingsmead Green, a beloved green space in our neighbourhood. People of all ages, including our furry friends from Kingsmead, Oxley, Westcroft, and Tattenhoe, gathered to show their support.\nCllr Shazna Muzammil was happy to present the petition to reduce the speed limit to 20MPH in Oxley Park in council this evening.\nA long process is involved, but this will be included in the council’s work programme for 2023/2024.\nHere’s hoping this will help reduce speeding in Oxley Park.\nThank y",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_stand-speak-and-make-your-mark-why-we-need-more-voices-women-colour-our-public-life/content_59.html": "As a passionate advocate for diversity and inclusion, and whilst wearing several hats representing CWO South East, Conservative Women's Organisation - UK, Milton Keynes Conservative Women's Organisation Milton Keynes Conservatives, and @Conservatives I take pride in my contribution to the crucial cross-party discussion on how we can bring greater diversity at all levels of the political sphere. This is an area that holds immense significance in the representation of ethnic minorities in parliament and will be an ongoing conversation.\nIt is important to promote the voices and perspectives of women of colour in our public life and I firmly believe that our society thrives when we have a parliament that reflects the rich tapestry of its people.\nIn my recent contribution to the interview by @CentenaryAction which is now available in their blog, \"Stand Up, Speak Up, and Make Your Mark: Why We Need More Voices from Women of Colour in Our Public Life,\" I delve into the importance of representation and the impact it has on shaping policies and decision-making processes. I invite you to read the article here: ‘Stand up, speak up and make your mark’ Why we need more voices from women of colour in our public life - Centenary Action Group\nIt is imperative that we all get together to champion diversity and equality, breaking down barriers and opening doors for women of colour to make their mark in our political landscape. By standing up and speaking up, we can create a more inclusive future that values and embraces the unique contributions of every individual.\nWe are a hugely diverse nation and this is an important journey towards a more representative and equitable society. Do share your thoughts and join the journey. 50:50 Parliament\nDiversityMatters #RepresentationMatters",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_category_Local-News/content_34.html": "What is Devolution and Why Should You Care? 10th January 2025 The UK government is rolling out devolution across the country. This involves creating new Strategic Mayoral Authorities (SMAs) to tackle big issues like... Local News\nDevolution: Labour’s Political Games Could Cost Milton Keynes Millions 10th January 2025 Political meddling by Cllr Pete Marland, Labour Leader of Milton Keynes City Council, is risking millions of investment into Milton Keynes and the wider region... Local News\nLabour’s Parking Charge Gamble: The Cost to Our Community 18th December 2024 There are days when I question the role of a councillor and the real impact we can have, especially when the council is run by a Labour administration that... Local News\nReflections on the LGA Annual Conference: Prioritising Milton Keynes 25th October 2024 As the Conservative Group Leader in Milton Keynes, I had the privilege of attending the Local Government Association (LGA) Annual Conference alongside Cllr... Local News\nLabour Government's Review Threatens New Hospital for Milton Keynes 23rd September 2024 Our PR on the hospital review: Following the recent announcement this Friday, of the Labour Government's review into the New Hospitals Programme, there is... Local News\nAn Independent Surge in Birmingham Ladywood 20th June 2024 In the heart of Birmingham Ladywood, a remarkable political development is unfolding. With a 49% Muslim population and 94% Black and Asian voters, this... Local News\nMy Plan for Birmingham Ladywood 31st May 2024 For too long, the constituency has been sidelined and neglected by those who were supposed to champion its needs. No more excuses. The people of this community... Local News\nRestoring Pride in Birmingham Ladywood: Shazna Muzammil's Commitment as the Conservative Parliamentary Candidate 31st May 2024 It is both an honour and a privilege for Shazna Muzammil to stand as the Conservative candidate for Birmingham Ladywood, a place that holds cherished memories... Local News\nFrom Activist to Group Leader, Milton Keynes Conservative Group 8th May 2024 On May 5th, Cllr Shazna Muzammil was elected as the Conservative Group Leader by her colleagues. Now leading the Conservative group, which is the smallest... Local News",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_heating-or-eating-milton-keynes-pensioners-deserve-better/content_61.html": "Last week, I spoke with Tess, a 70-year-old pensioner whose words still ring in my ears: “I will suffer.” As winter approaches, her fear isn’t just her own—it's a reality faced by thousands of elderly people across Milton Keynes and the UK. The unimaginable choice between heating or eating is now becoming far too common, and it’s something we cannot accept as a society.\nThe Prime Minister, when in opposition, was clear in his stance on Winter Fuel Payments—criticising any suggestion of means-testing them. Yet here we are, with Labour flip-flopping on this promise, and doing so at the expense of our most vulnerable citizens. To add insult to injury, our three local MPs voted to scrap the universal Winter Fuel Payment, knowing full well how this will devastate their own constituents.\nAs a councillor, I meet residents from all walks of life, many doing their best to manage under increasingly difficult circumstances. But I never imagined we’d reach a point where our elderly, who’ve contributed so much to society, are left in such vulnerable positions. People like Tess, who have raised families, built careers, and given back to their communities, are now being left to suffer. As Tess put it, “Labour hit us first.”\nThe Labour Government’s decision to restrict Winter Fuel Payments only to pensioners on Pension Credit is a devastating blow. What was once a universal benefit, designed to help all pensioners cope with rising energy costs, has been cruelly limited, leaving millions of elderly people out in the cold—literally. For those who fall just above the Pension Credit threshold, this feels like an unjust punishment. It’s a reminder of Labour’s foul play, where those who’ve worked hard their entire lives are now being abandoned just as energy prices are set to soar again.\nWhat angers me most is the grotesque contrast between these cuts and the lavish spending happening at the top of Labour's hierarchy. While pensioners like Tess are left wondering how they’ll survive the winter, Labour figures are using donations for parties and extravagant outfits. It’s not just heartbreaking—it’s utterly shameful.\nLabour’s Chancellor, Rachel Reeves, claims these \"tough decisions\" are necessary to make up for Conservative spending. But that excuse doesn’t wash. Labour cannot pull the wool over the public’s eyes on this. The Conservative government left Labour with the fastest-growing economy in the G7, and unemployment lower than in 2010. But in just a few months, Labour has managed to flatline the economy, with reckless decisions like handing out £10 billion in inflation-busting pay rises to public sector workers, including train drivers.\nThe so-called savings from scrapping universal Winter Fuel Payments are a farce. Labour says they’ll save £1.4 billion—but if more pensioners claim Pension Credit and Housing Benefit, the actual cost could rise to £3.8 billion. So where are the savings? Labour is robbing our most vulnerable citizens to placate their union backers and doing so as winter looms.\nThis isn’t just a political issue—this is about life and death. Cold homes lead to serious health problems, especially for the elderly. Conditions like hypothermia, respiratory infections, and cardiovascular diseases will inevitably rise. These will strain an already overstretched NHS, as hospital admissions increase due to cold-related illnesses.\nBut behind these numbers are real people—people like Tess—who’ve spent their lives contributing to society and are now facing hardships they never imagined. This is a public health issue, yes, but more importantly, it’s about basic human decency.\nThe current Labour government must step up and take responsibility. We cannot let short-term political manoeuvring cost lives. While I’ve always been proud to represent Milton Keynes, it is disheartening to watch decisions made by Labour hurt those who need help the most. It seems this government has lost its moral compass, willing to rob our most vulnerable citizens, at a difficult time with winter coming, just to placate their union backers.\nWe owe it to our elderly residents to fight for them. They are the backbone of our city, and it’s our moral duty to ensure they’re not left behind. This isn’t about party politics—it’s about doing what’s right. As a community and a council, we must come together to demand that no pensioner in the UK is forced to choose between heating and eating.\nLabour’s piecemeal changes to the welfare system are not only failing to deliver meaningful savings, but they’re doing so at the expense of those who can least afford it. Here in Milton Keynes alone, nearly 33,000 residents will miss out on this vital support just as the winter cold sets in. This is Labour’s legacy so far—broken promises and abandoned pensioners.\nIt’s time we demand better. Our elderly deserve more than to suffer through the winter while Labour’s elites party at their expense.\nContext:\nThe Winter Fuel Payment is paid to pensioners in England and Wales at a flat rate of £200, or £300 for households with someone aged over 80. From this winter, it will be restricted to those in receipt of certain benefits, notably Pension Credit, which means that about 10 million people will lose out. This is expected to save around £1.5 billion a year.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news/content_7.html": "How Partnerships Can Fail – And Why We Must Not Let Milton Keynes Fall Behind Monday, 17 February, 2025 Introduction The exclusion of Milton Keynes from the Devolution Priority Programme is not just a missed opportunity—it is a critical moment that puts our entire region’s future at risk. As we now grapple with the repercussions of this failed bid, it is clear that strained relationships, miscalculated leadership decisions, and lost opportunities have left Milton Keynes and its neighbouring... Articles\nRight of reply to my motion on English Devolution 22nd January 2025 I am incredibly proud that WE have brought it forward to initiate much-needed debate. While I still firmly believe that this decision to combine with BLMK does... Speeches\nMoving the English Devolution Motion 22nd January 2025 I move this motion, with both a sense of duty and frustration. This is a hugely important issue for our region, yet it’s one this administration chose not to... Speeches\nBreaking Barriers: Women as Conservative Candidates in Local Government 19th January 2025 Politics today suffers from a pervasive lack of trust, particularly in the two mainstream parties, driving many toward other alternatives like -dare I say -... Articles\nWhat is Devolution and Why Should You Care? 10th January 2025 The UK government is rolling out devolution across the country. This involves creating new Strategic Mayoral Authorities (SMAs) to tackle big issues like... Local News\nDevolution: Labour’s Political Games Could Cost Milton Keynes Millions 10th January 2025 Political meddling by Cllr Pete Marland, Labour Leader of Milton Keynes City Council, is risking millions of investment into Milton Keynes and the wider region... Local News\nLabour’s Parking Charge Gamble: The Cost to Our Community 18th December 2024 There are days when I question the role of a councillor and the real impact we can have, especially when the council is run by a Labour administration that... Local News\nLabour’s Broken Promises: An Attack on Working Families 4th November 2024 The British public deserves a government that keeps its promises and puts people at the heart of every decision. Yet the latest budget from Labour reveals a... Opinions\nFrom Candidate to Conference Opener: Lessons in Leadership and Resilience 30th October 2024 Standing on the stage of the Conservative Party Conference in Birmingham, flanked by esteemed figures like Chairman Richard Fuller, Sir Andy Street, Lord Daniel... Articles\nReflections on the LGA Annual Conference: Prioritising Milton Keynes 25th October 2024 As the Conservative Group Leader in Milton Keynes, I had the privilege of attending the Local Government Association (LGA) Annual Conference alongside Cllr... Local News",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_campaigns_petition-unauthorised-encampments/content_11.html": "Milton Keynes is facing a serious problem – unauthorised encampments are on the rise. As of August 2023, we have had 73 unauthorised encampments in Milton Keynes. The power to disperse illegal encampments sits with Milton Keynes City Council (MKCC) and Thames Valley Police (TVP). Milton Keynes Conservative Councillors have been liaising with the Council and the police as a matter of urgency when each of the illegal incursions that has taken place. However, the process is slow and tedious.\nThe petition calls upon Milton Keynes City Council to:\n· Sign the Thames Valley Police and Local Authority Joint Protocol for dealing with Unauthorised Encampments: without delay to ensure that Milton Keynes City Council and Thames Valley Police work together to effectively manage unauthorised encampments and minimise their impact.\n· Strengthen Barriers: Introduce strategic boulders and bollards to secure the entrances to redways, thereby deterring unauthorised vehicles from infiltrating, occupying, and setting up camps.\n· Expedite Resolution: Mobilize the Milton Keynes City Council Environmental Crime Team to enact swift measures for relocation, coupled with adherence to the extended period of prohibited return, recently extended from three months to 12 months.\n· Seek Sustainable Solutions: Consider a dedicated alternate site, designated for the encampment of travellers, somewhere that won't disrupt residents and encourage problems to occur.\nEvery year, taxpayers bear the weight of rising council taxes, while their homes, neighbourhoods, and families bear the brunt of the impact of violations. This cycle of intrusion and abuse must come to an end. Local residents demand action!\nAdd your voice to the growing list of residents in Milton Keynes demanding that the Labour/Lib Dems run Milton Keynes City Council take immediate action.\nTVP on unauthorised-encampments\nMore info on S77 and S78 - Trespass and Nuisance on Land: The Criminal Justice and Public Order Act 1994 - Tables of Offences involving Trespass\nUnauthorised encampments: Police, Crime, Sentencing and Courts Act 2022 factsheet (Updated 20 August 2022)Unauthorised encampments: Police, Crime, Sentencing and Courts Act 2022 factsheet Updated 20 August 2022\nThe petition is available here for your support and signature:",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_campaigns_unlocking-opportunities-bridging-gap-looked-after-children-milton-keynes/content_12.html": "In the city of Milton Keynes, nearly 400 Looked-after Children (LAC) are under the care of dedicated foster parents and the local council. These young individuals, with unique backgrounds and experiences, deserve every opportunity to thrive in adulthood. One crucial step towards empowering them is by creating work placements that not only provide valuable skills but also foster social mobility. In this campaign, Cllr. Shazna Muzammil, in collaboration with the council, aims to engage local businesses and the community in supporting Looked After Children in finding work placements, unlocking their potential and opening doors so our LACs can have the same opportunities as all other young people.\nThe Challenge\nLooked After Children often face additional hurdles in their journey towards adulthood. Transitioning from care to independence can be daunting, and finding suitable employment is a crucial aspect of this process. Recognising this challenge, the campaign was launched in Milton Keynes to enlist the support of businesses in offering work placements to Looked After Children. However, there is still a long way to go to ensure that every Looked After Child has access to these opportunities.\nThe Goal\nThe campaign's goal is to create a network of businesses and community members committed to providing Looked After Children with work placements and the chance to unlock their potential. By investing in their skills and abilities, the campaign contributes to the creation of a more inclusive and supportive community, where everyone has an equal chance at success.\nThe Project in Action\nI. Engaging Businesses\nThe campaign's goal is to create a network of opportunities for Looked After Children (LAC), providing them with valuable work experience and supporting their university applications. Local businesses, big or small, can join the initiative by offering work placements to LAC. The campaign is flexible, providing opportunities in various sectors that align with the interests and aspirations of LAC.\nThe initiative's aim is for LAC to learn from local business staff, gaining valuable insights into the daily operations of a professional environment. Participating in the program doesn't require any changes in the business's current workflow. The existing employers' liability insurance policy will cover work placements, provided the insurer is a member of the Association of British Insurers (ABI) or Lloyds. Businesses don't need to obtain additional insurance to accommodate work-experience students.\nParticipating businesses will receive support in completing a comprehensive risk assessment. The Milton Keynes City Council will undertake visits during the work experience period and ensure the sharing of appropriate information. These measures are in place to facilitate a successful placement experience for both the participating businesses and the young people involved.\nBy opening their doors to these young individuals, businesses contribute not only to their individual growth but also to the overall well-being of the community. This collaborative effort reflects a shared responsibility to ensure that every member of society, regardless of their background, has an equal chance at success.\nII. Engaging the Community\nThe campaign invites community members to support the initiative by spreading awareness and offering their time and resources. With the help of a supportive network of individuals and businesses, the campaign can provide more opportunities for Looked After Children and create a brighter future for them and the city.\nBenefits of Work Placements for Looked-After Children\nSkill Development: Work placements provide LACs with the opportunity to develop practical skills that are essential in the workplace. This hands-on experience enhances their employability and equips them for future career endeavours.\nIncreased Confidence: Stepping into a professional environment can significantly boost the confidence of Looked After Children. Exposure to different work settings helps them build a sense of self-efficacy and belief in their abilities.\nNetworking Opportunities: Work placements also offer valuable networking opportunities. By connecting with professionals in various fields, Looked After Children can expand their support network and gain insights into different career paths.\nBreaking Stereotypes: Engaging local businesses and the community in this initiative breaks down stereotypes and challenges preconceived notions about Looked-after Children. It showcases their potential and resilience, promoting a more inclusive community mindset.\nSocial Mobility and Beyond: Enabling looked-after children to secure work placements is a crucial step towards enhancing social mobility in Milton Keynes. By investing in the potential of these young individuals, we can contribute to the creation of a more equitable society where everyone has the chance to succeed, regardless of their background. This, in turn, fosters economic growth and development across the city.\nConclusion\nAs the local businesses and community members join hands to offer opportunities for these young individuals, they are doing more than just opening doors for them; they are unlocking a brighter and more promising future for the entire city. By investing in the potential of Looked After Children, this campaign takes a significant step towards building a society where everyone has an equal opportunity to thrive, and it sets the foundation for a more prosperous and equitable future for all.\nJoin the campaign in unlocking opportunities for Looked After Children in Milton Keynes.\nGet in touch with [email protected]",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_conservative-conference-fringe-event-girls-attitudes-survey-2023-how-have-girls-lives-changed/content_29.html": "Cllr Shazna Muzammil would like to present you the 2023 Girls' Attitudes Survey. Please read all about it here. (girlguiding.org.uk) girls-attitudes-summary.pdf\nGirlguiding has been surveying girls and young women since 2009 to better understand their ideas and experiences, ranging from stereotypes and goals to safety and well-being. The Girls' Attitudes Survey, now in its 15th year, examines how girls' lives have changed over the last decade and a half.\nFewer girls say they’re very happy, and more feel anxious\nCompared to 78% in 2016, 89% of girls and young women aged 7-21 are generally worried or anxious.\nFewer girls are happy with how they look\n62% of girls and young women aged 7-21 had been criticised or had negative comments made about their appearance, up from 49% in 2016.\nMore girls are facing negative online behaviours.\n81% of girls and young women aged 11 to 21 have experienced threatening or unpleasant behaviour online, up from 65% in 2018.\nMore girls feel part of their local community\n35% of girls and young women aged 7 to 21 say they feel a part of their community, up from 29% in 2011.\nGirls' aspirations have shifted, yet they remain concerned about their futures.\n48% of girls and young women aged 11 to 16 believe it will be more difficult for them to find work when they leave school than it was for young people. five years ago\nWhile there have been some gains, the statistics demonstrate that many elements of the lives of girls and young women have deteriorated. The findings also provide a sobering glimpse into the pressures and experiences that today's girls and young women endure, such as harassment and beauty pressures, and the harmful impact that has on their life. The findings also demonstrate the necessary changes to increase their possibilities and help them live safe and happy lives.\nPersonal Journey\nCllr Shazna Muzammil was happy to be part of the Girl Guiding panel at the Conservative party conference on the 1st of October with Mims Davies MP, Cllr Pinder Chauhan, Dr. Sophie King-Hill and girl guiding advocates. Cllr Shaz shared a bit about my own journey, which started in Sri Lanka during a time of armed conflict, where suicide bombings and curfews were the norm. Shaz was the only girl in a family of four brothers in a strict patriarchal society. Her father, who was fair-minded, ensured that she had the same opportunities as my siblings. However societal norms imposed limits, especially when it came to higher education. Shaz watched her brothers go to universities abroad while she was married off at a young age to someone she barely knew, becoming a mother of two boys, believing she was doing the right thing for her family.\nIn addition to the cultural and societal constraints, there was the war. Shaz remembers a truck bomb going off next to my school, physically throwing her backwards even before she heard the deafening blast. Nothing was certain, no plans were made, and no futures were envisioned.\nDespite these challenges, Shaz excelled academically. Education, however, was not a priority for girls in my community. Only after her battle with divorce could she restart her education. Shaz eventually completed her MBA, built a successful career, and raised her two sons on her own. She ran political campaigns, successfully lobbied for 25% female representation in local government, and started working in villages to promote girls' education, for which she recently received a global award. All the while fighting misogyny, harassment, and persecution.\nWhen Shaz moved to the UK, she encountered a new set of challenges. Even with her Master's degree, she struggled to find a job and had to start at the very bottom of the ladder at the Open University. It shattered her confidence at the time.\nToday, Shaz is an elected councillor, a prospective parliametary candidate, and a volunteer in various roles, from being a vaccinator to mentoring and providing support to young people in custody.\nThe Girls' Attitude Survey\nThis survey raises crucial questions and shines a spotlight on the concerns that affect young girls today. My story, though unique, shares a common thread with the struggles many girls face. It underscores the importance of organisations like Girlguiding and initiatives like the Girls' Attitude Survey.\nThe survey reveals a stark reality: many young girls grapple with hardships that impact their mental health and overall development. It speaks to the challenges that girls from diverse backgrounds and circumstances face as they navigate life.\nGovernment Initiatives Supporting Women and Girls\nFortunately, governmental policies in the UK are evolving to address these concerns. Several key milestones have been achieved in recent years:\n- Tackling Violence Against Women and Girls Strategy: This strategy criminalises stalking, strangulation, revenge porn, and child marriage.\n- Online Safety Bill: Designed to combat technology-driven crimes like stalking and cyber harassment, it offers protection in the digital realm.\n- Domestic Abuse Act: This landmark legislation strengthens protections for victims, including ending the \"rough sex gone wrong\" defence.\n- Protection from Sex-based Harassment in Public Bill: Recently enacted, this law makes it an offence to intentionally harass someone in public based on their sex.\nBreaking the Silence\nA study found that a staggering 71% of women in the UK have experienced sexual harassment in public spaces, yet only 5% of incidents were reported to the police. Encouraging victims to report these incidents is crucial, as it helps combat impunity. The Home Office's StreetSafe tool provides an avenue for anonymous reporting, ensuring safety even in the darkest moments.\nEmpowering Through Education\nEducation plays a vital role in creating lasting change. By educating ourselves on the law and spreading awareness, we empower individuals and communities to stand against harassment and discrimination.\nConclusion\nIn conclusion, we have made significant progress, but our journey toward gender equality and the well-being of girls is far from over. Meaningful change requires the dedication of individuals, communities, and organisations like Girlguiding. We must continue to work together and continue to amplify our voices, for only by doing so can we hope to transform our challenges into triumphs.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_right-reply-my-motion-english-devolution/content_44.html": "I am incredibly proud that WE have brought it forward to initiate much-needed debate. While I still firmly believe that this decision to combine with BLMK does not put our residents first, I remain hopeful that the Government will recognise the importance of the six unitaries combining and honour their original criteria for devolution as outlined in their white paper. We don’t just stand to lose greater investment in our areas, but in our people.\nI agree with Cllr David Hopkins—we should focus on the shared interests, goals, and outcomes for all six authorities on the South Midlands Authorities Board, prioritising our historical, business, and social connections to form the dynamic core of a thriving new sub-regional economy.\nI agree with Cllr Peter Geary—we are jeopardising our chance to be included in the priority devolution programme because we don’t meet the scale set by the government, and we aim to lose millions of investments.\nThe council leader highlighted very clearly why its not viable to work with Northants – I could list down a list of reasons why I believe that BLMK could be a strain.\nLuton being landlocked and with a higher need for housing has meant that other authorities have had to accommodate their needs. In the last central Beds local plan they had to include 8000 houses for Luton.\nJust yesterday, the Lib Dems in Central Beds expressed their frustration with the ICB's inefficiencies, particularly regarding the East London Foundation Trust's withdrawal from its contract to manage the Leighton Road practice.\nBut let’s focus on the positives stemming from SEMLEP. Their capital investment program, has generated 5,529 jobs, assisted 5,523 learners, and facilitated 4,692 homes.\nNorthants ICB positives: Northants was only just recently commended by HSJ for their excellence in digitising, connecting, and transforming health and care.\nWe know no one gets everything right, and that working relationships can be challenging, but working together we have been successful in supporting this region.\nI can’t stress enough the importance of the relationships we have built with all 6 unitaries, and more so with Northamptonshire over 12 years with SEMLEP and now South Midlands Authorities and what it has delivered for this region. It shouldn’t be overlooked by any means.\nAs a local authority, our responsibility should always be about putting the needs of our residents first, their concerns, and their future at the heart of every decision we make. Unfortunately, leaving out Northamptonshire does not feel like a decision that has been made with that priority in mind. We will always be better together.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_campaigns_youth-education-and-aspirations/content_18.html": "Empowering Women and Inspiring Youth: This is a Local Campaign for Political Engagement In a society that thrives on diversity and inclusivity, it is crucial to ensure that all voices are heard and represented in the political arena. Recognising the need for greater gender parity and youth involvement, a passionate individual has taken the initiative to launch a local campaign aimed at encouraging more women and young people to stand in local politics. The campaign, driven by a vision of a more inclusive and representative democracy, seeks to break down barriers and empower women to step forward as leaders in their communities. Moreover, the campaign recognises the immense potential and fresh perspectives that young people bring to the table. By inspiring and motivating them to engage in local politics, it aims to cultivate a new generation of leaders who are passionate.\nI am grateful for the opportunity, graciously facilitated by the local council, to secure two positions for our youth to engage in the practice of shadowing within the confines of the local council, thereby gaining a profound comprehension of the intricate workings of local politics. I have consistently advocated for the empowerment of women, and inspiring young people to become actively engaged in politics, and I am committed to continuing my efforts in this regard.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_conservative-home-leadership-candidates-must-focus-role-women-our-party/content_57.html": "My opinion piece for Conservative Home\nAs the Conservative leadership campaign gains momentum, it’s striking that none of the six candidates have given significant attention to the crucial support from female members, nor have they acknowledged the value of our local female councillors.\nThis oversight is not just a missed opportunity; it risks alienating a vital segment of our party’s foundation. The importance of female participation in local politics and within the Conservative Party, and the urgent need to increase the number of women elected to parliament, should be high on their agenda.\nAfter all, what is modernisation without equal representation?\nHaving listened to four out of the six leaders and reading up on what has been shared on social media, it’s clear that they all share a vision of uniting the party, bringing back lost voters, and putting members at the heart of the Conservative Party’s success. They all stress the need to deliver for the people, putting country first.\nWhile there’s no doubt that we have a lot of work to do in rebuilding our party and building morale, it’s equally clear that without the support of our female members, there remains a void in our offer.\nOur female MPs have consistently demonstrated the highest levels of ethics and integrity. Yet the party still has much progress to make in recognising and promoting female leadership: in the general election, fewer than one in three of the candidates selected in Tory-held constituencies or crucial target seats were women, and just eight new female candidates were elected.\nFor a party engulfed by the need to modernise and embrace the diverse changes around us, we are trailing behind where equal representation is concerned.\nThis is not just a matter of statistics but a pressing issue that requires immediate attention. I don’t need to highlight the number of women in Labour and Liberal Democrat camps. This is replicated not just in the House of Commons but across local government, too. And as Conservatives, we need to do a whole lot better.\nWomen make up a substantial portion of our party’s membership. Many of these women are not only dedicated party members but also local councillors juggling multiple responsibilities with family, full-time jobs, and volunteering for the party. Their unique perspectives and experiences, shaped by their diverse roles, are invaluable for shaping policies that resonate with a broader electorate.\nFemale members, councillors, and activists are part of the backbone of our grassroots efforts and they are on the frontlines, engaging with communities, fundraising, and driving local initiatives. Their work is crucial for maintaining the party’s connection with the electorate and for implementing change at the local level. As one long-serving councillor aptly put it:\n“Women are not just the heart of the community; they are its pulse, driving it forward with empathy and determination.”\nDavid Cameron tried to push the women’s agenda to the forefront. Of course, at the end of the day, it will be up to the associations and federations to pick the right candidates; their role is crucial in ensuring that we have a diverse and representative group of candidates.\nHowever, I still believe that our leadership candidates should feel it is equally important and vociferously make that point. After all, if it is not important to the leadership, why should it be important to the association?\nThe recent passing of a female councillor, without acknowledgement from our leaders, highlights a concerning lack of empathy and human connection. Recognising and celebrating the contributions of our female members fosters a sense of community and loyalty within the party.\nFemale leaders are crucial for our success. Many female candidates who put themselves forward at the last minute when the party called, didn’t do it because they wanted it on their CV; they did it because of their loyalties towards the party. Many who went out campaigning did it because of their passion to support all and hoped against hope for a Conservative win.\nAs a party, we should be proud that we were the first to produce a female prime minister who took the world by storm with her strength, dedication, love for country and life of service.\nHowever, we are still far behind in parliament, local councils, associations, Conservative Party Board representation, and the voluntary party and these are crucial if we are ever to encourage more women to join us. The need for more female leaders is not just a matter of equality, but a necessity for the success and growth of our party.\nWhat we saw in this election was a selection process that left many talented female candidates without a seat. During the campaign, decisions were made at the top and didn’t take into account what was being fed back by our activists on the ground.\nOur leaders must reconnect with the grassroots, acknowledge the human touch, the diverse skills and knowledge, and the emotional intelligence that our female members bring. It’s time to move beyond rhetoric and commit to real inclusion and representation. The future success – and relevance – of our party depends on it.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_petition-20mph-oxley-park-presented-council/content_56.html": "Cllr Shazna Muzammil was happy to present the petition to reduce the speed limit to 20MPH in Oxley Park in council this evening.\nA long process is involved, but this will be included in the council’s work programme for 2023/2024.\nHere’s hoping this will help reduce speeding in Oxley Park.\nThank you to all the residents who signed the petition and helped get it to council.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_contact/content_14.html": "Thank you for connecting with us. We're always looking for passionate individuals who can help us with our campaigns, events, and administrative tasks. Please consider checking the \"Volunteer\" box in our subscription form if you haven't already. Your support can make a significant difference.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_unlocking-opportunities-bridging-gap-looked-after-children-milton-keynes/content_16.html": "In the city of Milton Keynes, nearly 400 Looked-after Children (LAC) are under the care of dedicated foster parents and the local council. These young individuals, with unique backgrounds and experiences, deserve every opportunity to thrive in adulthood. One crucial step towards empowering them is by creating work placements that not only provide valuable skills but also foster social mobility. In this campaign, Cllr. Shazna Muzammil, in collaboration with the council, aims to engage local businesses and the community in supporting Looked After Children in finding work placements, unlocking their potential and opening doors so our LACs can have the same opportunities as all other young people.\nThe Challenge\nLooked After Children often face additional hurdles in their journey towards adulthood. Transitioning from care to independence can be daunting, and finding suitable employment is a crucial aspect of this process. Recognising this challenge, the campaign was launched in Milton Keynes to enlist the support of businesses in offering work placements to Looked After Children. However, there is still a long way to go to ensure that every Looked After Child has access to these opportunities.\nThe Goal\nThe campaign's goal is to create a network of businesses and community members committed to providing Looked After Children with work placements and the chance to unlock their potential. By investing in their skills and abilities, the campaign contributes to the creation of a more inclusive and supportive community, where everyone has an equal chance at success.\nThe Project in Action\nI. Engaging Businesses\nThe campaign's goal is to create a network of opportunities for Looked After Children (LAC), providing them with valuable work experience and supporting their university applications. Local businesses, big or small, can join the initiative by offering work placements to LAC. The campaign is flexible, providing opportunities in various sectors that align with the interests and aspirations of LAC.\nThe initiative's aim is for LAC to learn from local business staff, gaining valuable insights into the daily operations of a professional environment. Participating in the program doesn't require any changes in the business's current workflow. The existing employers' liability insurance policy will cover work placements, provided the insurer is a member of the Association of British Insurers (ABI) or Lloyds. Businesses don't need to obtain additional insurance to accommodate work-experience students.\nParticipating businesses will receive support in completing a comprehensive risk assessment. The Milton Keynes City Council will undertake visits during the work experience period and ensure the sharing of appropriate information. These measures are in place to facilitate a successful placement experience for both the participating businesses and the young people involved.\nBy opening their doors to these young individuals, businesses contribute not only to their individual growth but also to the overall well-being of the community. This collaborative effort reflects a shared responsibility to ensure that every member of society, regardless of their background, has an equal chance at success.\nII. Engaging the Community\nThe campaign invites community members to support the initiative by spreading awareness and offering their time and resources. With the help of a supportive network of individuals and businesses, the campaign can provide more opportunities for Looked After Children and create a brighter future for them and the city.\nBenefits of Work Placements for Looked-After Children\nSkill Development: Work placements provide LACs with the opportunity to develop practical skills that are essential in the workplace. This hands-on experience enhances their employability and equips them for future career endeavours.\nIncreased Confidence: Stepping into a professional environment can significantly boost the confidence of Looked After Children. Exposure to different work settings helps them build a sense of self-efficacy and belief in their abilities.\nNetworking Opportunities: Work placements also offer valuable networking opportunities. By connecting with professionals in various fields, Looked After Children can expand their support network and gain insights into different career paths.\nBreaking Stereotypes: Engaging local businesses and the community in this initiative breaks down stereotypes and challenges preconceived notions about Looked-after Children. It showcases their potential and resilience, promoting a more inclusive community mindset.\nSocial Mobility and Beyond: Enabling looked-after children to secure work placements is a crucial step towards enhancing social mobility in Milton Keynes. By investing in the potential of these young individuals, we can contribute to the creation of a more equitable society where everyone has the chance to succeed, regardless of their background. This, in turn, fosters economic growth and development across the city.\nAs the local businesses and community members join hands to offer opportunities for these young individuals, they are doing more than just opening doors for them; they are unlocking a brighter and more promising future for the entire city. By investing in the potential of Looked After Children, this campaign takes a significant step towards building a society where everyone has an equal opportunity to thrive, and it sets the foundation for a more prosperous and equitable future for all.\nJoin the campaign in unlocking opportunities for Looked After Children in Milton Keynes.\nGet in touch with [email protected]",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_celebrating-diversity-power-community-milton-keynes/content_51.html": "Milton Keynes, a city brimming with diversity and vibrancy, is a melting pot of cultures, traditions, and communities. I had the honour of being invited to celebrate Vaisakhi with the Rangeelay Punjabi community and the next day, attended an Ifthar at the Wolverton Mosque, events that highlighted the richness and beauty of our city's diversity. The magic of Milton Keynes lies in its ability to unite us all, transcending our backgrounds and allowing us to revel in the things that make us distinct.\nCommunity is not just a desirable aspect of our lives; it is essential. It offers us a sense of belonging, purpose, and support, enabling us to connect with others who share similar experiences, values, and interests. But when diverse communities unite in Milton Keynes, the impact is immeasurable. Each culture, tradition, and way of life infuses the city with a vibrant and unique colour, from the magnificent Vaisakhi celebration's colourful dupattas to the Wolverton mosque's soul-stirring azan. The beauty of community lies in its ability to create solidarity amidst our differences. The resulting wealth of knowledge, experience, and perspective, nurtures our growth, learning, and personal development, while challenging our assumptions and broadening our horizons. By embracing our differences, we create a more empathetic and compassionate community, where we can all thrive.\nFurthermore, when communities come together, they can achieve great things. From organizing cultural events and festivals to volunteering and giving back to the community, the power of collective action is truly remarkable. It allows us to create positive change and make a difference in the lives of those around us. It also allows us an opportunity to invite other cultures to join us and savour what is on offer and learn about each other. This is what I love about living here in Milton Keynes as it has welcomed everyone.\nThe power of community is undeniable, and in Milton Keynes, we are fortunate to have a wealth of diverse communities that enrich our lives and make our city a truly special place to live. Let us continue to come together, celebrate our differences, and create a brighter future for all and I am looking forward to al the different cultural events yet to come this year.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_reflections-lga-annual-conference-prioritising-milton-keynes/content_46.html": "As the Conservative Group Leader in Milton Keynes, I had the privilege of attending the Local Government Association (LGA) Annual Conference alongside Cllr Chris Wardle. This annual, cross-party event offered a wealth of insightful workshops and panel discussions covering a variety of critical issues.\nOur focus centered on the key challenges facing Milton Keynes residents, including growth, affordable housing, council finances, devolution, public transport, and support for young people and families. Engaging in dialogue with peers from across the political spectrum proved to be an invaluable experience. It was inspiring to hear how different councils manage their resources and implement best practices.\nThe charming town of Harrogate served as a picturesque backdrop to our discussions, rich with history. And, to my delight, I even spotted the Trotter brothers’ famous car parked on the street! #OnlyFoolsAndHorses\nHere are some key takeaways from the sessions we attended:\n🔵 Conservative Group Meeting:\nDaily meetings provided us with an opportunity to align our strategies and build connections with other council leaders.\n🔵 Delivering Inclusive Growth:\nWe discussed the vital role councils play in driving economic growth and the importance of devolution, especially in light of the growth and new town plans for Milton Keynes.\n🔵 SEND Sustainability:\nAddressed the ongoing challenges in meeting the educational needs of children with Special Educational Needs and Disabilities (SEND) while managing projected increases in spending.\n🔵 Tackling Health Inequalities:\nExplored strategies aimed at reducing health disparities and improving outcomes across local communities.\n🔵 Temporary Accommodation Challenges:\nEngaged in discussions about managing the rising number of households in temporary accommodation and the necessary policy changes to address this issue.\n🔵 Devolution for Growth and Public Services:\nCovered the benefits and challenges associated with mayoral combined authorities and the implications of the “Take Back Control” bill.\n🔵 Planning for Housing Needs:\nFocused on current housing challenges, including the need for affordable homes and revisions to right-to-buy policies.\n🔵 Improving Bus Services:\nEmphasized the necessity of reliable and accessible public transport, particularly in rural areas.\n🔵 Supporting Children and Young Families:\nConsidered how councils can enhance support for young people, with a specific focus on the Government’s Children’s Wellbeing Bill.\n🔵 Local Government Finance:\nDiscussed future strategies for local government authorities to tackle escalating costs and rising demand in crucial areas such as children's social care.\nAttending the LGA Annual Conference has equipped me with valuable insights and connections that will aid in my efforts to advocate for the residents of Milton Keynes. I look forward to implementing what we've learned and driving forward initiatives that will enhance our local community.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_girl-guides-fringe-event-conference-sunday-1st-october-2023/content_25.html": "Girl Guides fringe event at Conference Sunday 1st October 2023 (Spech in full)\nIt’s a pleasure to be speaking at the girl-guiding fringe.\nMy story begins in Sri Lanka amidst an ethnic minority armed conflict. I recall when suicide bombers shook our days, curfews became the norm, and home-schooling was commonplace.\nGrowing up in a strict patriarchal society wasn't easy. I was the lone girl in a family of four brothers, and while my father was notably fair, he made sure that I had the same opportunities as my siblings. If they got bikes, I got one, too; if I had a doll, they had dolls as well. Yet, there were limits imposed by societal norms, particularly when it came to higher education opportunities, and those weren’t available for me. My brothers went off to universities abroad, and I was married off at a very young age (to someone I hardly knew) and became a mother of two boys, all in the belief that I was doing the right thing by my family.\nOn top of the shackles of culture, religion and community, there was the war.\nI remember like it was yesterday when a truck bomb went off right next to my school, The impact physically threw me backwards, even before I heard the blast. Nothing was certain. No plans were made. No futures envisioned.\nI excelled academically, but education was not a priority for the girl child. Besides, I couldn't be more educated than the man I was to marry. I could only restart my education after my battle with divorce, and I went on to complete my MBA, built a successful career, and raised my two boys by myself. I ran two political campaigns, successfully lobbied for 25% female representation in local government and started working in villages promoting girls' education for which I recently received a global award. All the while fighting misogyny, harassment, and persecution.\nWhen I moved to the UK, I faced a new set of challenges. even with my Master's, I couldn’t find a job and I started at the very bottom of the ladder at the Open University. It broke my confidence and I remember feeling very low and thinking why does everything have to be a battle?\nFast forward to today, and I stand before you, not just as a senior member at the university but also as an elected councillor, a prospective parliamentary candidate, and a volunteer in various roles, from being a vaccinator to mentoring and providing support to young people in custody.\nThe Girls' Attitude Survey raises critical questions and spotlights the concerns affecting young girls today. My story, though unique, shares a common thread with the struggles many girls face. It highlights the importance of organisations like Girlguiding and initiatives like the Girls' Attitude Survey.\nThe survey reveals a sobering reality: many young girls struggle with hardships that affect their mental health and overall development. It speaks to the challenges that girls across different backgrounds and circumstances confront as they navigate life.\nWhile the challenges are undeniably real, I want to reassure you that our government is taking meaningful steps to address issues disproportionately affecting women and girls. Let’s consider the milestones achieved in the last few years:\n-\nThe Tackling Violence Against Women and Girls Strategy, criminalises stalking, strangulation, revenge porn, and child marriage.\n-\nThe upcoming Online Safety Bill is designed to combat technology-driven crimes like stalking and cyber harassment.\n-\nThe landmark Domestic Abuse Act has strengthened protections for victims and stopped the \"rough sex gone wrong\" defence.\n-\nThe Protection from Sex-based Harassment in Public Bill, which became law in September 2023, makes it an offence to intentionally harass someone in public based on their sex.\nA study by the All-Party Parliament Group for UN Women found that 71% of women in the UK have experienced some form of sexual harassment in public spaces, yet only 5% of incidents were reported to the police. We must encourage victims to report these incidents, for silence perpetuates impunity. The Home Office's StreetSafe tool offers an avenue for anonymous reporting, ensuring safety even in the darkest moments.\nWhile legislative progress is essential, we must also nurture our own development. Education stands as a mighty pillar, so educate yourselves on everything, on the law, and share that knowledge.\nIn conclusion, we have come far but our path to progress is far from over. Meaningful change requires the dedication of individuals, communities, and organisations like Girlguiding. We must continue to come together and continue to amplify our voices, for only by doing so can we hope to transform our challenges into triumphs.\nThank you",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_category_Articles/content_39.html": "How Partnerships Can Fail – And Why We Must Not Let Milton Keynes Fall Behind 17th February 2025 Introduction The exclusion of Milton Keynes from the Devolution Priority Programme is not just a missed opportunity—it is a critical moment that puts our entire... Articles\nBreaking Barriers: Women as Conservative Candidates in Local Government 19th January 2025 Politics today suffers from a pervasive lack of trust, particularly in the two mainstream parties, driving many toward other alternatives like -dare I say -... Articles\nFrom Candidate to Conference Opener: Lessons in Leadership and Resilience 30th October 2024 Standing on the stage of the Conservative Party Conference in Birmingham, flanked by esteemed figures like Chairman Richard Fuller, Sir Andy Street, Lord Daniel... Articles\nEmpowering girls through education: a global imperative 18th October 2023 Shazna is very proud to have been able to contribute to the Future Leaders Programme Essay Collection which addresses some of the biggest issues facing the next... Articles\nConservative Conference Fringe Event: The Girls’ Attitudes Survey 2023: How have girls’ lives changed over the last 15 years? 1st October 2023 Cllr Shazna Muzammil would like to present you the 2023 Girls' Attitudes Survey. Please read all about it here. (girlguiding.org.uk) girls-attitudes-summary.pdf... Articles\nMeet the man behind the “International Women and Girls Strategy” 30th July 2023 It was an honour to meet James Cleverly the man behind the “International Women and Girls Strategy”. As someone who has personally experienced the challenges of... Articles\n2-Day Workshop by Coalition for Global Prosperity 28th July 2023 Supported by the esteemed Gates Foundation, Coalition for Global Prosperity (CGP) Future Leaders program is a ground breaking initiative aiming to create a... Articles\n‘Stand up, speak up and make your mark’ Why we need more voices from women of colour in our public life 27th June 2023 As a passionate advocate for diversity and inclusion, and whilst wearing several hats representing CWO South East, Conservative Women's Organisation - UK... Articles\nCelebrating Diversity: The Power of Community in Milton Keynes 19th April 2023 Milton Keynes, a city brimming with diversity and vibrancy, is a melting pot of cultures, traditions, and communities. I had the honour of being invited to... Articles",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_my-plan-birmingham-ladywood/content_41.html": "For too long, the constituency has been sidelined and neglected by those who were supposed to champion its needs. No more excuses. The people of this community deserve action, not just words—they deserve leadership that delivers rather than disappoints.\nShazna Muzammil is committed to turning these goals into reality because the residents deserve a home and a community that are cherished and safeguarded for future generations. Her plan, crafted by listening to the voices and concerns of the community, reflects a deep understanding of what needs to change. She is ready to champion these causes vigorously.\nHer drive is fueled by the trust and support of the community, and she hopes to earn that trust and support to deliver real results.\nJoin Shazna, and let's work hard together to make our community a place we all feel PROUD to call home. She is dedicated to ensuring that every voice is heard and that every action taken is in the best interest of those she aims to serve.\nShazna Muzammil, Parliamentary Candidate for Birmingham Ladywood said:\n“The current Labour leadership has let Birmingham Ladywood down—The Labour MP has forgotten her residents. The Labour Council’s mismanagement of funds has meant more burden on the people, libraries have closed, and services have been reduced. The Labour PCC have shut down police stations, crime has increased, and drug dealers are dealing openly on our high streets. This is absolutely unacceptable. We should be proud of our city, and I am committed to restoring that, making our streets safe and holding the Labour Council accountable. I will listen to you, bring in the investment, and deliver the changes we desperately need here. We can rebuild our community where everyone feels secure and valued. It’s time for change.”\nPlease find 'My Plan for Birmingham Ladywood' below:\n1. Strengthening Our Local Economy\nBirmingham Ladywood has lower average incomes and higher unemployment rates than the national average. Only by strengthening our local economy can we improve the livelihoods of our constituents. For far too long, the current Labour MP has not acted. I will fight to secure necessary Government and private sector investments to boost our local economy and create high-quality jobs for our residents.\n2. More Police for Safer Streets and Communities\nWe have the highest knife crime in the country. It is not a statistic that we can be proud of, nor does it make us feel confident of our safety. Violent crime and drugs are widespread within the constituency, and yet around 30 police stations in high-crime areas are due for closure. The safety of our residents is non-negotiable, and I am committed to holding the Labour Police and Crime Commissioner accountable and will work diligently to improve community policing and implement programs to support at-risk youth, making our neighbourhoods safer for everyone.\n3. Regeneration by prioritising residents and upgrading council homes to meet decent home standards\nAffordability and availability of quality housing is a key concern which has resulted in overcrowding and homelessness. I am committed to working closely with the Council to revitalise the housing strategy. During the consultations on the Birmingham Ladywood Regeneration Plan, it is crucial that the council enables every resident and business owner to participate in the consultation process, and I will ensure that every voice is heard.\nThe people of Birmingham Ladywood deserve to live in homes that are suitable for living and raising families. The council has failed in its duty to support those living in council homes, and many are living in deplorable conditions. I will fight to ensure that the council brings these homes up to decent home standards.\n4. Save our libraries, extend services and invest in Education and Skills to boost opportunities\nEducation will be a key priority for me. Despite Birmingham having the most number of world class higher education institutions outside of London, our constituency is lagging with lower rates of progression to higher education. A focus on early childhood education is imperative for us to progress, and I am committed to ensuring every child receives a top-quality education. Further, up-skilling our youth in line with the job market is crucial for building a successful future. I will fight Labour’s Parent tax, which will stop children from receiving the best education they can have and will also burden SEND students. I will also fight for funding related to early childhood education, ensure access to apprenticeship schemes and work to enhance educational opportunities and career pathways, prepare our youth to thrive in their careers and contribute positively to our community.\n5. Combatting fly-tipping and making our area clean and tidy for all\nThe council has failed Birmingham Ladywood. There is litter and fly-tipping everywhere, along with rat infestations and dangerous abandoned buildings that contribute to high levels of crime in the area. I am committed to holding the council accountable for the services residents deserve, addressing the rat infestation, installing CCTV in fly-tipping hotspots, and collaborating with the council to find solutions to the littering problem. It's time to bring back pride in Birmingham.\n6. Ending Homelessness and Rough Sleeping by providing suitable accommodation\nIt is unacceptable that some of our residents are sleeping on the streets. Everyone should have access to a safe and stable home. I am committed to collaborating with local communities to make this a reality. I will work towards eliminating homelessness through targeted investments and partnerships with local charities and the private sector, ensuring everyone can access safe and stable housing and have access to food and opportunities.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_how-partnerships-can-fail-and-why-we-must-not-let-milton-keynes-fall-behind/content_21.html": "Introduction\nThe exclusion of Milton Keynes from the Devolution Priority Programme is not just a missed opportunity—it is a critical moment that puts our entire region’s future at risk. As we now grapple with the repercussions of this failed bid, it is clear that strained relationships, miscalculated leadership decisions, and lost opportunities have left Milton Keynes and its neighbouring authorities in an uncertain position.\nAt the heart of this issue lies a fundamental question: how can regional partnerships thrive when key principles of collaboration are ignored? The failure of the recent devolution bid for the Bedford, Luton, Milton Keynes, and Central Bedfordshire (BLMK) model highlights a wider issue—the fragility of partnerships when political self-interest overrides strategic cooperation.\nThe Breakdown of the BLMK Devolution Proposal\nMilton Keynes City Council, under its Labour leadership, put forward a devolution proposal linking Bedford, Central Bedfordshire, Luton, and Milton Keynes. However, this proposal was rejected for failing to meet the government’s preference for a broader, regional partnership. Crucially, it abandoned a long-standing model of cooperation that had included all six South Midlands authorities—Bedford Borough, Central Bedfordshire, Luton, Milton Keynes, West Northamptonshire, and North Northamptonshire.\nThe decision to exclude the Northamptonshire authorities was a significant gamble by the Labour Leader of Milton Keynes City Council, Cllr Pete Marland. It disrupted years of regional collaboration and created deep divisions among key local stakeholders. Worse still, it undermined the collective bargaining power of Milton Keynes and its neighbours, reducing the region’s ability to secure transformative investment and greater local decision-making powers.\nThis is more than just a bureaucratic setback; it is a wake-up call about the risks of fragmented leadership and unbalanced partnerships.\nThe Stakes Are High\nThe principle of devolution is something we support—localised decision-making has the power to transform services, create jobs, and drive economic growth. However, devolution must be based on democratic legitimacy and inclusive partnerships, not rushed proposals designed to serve narrow political interests.\nA report commissioned by the South East Midlands Local Enterprise Partnership (SEMLEP) was published on 13th July 2021, focusing on the economic impact of SEMLEP’s £265 million Local Growth Fund (LGF) investment programme. This multi-million-pound funding has supported 55 capital projects across the area between 2015 and 2021, aimed at enhancing business growth and productivity, funding new transport schemes and homes, and generating new jobs and opportunities for students.\nThe impact of the Local Growth Fund (LGF) projects has been significant:\n- By the end of 2020, the new homes and households created through LGF projects were generating an annual increase in local spending of around £25 million, projected to rise to £186 million by 2030.\n- The gross value added (GVA) from these projects reached approximately £173 million in 2020, with projections of £656 million annually by 2030.\n- More than 5,500 learners had been trained by the end of 2020, leading to an estimated £5.9 million in local spending each year, expected to increase to £8.5 million with 9,000 learners by 2030.\n- Investment in business growth yielded capacity for around 3,500 employees in 2020, which is anticipated to grow to nearly 4,000 by 2030.\nThese figures illustrate the profound impact of strategic investment on the region's economy, education, and workforce development.\nCllr Pete Marland, Council Leader of Milton Keynes City Council, has previously championed the collaborative model, stating, “We need strong partnerships like these to drive economic growth and boost job prospects in our city and across the region\"\nCouncils join forces to champion growth in business support, skills and careers drive - Business MK However, his recent U-turn regarding the exclusion of Northamptonshire from the BLMK bid has led us to a troubling situation.\nThe decision to exclude Northamptonshire from the BLMK bid disrupted a model that had a proven track record of success. It was a political gamble that relied on selective alliances rather than a strategic vision for the entire region. Even figures like Conservative Mayor Tom Wootton (Bedford Borough), who initially supported the proposal, later expressed concerns about the imbalance of power within the partnership.\nWhy Partnerships Fail: A Case Study in Mismanagement\nThe failure of the BLMK devolution bid provides an important lesson in how partnerships can break down. Several key issues contributed to this failure:\n1. Imposed Rather Than Collaborative Decision-Making\nTrue partnerships are built on genuine consultation, not top-down imposition. The devolution process was driven by a government directive, but the rushed nature of the BLMK proposal left many stakeholders feeling sidelined. Central Bedfordshire Council and others expressed frustration at the lack of meaningful engagement. This lack of consultation bred discontent and undermined trust in the process.\n2. Imbalanced Power Dynamics\nEffective partnerships require equitable representation. By excluding West and North Northamptonshire, Cllr Marland upset the balance of power. A devolution bid should not be structured to favour one authority over others, yet this is precisely what happened. The result was a proposal that lacked credibility and cohesion, making it easy for the government to reject.\n3. Absence of Consensus\nSuccessful partnerships require clear terms that all parties can agree on. The original SMA model had a solid foundation, with six authorities working in tandem. In contrast, the BLMK proposal lacked full support even among its own members, with Bedford’s Mayor eventually expressing reluctance. The lack of consensus was a major red flag for decision-makers in government.\n4. Financial Motivations Over Community Needs\nDevolution should be about empowering local communities, not political manoeuvring. The exclusion of key partners from the BLMK model was not about delivering better services—it was about consolidating power. When financial gain and political self-interest take precedence over collaboration, communities suffer. Issues such as affordable housing, infrastructure, and local economic growth should have been at the heart of the proposal, but instead, the process became a power struggle.\n5. Leadership Driven by Self-Interest\nStrong leadership is about serving the people, not personal ambition. Cllr Marland’s actions have raised serious concerns about governance in Milton Keynes. His decision to exclude key partners from the devolution bid was not in the best interests of residents but rather a strategic move to increase his control over regional decision-making.\n6. Fear of Losing Control\nThere is always an understandable concern that larger partnerships might dilute local authority power. However, excluding key stakeholders from the BLMK model did not strengthen Milton Keynes’ position—it weakened it. By failing to build a broad, inclusive coalition, Cllr Marland effectively ensured that our city would be left out of the devolution programme altogether.\n7. Lack of Transparency and Public Consultation\nResidents were not given a say in this devolution bid, despite the fact that it would have major implications for local governance. A lack of transparency creates distrust, and the failure to properly consult the public has only added to the perception that this process was driven by political interests rather than community needs.\nThe Path Forward\nThe failure of the BLMK bid should serve as a warning—but it must also be an opportunity for us to rebuild. Milton Keynes cannot afford to be left behind. The way forward requires:\n1. Restoring Regional Collaboration – All six South Midlands authorities must come back to the table to form a balanced and inclusive devolution proposal. The SMA model worked, and we should return to it.\n2. Aligning with Government Expectations – The government has made it clear that it favours broader, regional partnerships. We must ensure that our new proposal meets these criteria to avoid another rejection.\n3. Prioritising Community Needs – Devolution should focus on creating jobs, improving services, and boosting local economies. Political self-interest must not take precedence over real benefits for residents.\n4. Ensuring Transparency and Public Consultation – Residents must have a voice in the process. Future devolution discussions should be open, transparent, and accessible to the public.\n5. Avoiding Unwanted Alternatives – If we do not take the lead in creating a devolution proposal that works for Milton Keynes, we risk being forced into a less favourable partnership—such as being absorbed into a Thames Valley authority where we would have minimal influence.\nConclusion\nMilton Keynes has a proud history of innovation and growth. However, recent political miscalculations have put our city at risk of being left out of the next stage of devolution. If we want to secure the investment and decision-making powers that our region deserves, we must move beyond political gamesmanship and focus on genuine collaboration.\nThe failure of the BLMK bid is not the end of the road—but it is a clear signal that we need to change course. By restoring trust, working together, and prioritising our residents, we can build a stronger, more effective partnership that will drive real progress for Milton Keynes and the wider South Midlands region.\nNow is the time for leadership that puts people before politics. If we fail to act, we risk losing control over our own future. Let’s make sure Milton Keynes does not fall behind.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_events_feed/content_27.html": null,
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_moving-english-devolution-motion/content_4.html": "I move this motion, with both a sense of duty and frustration. This is a hugely important issue for our region, yet it’s one this administration chose not to bring to this Council for open discussion.\nDevolution offers us the chance to secure transformational investment, take control of key decisions, and unlock the potential of localised powers for the benefit of our communities. But instead of leading this important conversation, it’s been left to us to bring it forward.\nThe Labour Government’s criteria for devolution could not be clearer—Any area wanting to access the programme must have a combined population of at least 1.5 million or above to form a Mayoral Strategic Authority. The original South East Midlands proposal—6 unitaries—met this requirement with a population of 1.7 million.\nYet, at the eleventh hour, this administration pulled out the 2 Northamptonshire authorities. What’s left is a fragmented proposal of Bedford, Luton, and Milton Keynes, with fewer than 1 million people.\nWhilst this falls short in the criteria set by government, It also falls disastrously short in ambition.\nSEMLEP’s £265million Local Growth Fund (LGF) investment programme has funded by 55 capital projects across the area between 2015 and 2021, and it has been used to support business growth and productivity, fund new transport schemes and homes, and generate new jobs and opportunities for students. That amount of funding became available because there were six unitaries involved.\nBy submitting an EOI with just BLMK, the council fails to acknowledge the importance of this relationship and also fails meet the required population figures. It jeopardises our inclusion in the entire programme. Why are we setting ourselves up to fail risking investment and growth ?\nThe leader admitted in a letter to West Northamptonshire Council that they agreed to submit an Expression of Interest, which included the Northamptonshire councils, only because they believed a non-Mayoral Combined Authority was an option. This U-turn, certainly wasn’t made for residents.\nDoing nothing isn’t an option. But doing the wrong thing is just as bad, if not worse. That’s why this motion calls for a democratically elected mayor. Someone chosen by the people. Someone they can hold to account. Someone who will fight for our region’s fair share.\nI urge you to support this motion, because it’s the right thing to do for the people of Milton Keynes.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_empowering-girls-through-education-global-imperative/content_48.html": "Shazna is very proud to have been able to contribute to the Future Leaders Programme Essay Collection which addresses some of the biggest issues facing the next generation of UK Parliamentarians following a General Election in 2024.\nFormer Leader of the Conservative Party, First Secretary of State and UK Foreign Secretary Lord Hague has written the foreword for this collection. Coalition for Global Prosperity does great work and have given the opportunity to look at what Britain does through the lens of UK defence strategy, our Foreign Policy and UK Aid and Shaz feels hugely privileged to have been part of the programme and to have learnt so much from CGP and their expert distinguished guests.\nEducation is something Shaz is hugely passionate about and believe that it is the silver bullet. It holds the key to transformation and altered the course of her life. Working at The Open University, Shaz has witnessed the incredible support available for students in the UK and should take advantage of our education systems. Shaz is proud of the UK’s commitment to girls' education globally because it is only right that our knowledge and expertise is shared, to better lives across the world.\nRead the essay in full here:\nEmpowering girls through education: a global imperative\nShazna Muzammil\nIn the present age, it's disheartening that millions of girls still face significant barriers to education. These obstacles, ranging from deeply ingrained cultural norms to the harsh realities of climate change and conflict, demand our immediate attention. There is an urgent need to address this issue and to assess the transformativen power of education, international examples, and its profound positive impacts on\nsocieties and nations.\nMy personal journey of being married off at a young age and denied the opportunity to complete my education, only to return to it later and complete an MBA, which then led me to build a highly successful career whilst breaking through societal barriers, exemplifies the transformative potential of education in surmounting societal impediments.\nGirls' education: a global crisis\nThe issue of girls' education has profound implications for entire communities and nations. Education is globally recognised as an indispensable human right and a cornerstone for empowering girls and women. Yet, girls continue to confront an array of educational barriers, including poverty, gender discrimination, and early\nmarriages. This bleak reality condemns them to a lifetime of missed opportunities and constrained potential, making our world poorer for it.\nBreaking down barriers\nPremature marriages further exacerbate this crisis, relegating education to a low priority. As a result, countless girls are denied their right to education, stifling their personal growth and hindering their contribution to society. Inadequate infrastructure and learning environments also hinder girls education. For\ninstance, in many developing nations, girls drop out of school due to the lack of basic sanitation facilities, particularly during menstruation. According to UNESCO, 1 in 10 girls in Sub-Saharan Africa miss school during their menstrual cycle. In Somalia, drought worsens these educational barriers as children are displaced, schools are destroyed, and water scarcity disrupts daily life. Often tasked with fetching water, girls face a challenging dichotomy between education and household responsibilities.\nThe situation in Afghanistan is a glaring example of the challenges facing girls education. Political instability, economic uncertainty, educational disparities, sexual\nviolence, and poor health plague Afghan women and children. The recent ban by the de facto Taliban government saw 1.2 million denied access to college and secondary schools. As of February 2023, UNESCO reports that 2.5 million school-aged girls and young women in Afghanistan do not attend school, underscoring the gravity of the issue.\nSTEM and ICT skills\nThe significance of STEM and ICT skills in Africa has grown exponentially due to the advent of the fourth industrial revolution, which has ushered in numerous new job opportunities in these domains. Consequently, there is an ever-increasing urgency to ensure that girls have equitable access to and engagement with these areas. Work is taking place to provide girls with the opportunity to receive mentorship from female role models and gain exposure to cutting-edge 21st-century digital skills such as artificial intelligence, coding, robotics, 3D printing, and more. For example, this summer a transformative initiative led by UNESCO, the Ministry of Education and Prada allowed over 200 Kenyan girls to participate in specialised ICT-STEM boot camps.\nDespite their undeniable association with progress, women and girls continue to be significantly underrepresented in STEM and ICT careers. This gender disparity is a global issue, as evidenced by the International Telecommunication Union's Facts and Figures report for 2022, which reveals that girls still lag behind boys in terms of possessing digital skills on a global scale. Furthermore, the UNESCO Institute for Statistics, in its 2019 report, highlighted that women account for only 29.3% of scientific researchers worldwide. This highlights the pressing need for concerted efforts to rectify this gender imbalance in STEM and ICT fields and harness the full potential of girls and women in these vital fields.\nInitiatives for change: the role of nations\nIn Bangladesh, the success of microfinance institutions like Grameen Bank, founded by Nobel laureate Muhammad Yunus, was significantly propelled by women's education. Women who received education through such programs were better equipped to manage financial resources, leading to improved family income and poverty reduction.\nRwanda, often celebrated for its commitment to gender equality, has made significant strides by investing in girls education. As a result, women now occupy prominent roles in politics and leadership, making Rwanda an exemplar of gender parity.\nIn India, the \"Kishori Vikas\" program aimed at educating adolescent girls in rural areas has not only improved literacy rates but has also had a positive impact on the overall development of these communities. Girls' educated under this initiative are actively participating in community activities, promoting sustainable development.\nGovernment commitments: the UK's Girls' Education Strategy\nGovernments are acknowledging the pivotal role of girls' education. The United Kingdom has been a prominent advocate for girls' education globally, recognising it as a vital tool for empowering individuals, fostering gender equality, and promoting economic growth. The UK government’s Girls’ Education Strategy recognises education as a fundamental human right and a potent instrument for poverty alleviation, improved health outcomes, and economic growth.\nUK aid has significantly contributed to expanding access to education for girls in some of the world's most underserved regions. By investing in infrastructure,\nscholarships, and targeted programs, UK aid has helped bring more girls into classrooms.\nInvesting in a brighter future\nInvesting in girls' education is a moral imperative and a strategic necessity. Educated girls and women experience improved health outcomes, increased workforce participation and are better equipped to uplift their families and communities. It is high time we recognise that empowering girls through education is not just the right thing to do; it is the smartest investment for a brighter future for individuals, communities, and entire nations.\nThe essay collection is now live here:\nhttps://www.coalitionforglobalprosperity.com/news/launch-of-the-future-leaders-essay",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_soft-power-monarchy-how-king-charless-diagnosis-highlights-uks-influence/content_62.html": "In a recent announcement from Buckingham Palace, the news of King Charles's cancer diagnosis has sparked widespread concern and a huge surge in public interest, particularly in matters concerning men's health. While the revelation of such personal news is undoubtedly sobering, it also sheds light on the unique soft power wielded by the British monarchy and its ability to influence societal behaviour positively.\nThe monarchy is an institution that holds a special place in the hearts of many around the world, symbolising tradition, stability, and continuity. But it also plays a significant role in shaping public discourse and fostering national unity. King Charles's transparency about his health condition is not only courageous, but also serves as a catalyst for important conversations, particularly regarding men's health issues such as prostate cancer, and you can now see its immediate impact.\nOne notable impact of the King's diagnosis is the substantial increase in visits to NHS advice pages related to prostate health. According to NHS England, the announcement led to a staggering 1000% surge in visits to the prostate enlargement page, highlighting the power of royal influence in raising awareness and prompting action. This surge in interest underscores the monarchy's ability to drive positive change and encourage proactive healthcare-seeking behaviour among the public. These are important conversations, and men are feeling comfortable enough to have them, and seek help.\nMoreover, the response to King Charles's diagnosis reflects the deep sense of empathy and solidarity that the British people feel towards their monarch. Messages of support and well-wishes have poured in from all corners of society, and from across our borders, transcending political divides and reaffirming the monarchy's role as a unifying force in times of adversity. The King's courageous decision to publicly confront his illness serves as an inspiration for many others facing similar challenges, instilling a sense of resilience and growing community spirit.\nWhat this also puts the spotlight on is the importance of the monarchy's soft power, which extends to various aspects of British culture and diplomacy. The Royal Family's global prominence and influence provides a platform for promoting British values, interests, and charitable causes on the international stage. Through their engagements and public appearances, members of the Royal Family bolster the UK's reputation and cultivate diplomatic relationships with other countries. It prompts reflection on why the positive contributions are often overshadowed by anti-monarchist sentiments, perhaps underscoring the inherent complexities of maintaining a free and fair society.\nIn times of crisis or uncertainty, the presence of a strong and stable monarchy offers reassurance and continuity, bolstering national resilience and cohesion. King Charles's dignified response to his diagnosis exemplifies the resilience and resolve that characterise the British monarchy, embodying the spirit of duty and service that defines this institution.\nAs I, take a moment to wish King Charles a speedy recovery and offer support to him and his family during this challenging time, it is important to recognise and also reflect upon, the enduring significance of the monarchy in shaping the collective identity and values of the United Kingdom. From healthcare advocacy to diplomatic outreach, the soft power of the monarchy continues to play a vital role in advancing our country’s interests and promoting positive change, both at home and abroad.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_campaigns_combatting-litter-community/content_33.html": "As someone who is deeply passionate about keeping our communities clean and beautiful, I have taken it upon myself to organise regular community litter picks in our area. Litter has become an unfortunate problem in many neighbourhoods, tarnishing the natural beauty of our surroundings and posing a threat to wildlife and the environment. It's disheartening to see trash scattered around, but instead of simply complaining about it, I decided to take action. Please do join the regular litter picks. PLease follow my Facebook page for updates on dates and meeting points. https://www.facebook.com/ShazMuz77",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_unauthorised-encampments/content_17.html": "Update on unauthorised encampments petition\nThe Milton Keynes Council and Thames Valley Police have teamed up by signing a joint protocol to tackle unauthorised encampments. This is great news for us all.\nThis partnership marks a significant step towards addressing the long-standing issue of encampments that have been a source of concern for the community and residents. With this collaboration, we can finally address the issue head-on, and it's about time!\nOur campaign has been relentlessly pressuring for action towards these unauthorised encampments that have brought Anti-Social Behaviour (ASB) and numerous other issues to our residents.\nPreviously, Milton Keynes Council was one of only three councils that hadn't joined this essential initiative, but now, we can finally say that they're listening to us and taking action.\nThis is a significant victory for the residents who have tirelessly fought for a neighbourhood without disruptions, and by signing the petitions and supporting our efforts, we have managed to get the council to listen.\nThere’s still much more to do, and we will continue to represent our residents and fight for bollards and bunds on the redways. We will urge the council to keep finding a long-term solution by allocating a site for the traveller community.\nWe thank you for your unwavering support and hope you will continue supporting us.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_map-locations/content_3.html": "Skip to main content\nMain navigation\nHome\nAbout Shazna\nNews\nCampaigns\nContact\nMy map",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_save-kingsmead-green-stop-h6-extension-action-day/content_38.html": "Today, our community came together to support the preservation of Kingsmead Green, a beloved green space in our neighbourhood. People of all ages, including our furry friends from Kingsmead, Oxley, Westcroft, and Tattenhoe, gathered to show their support. The event gained the attention of ITV News, where some of our residents and Councillor Muzammil spoke about our mission to stop the H6 extension and save the green space.\nWe are grateful to everyone who played a part in making this event a success, from organisers to attendees. With over 500 signatures on our petition, we have demonstrated our shared vision for the future of Kingsmead. The weather was perfect, adding to the joy and positivity in the air.\nOur fight to safeguard Kingsmead is far from over, and we must continue to stand together in our shared objective. We will continue to protect our green space and ensure that it remains the vibrant heart of our community. As we move forward, remember the incredible feats we can achieve when we come together for a common cause. Thank you to everyone who contributed to the success of this event. Your passion and dedication are the driving forces behind our campaign.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_privacy/content_8.html": "This document outlines how Shazna Muzammil processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Shazna Muzammil\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Shazna Muzammil.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Shazna Muzammil, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Shazna Muzammil via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_about-rss/content_6.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_cookies/content_5.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_independent-surge-birmingham-ladywood/content_65.html": "In the heart of Birmingham Ladywood, a remarkable political development is unfolding. With a 49% Muslim population and 94% Black and Asian voters, this constituency has long been a Labour stronghold, boasting a staggering 73.2% majority in the 2019 election. However, the entry of independent candidate Akhmed Yakoob into the race is reshaping the political landscape in unprecedented ways.\nYakoob, a local solicitor with a robust social media following, has brought a new dynamic to this election. His vocal stance on the Gaza conflict and, more importantly, his ability to connect with younger voters have made him a formidable contender. His campaign has resonated particularly in the Alum Rock Road area, now part of Ladywood, due to boundary changes. This area, with its predominantly Black and Asian population, has become a hub of support for Yakoob's candidacy, showcasing the potential for youth engagement in politics.\nAs a Conservative candidate, I find Yakoob's impact noteworthy. He stood against the West Midlands Mayor Andy Street and garnered nearly 70,000 votes in May 2024. His ability to galvanise support and challenge an established Labour frontbencher like Shabana Mahmood underscores a significant shift in UK politics. It highlights a growing sentiment among voters for representation that speaks directly to their concerns and experiences.\nWhile Labour's traditional strongholds are being tested, this election is not just about party lines but about the voices of the people. Yakoob's rise clearly demonstrates that independent candidates can indeed disrupt the status quo and bring new perspectives to the forefront of political discourse. This potential for change in political representation should not be underestimated.\nAs we move towards the July 4th election, it's clear that the political dynamics in Birmingham Ladywood are shifting. Whether or not Yakoob unseats Mahmood, his campaign has already made a significant impact, demonstrating the power of grassroots movements and the changing face of British politics.\nStay tuned as we continue to monitor this exciting race and consider its implications for the future of our community and our country.\nI have shared my comments on the article by Thomas Harding of National News here:",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_campaigns_say-no-waste-tip-tattenhoe/content_10.html": "As the voice of the Tattenhoe community, we must stand together against the proposed fast-tracking of a new Household Waste Recycling Centre on Snelshall Street. Local Conservative councillors, including myself, Cllr Shazna Muzammil, alongside Cllr Manish Verma, are deeply concerned about the impacts this decision will have on our residents and the environment.\nA Threat to Our Quality of Life\nThis proposed waste facility is alarmingly close to residential areas, raising serious concerns about increased noise pollution and traffic congestion. Our residents deserve better. The potential disruption to our community could significantly compromise the quality of life that we’ve all worked hard to maintain.\nMoreover, it’s crucial to recognize that a significant portion of the proposed site falls within Flood Zone 3 and is classified as a Biodiversity Opportunity Area. Developing a waste facility in this sensitive location poses serious risks to local habitats and ecological systems. We cannot allow projects that endanger not only our environment but also the very fabric of our community.\nLack of Consultation is Unacceptable\nResidents have expressed their frustrations over the glaring lack of consultation surrounding this decision. The last engagement took place back in 2020, long before recent developments in Tattenhoe Park, leaving many new residents unaware of how this plan directly affects their lives and homes. This is simply unacceptable!\nOne resident rightly pointed out, “It’s troubling that new voices are being excluded from this conversation. We deserve transparency and to have our concerns heard.” Their words reflect a growing sentiment that resonates deeply within our community.\nCall for Thoughtful Review\nAs representatives of Tattenhoe, we are formally requesting a thorough examination of this decision, ensuring that community concerns are prioritized in alignment with Milton Keynes' commitment to sustainability and high-quality living standards.\nWe believe the Labour-led council’s approach to planning has become dangerously relaxed. By sidestepping public objections and rushing through approvals, we are compromising vital environmental and community standards, putting the future of our region at risk.\nTake Action!\nWe must come together to demand accountability from the Council and the Labour leadership. This is why we, alongside our residents, have called the decision in for further scrutiny. The council has offered mediation for residents on the 18th of February 2025. We are urging them to halt the approval of the Snelshall waste recycling site, reopen the consultation process, and explore alternative sites that better meet our community’s strategic development needs and uphold our environmental standards.\nWe, as local councillors, have arranged a meeting with residents on Saturday, the 15th of February, to prepare for the mediation and also take any questions. We take pride in our green spaces, which are essential for recreation and community gatherings. Let's ensure that our hard-won quality of life in Tattenhoe is not sacrificed for hasty development plans that fail to consider our residents' best interests.\nJoin us in saying no to the waste tip in Tattenhoe!",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_cdn-cgi_l_email-protection/content_22.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_unauthorised-encampments-0/content_28.html": "There has been a recent increase of unauthorised encampments in Milton Keynes, which is becoming a significant issue. From January to August 2023, there have been a total of 73 unauthorised encampments in Milton Keynes, including some spotted in Oxley Park, which took some time to remove from the redways. The responsibility to disperse these illegal encampments falls under Milton Keynes City Council's jurisdiction (MKCC).\nTo address this problem, we have held meetings with various parties, such as Thames Valley Police, MPs, the Police Crime Commissioner for Thames Valley, and council officers. We have also started a petition on unauthorised encampments, which we will present to the council this Wednesday, the 13th September 2023. Cllr Verma will speak on our behalf, and I will pose a question to the leader of the council.\nOn Friday, 8th September, we received news via Councillors news that Milton Keynes City Council will be signing up to the joint protocol with Thames Valley Police. Additionally, the Shenley Brook End Parish has organised a resident meeting on the topic, which will take place on the 13th of September at 6 pm. Officers from MKCC Environment Crime team along with officers from Thames Valley Police will be present.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_cllr-shazna-muzammils-response-delegated-decision-shenley-park/content_40.html": "03rd October 2023\nThank you, Leader\nAnd to our residents, our sincere apologies for not being able to be there with you all today. I appreciate the council's response to the Supplementary Planning Document (SPD), as you have heard from the residents, there is much to commend.\nHowever, it's important to be clear with residents about what compliance with policy SD15 means. Your big message is the rejection of the SPD because the link road is non-compliant with policy SD15. What is not said is that compliance requires a grid road and grid road corridors, which is the very thing residents are opposed to. And for the avoidance of doubt, Cabinet Member Martin Gowans spelt this out clearly in his amendments to Aylesbury Vale’s policy D WHA001 in Dec 2019 DD, listed as background papers to tonight’s Decision.\nSo, to say you are supporting residents by rejecting the SPD is disingenuous. Residents feel this deeply and are disappointed.\nHowever, despite this, residents are taking a reasonable approach and are asking you to include in the draft what a grid road should look like, drawing on precedents for other grid roads in MK. I strongly support residents on this. They have brought these mitigations and I ask that these are fully considered and incorporated into your response.\nI agree that more clarity is needed on financial mitigations to compensate for the inevitable burden on MK health and council-delivered services – through e.g. S106 contributions - and these are covered adequately in the draft response. Points made about underestimation of school places provision are wholeheartedly supported as we have learnt through experience in Tattenhoe ward.\nI would like to highlight the importance of aligning with SD 15 B6 of Plan MK which it clearly states that technical work should be undertaken to comprehensively assess the traffic impacts of the development on the entire road network, including nearby town and district centres and adjoining rural areas. I urge the council to strengthen the SPD on the need to thoroughly evaluate traffic diversion from A421 through a joint study with MK. I draw your attention to significant comments raised by MK Highways on the outline planning application, which adds weight to this need.\nI want to emphasise the point made by residents that any changes to reduce the Green, which serves as a vital recreational area for our Kingsmead and Oxley Park residents, should be replaced and situated close to the residents. This is a requirement of policy L2. Tattenhoe Linear Park extension is much too far away.\nIn conclusion, while we acknowledge the council's response and happy that you are taking Mr Heath's comments on board, we also urge you to re-evaluate and take into account the concerns raised by all residents and adjoining parishes as well. Our primary focus should always be the well-being and quality of life of the taxpayers who are our residents and the ones we represent. Thank you.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_meet-man-behind-international-women-and-girls-strategy/content_47.html": "It was an honour to meet James Cleverly the man behind the “International Women and Girls Strategy”.\nAs someone who has personally experienced the challenges of fighting for her own education after being forced into marriage, Shazna cannot help but feel an immense sense of pride for the incredible efforts being made to foster global partnerships that prioritise girls' education and combat the prevalence of early marriages.\nIt is truly remarkable that he chose to launch it in Bo, Sierra Leone, a place that holds a special significance for him as it is his mother's hometown.\nYou can read more about the strategy here:\nInternational women and girls strategy 2023 to 2030 - GOV.UK (www.gov.uk)",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_activist-group-leader-milton-keynes-conservative-group/content_58.html": "On May 5th, Cllr Shazna Muzammil was elected as the Conservative Group Leader by her colleagues. Now leading the Conservative group, which is the smallest opposition in the Council with only nine members, she embraces both honour and responsibility. The group is committed to representing every resident who voted for Conservative values on May 2nd, ensuring their voices are heard in the council.\nReflecting on her journey as a Conservative activist, councillor, Parliamentary candidate, and now Group Leader, Cllr Muzammil shared her thoughts:\n\"I'm filled with immense gratitude for the support and inspiration that helped me reach this point. It all began with a passion for serving my community and driving real change in people's lives,\" said Cllr Muzammil.\nHer political journey was fueled by a deep-seated frustration with the status quo. \"As an Appropriate Adult volunteering in custody, I witnessed firsthand the shortcomings of our system. Young people were slipping through the cracks, waiting endlessly for support that never seemed to arrive. It was a cycle of frustration and hopelessness, and I knew that if I wanted to make a real difference, I needed to be on the inside, fighting for change,\" she explained.\nCllr Muzammil is fortunate to lead a group of seasoned councillors, each bringing a wealth of diverse skills and experiences. \"We will work tirelessly always to champion our residents' concerns and deliver what our residents want. Losing good councillors was disappointing, but we will support them in their ongoing dedication to serving their communities,\" she added.\nIt was a significant honour for Cllr Muzammil to be invited to No. 10 Downing Street and share her first words as Group Leader. \"In Milton Keynes, we've demonstrated time and again what can be accomplished with the right strategy, focus, and, of course, a lot of hard work. Our recent local elections are a testament to this. We not only reclaimed two wards we had lost in 2023, but we also saw our vote share increase across the board. With our vote share hovering at around 32%, and Labour's at just 35%, we're practically within arm's reach of victory come the General Election. This is just the beginning of what we can achieve, and I am immensely proud of our team's efforts,\" she stated.\nHer focus for the year ahead is clear – to use her position to support and nurture the growth of her group. However, she is aware of the unique challenges they'll face as the smallest opposition. \"With the support of the CCA and the exceptional team in Milton Keynes, I'm confident that we can overcome these challenges and cultivate and train a formidable cohort of candidates in preparation for the all-outs in 2026,\" she affirmed.\nThe next year will be challenging, but the united group remains committed to prioritising the needs of their residents above all else. Cllr Muzammil's journey has been marked by empowerment, support, and growth, and she is determined to encourage and support future Conservative leaders who will continue to fight for their values and make a positive difference in their communities.",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_news_devolution-labours-political-games-could-cost-milton-keynes-millions/content_42.html": "Political meddling by Cllr Pete Marland, Labour Leader of Milton Keynes City Council, is risking millions of investment into Milton Keynes and the wider region, says the Conservative Group Leader Cllr Shazna Muzammil.\nCllr Muzammil has accused Cllr Marland of deliberately undermining the potential South Midlands devolution deal, jeopardising the millions of investment and enhanced control over local services that a Mayoral Strategic Authority would provide.\nThis accusation comes after the Labour Leader’s sudden U-turn to exclude the Northamptonshire authorities from the proposal, jeopardising the whole transformational programme aimed at benefitting the region.\nGroup Leader Cllr Muzammil has criticised the Labour leader’s actions as “reckless political opportunism’ particularly targeting Cllr Pete Marland and his fellow Labour Leader Cllr Hazel Simmons, of Luton Borough Council, for withdrawing their support and attempting to exclude the Conservative-led Northamptonshire authorities out at this late and critical stage.\nShe raises that it will be the residents of Milton Keynes, Bedfordshire, Luton and Northampton that will pay the price for this ‘shameless gameplaying’ as a lack of consensus threatens the whole project and thus risks access to the significant investment and transfer of services to local control that comes with a devolution deal.\nSignificantly, Mayoral Strategic Authorities receive long term investment funds to drive growth and fund strategic priorities such as investment in infrastructure, transport and healthcare. For example, the East Midlands Mayoral Combined County authority received an investment fund of £38 million per year for 30 years under their devolution agreement and has used funds to invest in projects such as Clean Energy Supercluster, regeneration projects within Derby City and new highways infrastructure.\nIt would be ‘baffling, short-sighted and incredibly damaging’ says Cllr Muzammil to lose out on the opportunity to access such for transformational investment for our region.\nThe originally proposed Strategic Authority, with an appointed Mayor, was intended to include Milton Keynes City Council, Bedford Borough Council, Central Bedfordshire Council, Luton Borough Council alongside West Northamptonshire Council and North Northamptonshire Council. But, with the Government clearly pushing for an elected Mayor within devolved authorities, giving residents the democratic power to choose their leader, Cllr Marland’s position has flipped.\nCllr Shazna Muzammil argues that the original makeup of the proposed mayoral strategic authority ‘makes absolute sense’ considering the historic partnership of all the authorities including as board members of SEMLEP from 2011-2024, members of the Central Area Growth Board from 2018-24 until it was replaced by the South Midlands Authorities board that exists today. This successful collaboration has resulted in sustainable economic growth across the region, delivering projects such as the South Midlands Growth Hub, which has provided business support, mentoring and a variety of workshops to over 700 businesses, with nearly 200 jobs created through their grant schemes.\nCllr Shazna Muzammil, Conservative Group Leader, finished:\n“Cllr Marland needs to put residents first. His sudden U-turn on including Northamptonshire in a devolution deal is political opportunism at its worst. For over a decade, we’ve worked closely with Northamptonshire—sharing transport, health, and economic ties. Why would anyone want to fracture those relationships—especially when only weeks ago, he fully supported their involvement? Breaking that partnership now is a betrayal of everything devolution could achieve for Milton Keynes.\n“Why is the Labour council taking residents needs for granted? Devolution isn’t about Labour’s political ambitions; it’s about providing real benefits for residents. We need to back proposals that deliver for all of us, not rushed plans designed to serve narrow political interests. Milton Keynes residents deserve better, and they should be prioritised above all else.”\nSee coverage by BBC below\nLabour and Tories divided over city devolution bid - Amy Holmes BBC political reporter, Milton Keynes",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk/content_1.html": "MK Conservatives, Pledges to Challenge MK Labour’s Reckless Expansion Plans\nCONSERVATIVES PLAN IS WORKING. WE ARE DELIVERING FOR YOU\nTo read more about it follow the link below:\n1. Tackling the cost of living\n2. Keeping our streets safe\n3. Boosting our NHS\n4. World-class education",
  "https_www_shaznamuzammil_org_uk_/https_www_shaznamuzammil_org_uk_campaigns/content_2.html": "Say No to the Waste Tip in Tattenhoe! As the voice of the Tattenhoe community, we must stand together against the proposed fast-tracking of a new Household Waste Recycling Centre on Snelshall Street...\nSay No to Doubling Parking Charges in Central Milton Keynes! The Labour administration of Milton Keynes City Council is poised to impose steep increases on parking charges in central Milton Keynes, hitting residents and...\nUnlocking Opportunities: Bridging the Gap for Looked-After Children in Milton Keynes In the city of Milton Keynes, nearly 400 Looked-after Children (LAC) are under the care of dedicated foster parents and the local council. These young...\nPetition: Unauthorised encampments Milton Keynes is facing a serious problem – unauthorised encampments are on the rise. As of August 2023, we have had 73 unauthorised encampments in Milton...\nSave Kingsmead Green Residents and their children have used Kingsmead Green as a safe location for recreation and family get-togethers. Many locals are frustrated because the...\nSupporting Local Police in Combating ASB and Criminal Activities n today's fast-paced world, ensuring the safety and security of our communities has become more crucial than ever. One of the key pillars in maintaining law and...\nYouth: Education and Aspirations Empowering Women and Inspiring Youth: This is a Local Campaign for Political Engagement In a society that thrives on diversity and inclusivity, it is crucial to...\nCombatting litter with the community As someone who is deeply passionate about keeping our communities clean and beautiful, I have taken it upon myself to organise regular community litter picks in...\nReducing speed limit to 20MPH in Oxley Park I am proposing that the speed limit on Harlow Crescent, Hepburn Crescent and Fonda Meadows be lowered to 20 mph and that additional pavement pedestrian safety..."
}