{
  "http_concordia503_wordpress_com/http_concordia503_wordpress_com_2016_03_31_concordia/content_16.html": "Promoting Harmony between Market, State, Organisation and Individual.\nThe purpose of this party is to re-establish the true role of government tax and spend. Democracy has distorted its purpose. Popularity has become a pre-requisite to electoral success. The need to be popular has led politicians to take credit for things they did not do. Such as creating a booming economy. As soon as they took credit for the boom they also accepted responsibility for the inevitable bust. The position of the voters was simple, if the politicians enabled full employment and the economy to boom once then they can do it again. Except of course they never enabled the boom; it just happened. Before the boom and during the boom tax and spend was used to overcome market failure to eradicate inequality. Tax and spend wasn’t pro-active it was reactive. It wasn’t used to lead, drive or grow the economy. It was used to supplement the markets. When markets fail to supply enough essential goods and services the poor are priced out of the market and inequality occurs. The state reacted to the market’s failure to supply essential goods and services. The state supplemented the markets. These supplements only supplied essential goods and services. These supplements only ever made up the short fall. They never interfered with or distorted the markets. They were state owned and state run. Yes these supplements represented an increase in supply. Yes this increase in supply was recorded as economic growth. Yes this economic growth contributed to the boom. But when the bust came, it wasn’t the supplements which shrank; it was the markets. If anything the supplements had to be increased to counter the increases in market failure. This is how the supplements became the means of fulfilling this new unplanned responsibility of growing the economy. Money was borrowed and pumped into the supplements to buoy up the economy. This made them inefficient so they were sold off in the name of efficiency. Unfortunately the subsidies and incentives which are being paid out to make these supplements appear profitable and therefore worth investing in; make them inefficient and unsustainable. Decades of government led growth has been financed with debt. The Tories have cut services to the bone and yet the debt continues to grow. We need change; not cuts. We must accept that the Government is not responsible for leading, driving or growing the economy. Tax and spend should only be used for overcoming market failure, to eradicate inequality, by supplementing the markets, with state owned and state run supply chains. We should put an end to contracting out government services, stop paying out subsidies, stop handing out tax breaks and other incentives and move to a low tax mixed economy.\nConcordia is a centre ground political party. We don’t help the rich at the expense of the poor. We don’t help the poor at the expense of the rich. We overcome market failure, to eradicate inequality, by supplementing the markets.\nContact us: concordiaengland@yahoo.com\nHead Office Concordia, 318 Wood Lane, Dagenham, Essex,RM9 5TB.\nOur Government Serves Its own interests and fails both the Economy and Society.\nOur Government prioritises capitol over labour. The writing down allowance enables investors to recoup most if not all of their investment before the pay any tax. The writing down allowance distorts investment strategies. Investments are structured around the tax system and not tailored to market conditions. Volatile short term investments are favoured over the stabilising long term investments. There is no reason to give tax breaks to investors to encourage them to invest. Investors don’t need encouragement as they have already decided to invest; they just need to find the right investment opportunity for them. Government incentives discourage investors from looking for the right investments. Tax breaks, financial incentives and government subsidies are used to underwrite commercial risks. They steer investors away from genuine market investments and towards Government sponsored projects. Getting the markets to fulfil the Government’s agenda leads to many investment opportunities which have real potential for sustainable growth to be missed. Risk is the cutting edge which enables economic growth. It is the personal agency of investors mitigating the risks of their investments which leads to innovation. It is the exploitation of innovation which leads to growth. Necessity is the mother of invention. Risk is the mother of innovation. Tax breaks are the grim reaper of sustainable growth.\nStop giving tax breaks and we will rebalance our economy. Investments will be made in accordance with the risks of market conditions. We will start investing in people as well as technology, property and equipment. We will invest for the long term as well as the short and medium terms. We must end all tax allowances, subsidies and incentives, set corporation tax, capitol gains tax, income tax and VAT at the same rate. Enable every individual to develop their talents into a resource. Make the minimum wage a living wage which allows full time workers to keep rooves over their heads, put food on their tables and make their contributions to the public purse. So that every body contributes and nobody gets a free ride.\nConcordia is a centre ground political party. We don’t help the rich at the expense of the poor. We don’t help the poor at the expense of the rich. We overcome market failure to eradicate inequality by supplementing the markets.\nContact us: concordiaengland@yahoo.com\nHead Office: 318 Wood Lane, Dagenham, Essex, RM9 5TB.\nReform of the House of Lords has Subverted the House of Commons.\nDemocracy cannot be doubled but it can be split. Having a fully elected second chamber will split our democracy. Britain is a market economy, built by capitol and labour, moulded by organisations and individuals, represented in the Lords and in the Commons. Except with the political selection of peers the Lords no longer represent the interests on capitol and organisations. So the capitol investors and the organisations have subverted the House of Commons. The Commons now represents the interests of businesses, of charities and other lobbying organisations. So the people no longer have any representation in Parliament. The House of Lords does try to represent the people but they are only a revising chamber. All challenges to government reform by the Lords are easily brushed aside. We make laws to benefit the people. We revise laws to accommodate the needs of organisations. So the people should be represented in the more powerful chamber which writes the laws and organisations should be represented in the revising chamber. Political reform needs to re-establish the House of Lords as a fully unelected chamber with none of the peers appointed by the political parties. So that this chamber represents the interests of capitol and organisations at a level which reflects their value to our society. Only then will the organisations release their grip on the members in the Commons and only then will the people have a voice and be genuinely represented in Parliament. The Liberals have been trying to reform the House of Lords for more than one hundred years. That is one hundred years of gradual movement in the wrong direction. This issue of reform will only be resolved if we approach it from a completely new perspective.\nConcordia is a centre ground political party. We don’t help the rich at the expense of the poor. We don’t help the poor at the expense of the rich. We overcome market failure to eradicate inequality by supplementing the markets.\nContact us: concordiaengland@yahoo.com\nHead Office: 318 Wood Lane, Dagenham, Essex, RM9 5TB.",
  "http_concordia503_wordpress_com/http_concordia503_wordpress_com_2016_03_31_first-blog-post/content_19.html": "This is your very first post. Click the Edit link to modify or delete it, or start a new post. If you like, use this post to tell readers why you started this blog and what you plan to do with it.\nThis is your very first post. Click the Edit link to modify or delete it, or start a new post. If you like, use this post to tell readers why you started this blog and what you plan to do with it.",
  "http_concordia503_wordpress_com/http_concordia503_wordpress_com_2017_10_05_an-epidemic-of-self-doubt-amongst-the-so-called-political-elite/content_22.html": "There is a narrative which has been adopted by politicians from both the left and the right. A narrative which purports that the electorate has re-polarised, that the centre ground has become broader and more barren. The only part which is accurate is that the centre ground is now barren. The Liberal Democrats lost all credibility when their participation in the Coalition Government of 2010-2015 exposed their complete lack of political conviction. As for UKIP they are a one issue party. So now that they have delivered on that issue; there is no longer any reason to vote for them. And as for the Scottish Nationalist Party much of their success in 2015 was due to the collapse of Scottish Labour in that year. The resurgence of Scottish Labour is due to Jeremy Corbyn moving the Labour Party to the left. This does not mean that the electorate has moved to the left. Scottish and Welsh Labour have always been further to the left than their English counterparts.\nNo the British Electorate has not changed its stance. The main reasons their voting patterns changed in 2017 is twofold. Firstly there is no longer a credible party in the centre ground to vote for and there is no where for the anti-establishment/protest vote to go. So there were many voters with no real political allegiance which brought the second factor into play: the campaigns. Labour’s anti austerity campaign proved to be more alluring the Conservative’s increased austerity campaign. So as the floating vote drifted left the Conservative fear campaign activated the apathetic voters. People who don’t normally vote and who never vote for anything but occasionally vote against things came out to prevent a socialist labour government from being formed.\nThis misconception about the re-polarised electorate has been orchestrated by political extremists from both the left of the Labour Party and from the right of the Conservative Party. And as we have heard during this conference season they have dominated the agendas of both conferences. The social reformists within the Labour Party apparently no longer have anything to say. And the Liberals within the Conservative Party did not even attend their own party’s conference. Politics is all about leadership and leadership requires conviction. If you intend to lead a nation and spend billions of pounds of tax payers money in the process then you need to be absolutely certain that you are leading in the right direction. What we are witnessing amongst the so called political elite is an epidemic of self doubt. The only people still talking are those who are spouting the political philosophies of the past. Political philosophies which have been tried, which have been tested and which have been seen to fail. Austerity was proved to be wrong by John Maynard Keynes between the wars. Socialism has had a significantly negative impact on every society it has had the opportunity to influence. The extremists have successfully framed the debate as market versus state. Even though all the astute people know that the way forward is market plus the state. The real debate is about where the line between market and state is drawn. As it is the drawing of this line which determines the remit of the state but we must first determine the remit of the state to enable us to draw the line.\nFirst we must accept that the remit of the state is to overcome market failure to eradicate inequality. Then we can turn our attention to understanding what market failure actually is and how it causes inequality. We know that if a market is over supplied then prices fall and so do profits. We also know that the opposite is true when markets are under supplied prices rise and so do profits. Markets do not have a social conscience. They are not interested in need they only respond to demand. So all markets have a built in bias to under supply, and that bias is strong. It will over whelm any socioeconomic policy that challenges it. The evidence is absolutely clear if we are to reap the benefits of market economics then we have to let the markets be true to themselves. This means that we accept that the bias cannot be changed so we dismantle all current government policies which are trying to challenge the bias. We remove all state subsidies, all state incentives all tax breaks and all punitive taxes. The State ceases to try and influence how any body spends or earns money. When all this is removed risk will draw the line between market and state. The markets will decide how much they will supply and therefore how much they will fail to supply. The markets will never risk investing in the expansion of production to supply to people who cannot afford their products.\nSo the state must take on those risks and supply to the people who have been priced out of the market. But they must do it in such a way that they do not distort the markets. The line between market and state must remain thin crisp and un-blurred. Therefore all government contracts must be brought back in house and all agency staff working in the state sector must be directly employed by the state. If the state over supplies it will be competing with the markets which will distort them and blur the line. The same would happen if the state supplied products that there was no need for them to supply. Understanding market failure and how it causes inequality is key to distinguishing market activity from state activity. Market failure is an integral part of the market system and in the main only reflects choice. But when the markets fail to supply enough essential goods and services to fulfil all of society’s needs those who are priced out of the market are forced to decide which of life’s essentials they must go without. Anyone facing this choice through no fault of their own is subject to systemic inequality directly caused by market failure. So the market’s failure to supply essential goods and services is the cause of inequality. So if the state is to fulfil its remit of over coming market failure to eradicate inequality it must only supply essential goods and services and it must only make up the short fall. And they must do it with state owned and state run supply chains.\nThis type of economy has been described in the past as a mixed economy, but labels are important and this was a bad label. It implied that both elements of the economy operated in a similar way and could be combined in a seamless way. It was not clear where one ended and the other one began. This vagueness created a massive opportunity for commercial enterprizes to exploit the British tax payer. This exploitation caused the fall in Britain’s international competitiveness and the greater part of our huge public debt. The right label is twin economy. This label enables all to appreciate how distinctly different the two economic processes are in both make up and objective. Maintaining that distinction will be the means that future tax payers must use to protect their contributions from the exploitations of commercial enterprizes.",
  "http_concordia503_wordpress_com/http_concordia503_wordpress_com_2017_06_08_election-day-2017/content_20.html": "Right from the outset of this General Election the Conservatives have tried to make it a contest between leaders. They thought that if they could keep the focus on Jeremy Corbyn and his uncompromising and dubious brand of ethics they would be able to sneak their excessively austere manifesto through without any scrutiny. A manifesto that if elected would give them a mandate to financially penalise dementia sufferers. A mandate to take from everyone. To take food away from the young. To take heat away from the elderly. And to take more money from the workers. Introducing the dementia tax, means testing the winter fuel allowance, restricting access to free school meals and paving the way for income tax rises and national insurance rises. They never managed to sneak it through without scrutiny but they will still probably get their mandate because the Labour alternative is just not viable.\nLabour didn’t produce a manifesto designed for the good of the country. This is a party steeped in the politics of envy. They are the pedlars of false hope. They produced a manifesto that would win them votes. Not enough votes to win the election. They are not trying to win the election. They are just trying to secure second place and in doing so secure the socialists grip on the Labour Party.\nIf we only see this election in the terms of who gets to form the next government then we miss an invaluable opportunity. There is a festering malignant force in British politics. Conservatism is that malignant force and Labour have become the barrier which blocks all remedies from reaching it. Conservatives divide the country; pitting haves against have nots implying that there can only be winners if there are also losers. By playing that game, choosing a side, representing the have nots Labour are reinforcing the divide.\nThe Conservatives are going to form the next government. Whether its a minority government, a government with a small majority or a government with a huge majority we still don’t know. What we do know is that no other party is in a position to form a government. This election really is about second place. Labour are too weak to win, too strong to die and too arrogant to change. This election needs to weaken Labour so that it will die. Only then can we remove the barrier to confront Conservatism with a viable alternative.",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com_category_uncategorized/content_3.html": "There is a narrative which has been adopted by politicians from both the left and the right. A narrative which purports that the electorate has re-polarised, that the centre ground has become broader and more barren. The only part which is accurate is that the centre ground is now barren. The Liberal Democrats lost all credibility when their participation in the Coalition Government of 2010-2015 exposed their complete lack of political conviction. As for UKIP they are a one issue party. So now that they have delivered on that issue; there is no longer any reason to vote for them. And as for the Scottish Nationalist Party much of their success in 2015 was due to the collapse of Scottish Labour in that year. The resurgence of Scottish Labour is due to Jeremy Corbyn moving the Labour Party to the left. This does not mean that the electorate has moved to the left. Scottish and Welsh Labour have always been further to the left than their English counterparts.\nNo the British Electorate has not changed its stance. The main reasons their voting patterns changed in 2017 is twofold. Firstly there is no longer a credible party in the centre ground to vote for and there is no where for the anti-establishment/protest vote to go. So there were many voters with no real political allegiance which brought the second factor into play: the campaigns. Labour’s anti austerity campaign proved to be more alluring the Conservative’s increased austerity campaign. So as the floating vote drifted left the Conservative fear campaign activated the apathetic voters. People who don’t normally vote and who never vote for anything but occasionally vote against things came out to prevent a socialist labour government from being formed.\nThis misconception about the re-polarised electorate has been orchestrated by political extremists from both the left of the Labour Party and from the right of the Conservative Party. And as we have heard during this conference season they have dominated the agendas of both conferences. The social reformists within the Labour Party apparently no longer have anything to say. And the Liberals within the Conservative Party did not even attend their own party’s conference. Politics is all about leadership and leadership requires conviction. If you intend to lead a nation and spend billions of pounds of tax payers money in the process then you need to be absolutely certain that you are leading in the right direction. What we are witnessing amongst the so called political elite is an epidemic of self doubt. The only people still talking are those who are spouting the political philosophies of the past. Political philosophies which have been tried, which have been tested and which have been seen to fail. Austerity was proved to be wrong by John Maynard Keynes between the wars. Socialism has had a significantly negative impact on every society it has had the opportunity to influence. The extremists have successfully framed the debate as market versus state. Even though all the astute people know that the way forward is market plus the state. The real debate is about where the line between market and state is drawn. As it is the drawing of this line which determines the remit of the state but we must first determine the remit of the state to enable us to draw the line.\nFirst we must accept that the remit of the state is to overcome market failure to eradicate inequality. Then we can turn our attention to understanding what market failure actually is and how it causes inequality. We know that if a market is over supplied then prices fall and so do profits. We also know that the opposite is true when markets are under supplied prices rise and so do profits. Markets do not have a social conscience. They are not interested in need they only respond to demand. So all markets have a built in bias to under supply, and that bias is strong. It will over whelm any socioeconomic policy that challenges it. The evidence is absolutely clear if we are to reap the benefits of market economics then we have to let the markets be true to themselves. This means that we accept that the bias cannot be changed so we dismantle all current government policies which are trying to challenge the bias. We remove all state subsidies, all state incentives all tax breaks and all punitive taxes. The State ceases to try and influence how any body spends or earns money. When all this is removed risk will draw the line between market and state. The markets will decide how much they will supply and therefore how much they will fail to supply. The markets will never risk investing in the expansion of production to supply to people who cannot afford their products.\nSo the state must take on those risks and supply to the people who have been priced out of the market. But they must do it in such a way that they do not distort the markets. The line between market and state must remain thin crisp and un-blurred. Therefore all government contracts must be brought back in house and all agency staff working in the state sector must be directly employed by the state. If the state over supplies it will be competing with the markets which will distort them and blur the line. The same would happen if the state supplied products that there was no need for them to supply. Understanding market failure and how it causes inequality is key to distinguishing market activity from state activity. Market failure is an integral part of the market system and in the main only reflects choice. But when the markets fail to supply enough essential goods and services to fulfil all of society’s needs those who are priced out of the market are forced to decide which of life’s essentials they must go without. Anyone facing this choice through no fault of their own is subject to systemic inequality directly caused by market failure. So the market’s failure to supply essential goods and services is the cause of inequality. So if the state is to fulfil its remit of over coming market failure to eradicate inequality it must only supply essential goods and services and it must only make up the short fall. And they must do it with state owned and state run supply chains.\nThis type of economy has been described in the past as a mixed economy, but labels are important and this was a bad label. It implied that both elements of the economy operated in a similar way and could be combined in a seamless way. It was not clear where one ended and the other one began. This vagueness created a massive opportunity for commercial enterprizes to exploit the British tax payer. This exploitation caused the fall in Britain’s international competitiveness and the greater part of our huge public debt. The right label is twin economy. This label enables all to appreciate how distinctly different the two economic processes are in both make up and objective. Maintaining that distinction will be the means that future tax payers must use to protect their contributions from the exploitations of commercial enterprizes.",
  "http_concordia503_wordpress_com/http_concordia503_wordpress_com_2017_05_28_a-brexit-and-post-brexit-election/content_7.html": "This General Election isn’t simply about changing the Government because the Conservatives will win the most seats. This General Election isn’t just about Brexit; that was decided on June 23rd 2016. Brexit negotiations do not require a strong Government but a strong Parliament. Brexit negotiations require a leader who believes in Brexit, who believes that Brexit is good for Britain with or without a trade deal with the EU. A hung Parliament could bring another change in Tory leadership. It could give us a brexiteer as prime minister.\nThis General Election is about what happens after Brexit. Its about how we want our society to be governed. For the past four and a half decades British politicians have been constricted to the centre ground; reduced to tinkering with things of lesser importance. Post Brexit we write our own laws, set our own taxes and enforce our own immigration policies. Post Brexit Labour will veer sharply to the left and the Conservatives will make a mad dash to the right. The centre ground will be deserted. We will be left with nothing but the politics of extremists; partisan politics on steroids.\nThe Conservatives only represent the part of society who earn all or most of their income from investments. Their priority is to ensure that capital always earns faster than labour. Their policies do not enhance the earning potential of investments, instead they hinder the earning potential of labour. This will come in the form of a Government led squeeze on wages.\nLabour who claim to represent those who earn most or all of their income from their labour will attempt another economically disastrous transfer of wealth through the benefit system. We still haven’t started paying off the bill of their last disaster. Seven years of austerity and we have only been paying interest. We have been servicing the debt whilst we continue to borrow more.\nThe Conservatives are the pioneers of partisan politics. They have set the political agenda ever since we have had universal suffrage. Labour have been shaped by their opposition to conservatism. We do not need an opposition to conservatism we need an alternative to conservatism and that also means an alternative to partisan politics.\nThis General Election is about forging an alternative to conservatism. The Labour Party is too weak to win, too strong to die and too arrogant to change. This General Election is about challenging the arrogance of the Labour Party; either forcing it to change or weakening it so it will die.\nThe democratic process tends to maintain focus on the here and now rarely looking back beyond the last General Election. Yet we all know that the issues which we face today are the issues that previous governments failed to deal with effectively and these failures have only made these issues worse. To understand these failures we need to briefly go back to the Labour Governments of the 1960s when Harold Wilson transferred wealth through the benefit system. In 1972 Edward Heath transferred that wealth back through his housing bill. This bill obliged councils to house the homeless immediately. These homeless were not living on the streets. They were mainly young adults living in the family home. This policy enabled these young adults to rent privately even if they could not afford the rent with councils making up the shortfall. In a bid to save money councils down graded the role of a council house from a reward to a right. People no longer had to show that they could afford to pay rent for a council house they merely had to show they needed a home. As a reward councils houses acted as a ladder out of poverty. Not within a generation but for the next generation. Down grading the role of the council house marked the beginning of the benefits culture and an end to social mobility in this country. With council houses now devalued in the public’s eye Margaret Thatcher was able to sell them off with huge public subsidies. A Tory policy which lasted for eighteen years only for it to be adopted as a Labour policy. A Labour policy which further reduced the social housing stock in this country by 400,000 homes in thirteen years.\nThose same thirteen years saw another transfer of wealth this time via tax credits. Tax credits which encouraged people to get a job, any job, any low paid job. There is no need to worry whether it covers all your bills because tax credits will make up the shortfall. No need to do any over time or take on further training, or to take on any extra responsibilities. In fact you can just sit there on the bottom rung of the employment ladder and the Labour Government will sort everything else out on your behalf. Such as the mass youth unemployment which occurred because they could not get their foot on the first rung of the employment ladder. Or the increasing skills shortage which occurred because tax credits actively discouraged workers from developing their work skills. The Labour Government simply solved the skill shortage with immigration and to solve mass youth unemployment they could grow the economy. All they had to do was deregulate the banks. This would enable banks to take more risks with other people’s money. So investments which were previously deemed as too risky could now be realised. Along with investments comes economic growth and jobs. So what if there is a financial crisis, a credit crunch and a huge deficit. Labour will just lose an election or two. The Tories will get in and embark on a programme of austerity Labour will blame the Tories for all the cuts and everyone will forget who caused the financial crisis.\nHere is a nice radical statement to challenge your political thinking. Governments do not, can not and never have run the economy. They have taken credit for the good times and inadvertently accepted responsibility for the bad times. They have intervened in markets and hindered the economy but they have never run the economy. The reality is that there are only two driving forces in the economy and they both have names which people feel uncomfortable referring to. All economic activity is driven by either need or greed. There are of course an infinite number of drives which drive us as individuals but there are only two factors which encourage us to harness our passions into economic activity and they are need and greed.\nWe all have needs and if we are able to fulfil those needs then no negative connotations are attached to the term need. We all like nice things, we all want to thrive and not just to survive. If we pursue economic activity beyond our needs then that activity is referred to as greed. In this context there is still no reason to attach negative connotations. Market failure is the source of the negative connotations. Over supply a market and the price falls and so do profits. Under supply a market and the price rises and so do profits. All profitable markets have a bias to under supply. Often when markets under supply it merely reflects choice. But nobody chooses to go without essential goods and services. So when the markets fail to supply enough essential goods and services for everyone the price rises and the poor are priced out of the market. This is the true definition of inequality. So when needs are unfulfilled and greed continues to prosper negative connotations are attached to both need and greed.\nThe real issue is the market’s failure to supply enough essential goods and services for all. Therefore the sole purpose of government tax and spend is to overcome market failure to eradicate inequality. For decades we have had to choose between Labour giving more money to the needy with the intention of enabling them to price themselves back into the market. Or the Tories paying out subsidies and incentives to suppliers to encourage them to increase supply. Neither of these approaches have achieved any degree of success. They both fail to understand the fundamental nature of markets; over supply a market and the price falls and so do profits, under supply a market and the price rises and so do profits. Incentivising or subsidizing a market does not change this bias. And as for Labour’s approach of increasing demand without increasing supply that is a formula for replicating the bias.\nThe only way to eradicate inequality by overcoming market failure is to supplement the markets. The solution has to be activated from outside the market system and away from the bias. The solution requires state owned and state run supplements to the market which do not interfere or compete with the market in anyway.\nThis is why Concordia will compulsory purchase all schools and hospitals which were financed under the private finance initiative. And why Concordia will bring all free schools, academies and part funded schools under the control of local education authorities. And why Concordia will end all discounts on right to buy social housing enabling councils to once again build council housing. Putting an end to our housing crisis, re-establishing the council house’s role as a reward and enabling social mobility.\nConcordia is a social reformist party. We proudly occupy the centre ground of English politics out of political conviction and not from compromise. We believe that the sole purpose of government tax and spend is to eradicate inequality by overcoming market failure. We do not believe that the Government should use the tax system to influence the behaviour of individuals or the markets in any way. We oppose all attempts by the state to run, drive or steer the economy. Using tax payer’s money to reward one type of behaviour and penalise another type of behaviour is morally wrong and detrimental to both our economy and our society. Paying out subsidies and incentives, and awarding tax breaks is the process that governments use to underwrite commercial risk with tax payer’s money. This also includes in work benefits which are really a wage subsidy paid to help investors. Politicians do not understand that risk is the cutting edge that enables growth. With the inheritance of wealth comes the burden of responsibility. The responsibility to ensure that when you pass your wealth on to the next generation it is worth at least as much in real terms as what you inherited. Most investors are reluctant investors. They are not trying to make a fortune; they are trying not to lose a fortune. It is the proactive nature of investors mitigating risk that leads to innovative ideas being realised. All sustainable growth stems from innovation. Take away the risk and you take away the proactive nature of investors and most of the innovative ideas are left on a shelf collecting dust as a missed opportunity. Concordia will oppose tax payer’s money being used to underwrite commercial risk in all its forms and guises.\nIf there is no social reformist option on the ballot paper then no one can vote for it. The Conservatives, the Liberals, the Socialists and the Trade Unionists have all made concerted efforts to keep the Social Reformists off of the ballot paper. The Conservatives under Edward Heath and Margaret Thatcher set out to dismantle all that the social reformists had built. They were always mindful to refer to them as socialists and never to acknowledge them as social reformers so as to expunge their record and all memory of them, tarring them with the same brush as the socialists; rewriting their history as the opposers of capitalism, the transferers of wealth and the builders of a centralised economy. Hounded out of the Labour Party they formed the SDP. Unwilling to share the centre ground with another party the Liberals duped them into first forming an alliance and then merging with the Liberal Party to form the Liberal Democrats. Then they were systematically marginalised with futile, leaderless, grass roots, bottom up, evidence based policy making. The politics of protest NIMBYISM on a nationwide scale, not in my back yard not in anyone’s back yard. There was no refuge for the politics of conviction in a self interest only party. The Social Reformist option had been completely removed from the ballot paper. That was over twenty five years ago. Now we have the Tories moving to the right, Labour moving to the left the voters deserting the Lib Dems; the centre ground is empty. Now is the time for the Social Reformists to regroup and take the centre ground.",
  "http_concordia503_wordpress_com/http_concordia503_wordpress_com/content_1.html": "There is a narrative which has been adopted by politicians from both the left and the right. A narrative which purports that the electorate has re-polarised, that the centre ground has become broader and more barren. The only part which is accurate is that the centre ground is now barren. The Liberal Democrats lost all credibility when their participation in the Coalition Government of 2010-2015 exposed their complete lack of political conviction. As for UKIP they are a one issue party. So now that they have delivered on that issue; there is no longer any reason to vote for them. And as for the Scottish Nationalist Party much of their success in 2015 was due to the collapse of Scottish Labour in that year. The resurgence of Scottish Labour is due to Jeremy Corbyn moving the Labour Party to the left. This does not mean that the electorate has moved to the left. Scottish and Welsh Labour have always been further to the left than their English counterparts.\nNo the British Electorate has not changed its stance. The main reasons their voting patterns changed in 2017 is twofold. Firstly there is no longer a credible party in the centre ground to vote for and there is no where for the anti-establishment/protest vote to go. So there were many voters with no real political allegiance which brought the second factor into play: the campaigns. Labour’s anti austerity campaign proved to be more alluring the Conservative’s increased austerity campaign. So as the floating vote drifted left the Conservative fear campaign activated the apathetic voters. People who don’t normally vote and who never vote for anything but occasionally vote against things came out to prevent a socialist labour government from being formed.\nThis misconception about the re-polarised electorate has been orchestrated by political extremists from both the left of the Labour Party and from the right of the Conservative Party. And as we have heard during this conference season they have dominated the agendas of both conferences. The social reformists within the Labour Party apparently no longer have anything to say. And the Liberals within the Conservative Party did not even attend their own party’s conference. Politics is all about leadership and leadership requires conviction. If you intend to lead a nation and spend billions of pounds of tax payers money in the process then you need to be absolutely certain that you are leading in the right direction. What we are witnessing amongst the so called political elite is an epidemic of self doubt. The only people still talking are those who are spouting the political philosophies of the past. Political philosophies which have been tried, which have been tested and which have been seen to fail. Austerity was proved to be wrong by John Maynard Keynes between the wars. Socialism has had a significantly negative impact on every society it has had the opportunity to influence. The extremists have successfully framed the debate as market versus state. Even though all the astute people know that the way forward is market plus the state. The real debate is about where the line between market and state is drawn. As it is the drawing of this line which determines the remit of the state but we must first determine the remit of the state to enable us to draw the line.\nFirst we must accept that the remit of the state is to overcome market failure to eradicate inequality. Then we can turn our attention to understanding what market failure actually is and how it causes inequality. We know that if a market is over supplied then prices fall and so do profits. We also know that the opposite is true when markets are under supplied prices rise and so do profits. Markets do not have a social conscience. They are not interested in need they only respond to demand. So all markets have a built in bias to under supply, and that bias is strong. It will over whelm any socioeconomic policy that challenges it. The evidence is absolutely clear if we are to reap the benefits of market economics then we have to let the markets be true to themselves. This means that we accept that the bias cannot be changed so we dismantle all current government policies which are trying to challenge the bias. We remove all state subsidies, all state incentives all tax breaks and all punitive taxes. The State ceases to try and influence how any body spends or earns money. When all this is removed risk will draw the line between market and state. The markets will decide how much they will supply and therefore how much they will fail to supply. The markets will never risk investing in the expansion of production to supply to people who cannot afford their products.\nSo the state must take on those risks and supply to the people who have been priced out of the market. But they must do it in such a way that they do not distort the markets. The line between market and state must remain thin crisp and un-blurred. Therefore all government contracts must be brought back in house and all agency staff working in the state sector must be directly employed by the state. If the state over supplies it will be competing with the markets which will distort them and blur the line. The same would happen if the state supplied products that there was no need for them to supply. Understanding market failure and how it causes inequality is key to distinguishing market activity from state activity. Market failure is an integral part of the market system and in the main only reflects choice. But when the markets fail to supply enough essential goods and services to fulfil all of society’s needs those who are priced out of the market are forced to decide which of life’s essentials they must go without. Anyone facing this choice through no fault of their own is subject to systemic inequality directly caused by market failure. So the market’s failure to supply essential goods and services is the cause of inequality. So if the state is to fulfil its remit of over coming market failure to eradicate inequality it must only supply essential goods and services and it must only make up the short fall. And they must do it with state owned and state run supply chains.\nThis type of economy has been described in the past as a mixed economy, but labels are important and this was a bad label. It implied that both elements of the economy operated in a similar way and could be combined in a seamless way. It was not clear where one ended and the other one began. This vagueness created a massive opportunity for commercial enterprizes to exploit the British tax payer. This exploitation caused the fall in Britain’s international competitiveness and the greater part of our huge public debt. The right label is twin economy. This label enables all to appreciate how distinctly different the two economic processes are in both make up and objective. Maintaining that distinction will be the means that future tax payers must use to protect their contributions from the exploitations of commercial enterprizes.",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com_2017_05_28_a-brexit-and-post-brexit-election/content_5.html": "This General Election isn’t simply about changing the Government because the Conservatives will win the most seats. This General Election isn’t just about Brexit; that was decided on June 23rd 2016. Brexit negotiations do not require a strong Government but a strong Parliament. Brexit negotiations require a leader who believes in Brexit, who believes that Brexit is good for Britain with or without a trade deal with the EU. A hung Parliament could bring another change in Tory leadership. It could give us a brexiteer as prime minister.\nThis General Election is about what happens after Brexit. Its about how we want our society to be governed. For the past four and a half decades British politicians have been constricted to the centre ground; reduced to tinkering with things of lesser importance. Post Brexit we write our own laws, set our own taxes and enforce our own immigration policies. Post Brexit Labour will veer sharply to the left and the Conservatives will make a mad dash to the right. The centre ground will be deserted. We will be left with nothing but the politics of extremists; partisan politics on steroids.\nThe Conservatives only represent the part of society who earn all or most of their income from investments. Their priority is to ensure that capital always earns faster than labour. Their policies do not enhance the earning potential of investments, instead they hinder the earning potential of labour. This will come in the form of a Government led squeeze on wages.\nLabour who claim to represent those who earn most or all of their income from their labour will attempt another economically disastrous transfer of wealth through the benefit system. We still haven’t started paying off the bill of their last disaster. Seven years of austerity and we have only been paying interest. We have been servicing the debt whilst we continue to borrow more.\nThe Conservatives are the pioneers of partisan politics. They have set the political agenda ever since we have had universal suffrage. Labour have been shaped by their opposition to conservatism. We do not need an opposition to conservatism we need an alternative to conservatism and that also means an alternative to partisan politics.\nThis General Election is about forging an alternative to conservatism. The Labour Party is too weak to win, too strong to die and too arrogant to change. This General Election is about challenging the arrogance of the Labour Party; either forcing it to change or weakening it so it will die.\nThe democratic process tends to maintain focus on the here and now rarely looking back beyond the last General Election. Yet we all know that the issues which we face today are the issues that previous governments failed to deal with effectively and these failures have only made these issues worse. To understand these failures we need to briefly go back to the Labour Governments of the 1960s when Harold Wilson transferred wealth through the benefit system. In 1972 Edward Heath transferred that wealth back through his housing bill. This bill obliged councils to house the homeless immediately. These homeless were not living on the streets. They were mainly young adults living in the family home. This policy enabled these young adults to rent privately even if they could not afford the rent with councils making up the shortfall. In a bid to save money councils down graded the role of a council house from a reward to a right. People no longer had to show that they could afford to pay rent for a council house they merely had to show they needed a home. As a reward councils houses acted as a ladder out of poverty. Not within a generation but for the next generation. Down grading the role of the council house marked the beginning of the benefits culture and an end to social mobility in this country. With council houses now devalued in the public’s eye Margaret Thatcher was able to sell them off with huge public subsidies. A Tory policy which lasted for eighteen years only for it to be adopted as a Labour policy. A Labour policy which further reduced the social housing stock in this country by 400,000 homes in thirteen years.\nThose same thirteen years saw another transfer of wealth this time via tax credits. Tax credits which encouraged people to get a job, any job, any low paid job. There is no need to worry whether it covers all your bills because tax credits will make up the shortfall. No need to do any over time or take on further training, or to take on any extra responsibilities. In fact you can just sit there on the bottom rung of the employment ladder and the Labour Government will sort everything else out on your behalf. Such as the mass youth unemployment which occurred because they could not get their foot on the first rung of the employment ladder. Or the increasing skills shortage which occurred because tax credits actively discouraged workers from developing their work skills. The Labour Government simply solved the skill shortage with immigration and to solve mass youth unemployment they could grow the economy. All they had to do was deregulate the banks. This would enable banks to take more risks with other people’s money. So investments which were previously deemed as too risky could now be realised. Along with investments comes economic growth and jobs. So what if there is a financial crisis, a credit crunch and a huge deficit. Labour will just lose an election or two. The Tories will get in and embark on a programme of austerity Labour will blame the Tories for all the cuts and everyone will forget who caused the financial crisis.\nHere is a nice radical statement to challenge your political thinking. Governments do not, can not and never have run the economy. They have taken credit for the good times and inadvertently accepted responsibility for the bad times. They have intervened in markets and hindered the economy but they have never run the economy. The reality is that there are only two driving forces in the economy and they both have names which people feel uncomfortable referring to. All economic activity is driven by either need or greed. There are of course an infinite number of drives which drive us as individuals but there are only two factors which encourage us to harness our passions into economic activity and they are need and greed.\nWe all have needs and if we are able to fulfil those needs then no negative connotations are attached to the term need. We all like nice things, we all want to thrive and not just to survive. If we pursue economic activity beyond our needs then that activity is referred to as greed. In this context there is still no reason to attach negative connotations. Market failure is the source of the negative connotations. Over supply a market and the price falls and so do profits. Under supply a market and the price rises and so do profits. All profitable markets have a bias to under supply. Often when markets under supply it merely reflects choice. But nobody chooses to go without essential goods and services. So when the markets fail to supply enough essential goods and services for everyone the price rises and the poor are priced out of the market. This is the true definition of inequality. So when needs are unfulfilled and greed continues to prosper negative connotations are attached to both need and greed.\nThe real issue is the market’s failure to supply enough essential goods and services for all. Therefore the sole purpose of government tax and spend is to overcome market failure to eradicate inequality. For decades we have had to choose between Labour giving more money to the needy with the intention of enabling them to price themselves back into the market. Or the Tories paying out subsidies and incentives to suppliers to encourage them to increase supply. Neither of these approaches have achieved any degree of success. They both fail to understand the fundamental nature of markets; over supply a market and the price falls and so do profits, under supply a market and the price rises and so do profits. Incentivising or subsidizing a market does not change this bias. And as for Labour’s approach of increasing demand without increasing supply that is a formula for replicating the bias.\nThe only way to eradicate inequality by overcoming market failure is to supplement the markets. The solution has to be activated from outside the market system and away from the bias. The solution requires state owned and state run supplements to the market which do not interfere or compete with the market in anyway.\nThis is why Concordia will compulsory purchase all schools and hospitals which were financed under the private finance initiative. And why Concordia will bring all free schools, academies and part funded schools under the control of local education authorities. And why Concordia will end all discounts on right to buy social housing enabling councils to once again build council housing. Putting an end to our housing crisis, re-establishing the council house’s role as a reward and enabling social mobility.\nConcordia is a social reformist party. We proudly occupy the centre ground of English politics out of political conviction and not from compromise. We believe that the sole purpose of government tax and spend is to eradicate inequality by overcoming market failure. We do not believe that the Government should use the tax system to influence the behaviour of individuals or the markets in any way. We oppose all attempts by the state to run, drive or steer the economy. Using tax payer’s money to reward one type of behaviour and penalise another type of behaviour is morally wrong and detrimental to both our economy and our society. Paying out subsidies and incentives, and awarding tax breaks is the process that governments use to underwrite commercial risk with tax payer’s money. This also includes in work benefits which are really a wage subsidy paid to help investors. Politicians do not understand that risk is the cutting edge that enables growth. With the inheritance of wealth comes the burden of responsibility. The responsibility to ensure that when you pass your wealth on to the next generation it is worth at least as much in real terms as what you inherited. Most investors are reluctant investors. They are not trying to make a fortune; they are trying not to lose a fortune. It is the proactive nature of investors mitigating risk that leads to innovative ideas being realised. All sustainable growth stems from innovation. Take away the risk and you take away the proactive nature of investors and most of the innovative ideas are left on a shelf collecting dust as a missed opportunity. Concordia will oppose tax payer’s money being used to underwrite commercial risk in all its forms and guises.\nIf there is no social reformist option on the ballot paper then no one can vote for it. The Conservatives, the Liberals, the Socialists and the Trade Unionists have all made concerted efforts to keep the Social Reformists off of the ballot paper. The Conservatives under Edward Heath and Margaret Thatcher set out to dismantle all that the social reformists had built. They were always mindful to refer to them as socialists and never to acknowledge them as social reformers so as to expunge their record and all memory of them, tarring them with the same brush as the socialists; rewriting their history as the opposers of capitalism, the transferers of wealth and the builders of a centralised economy. Hounded out of the Labour Party they formed the SDP. Unwilling to share the centre ground with another party the Liberals duped them into first forming an alliance and then merging with the Liberal Party to form the Liberal Democrats. Then they were systematically marginalised with futile, leaderless, grass roots, bottom up, evidence based policy making. The politics of protest NIMBYISM on a nationwide scale, not in my back yard not in anyone’s back yard. There was no refuge for the politics of conviction in a self interest only party. The Social Reformist option had been completely removed from the ballot paper. That was over twenty five years ago. Now we have the Tories moving to the right, Labour moving to the left the voters deserting the Lib Dems; the centre ground is empty. Now is the time for the Social Reformists to regroup and take the centre ground.",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com_2017_06_05_the-strangest-general-election/content_15.html": "This election started out as a certain landslide victory for the Conservatives. With Labour going out of their way to give us reasons not to vote for Labour. Such as making a pacifist their leader and would be prime minister. Jeremy Corbyn is a man who is unwilling to advocate the use of force to protect our nation and our people. Not the right man to lead us when we have a campaign of terror being waged against us. Or making a communist their shadow chancellor. John MacDonald is a man who has disregarded all the positives of capitalism and the market economy and disregarded all of the negatives of a communist economy. If given the chance he would destroy our economy and replace it with a defective centralised economy run from Westminster. Or making Dianne Abbott their shadow home secretary. A person widely regarded as an anti white racist. Yes putting her in charge of home security and law and order is a reason not to vote Labour.\nBut then the Conservatives adopted Labour’s approach of giving us reasons not to vote Conservative. First they narrowed their campaign from a Conservative campaign to a strong and stable Teresa May campaign. Then they launched their austere manifesto. With their dementia tax alienating all home owners. And their attack on the elderly; means testing the winter fuel allowance and downgrading the triple lock on pensions to a double lock. Their attack on families; taking away free school meals. And revealing their clear intention to put up income tax and national insurance contributions. Then they undermine their strong and stable government campaign by back tracking on their manifesto promise within two days of its launch. How can these people be trusted to negotiate a Brexit deal that would be good for Britain?\nThen both UKIP and the Green Party give us reasons not to vote for them; by trying to undermine the democratic process. By not standing candidates in constituencies where pro leave and pro remain candidates are defending slim majorities. The process of democracy is bigger and much more important than any party or any referendum. So these subversive acts should not be endorsed with electoral support. A vote for the Green Party or a vote for UKIP in this election would be a vote against democracy.\nThen of course the Liberal Democrats run a campaign on their bizarre interpretation of what the Brexit referendum actually meant. They are the bigger threat to democracy because the refuse to accept the clear decision of the British people.\nAnd now the final run in to polling day due to the recent horrific terror attacks is set to be all about terrorism and security. Is this election going to be reduced to a choice between a pacifist and the slasher of police budgets? Or is this the right opportunity to go out and actively vote against all of the old parties.",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com_about/content_10.html": "This is an example of an about page. Unlike posts, pages are better suited for more timeless content that you want to be easily accessible, like your About or Contact information. Click the Edit link to make changes to this page or add another page.\nThis is an example of an about page. Unlike posts, pages are better suited for more timeless content that you want to be easily accessible, like your About or Contact information. Click the Edit link to make changes to this page or add another page.",
  "http_concordia503_wordpress_com/http_concordia503_wordpress_com_2017_06_05_the-strangest-general-election/content_21.html": "This election started out as a certain landslide victory for the Conservatives. With Labour going out of their way to give us reasons not to vote for Labour. Such as making a pacifist their leader and would be prime minister. Jeremy Corbyn is a man who is unwilling to advocate the use of force to protect our nation and our people. Not the right man to lead us when we have a campaign of terror being waged against us. Or making a communist their shadow chancellor. John MacDonald is a man who has disregarded all the positives of capitalism and the market economy and disregarded all of the negatives of a communist economy. If given the chance he would destroy our economy and replace it with a defective centralised economy run from Westminster. Or making Dianne Abbott their shadow home secretary. A person widely regarded as an anti white racist. Yes putting her in charge of home security and law and order is a reason not to vote Labour.\nBut then the Conservatives adopted Labour’s approach of giving us reasons not to vote Conservative. First they narrowed their campaign from a Conservative campaign to a strong and stable Teresa May campaign. Then they launched their austere manifesto. With their dementia tax alienating all home owners. And their attack on the elderly; means testing the winter fuel allowance and downgrading the triple lock on pensions to a double lock. Their attack on families; taking away free school meals. And revealing their clear intention to put up income tax and national insurance contributions. Then they undermine their strong and stable government campaign by back tracking on their manifesto promise within two days of its launch. How can these people be trusted to negotiate a Brexit deal that would be good for Britain?\nThen both UKIP and the Green Party give us reasons not to vote for them; by trying to undermine the democratic process. By not standing candidates in constituencies where pro leave and pro remain candidates are defending slim majorities. The process of democracy is bigger and much more important than any party or any referendum. So these subversive acts should not be endorsed with electoral support. A vote for the Green Party or a vote for UKIP in this election would be a vote against democracy.\nThen of course the Liberal Democrats run a campaign on their bizarre interpretation of what the Brexit referendum actually meant. They are the bigger threat to democracy because the refuse to accept the clear decision of the British people.\nAnd now the final run in to polling day due to the recent horrific terror attacks is set to be all about terrorism and security. Is this election going to be reduced to a choice between a pacifist and the slasher of police budgets? Or is this the right opportunity to go out and actively vote against all of the old parties.",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com_2016_03_31_concordia/content_12.html": "Promoting Harmony between Market, State, Organisation and Individual.\nThe purpose of this party is to re-establish the true role of government tax and spend. Democracy has distorted its purpose. Popularity has become a pre-requisite to electoral success. The need to be popular has led politicians to take credit for things they did not do. Such as creating a booming economy. As soon as they took credit for the boom they also accepted responsibility for the inevitable bust. The position of the voters was simple, if the politicians enabled full employment and the economy to boom once then they can do it again. Except of course they never enabled the boom; it just happened. Before the boom and during the boom tax and spend was used to overcome market failure to eradicate inequality. Tax and spend wasn’t pro-active it was reactive. It wasn’t used to lead, drive or grow the economy. It was used to supplement the markets. When markets fail to supply enough essential goods and services the poor are priced out of the market and inequality occurs. The state reacted to the market’s failure to supply essential goods and services. The state supplemented the markets. These supplements only supplied essential goods and services. These supplements only ever made up the short fall. They never interfered with or distorted the markets. They were state owned and state run. Yes these supplements represented an increase in supply. Yes this increase in supply was recorded as economic growth. Yes this economic growth contributed to the boom. But when the bust came, it wasn’t the supplements which shrank; it was the markets. If anything the supplements had to be increased to counter the increases in market failure. This is how the supplements became the means of fulfilling this new unplanned responsibility of growing the economy. Money was borrowed and pumped into the supplements to buoy up the economy. This made them inefficient so they were sold off in the name of efficiency. Unfortunately the subsidies and incentives which are being paid out to make these supplements appear profitable and therefore worth investing in; make them inefficient and unsustainable. Decades of government led growth has been financed with debt. The Tories have cut services to the bone and yet the debt continues to grow. We need change; not cuts. We must accept that the Government is not responsible for leading, driving or growing the economy. Tax and spend should only be used for overcoming market failure, to eradicate inequality, by supplementing the markets, with state owned and state run supply chains. We should put an end to contracting out government services, stop paying out subsidies, stop handing out tax breaks and other incentives and move to a low tax mixed economy.\nConcordia is a centre ground political party. We don’t help the rich at the expense of the poor. We don’t help the poor at the expense of the rich. We overcome market failure, to eradicate inequality, by supplementing the markets.\nContact us: concordiaengland@yahoo.com\nHead Office Concordia, 318 Wood Lane, Dagenham, Essex,RM9 5TB.\nOur Government Serves Its own interests and fails both the Economy and Society.\nOur Government prioritises capitol over labour. The writing down allowance enables investors to recoup most if not all of their investment before the pay any tax. The writing down allowance distorts investment strategies. Investments are structured around the tax system and not tailored to market conditions. Volatile short term investments are favoured over the stabilising long term investments. There is no reason to give tax breaks to investors to encourage them to invest. Investors don’t need encouragement as they have already decided to invest; they just need to find the right investment opportunity for them. Government incentives discourage investors from looking for the right investments. Tax breaks, financial incentives and government subsidies are used to underwrite commercial risks. They steer investors away from genuine market investments and towards Government sponsored projects. Getting the markets to fulfil the Government’s agenda leads to many investment opportunities which have real potential for sustainable growth to be missed. Risk is the cutting edge which enables economic growth. It is the personal agency of investors mitigating the risks of their investments which leads to innovation. It is the exploitation of innovation which leads to growth. Necessity is the mother of invention. Risk is the mother of innovation. Tax breaks are the grim reaper of sustainable growth.\nStop giving tax breaks and we will rebalance our economy. Investments will be made in accordance with the risks of market conditions. We will start investing in people as well as technology, property and equipment. We will invest for the long term as well as the short and medium terms. We must end all tax allowances, subsidies and incentives, set corporation tax, capitol gains tax, income tax and VAT at the same rate. Enable every individual to develop their talents into a resource. Make the minimum wage a living wage which allows full time workers to keep rooves over their heads, put food on their tables and make their contributions to the public purse. So that every body contributes and nobody gets a free ride.\nConcordia is a centre ground political party. We don’t help the rich at the expense of the poor. We don’t help the poor at the expense of the rich. We overcome market failure to eradicate inequality by supplementing the markets.\nContact us: concordiaengland@yahoo.com\nHead Office: 318 Wood Lane, Dagenham, Essex, RM9 5TB.\nReform of the House of Lords has Subverted the House of Commons.\nDemocracy cannot be doubled but it can be split. Having a fully elected second chamber will split our democracy. Britain is a market economy, built by capitol and labour, moulded by organisations and individuals, represented in the Lords and in the Commons. Except with the political selection of peers the Lords no longer represent the interests on capitol and organisations. So the capitol investors and the organisations have subverted the House of Commons. The Commons now represents the interests of businesses, of charities and other lobbying organisations. So the people no longer have any representation in Parliament. The House of Lords does try to represent the people but they are only a revising chamber. All challenges to government reform by the Lords are easily brushed aside. We make laws to benefit the people. We revise laws to accommodate the needs of organisations. So the people should be represented in the more powerful chamber which writes the laws and organisations should be represented in the revising chamber. Political reform needs to re-establish the House of Lords as a fully unelected chamber with none of the peers appointed by the political parties. So that this chamber represents the interests of capitol and organisations at a level which reflects their value to our society. Only then will the organisations release their grip on the members in the Commons and only then will the people have a voice and be genuinely represented in Parliament. The Liberals have been trying to reform the House of Lords for more than one hundred years. That is one hundred years of gradual movement in the wrong direction. This issue of reform will only be resolved if we approach it from a completely new perspective.\nConcordia is a centre ground political party. We don’t help the rich at the expense of the poor. We don’t help the poor at the expense of the rich. We overcome market failure to eradicate inequality by supplementing the markets.\nContact us: concordiaengland@yahoo.com\nHead Office: 318 Wood Lane, Dagenham, Essex, RM9 5TB.",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com_2017_05_22_general-election-2017/content_2.html": "After this latest debacle of a u turn on Conservative social care policy. It is clear that Teresa May has no leadership qualities. Every time there is an in party challenge to her policies she caves in. How can that be described as strong and stable leadership? If a campaign of slogans and subliminal messages once again wins a General Election for the Tories. Then we face a very difficult Brexit negotiation. Forget the idea that we need strong and stable government to get a successfully negotiated Brexit. What we need is a strong Parliament, and the strongest Parliaments are hung Parliaments. What we need is a minority Government and a cross bench negotiating team. To ensure that any deal struck is a deal regarded as a good deal through out the length and breadth of the country.\nIf Brexit is negotiated entirely by the Tories then there will undoubtedly be winners and losers.This General Election is not the time to endorse Conservatism or to hand Teresa May a mandate for unsrutinised and reckless Brexit negotiations.\nWe all know that the vast majority of British people do not trust Jeremy Corbyn so there is no likelihood of a Labour Government. However there is nearly always a candidate on the ballot paper who if elected could not form a government. So a vote for an independent candidate or for a small party is a vote for a hung Parliament for a strong Parliament. A strong Parliament which will see us through the Brexit negotiations and then give us another early General Election. A General Election when we can all see what is in front of us. A General Election where the parties will have to offer us a clear direction. And not just a load of sentimental guff about what needs doing and why it needs doing but actually tell us how they are going to do it.",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com_2017_05_28_no-manifesto-and-disaffected-voters/content_9.html": "This election is about the on going process of change. Brexit is part of that change but the real change will happen post Brexit. So this election is about laying out different options for voters. Neither Labour nor the Conservatives can see beyond Brexit. So any ideas which are endorsed by the electorate will shape the manifestos and campaigns of the next election. So I want to reach out to disaffected voters. There is a consensus amongst political activists across the parties that people who don’t always vote fail to vote entirely out of apathy. My experience on the doorstep is quite the opposite. I find that the people who don’t always vote are more interested in and more knowledgeable about politics than the people who vote regularly. The reality is that they value their vote so they don’t cast it away lightly. Quite simply they don’t vote when there is nothing worth voting for.\nFor decades both Labour and the Conservatives have been knowingly leading us in the wrong directions. With campaigns filled with sentiment and subliminal messaging designed to bypass the rational mind and target the emotional decision making process. With policies not designed to serve society but to serve the process of getting elected. Political convictions have been replaced with pragmatism.\nPolitics is about leadership; its about leading society into the future. We are contesting this election to give people a very clear choice a direction based on a complete political philosophy. A philosophy which embraces capitalism and market economics but recognizes that markets have their limitations. A philosophy which sees the state’s role in the economy as reactive and not proactive. A philosophy which sees the Government role of tax and spend as having a single purpose. That purpose is to eradicate inequality by overcoming market failure. A philosophy which recognizes that market failure can only be overcome from outside the market system. A philosophy which is fundamentally opposed to market intervention, to subsidies, to incentives and to contracting out government services. A philosophy which supplements the markets to eradicate inequality. With state owned and state run supplements which operate independently of the markets.\nTo bring about genuine change it is sometimes necessary to approach things in a different way. If we produced a manifesto we would be conforming to the restrictive narrative set by the Conservatives and labour. We want them to broaden their approach and we will not achieve that by narrowing our’s",
  "http_concordia503_wordpress_com/http_concordia503_wordpress_com_2017_05_22_general-election-2017/content_4.html": "After this latest debacle of a u turn on Conservative social care policy. It is clear that Teresa May has no leadership qualities. Every time there is an in party challenge to her policies she caves in. How can that be described as strong and stable leadership? If a campaign of slogans and subliminal messages once again wins a General Election for the Tories. Then we face a very difficult Brexit negotiation. Forget the idea that we need strong and stable government to get a successfully negotiated Brexit. What we need is a strong Parliament, and the strongest Parliaments are hung Parliaments. What we need is a minority Government and a cross bench negotiating team. To ensure that any deal struck is a deal regarded as a good deal through out the length and breadth of the country.\nIf Brexit is negotiated entirely by the Tories then there will undoubtedly be winners and losers.This General Election is not the time to endorse Conservatism or to hand Teresa May a mandate for unsrutinised and reckless Brexit negotiations.\nWe all know that the vast majority of British people do not trust Jeremy Corbyn so there is no likelihood of a Labour Government. However there is nearly always a candidate on the ballot paper who if elected could not form a government. So a vote for an independent candidate or for a small party is a vote for a hung Parliament for a strong Parliament. A strong Parliament which will see us through the Brexit negotiations and then give us another early General Election. A General Election when we can all see what is in front of us. A General Election where the parties will have to offer us a clear direction. And not just a load of sentimental guff about what needs doing and why it needs doing but actually tell us how they are going to do it.",
  "http_concordia503_wordpress_com/http_concordia503_wordpress_com_2017_05_28_no-manifesto-and-disaffected-voters/content_11.html": "This election is about the on going process of change. Brexit is part of that change but the real change will happen post Brexit. So this election is about laying out different options for voters. Neither Labour nor the Conservatives can see beyond Brexit. So any ideas which are endorsed by the electorate will shape the manifestos and campaigns of the next election. So I want to reach out to disaffected voters. There is a consensus amongst political activists across the parties that people who don’t always vote fail to vote entirely out of apathy. My experience on the doorstep is quite the opposite. I find that the people who don’t always vote are more interested in and more knowledgeable about politics than the people who vote regularly. The reality is that they value their vote so they don’t cast it away lightly. Quite simply they don’t vote when there is nothing worth voting for.\nFor decades both Labour and the Conservatives have been knowingly leading us in the wrong directions. With campaigns filled with sentiment and subliminal messaging designed to bypass the rational mind and target the emotional decision making process. With policies not designed to serve society but to serve the process of getting elected. Political convictions have been replaced with pragmatism.\nPolitics is about leadership; its about leading society into the future. We are contesting this election to give people a very clear choice a direction based on a complete political philosophy. A philosophy which embraces capitalism and market economics but recognizes that markets have their limitations. A philosophy which sees the state’s role in the economy as reactive and not proactive. A philosophy which sees the Government role of tax and spend as having a single purpose. That purpose is to eradicate inequality by overcoming market failure. A philosophy which recognizes that market failure can only be overcome from outside the market system. A philosophy which is fundamentally opposed to market intervention, to subsidies, to incentives and to contracting out government services. A philosophy which supplements the markets to eradicate inequality. With state owned and state run supplements which operate independently of the markets.\nTo bring about genuine change it is sometimes necessary to approach things in a different way. If we produced a manifesto we would be conforming to the restrictive narrative set by the Conservatives and labour. We want them to broaden their approach and we will not achieve that by narrowing our’s",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com_2016_03_31_first-blog-post/content_13.html": "This is your very first post. Click the Edit link to modify or delete it, or start a new post. If you like, use this post to tell readers why you started this blog and what you plan to do with it.\nThis is your very first post. Click the Edit link to modify or delete it, or start a new post. If you like, use this post to tell readers why you started this blog and what you plan to do with it.",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com_2017_10_05_an-epidemic-of-self-doubt-amongst-the-so-called-political-elite/content_14.html": "There is a narrative which has been adopted by politicians from both the left and the right. A narrative which purports that the electorate has re-polarised, that the centre ground has become broader and more barren. The only part which is accurate is that the centre ground is now barren. The Liberal Democrats lost all credibility when their participation in the Coalition Government of 2010-2015 exposed their complete lack of political conviction. As for UKIP they are a one issue party. So now that they have delivered on that issue; there is no longer any reason to vote for them. And as for the Scottish Nationalist Party much of their success in 2015 was due to the collapse of Scottish Labour in that year. The resurgence of Scottish Labour is due to Jeremy Corbyn moving the Labour Party to the left. This does not mean that the electorate has moved to the left. Scottish and Welsh Labour have always been further to the left than their English counterparts.\nNo the British Electorate has not changed its stance. The main reasons their voting patterns changed in 2017 is twofold. Firstly there is no longer a credible party in the centre ground to vote for and there is no where for the anti-establishment/protest vote to go. So there were many voters with no real political allegiance which brought the second factor into play: the campaigns. Labour’s anti austerity campaign proved to be more alluring the Conservative’s increased austerity campaign. So as the floating vote drifted left the Conservative fear campaign activated the apathetic voters. People who don’t normally vote and who never vote for anything but occasionally vote against things came out to prevent a socialist labour government from being formed.\nThis misconception about the re-polarised electorate has been orchestrated by political extremists from both the left of the Labour Party and from the right of the Conservative Party. And as we have heard during this conference season they have dominated the agendas of both conferences. The social reformists within the Labour Party apparently no longer have anything to say. And the Liberals within the Conservative Party did not even attend their own party’s conference. Politics is all about leadership and leadership requires conviction. If you intend to lead a nation and spend billions of pounds of tax payers money in the process then you need to be absolutely certain that you are leading in the right direction. What we are witnessing amongst the so called political elite is an epidemic of self doubt. The only people still talking are those who are spouting the political philosophies of the past. Political philosophies which have been tried, which have been tested and which have been seen to fail. Austerity was proved to be wrong by John Maynard Keynes between the wars. Socialism has had a significantly negative impact on every society it has had the opportunity to influence. The extremists have successfully framed the debate as market versus state. Even though all the astute people know that the way forward is market plus the state. The real debate is about where the line between market and state is drawn. As it is the drawing of this line which determines the remit of the state but we must first determine the remit of the state to enable us to draw the line.\nFirst we must accept that the remit of the state is to overcome market failure to eradicate inequality. Then we can turn our attention to understanding what market failure actually is and how it causes inequality. We know that if a market is over supplied then prices fall and so do profits. We also know that the opposite is true when markets are under supplied prices rise and so do profits. Markets do not have a social conscience. They are not interested in need they only respond to demand. So all markets have a built in bias to under supply, and that bias is strong. It will over whelm any socioeconomic policy that challenges it. The evidence is absolutely clear if we are to reap the benefits of market economics then we have to let the markets be true to themselves. This means that we accept that the bias cannot be changed so we dismantle all current government policies which are trying to challenge the bias. We remove all state subsidies, all state incentives all tax breaks and all punitive taxes. The State ceases to try and influence how any body spends or earns money. When all this is removed risk will draw the line between market and state. The markets will decide how much they will supply and therefore how much they will fail to supply. The markets will never risk investing in the expansion of production to supply to people who cannot afford their products.\nSo the state must take on those risks and supply to the people who have been priced out of the market. But they must do it in such a way that they do not distort the markets. The line between market and state must remain thin crisp and un-blurred. Therefore all government contracts must be brought back in house and all agency staff working in the state sector must be directly employed by the state. If the state over supplies it will be competing with the markets which will distort them and blur the line. The same would happen if the state supplied products that there was no need for them to supply. Understanding market failure and how it causes inequality is key to distinguishing market activity from state activity. Market failure is an integral part of the market system and in the main only reflects choice. But when the markets fail to supply enough essential goods and services to fulfil all of society’s needs those who are priced out of the market are forced to decide which of life’s essentials they must go without. Anyone facing this choice through no fault of their own is subject to systemic inequality directly caused by market failure. So the market’s failure to supply essential goods and services is the cause of inequality. So if the state is to fulfil its remit of over coming market failure to eradicate inequality it must only supply essential goods and services and it must only make up the short fall. And they must do it with state owned and state run supply chains.\nThis type of economy has been described in the past as a mixed economy, but labels are important and this was a bad label. It implied that both elements of the economy operated in a similar way and could be combined in a seamless way. It was not clear where one ended and the other one began. This vagueness created a massive opportunity for commercial enterprizes to exploit the British tax payer. This exploitation caused the fall in Britain’s international competitiveness and the greater part of our huge public debt. The right label is twin economy. This label enables all to appreciate how distinctly different the two economic processes are in both make up and objective. Maintaining that distinction will be the means that future tax payers must use to protect their contributions from the exploitations of commercial enterprizes.",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com_author_alisonunderwood/content_17.html": "There is a narrative which has been adopted by politicians from both the left and the right. A narrative which purports that the electorate has re-polarised, that the centre ground has become broader and more barren. The only part which is accurate is that the centre ground is now barren. The Liberal Democrats lost all credibility when their participation in the Coalition Government of 2010-2015 exposed their complete lack of political conviction. As for UKIP they are a one issue party. So now that they have delivered on that issue; there is no longer any reason to vote for them. And as for the Scottish Nationalist Party much of their success in 2015 was due to the collapse of Scottish Labour in that year. The resurgence of Scottish Labour is due to Jeremy Corbyn moving the Labour Party to the left. This does not mean that the electorate has moved to the left. Scottish and Welsh Labour have always been further to the left than their English counterparts.\nNo the British Electorate has not changed its stance. The main reasons their voting patterns changed in 2017 is twofold. Firstly there is no longer a credible party in the centre ground to vote for and there is no where for the anti-establishment/protest vote to go. So there were many voters with no real political allegiance which brought the second factor into play: the campaigns. Labour’s anti austerity campaign proved to be more alluring the Conservative’s increased austerity campaign. So as the floating vote drifted left the Conservative fear campaign activated the apathetic voters. People who don’t normally vote and who never vote for anything but occasionally vote against things came out to prevent a socialist labour government from being formed.\nThis misconception about the re-polarised electorate has been orchestrated by political extremists from both the left of the Labour Party and from the right of the Conservative Party. And as we have heard during this conference season they have dominated the agendas of both conferences. The social reformists within the Labour Party apparently no longer have anything to say. And the Liberals within the Conservative Party did not even attend their own party’s conference. Politics is all about leadership and leadership requires conviction. If you intend to lead a nation and spend billions of pounds of tax payers money in the process then you need to be absolutely certain that you are leading in the right direction. What we are witnessing amongst the so called political elite is an epidemic of self doubt. The only people still talking are those who are spouting the political philosophies of the past. Political philosophies which have been tried, which have been tested and which have been seen to fail. Austerity was proved to be wrong by John Maynard Keynes between the wars. Socialism has had a significantly negative impact on every society it has had the opportunity to influence. The extremists have successfully framed the debate as market versus state. Even though all the astute people know that the way forward is market plus the state. The real debate is about where the line between market and state is drawn. As it is the drawing of this line which determines the remit of the state but we must first determine the remit of the state to enable us to draw the line.\nFirst we must accept that the remit of the state is to overcome market failure to eradicate inequality. Then we can turn our attention to understanding what market failure actually is and how it causes inequality. We know that if a market is over supplied then prices fall and so do profits. We also know that the opposite is true when markets are under supplied prices rise and so do profits. Markets do not have a social conscience. They are not interested in need they only respond to demand. So all markets have a built in bias to under supply, and that bias is strong. It will over whelm any socioeconomic policy that challenges it. The evidence is absolutely clear if we are to reap the benefits of market economics then we have to let the markets be true to themselves. This means that we accept that the bias cannot be changed so we dismantle all current government policies which are trying to challenge the bias. We remove all state subsidies, all state incentives all tax breaks and all punitive taxes. The State ceases to try and influence how any body spends or earns money. When all this is removed risk will draw the line between market and state. The markets will decide how much they will supply and therefore how much they will fail to supply. The markets will never risk investing in the expansion of production to supply to people who cannot afford their products.\nSo the state must take on those risks and supply to the people who have been priced out of the market. But they must do it in such a way that they do not distort the markets. The line between market and state must remain thin crisp and un-blurred. Therefore all government contracts must be brought back in house and all agency staff working in the state sector must be directly employed by the state. If the state over supplies it will be competing with the markets which will distort them and blur the line. The same would happen if the state supplied products that there was no need for them to supply. Understanding market failure and how it causes inequality is key to distinguishing market activity from state activity. Market failure is an integral part of the market system and in the main only reflects choice. But when the markets fail to supply enough essential goods and services to fulfil all of society’s needs those who are priced out of the market are forced to decide which of life’s essentials they must go without. Anyone facing this choice through no fault of their own is subject to systemic inequality directly caused by market failure. So the market’s failure to supply essential goods and services is the cause of inequality. So if the state is to fulfil its remit of over coming market failure to eradicate inequality it must only supply essential goods and services and it must only make up the short fall. And they must do it with state owned and state run supply chains.\nThis type of economy has been described in the past as a mixed economy, but labels are important and this was a bad label. It implied that both elements of the economy operated in a similar way and could be combined in a seamless way. It was not clear where one ended and the other one began. This vagueness created a massive opportunity for commercial enterprizes to exploit the British tax payer. This exploitation caused the fall in Britain’s international competitiveness and the greater part of our huge public debt. The right label is twin economy. This label enables all to appreciate how distinctly different the two economic processes are in both make up and objective. Maintaining that distinction will be the means that future tax payers must use to protect their contributions from the exploitations of commercial enterprizes.",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com_2017_06_08_election-day-2017/content_18.html": "Right from the outset of this General Election the Conservatives have tried to make it a contest between leaders. They thought that if they could keep the focus on Jeremy Corbyn and his uncompromising and dubious brand of ethics they would be able to sneak their excessively austere manifesto through without any scrutiny. A manifesto that if elected would give them a mandate to financially penalise dementia sufferers. A mandate to take from everyone. To take food away from the young. To take heat away from the elderly. And to take more money from the workers. Introducing the dementia tax, means testing the winter fuel allowance, restricting access to free school meals and paving the way for income tax rises and national insurance rises. They never managed to sneak it through without scrutiny but they will still probably get their mandate because the Labour alternative is just not viable.\nLabour didn’t produce a manifesto designed for the good of the country. This is a party steeped in the politics of envy. They are the pedlars of false hope. They produced a manifesto that would win them votes. Not enough votes to win the election. They are not trying to win the election. They are just trying to secure second place and in doing so secure the socialists grip on the Labour Party.\nIf we only see this election in the terms of who gets to form the next government then we miss an invaluable opportunity. There is a festering malignant force in British politics. Conservatism is that malignant force and Labour have become the barrier which blocks all remedies from reaching it. Conservatives divide the country; pitting haves against have nots implying that there can only be winners if there are also losers. By playing that game, choosing a side, representing the have nots Labour are reinforcing the divide.\nThe Conservatives are going to form the next government. Whether its a minority government, a government with a small majority or a government with a huge majority we still don’t know. What we do know is that no other party is in a position to form a government. This election really is about second place. Labour are too weak to win, too strong to die and too arrogant to change. This election needs to weaken Labour so that it will die. Only then can we remove the barrier to confront Conservatism with a viable alternative.",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com_contact/content_6.html": "Contact This is a contact page with some basic contact information and a contact form. Name(required) Email(required) Website Comment(required) Submit Δ Like Loading...",
  "http_concordia503_wordpress_com/https_concordia503_wordpress_com/content_8.html": "There is a narrative which has been adopted by politicians from both the left and the right. A narrative which purports that the electorate has re-polarised, that the centre ground has become broader and more barren. The only part which is accurate is that the centre ground is now barren. The Liberal Democrats lost all credibility when their participation in the Coalition Government of 2010-2015 exposed their complete lack of political conviction. As for UKIP they are a one issue party. So now that they have delivered on that issue; there is no longer any reason to vote for them. And as for the Scottish Nationalist Party much of their success in 2015 was due to the collapse of Scottish Labour in that year. The resurgence of Scottish Labour is due to Jeremy Corbyn moving the Labour Party to the left. This does not mean that the electorate has moved to the left. Scottish and Welsh Labour have always been further to the left than their English counterparts.\nNo the British Electorate has not changed its stance. The main reasons their voting patterns changed in 2017 is twofold. Firstly there is no longer a credible party in the centre ground to vote for and there is no where for the anti-establishment/protest vote to go. So there were many voters with no real political allegiance which brought the second factor into play: the campaigns. Labour’s anti austerity campaign proved to be more alluring the Conservative’s increased austerity campaign. So as the floating vote drifted left the Conservative fear campaign activated the apathetic voters. People who don’t normally vote and who never vote for anything but occasionally vote against things came out to prevent a socialist labour government from being formed.\nThis misconception about the re-polarised electorate has been orchestrated by political extremists from both the left of the Labour Party and from the right of the Conservative Party. And as we have heard during this conference season they have dominated the agendas of both conferences. The social reformists within the Labour Party apparently no longer have anything to say. And the Liberals within the Conservative Party did not even attend their own party’s conference. Politics is all about leadership and leadership requires conviction. If you intend to lead a nation and spend billions of pounds of tax payers money in the process then you need to be absolutely certain that you are leading in the right direction. What we are witnessing amongst the so called political elite is an epidemic of self doubt. The only people still talking are those who are spouting the political philosophies of the past. Political philosophies which have been tried, which have been tested and which have been seen to fail. Austerity was proved to be wrong by John Maynard Keynes between the wars. Socialism has had a significantly negative impact on every society it has had the opportunity to influence. The extremists have successfully framed the debate as market versus state. Even though all the astute people know that the way forward is market plus the state. The real debate is about where the line between market and state is drawn. As it is the drawing of this line which determines the remit of the state but we must first determine the remit of the state to enable us to draw the line.\nFirst we must accept that the remit of the state is to overcome market failure to eradicate inequality. Then we can turn our attention to understanding what market failure actually is and how it causes inequality. We know that if a market is over supplied then prices fall and so do profits. We also know that the opposite is true when markets are under supplied prices rise and so do profits. Markets do not have a social conscience. They are not interested in need they only respond to demand. So all markets have a built in bias to under supply, and that bias is strong. It will over whelm any socioeconomic policy that challenges it. The evidence is absolutely clear if we are to reap the benefits of market economics then we have to let the markets be true to themselves. This means that we accept that the bias cannot be changed so we dismantle all current government policies which are trying to challenge the bias. We remove all state subsidies, all state incentives all tax breaks and all punitive taxes. The State ceases to try and influence how any body spends or earns money. When all this is removed risk will draw the line between market and state. The markets will decide how much they will supply and therefore how much they will fail to supply. The markets will never risk investing in the expansion of production to supply to people who cannot afford their products.\nSo the state must take on those risks and supply to the people who have been priced out of the market. But they must do it in such a way that they do not distort the markets. The line between market and state must remain thin crisp and un-blurred. Therefore all government contracts must be brought back in house and all agency staff working in the state sector must be directly employed by the state. If the state over supplies it will be competing with the markets which will distort them and blur the line. The same would happen if the state supplied products that there was no need for them to supply. Understanding market failure and how it causes inequality is key to distinguishing market activity from state activity. Market failure is an integral part of the market system and in the main only reflects choice. But when the markets fail to supply enough essential goods and services to fulfil all of society’s needs those who are priced out of the market are forced to decide which of life’s essentials they must go without. Anyone facing this choice through no fault of their own is subject to systemic inequality directly caused by market failure. So the market’s failure to supply essential goods and services is the cause of inequality. So if the state is to fulfil its remit of over coming market failure to eradicate inequality it must only supply essential goods and services and it must only make up the short fall. And they must do it with state owned and state run supply chains.\nThis type of economy has been described in the past as a mixed economy, but labels are important and this was a bad label. It implied that both elements of the economy operated in a similar way and could be combined in a seamless way. It was not clear where one ended and the other one began. This vagueness created a massive opportunity for commercial enterprizes to exploit the British tax payer. This exploitation caused the fall in Britain’s international competitiveness and the greater part of our huge public debt. The right label is twin economy. This label enables all to appreciate how distinctly different the two economic processes are in both make up and objective. Maintaining that distinction will be the means that future tax payers must use to protect their contributions from the exploitations of commercial enterprizes."
}