{
  "https_www_eva4aandg_com/https_www_eva4aandg_com_donation-thank-you-page/content_9.html": "top of page\nThank you, Donor Name\nWe are so grateful for your generous donation of £0.\nYour donation number is #1000. You’ll receive a confirmation email soon.\nbottom of page\nWe are so grateful for your generous donation of £0.\nYour donation number is #1000. You’ll receive a confirmation email soon.",
  "https_www_eva4aandg_com/https_www_eva4aandg_com_copy-of-videos/content_5.html": "top of page\nThe Videos\nVideos out and about during the campaign.\nThis page will take longer to load,\nAnd may require reloading\nGive it time, it IS worth it!\n*The Facebook videos require you to be a member to see them\nALVA - MY HOME TOWN\nTILLICOULTRY\nALLOA\nBANNOCKBURN RALLY\nGRANGEMOUTH\nI AM A LOCAL!\nIN GRANGEMOUTH\nMUTTING PIES!\nALLOA HARBOUR\nLARBERT\nGRANGEMOUTH\nGRANGEMOUTH GALA DAY\nbottom of page",
  "https_www_eva4aandg_com/https_www_eva4aandg_com_general-clean/content_6.html": "HOME\nVIDEOS EVA\nVIDEOS ON THE ROAD\nGALLERY\nWANT TO HELP?\nMY ADDRESS TO YOU\nABOUT\nSCRIBBLES\nCONTACT\nBlog\nSearch Results\nMore",
  "https_www_eva4aandg_com/https_www_eva4aandg_com_search/content_8.html": "7 results found with an empty search\n- MY ADDRESS TO YOU | Vote Eva\nWill appear here...\n- Vote Eva | Alloa & Grangemouth | Clackmannanshire, UK\nVote Eva - Westminster Election Campaign site for Eva Comrie who is standing as an independent candidate in Alloa and Grangemouth constituency in the upcoming election. Liberty, Equality, Prosperity Help with Eva's campaign ABOUT ABOUT EVA COMRIE Vote Eva is a site dedicated to supporting Eva's election as an MSP for the Clackmannanshire and Dunblane constituency.or the Mid Scotland and Fife region. The website offers services such as the Election Manifesto and aims to collect donations, build a volunteer network, and share blogs. Eva has a strong track record of community involvement, having previously served as a councillor and being an outspoken advocate on various issues. Her commitment to the community sets her apart from other candidates. This space will highlight Eva's unique approach and involvement in local campaigns and issues. The sma' folk are on the field Scotland’s resounding victory at Bannockburn on 24 June 1314 was especially significant because of the role played by the sma’ folk. Those of us determined to replicate the achievements of the last man to unite the Scots and attain our country’s Independence know that the sma’ folk are today, as they were 710 years ago, vital to the achievement of our goal. And it is the sma’ folk who will benefit most when we realise it. We can start by making this General Election Scotland’s Independence Election. Today Scotland stands at a political crossroads similar to those faced by Wallace in 1297 and Bruce in 1314. Born in Stirling, living and working for most of my life in Clackmannanshire and the Forth Valley, I know the constituency like the back of my hand. The landscape is stunning, the history blood curdling and inspiring in equal measure. But my friends and neighbours are skint and cold, worried about the future, in this land of plenty. Climb the Ochil hills behind my home town of Alva and see Grangemouth and the bridges - Kincardine, Clackmannan, Forth road and rail and the Queensferry Crossing. Marvel at the engineering skills of our people yet observe in the same panorama abject poverty and deprivation, a multiplicity of food banks, baby banks and school clothing banks - testament to a laudable community spirit but also to the absence of political will, vision or strategy for change. Consider the prospect of the continued deadly de-industrialisation of Scotland that the loss of the Grangemouth oil refinery will comprise; from the top ten oil producers reduced to the status of a third world country, reliant on England refining Scotland’s oil! Scotland - the country that discovered oil and became a desert. No stetsons, diamonds, ranches or multi million dollar oil funds for us - just dole queues, drugs deaths, drinking dens and dunces. It doesn’t have to be this way - and it won’t be when we grasp that thistle and unite in our common cause. Grangemouth is a national campaign and retaining, improving and replacing the oil refinery there must become a national and urgent mission. Women of Scotland and of this constituency have been badly betrayed by politicians duped by an ideology into encouraging us to ignore truth and science and pretend to the detriment of children and vulnerable adults that humans can change sex. The defence of single sex protections is and will also be a priority for me, backed up by forty years of practising in family and child law. In the forthcoming General Election we must chap every door and speak with every voter in every scheme and estate in Scotland, record those who support our cause and engage with those yet to be persuaded. In my campaign to win Alloa and Grangemouth I intend to encourage the disenfranchised to trust that with Independence they will have hope, the chance of equality and respect and for once in several generations the ability to break the cycle and release the power of Scotland’s greatest resource - the potential of our people. I will show that with our freedom we can rebuild Scotland; a national energy company, a national house building company - these will be ours to design and empower when we have the economic levers in Scotland’s hands. We’ll retain our resources for our good, build schools and hospitals, road and rail networks, ferries and buses, pay a decent wage to all and provide universality of welfare and benefits at levels enabling all to maintain self respect. In other words, in an independent Scotland, we can put the heating back on and live like those of other normal independent countries - like Norway, Germany, France, you get the picture. Election Day will be a positive day where we look forward to the realisation of our dream - Scotland will flourish when we reap our own harvest and ring our own till. Join my campaign today. Now is the day. Now is the hour. Break the servile chains, the woes and pains of oppression and set Scotland free. If you feel can help with this campaign click the button I can help TREATMENTS JOIN THE MOVEMENT Help Eva's campaign Recomended reading/viewing One Legged Woman Speaks Through a Scottish Prism Wings over Scotland CONTACT ADDRESS 4 0 Stirling St Alva FK12 5EB CONTACT US info@voteeva.scot First Name Last Name Email Message Submit Thanks for submitting! © 2024 by BionicLawyer.\n- Thank You Page | Vote Eva\nThank you, Donor Name We are so grateful for your generous donation of £0. Your donation number is #1000. You’ll receive a confirmation email soon.\n- VIDEOS EVA | Vote Eva\nThe Videos Videos about me and my thoughts. This page will take longer to load, And may require reloading Give it time, it IS worth it! *The Facebook videos require you to be a member to see them THIS IS ME! ADULT HUMAN FEMALE FROM GREENOCK 2021 SCOTLAND UNITED? HOW IT COULD BE PARTY POLITICS!\n- VIDEOS ON THE ROAD | Vote Eva\nThe Videos Videos out and about during the campaign. This page will take longer to load, And may require reloading Give it time, it IS worth it! *The Facebook videos require you to be a member to see them ALVA - MY HOME TOWN TILLICOULTRY ALLOA BANNOCKBURN RALLY GRANGEMOUTH I AM A LOCAL! IN GRANGEMOUTH MUTTING PIES! ALLOA HARBOUR LARBERT GRANGEMOUTH GRANGEMOUTH GALA DAY\n- WANT TO HELP? | Vote Eva\nWant to help Eva? Eva and her team welcome any help that you can give Delivering leaflets Canvassing (if you are new to this we will team you up with an experienced person). Transport - People to and fro and/or picking up and delivering election materials. Polling duty at polling places on election day. Events What is happening in the campaign Keep up to date with any late changes on our Facebook and Twitter/X feeeds. Click on any event in the calendar for details. If a post has an address on it, click on it and it will give you a map. Chose the option 'Directions' and it will give you the best route to get there. Give it time to work. If you have trouble with this link because of Yahoo, email directly to info@voteeva.scot CLACKMANNANSHIRE & DUNBLANE MID SCOTLAND & FIFE CONTACT ADDRESS 4 0 Stirling St Alva FK12 5EB CONTACT US info@voteeva.scot First Name Last Name Email Message Submit Thanks for submitting! © 2024 by BionicLawyer.",
  "https_www_eva4aandg_com/https_www_eva4aandg_com_general-4/content_3.html": "top of page\nThe Videos\nVideos about me and my thoughts.\nThis page will take longer to load,\nAnd may require reloading\nGive it time, it IS worth it!\n*The Facebook videos require you to be a member to see them\nTHIS IS ME!\nADULT HUMAN FEMALE\nFROM GREENOCK 2021\nSCOTLAND UNITED?\nHOW IT COULD BE\nPARTY POLITICS!\nbottom of page",
  "https_www_eva4aandg_com/https_www_eva4aandg_com_general-5/content_4.html": "top of page\nWant to help Eva?\nEva and her team welcome any help that you can give\nDelivering leaflets\nCanvassing (if you are new to this we will team you up with an experienced person).\nTransport - People to and fro and/or picking up and delivering election materials.\nPolling duty at polling places on election day.\nEvents\nWhat is happening in the campaign\nKeep up to date with any late changes on our Facebook and Twitter/X feeeds.\nClick on any event in the calendar for details. If a post has an address on it, click on it and it will give you a map.\nChose the option 'Directions' and it will give you the best route to get there.\nGive it time to work.\nIf you have trouble with this link because of Yahoo, email directly to info@voteeva.scot\nCLACKMANNANSHIRE & DUNBLANE\nMID SCOTLAND & FIFE\nbottom of page",
  "https_www_eva4aandg_com/https_www_eva4aandg_com_blog/content_7.html": "HOME\nVIDEOS EVA\nVIDEOS ON THE ROAD\nGALLERY\nWANT TO HELP?\nMY ADDRESS TO YOU\nABOUT\nSCRIBBLES\nCONTACT\nBlog\nSearch Results\nMore",
  "https_www_eva4aandg_com/https_www_eva4aandg_com/content_1.html": "ABOUT\nEVA COMRIE\nVote Eva is a site dedicated to supporting Eva's election as an MSP for the Clackmannanshire and Dunblane constituency.or the Mid Scotland and Fife region. The website offers services such as the Election Manifesto and aims to collect donations, build a volunteer network, and share blogs. Eva has a strong track record of community involvement, having previously served as a councillor and being an outspoken advocate on various issues. Her commitment to the community sets her apart from other candidates. This space will highlight Eva's unique approach and involvement in local campaigns and issues.\nThe sma' folk are on the field\nScotland’s resounding victory at Bannockburn on 24 June 1314 was especially significant because of the role played by the sma’ folk. Those of us determined to replicate the achievements of the last man to unite the Scots and attain our country’s Independence know that the sma’ folk are today, as they were 710 years ago, vital to the achievement of our goal. And it is the sma’ folk who will benefit most when we realise it. We can start by making this General Election Scotland’s Independence Election.\nToday Scotland stands at a political crossroads similar to those faced by Wallace in 1297 and Bruce in 1314.\nBorn in Stirling, living and working for most of my life in Clackmannanshire and the Forth Valley, I know the constituency like the back of my hand. The landscape is stunning, the history blood curdling and inspiring in equal measure. But my friends and neighbours are skint and cold, worried about the future, in this land of plenty. Climb the Ochil hills behind my home town of Alva and see Grangemouth and the bridges - Kincardine, Clackmannan, Forth road and rail and the Queensferry Crossing. Marvel at the engineering skills of our people yet observe in the same panorama abject poverty and deprivation, a multiplicity of food banks, baby banks and school clothing banks - testament to a laudable community spirit but also to the absence of political will, vision or strategy for change.\nConsider the prospect of the continued deadly de-industrialisation of Scotland that the loss of the Grangemouth oil refinery will comprise; from the top ten oil producers reduced to the status of a third world country, reliant on England refining Scotland’s oil! Scotland - the country that discovered oil and became a desert. No stetsons, diamonds, ranches or multi million dollar oil funds for us - just dole queues, drugs deaths, drinking dens and dunces. It doesn’t have to be this way - and it won’t be when we grasp that thistle and unite in our common cause. Grangemouth is a national campaign and retaining, improving and replacing the oil refinery there must become a national and urgent mission.\nWomen of Scotland and of this constituency have been badly betrayed by politicians duped by an ideology into encouraging us to ignore truth and science and pretend to the detriment of children and vulnerable adults that humans can change sex. The defence of single sex protections is and will also be a priority for me, backed up by forty years of practising in family and child law.\nIn the forthcoming General Election we must chap every door and speak with every voter in every scheme and estate in Scotland, record those who support our cause and engage with those yet to be persuaded.\nIn my campaign to win Alloa and Grangemouth I intend to encourage the disenfranchised to trust that with Independence they will have hope, the chance of equality and respect and for once in several generations the ability to break the cycle and release the power of Scotland’s greatest resource - the potential of our people.\nI will show that with our freedom we can rebuild Scotland; a national energy company, a national house building company - these will be ours to design and empower when we have the economic levers in Scotland’s hands. We’ll retain our resources for our good, build schools and hospitals, road and rail networks, ferries and buses, pay a decent wage to all and provide universality of welfare and benefits at levels enabling all to maintain self respect. In other words, in an independent Scotland, we can put the heating back on and live like those of other normal independent countries - like Norway, Germany, France, you get the picture.\nElection Day will be a positive day where we look forward to the realisation of our dream - Scotland will flourish when we reap our own harvest and ring\nour own till.\nJoin my campaign today. Now is the day. Now is the hour. Break the servile chains, the woes and pains of oppression and set Scotland free.\nRecomended reading/viewing",
  "https_www_eva4aandg_com/https_www_eva4aandg_com_about-5/content_2.html": "HOME\nVIDEOS EVA\nVIDEOS ON THE ROAD\nGALLERY\nWANT TO HELP?\nMY ADDRESS TO YOU\nABOUT\nSCRIBBLES\nCONTACT\nBlog\nSearch Results\nMore"
}