{
  "https_graemedownie_com/https_graemedownie_com_candidate-says-worrying-fife-has-lowest-pain-clinic-referral-acceptances/content_56.html": "A council candidate has written to the Chair of NHS Fife asking why the region has the lowest number of accepted referrals to Pain Clinics in Scotland and expressing his concern this might be due to lack of resources for those suffering Chronic Pain.\nGraeme Downie, Scottish Labour candidate for West Fife and Coastal Villages, said the figures, published today, show only 40% of those referred to a Pain Clinic in NHS Fife are accepted. Mr. Downie has questioned why acceptances are so low and has written to Tricia Marwick asking for more information on the reasons behind the figures.\nThe figures that of 352 patients in Fife referred to a Pain Clinic, only 144 (40.9%) were accepted, compared to a Scottish average of 81.5%, making it the lowest in Scotland. These figures are in-line with figures for NHS Fife in previous quarters.\nCommenting on the figures, Graeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, said:\n“It is worrying Fife has the lowest acceptance rate of referrals to Pain Clinics in Scotland and I have written to the Chair of NHS Fife to ask why this might be the case.”\n“Those living with Chronic Pain deserve to been seen by a specialist as quickly as possible but these figures indicate there is a problem with the service being provided by NHS Fife.”\n“I am concerned this is either because of limited resources available to help those with Chronic Pain or because GPs in Fife do not have adequate training to make a correct referral so hope NHS Fife can clarify as soon as possible.”",
  "https_graemedownie_com/https_graemedownie_com_author_graeme-downie_page_4/content_35.html": "Dunfermline and West Fife could miss out on investment, skills and jobs as a result of the knock down sale of offshore wind leases, according to a local Councillor. Cllr. Graeme Downie, Scottish Labour Councillor for West Fife and Coastal Villages, said estimates...\nDunfermline should be the “New Capital” for innovation, investment and economic growth in Fife while delivering excellent public services for communities, according to a local Councillor. Scottish Labour Councillor Graeme Downie made the comments after speaking to...\nA West Fife Councillor believes the successful bid by Forth Ports for a Green Freeport could unlock the economic potential of the site of the former Longannet Generating Station near Kincardine. Cllr. Graeme Downie, Scottish Labour Councillor for West Fife &...\nA West Fife Councillor has welcomed the decision by Fife Labour Council to remove charges for bulky uplifts from this April. Cllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, said that the move will tackle the blight of fly-tipping,...\nA Member of the Fife Health & Social Care Board has written to the Health Secretary, Humza Yousaf MSP, urging him to allow over £20m of Covid money due to be returned to the Scottish Government to be spent addressing the current health crisis in the Kingdom Cllr....\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_snp-budget-fails-dunfermline-dollar/content_7.html": "Commenting on the Scottish Budget announced this afternoon, Graeme Downie, Labour Candidate for Dunfermline & Dollar, said:\n“Opportunity, aspiration and ambition should be at the heart of plans for Dunfermline to take advantage of city status, yet the SNP are harming the potential for our area by cutting £30m in cities investment next year.”“Alongside cuts to funding for rail services, a seeming end to Green Economy spending altogether and a reduction in agricultural support, this Budget is asking working people in Dunfermline & Dollar to pay for the mismanagement of the economy by the SNP and the Tories.”“If elected as the Labour MP for Dunfermline & Dollar next year I will work to use Dunfermline’s city status to deliver more investment and bring more high skilled jobs to places like Rosyth shipyard.”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_author_graeme-downie_page_11/content_75.html": "Comrades, I have bad news. The electorate think Scottish Labour is out of touch and that the party arrogantly believes it is special and somehow morally superior to other political parties. You know why? Because we are out of touch and arrogantly believe we are...\nIt has been fantastic watching new Scottish Labour MSPs working so effectively since the election, both at Holyrood and in their communities. It has been equally heartening to see those same MSPs, and others in the group, being so heavily involved in issues that will...\nThere is a tendency in opposition to decry all government ideas, call them unworkable or unrealistic. Afterall, oppositions are there to oppose. However, history shows that the most successful political parties steal and refine, from governments, think-tanks,...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_category_blog_page_2/content_23.html": "Firstly, yes, this is a very long sub-tweet. As I have said before, Scottish Labour can continue on a path to recovery and relevance by supporting people’s aspirations and by reaching out to build as broad a coalition as possible. To do that we need to talk about...\nAfter a Westminster election, The British Election Study (BES) can be invaluable in getting behind the punditry and perceived wisdoms to more fact-based lessons and analysis that political parties can use. In 2017, the BES found there was no “youthquake” in favour of...\nComrades, I have bad news. The electorate think Scottish Labour is out of touch and that the party arrogantly believes it is special and somehow morally superior to other political parties. You know why? Because we are out of touch and arrogantly believe we are...\nIt has been fantastic watching new Scottish Labour MSPs working so effectively since the election, both at Holyrood and in their communities. It has been equally heartening to see those same MSPs, and others in the group, being so heavily involved in issues that will...\nThere is a tendency in opposition to decry all government ideas, call them unworkable or unrealistic. Afterall, oppositions are there to oppose. However, history shows that the most successful political parties steal and refine, from governments, think-tanks,...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_candidate-calls-for-delay-and-financial-support-for-new-smoke-alarm-plans/content_68.html": "A local council candidate has urged the SNP-led Scottish Government to delay the implementation of rules that could require homeowners to spend hundreds of pounds on new smoke alarms.\nGraeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, has urged a delay in the implementation of the regulations requiring all homes to have an inter-linked system of smoke alarms and heat detectors so that financial support can be made available for those who might struggle to afford such a high cost.\nMr. Downie is concerned that many of those affected do not know what they have to do and could struggle to afford such an expense with cost of living rises already having an effect. Furthermore, he says a shortage of supply could stop even those who can afford from complying in time, putting their home insurance at risk were their property to be damaged by fire in the meantime.\nCommenting on the policy, Graeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, said:\n“With energy prices increasing and Tory tax rises on the horizon for working people, and with local suppliers telling me of a shortage of units, the SNP must think again about the best way to implement this important policy.”\n“I want to see a delay so we can work together to put in place financial support for people who will struggle to afford this equipment. If we don’t provide that support, we risk creating a group whose houses are less safe and could find it difficult to claim on their home insurance in the event of a fire.”\n“Everyone wants to get this fixed so let’s have a short delay, sit round a table and figure out the best way to support people and get this change implemented properly.”",
  "https_graemedownie_com/https_graemedownie_com_no-vote-is-ours-by-right-but-no-vote-should-be-out-of-reach/content_21.html": "Comrades, I have bad news. The electorate think Scottish Labour is out of touch and that the party arrogantly believes it is special and somehow morally superior to other political parties.\nYou know why? Because we are out of touch and arrogantly believe we are special and somehow morally superior to other political parties.\nI worked on the campaigns in 2007, 2011, 2016 and 2021. After each of those four elections I heard elected members, candidates, staff or activists utter phrases like “they will come back to us”, “they don’t know that they’ve done”, “they don’t understand”, “just give them time.” If that isn’t arrogant and presumptive then I don’t know what is.\nAt the same time, we, and I am as guilty of this as anyone, we reel off broken SNP promises, things they haven’t achieved, targets they have missed, what we see as dirty tricks or dishonest campaigning and then look on in disbelief as Scottish Labour lose yet another election. We think we are better than, purer than, above, beyond, the other parties or in a different realm altogether. It’s someone else’s fault, if only they would understand.\nWell, I have more news. We are not better than any other party, we are not purer, we are not in some kind of elevated position. We are in the same scrap for votes as they are. We want to win so we have the opportunity to put our values in to practice and help people. That’s politics.\nNo more was this obvious than during the most recent election. During the campaign, Scottish Labour introduced a new slogan, “people deserve a better government and better opposition.” Now, it was obvious to absolutely anyone that Scottish Labour were not going to sweep to power, with Anas Sarwar installed as First Minister after 7 May. And yet the response to bluntly stating this fact was not exactly universal acclaim. “We are giving up on winning”, “We shouldn’t concede”, “What’s the point if you aren’t in it to win.” I heard all of these things and more.\nSo why did this slogan cause such grumping? Because it pierced the bubble of our self-delusion and said what the voters themselves already knew. We weren’t going to win but we would try and improve the lives of people in Scotland no matter the result.\nWe had no divine right to anyone’s vote, we were going to fight for them all, we knew we had fallen far and had a long way to come back. I was told this on the phones and on the doors when people heard that slogan. “At least you understand”, “You know how far you have to go” and, my favourite, “I might listen to what you have to say.” Hardly a ringing endorsement, but perhaps a start.\nWe need to build on that when the council elections roll round again next year, always remind ourselves that we don’t have the automatic right to any vote but neither should any vote seem out of reach. Honesty, positivity and aspiration should be at the heart of everything we say.\nNo grumping, no complaining, no bemoaning lies or dirty tricks by our opponents. Show voters we are on their side, will stick with them, we will help them no matter the result. That we want to earn their votes and demonstrate that we deserve their votes through our words and actions in and out of power.\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_category_news_page_6/content_60.html": "A council candidate who previously highlighted statistics showing pressure on social care could see over 50,000 Fife patients spend longer in hospital than necessary, has welcomed plans to transform social care in Scotland by delivering free residential care for over...\nA council candidate has demanded that tackling alcohol-related deaths among at-risk groups is a top priority for Covid-19 recovery plans, new statistics showed NHS Fife had failed to meet national waiting time standards for treatment, and a new report warned of...\nA West Fife candidate has called for the SNP to help address the rising cost of living by blocking proposed rises in water charges and providing an immediate Fuel Costs Payment to help those most in need meet the rising cost of energy. Graeme Downie, Scottish Labour...\nA candidate for local elections in May has called for Fife Council’s latest transport plan to prioritise improving bus links from the West Fife villages to major transport hubs to meet carbon reduction targets and ensure better and fairer access to education and job...\nTwo local council election candidates have pledged to work together with government bodies and other parties to find a solution to clean up a site just outside Dunfermline which has become a serious environmental hazard and is restricting economic development in the...\nA local council candidate has urged the SNP-led Scottish Government to delay the implementation of rules that could require homeowners to spend hundreds of pounds on new smoke alarms. Graeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, has...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_category_news_page_3/content_41.html": "The Scottish Government’s decision to delay funding for a new GP surgery in West Fife means it could be 15 or 20 years after a replacement was promised before it is delivered. In a briefing shared via social media by Fife Health & Social Care Partnership, the...\nDunfermline and West Fife could miss out on investment, skills and jobs as a result of the knock down sale of offshore wind leases, according to a local Councillor. Cllr. Graeme Downie, Scottish Labour Councillor for West Fife and Coastal Villages, said estimates...\nDunfermline should be the “New Capital” for innovation, investment and economic growth in Fife while delivering excellent public services for communities, according to a local Councillor. Scottish Labour Councillor Graeme Downie made the comments after speaking to...\nA West Fife Councillor believes the successful bid by Forth Ports for a Green Freeport could unlock the economic potential of the site of the former Longannet Generating Station near Kincardine. Cllr. Graeme Downie, Scottish Labour Councillor for West Fife &...\nA West Fife Councillor has welcomed the decision by Fife Labour Council to remove charges for bulky uplifts from this April. Cllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, said that the move will tackle the blight of fly-tipping,...\nA Member of the Fife Health & Social Care Board has written to the Health Secretary, Humza Yousaf MSP, urging him to allow over £20m of Covid money due to be returned to the Scottish Government to be spent addressing the current health crisis in the Kingdom Cllr....\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com/content_1.html": "Welcome\nIt is the greatest honour of my life to be elected to serve as your Member of Parliament for the Dunfermline and Dollar constituency. I will do everything I can to serve you and your family and deliver for our communities.\nThe Dunfermline and Dollar constituency blends a rich history, vibrant communities and a future of dynamic growth. It includes Scotland’s newest city, Dunfermline, once a royal capital and now a thriving urban centre. Rosyth is home to a major naval dockyard, playing an ever-growing role in UK shipbuilding and defence. Our picturesque towns and villages, Dollar, Muckhart, Kincardine, Saline and Limekilns, add character to our area, offering a unique mix of heritage, natural beauty and local pride. Our former mining towns of Oakley, High Valleyfield and Comrie reflect the area’s industrial heritage and contribute to the resilience of our communities, as well as our proud working-class roots and strong sense of identity.\nIf you are a constituent and wish to contact me, you can do so by emailing me at graeme.downie.mp@parliament.co.uk or calling 01383 332841. My team and I will be happy to assist you with any enquiries or concerns you may have.\nOn my website, you can keep up to date with my work and constituency visits right across Dunfermline and Dollar as well as my contributions at Westminster, standing up for you in Parliament.\nAbout Graeme\nI live in the constituency on the West Fife coast with my wife and two daughters. Before being elected as the MP for Dunfermline and Dollar, I served as a councillor for West Fife & Coastal Villages and ran my own business.\nMy dad was an electrician all his working life – for the nationalised Electricity Board, the railways, the armed forces, and at Edinburgh Castle and Holyrood Palace. My mum worked in clerical and administrative roles across construction, insurance, and higher education. My sister is a Clinical Psychologist in our NHS.\nI was one of the first in my family to go to university. I got there through hard work and ambition – but I also got there because of great teachers and the opportunities provided by a good state school. Without public services like those, my journey would have been far more difficult, if not impossible.\nThe people of Dunfermline and Dollar voted for change – for a better future where everyone has the chance to achieve their ambitions. I will never be ashamed of being ambitious – for my community, for Fife, and for Scotland.\nAs your MP, I’m determined to help create a society where the opportunities my parents worked so hard to give me – and which successive Labour governments helped to deliver – are available to everyone.\nHow I can help you\nYour Title Goes Here\nYour content goes here. Edit or remove this text inline or in the module Content settings. You can also style every aspect of this content in the module Design settings and even apply custom CSS to this text in the module Advanced settings.\nHelp with Reserved Matters (UK-wide issues)\nMy constituency team and I can assist you with issues reserved to the UK government, such as immigration and visas, passports and nationality, pensions and benefits (e.g., Universal Credit), taxation and HMRC issues.\nRepresent your views in Parliament\nI can raise local issues that matter to your communities by asking questions and speaking in debates, writing to government ministers on behalf of constituents, submitting motions, petitions and responses to consultations and serving on All Party Parliamentary Groups (APPGs) on a range of issues relevant to our constituency.\nWork with Local Council's on Devolved issues\nWhile health, education, housing, transport, and a range of other matters are devolved to the Scottish Parliament and Scottish Government, I can liaise with local councils to coordinate support on these issues and raise matters on your behalf.\nAdvocate for our local area and communities interests\nI will always be a local champion for our constituency, supporting our industries and employers, promoting our local heritage, culture and community projects, and ensuring our local needs are heard in national debates.\nLatest News\nLabour government will cut energy bills and create jobs in Dunfermline & Dollar to tackle climate crisis, as SNP abandons targets\nA UK Labour government will save £300 off the average energy bills for families in Dunfermline & Dollar while bringing good jobs to the local...\nThanks due to Farmers for their vital role in local economy, says candidate\nA General Election candidate has thanked farmers for their contribution to the local economy, enhancing food security and tackling climate change...\nSNP Police cuts threaten Fife Remembrance services and community events\nA Scottish Labour General Election candidate has warned cuts to officer numbers mean Police Scotland will no longer be able to support community...\nDunfermline and Dollar voted for change.\nBlogs\nAspiration, ambition and the route through Scottish marginals\nYou could almost hear the eyelid muscles of Scottish Labour activists straining last week as we stared at the results of the YouGov MRP poll that had just been published. Don’t let the eyelids shut. Keep those eyes open. Don’t blink or it might go away. But no, it...\nScottish voted want change but not for its own sake\nI was delighted to be selected to be the Scottish Labour candidate for the seat where I live, Dunfermline & West Fife, likely to become Dunfermline & East Ochils after boundary changes. It it is a very winnable seat in a General Election, but also could be a...\nCrisis, what crisis? Values, what values?\nThe quote penned by novelist James Lane Allen “Adversity does not build character, it reveals it” applies about as clearly to the past two years of politics as perhaps at any time of the past. It is therefore worth reflecting on what the responses over the past two...\nNominatations for the Community Hero Award\nI am pleased to announce my new Community Hero Award, an opportunity for you to nominate a a local resident or group for or recognise individuals making a positive impact through volunteering, charity work, or community support.\nWinners are chosen quarterly, receive a certificate of recognition, and have their inspiring stories shared by Graeme Downie MP’s office.\nGet in touch with me\nIf you have a constituent enquiry please email me at graeme.downie.mp@parliament.uk or telephone my office on 01383 332841.",
  "https_graemedownie_com/https_graemedownie_com_momentum-builds-for-kincardine-health-centre-campaign/content_12.html": "A campaign to reverse a decision to withdraw funding for a new health centre in Kincardine is gathering momentum after a public meeting this afternoon secured the support of a leading MSP.\nThe meeting was organised by Cllr. Graeme Downie, Fife Labour Councillor for West Fife & Coastal Villages and heard from Jackie Baillie MSP, Shadow Cabinet Secretary for NHS Recovery, Health and Social Care.\nJackie Baillie gave her support for the campaign and pledged to raise the issue at Holyrood with SNP Health Secretary Michael Matheson.\nCllr. Downie gave an update on the current situation including:\n- The current health centre is a cottage built in the early 20th century.\n- A report in 2016 confirmed it was not fit for purpose for reasons including a lack of disabled access, no storage and insufficient space.\n- Scottish Government and NHS Fife agreed a plan and funding for a new health centre in the village which would better serve the growing population of the area and bring more services together.\n- In March 2023, the SNP announced they were delaying their funding until “the second half of the decade” because it was no longer a priority.\n- Other projects in Fife affected by the delay include plans for a new health centre in Lochgelly.\n- Despite approaches from local people, Health Secretary, Michael Matheson MSP, has refused to meet with local people to explain the decision.\nSpeaking after the event Cllr. Graeme Downie said: “It is outrageous that the person responsible for breaking their promise to the people of Kincardine to provide a new health centre is too scared to come and explain that decision to the community.\n“It would only take a small diversion of his Ministerial car but Michael Matheson is unwilling to even do that.\n“I am delighted to have the support of Scottish Labour and Jackie Baillie MSP and I am sure with her help at Holyrood we can continue to press the SNP Scottish Government to do the right thing and bring back the funding that this centre so desperately needs.”\nCommenting, Scottish Labour Health Spokesperson Jackie Baillie said: “For too long people in Kincardine have been let down by an SNP government that is out of ideas and out of touch.\n“This health centre is vital to the local community, but Mr Matheson has not even taken the time to explain this decision to the people he’s letting down.\n“I will be raising this issue in Holyrood and hope to hear from Mr Matheson soon.”",
  "https_graemedownie_com/https_graemedownie_com_locums-not-enough-to-plug-fife-gp-gaps-says-councillor/content_39.html": "Attempts by NHS Fife to plug gaps in GP services with locums are falling short, according to a Fife Labour Councillor, who wants more information about how other interventions can maintain a high level of care for people and communities.\nFigures obtained through a Freedom of Information request by Cllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, show an average of four locums covering 25 sessions each month since January 2021.\nWith each session intended to last four hours and 10mins, that means approximately just 13 days of additional GP cover across the Kingdom being provided by locum GPs.\nNHS Fife has regularly posted on social media about reduced services at GP surgeries across the Kingdom.\nCllr. Downie wants more detail about how multi-disciplinary teams, which NHS Fife say can provide a very high standard of care without the need to see or speak to a GP, will work and reassurance that the staff exist to fill those teams.\nCommenting on the figures, Cllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages said:\n“In just the last month, NHS Fife have posted four warnings on their Facebook page about reduced services at GP surgeries across the Kingdom.”\n“We are told there is a shortage of GPs nationwide and clearly there are not enough locum doctors to fill the gaps either.”\n“At Valleyfield Practice in my own Ward which has had extensive problems over recent years. Patients were reassured in a letter on 1 July that a multi-disciplinary team is being deployed to maintain service levels.”\n“I trust that could be the case but people need to know what the composition of those team might be and that NHS Fife have the staff to fill them. Only then can people and communities feel properly assured.”",
  "https_graemedownie_com/https_graemedownie_com_author_graeme-downie_page_8/content_62.html": "A council candidate has demanded that tackling alcohol-related deaths among at-risk groups is a top priority for Covid-19 recovery plans, new statistics showed NHS Fife had failed to meet national waiting time standards for treatment, and a new report warned of...\nA West Fife candidate has called for the SNP to help address the rising cost of living by blocking proposed rises in water charges and providing an immediate Fuel Costs Payment to help those most in need meet the rising cost of energy. Graeme Downie, Scottish Labour...\nA candidate for local elections in May has called for Fife Council’s latest transport plan to prioritise improving bus links from the West Fife villages to major transport hubs to meet carbon reduction targets and ensure better and fairer access to education and job...\nAs a local council candidate, what strikes me speaking to people is that everyone, regardless of age, gender, background or political affiliation, wants to make their community and country, however they identify that, better. We know the divisiveness of the...\nTwo local council election candidates have pledged to work together with government bodies and other parties to find a solution to clean up a site just outside Dunfermline which has become a serious environmental hazard and is restricting economic development in the...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_scottish-labour-should-mean-business-as-well/content_22.html": "It has been fantastic watching new Scottish Labour MSPs working so effectively since the election, both at Holyrood and in their communities. It has been equally heartening to see those same MSPs, and others in the group, being so heavily involved in issues that will be front and centre over the next five years.\nFrom Paul Sweeney and Pam Duncan-Glancy fighting for better services in Glasgow, to Martin Whitfield highlighting the importance of involving young people in real policy development.\nWe need to do more of this and broaden our coalition to also involve more of those in the business sector who share our values and are frustrated with the SNP for a lack of clear economic strategy or approach.\nIn the past, there has been a seeming reluctance for Scottish Labour to engage with business but we ignore this group at our peril. Afterall, the first concern of almost all of the voters we must win over is their job or career, be that in the public sector or private sector. They want to pay the bills, of course, but also be valued and see career progression, increased income and job satisfaction. We need to work with businesses, unions and employees to make that happen.\nWe must harness the ideas business has for how government at local or national level should support and them either to start-up or to grow. This is not just a matter of funding, often businesses are looking for clear guidance if they are welcome in certain areas or not, are the supply chains and skills in place so they can grow.\nBy helping businesses setup, stay or grow in Scotland, we are helping our target voters meet their own aspirations for their careers and families as well.\nWe need to reach out to businesses who don’t naturally engage with government or who have backed away from politics because they feel the current administration doesn’t understand or support them effectively.\nWe must use that knowledge and ensure that creating as well as keeping jobs is a key component of our manifestos for the Council elections next year and beyond.\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_west-fife-councillors-support-transformative-vision-for-fife/content_52.html": "Four Scottish Labour Councillors representing West Fife, Dunfermline and Rosyth have unanimously backed proposals for a Labour minority administration to run Fife Council and called the plans for the next five years, “transformative”. The four have also supported plans for colleague, Jim Leishman, to continue as Provost as Fife.\nLabour Councillors will be seeking support to form a Labour Minority Administration on Thursday as Fife Council meets to agree its new governance structure.\nIn a statement, the four Councillors (Graeme Downie, West Fife & Coastal Villages; Cara Hilton, Dunfermline South; Gordon Pryde, Dunfermline North; and Andrew Verrecchia, Rosyth) said:\n“The election on 5 May did not provide a majority for any single party so it is up to each to present their vision for Fife and see which of those could win the support of a majority . That is democracy.”\n“The people of Fife are right to demand Fife Council make their lives better and fairer. Cuts to local government budgets by the SNP / Green coalition at Holyrood will make it very difficult but we believe the Fife Labour manifesto has the potential to be transformative for Fife by; helping people with increases in the cost of living; upgrading roads and public transport; improving social care; and creating new job opportunities.”\n“We will be supporting Jim Leishman to continue as the Provost of Fife. Jim has been a fantastic ambassador for Fife and we hope he will get the overwhelming support of the Council on Thursday.”\n“Should our proposals be agreed by the Council, we look forward to working with all other parties to improve services across the region and focussing on the most important thing, the people of Fife.”",
  "https_graemedownie_com/https_graemedownie_com_health-secretary-still-refuses-to-meet-west-fife-community-over-broken-health-centre-promise/content_32.html": "A local Councillor has one again urged Scottish Health Secretary, Michael Matheson MSP, to meet with the local community in Kincardine to explain his government’s decision to refuse funding for a new Health Centre, initially promised in 2016.\nCllr. Graeme Downie, Labour Councillor for West Fife and Coastal Villages, has written to Mr. Matheson asking him to meet with the community in Kincardine to explain the Scottish Government decision to refuse previously promised funding. That funding is now unlikely to appear until at least the end of the decade, or even later.\nMore than 300 people in Kincardine have now signed a petition online or in person urging the Health Secretary to reverse this decision and provide funding for the new health centre immediately.\nIt comes as press reports indicate Mr. Matheson will visit Lochgelly Health Centre, who has also been refused funding, after pressure from Fife Labour (https://www.centralfifetimes.com/news/23506789.government-minister-visit-dilapidated-health-centre/)\nCommenting, Cllr. Downie said:\n“I am delighted that pressure from Fife Labour colleagues means Mr. Matheson will visit Lochgelly to explain why his government has broken its promises on funding, yet he refuses to explain himself to people in Kincardine.”\n“Mr. Matheson’s Ministerial Car will have to drive through Kincardine from his Falkirk constituency to get to Lochgelly. Why doesn’t he just stop on the way and explain why his government has broken its promise to people in Kincardine and what he is going to do to make sure they are still receiving proper medical services?”\nText of letter to Michael Matheson MSP\n“Dear Mr. Matheson\nI am writing, as I did to your predecessor, to ask you to meet with the local community in Kincardine to explain why promised funding for a new health centre in the village might not be provided until the end of the decade or even later.\nI note your reply to the Leader of Fife Council, Cllr. David Ross (REF 202300351344), contained some excuses but I believe the people of Kincardine deserve an explanation in person and the opportunity to ask you some questions and, hopefully, receive some reassuring answers.\nMore than 300 people in Kincardine have signed a petition urging you to reverse your decision and provide funding immediately.\nI note press reports that you intend to visit Lochgelly Health Centre which has also been denied funding in a similar manner. I hope during that visit you will meet with local Councillors and community groups to hear more about their concerns as well.\nThe people of Kincardine often tell me they feel forgotten by the Scottish Government and, given the proximity of your own constituency to the village, I hope you can find time to visit soon and explain your decisions to local people.\nI look forward to hearing from you.\nYours sincerely,\nCllr. Graeme Downie”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_councillor-blasts-snp-failure-as-longannet-plans-collapse/content_51.html": "Plans for a major site in Fife that could have delivered thousands of jobs and created training opportunities in areas of high unemployment are in ruins after the Scottish Government agency responsible for economic development admitted plans to bring high-speed train manufacturing to the site had ended.\nIn a letter to a local Councillor, Scottish Enterprise have admitted their option to purchase the site of the former Generating Station at Longannet, near Kincardine in Fife, had expired following confirmation from Talgo last year that they had been unsuccessful in the bid process for HS2.\nThe confirmation comes just a few months after Talgo claimed they still intended moving ahead with their plans and Scottish Enterprise said they were still actively marketing the site. (https://www.bbc.co.uk/news/uk-scotland-scotland-business-59775943 / https://www.dunfermlinepress.com/news/19799256.kincardine-talgo-remain-committed-40m-investment-longannet/)\nThe plans for Talgo to move to Longannet had been supported by the First Minister, Nicola Sturgeon MSP, as well as local MSP, Cabinet Secretary for Education, Shirley-Anne Somerville, and MP, Douglas Chapman.\nThose plans now appear to be in tatters as Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, has received a letter from Adrian Gillespie, Chief Executive of Scottish Enterprise, confirming the option on the side has expired. Mr. Downie has likened the failure to the CalMac Ferry fiasco, saying the SNP are more interested in press coverage than helping people.\nCommenting, Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, said: “We have seen this again and again with the SNP, from Ferries to BiFab. They are more interested in looking good than in actually helping people and communities. We were led to believe these plans could go ahead regardless of Talgo’s HS2 contract but that appears not to be the case.”\n“I believe Scottish Enterprise entered in into these discussions in good faith but have been let down by the lack of a strategic plan from the SNP / Green Scottish Government. The Longannet site has fantastic road and sea links and the fact the Scottish Government have failed to prioritise realising this potential is an absolute scandal.”\n“I wrote to the Chief Executive of Talgo two weeks ago asking for more information but have yet to receive a reply. I will be speaking to colleagues and Officers at Fife Council to see what more can be done but a site of this important requires encouragement from the centre and that has been sadly lacking in this case.”\n“We need a proper, long-term strategy for the Longannet site that take advantage of local skills and bring all parties round the table to put together a plan that seeks to bring jobs, possibly related to solving climate change, to this part of Fife.”\n——ENDS——\nLetter text below:\n“Dear Councillor Downie\nThank you for your letter dated 13th May 2022 regarding the development of the site of the former Longannet Generating Station.\nWhile Scottish Enterprise had agreed an option to purchase the site from its owner Scottish Power that has now expired following confirmation from Talgo last year that they had been unsuccessful in the bid process for HS2.\nWe would, of course, be happy to meet with you to discuss further the efforts we are undertaking to secure a productive use for the site, and Neil Francis, our Interim Managing Director, Scottish Development International and leadership champion for the region, would be pleased to do this. If you would find this helpful, please do get in touch with Neil <EMAIL ADDRESS SUPPLIED>”",
  "https_graemedownie_com/https_graemedownie_com_transport-plan-must-tackle-wholly-unacceptable-west-fife-villages-links/content_67.html": "A candidate for local elections in May has called for Fife Council’s latest transport plan to prioritise improving bus links from the West Fife villages to major transport hubs to meet carbon reduction targets and ensure better and fairer access to education and job opportunities.\nGraeme Downie, Scottish Labour candidate for West Fife and Coastal Villages, said journeys from places like High Valleyfield, Torryburn, Culross and Kincardine to rail and bus hubs such as Inverkeithing station and Ferrytoll P&R should be a priority in Fife Council’s Local Transport Strategy after the opening of the consultation on the Main Issues report last week (27 January)\nMr. Downie pointed to the contrast of a 15min car journey from the villages to these hubs, whilst a bus journey takes an hour or more. He said the disparity makes it difficult for those living in West Fife villages who do not have access to a car as well as for those trying to reduce their carbon footprint.\nGraeme wants to see improved bus services and other public transport options in the West Fife Villages and is urging people to contact him via social media to let him know of their own priorities for future transport in the area.\nCommenting, Graeme Downie, Scottish Labour candidate for West Fife and Coastal Villages, said:\n“Delivering access from the West Fife villages to transport hubs through local bus services must be a key priority for Fife Council’s future transport strategy.”\n“For a 15-minute car journey to somewhere like Inverkeithing or Ferrytoll to take over an hour by bus at peak times is wholly unacceptable; it significantly reduces educational and job opportunities for people living in the West Fife villages without access to a car. Access is even harder for people travelling outside peak times, with sparse services and journey times up to 90mins.”\n“For those with access to a car, the poor services makes it much harder for them to reduce their carbon footprint which is rightly one of the objectives of the proposed transport strategy.”\n“We must demand better and fairer localised public transport to take people to these hubs. I am asking anyone who is impacted by this to get in touch via my Facebook page as well as anyone who has other transport issues they believe should be a priority for this area.”",
  "https_graemedownie_com/https_graemedownie_com_a-little-more-conversation-a-little-less-self-destruction-please/content_13.html": "Firstly, yes, this is a very long sub-tweet. As I have said before, Scottish Labour can continue on a path to recovery and relevance by supporting people’s aspirations and by reaching out to build as broad a coalition as possible.\nTo do that we need to talk about issues the SNP are not comfortable on, education, jobs, economy, health services, and offer up our own alternative vision. That is something we have been doing very well the past few weeks.\nWhat we shouldn’t do, and must not do, is to open up conversations on topics where the SNP are entirely comfortable and can spin populist rhetoric without ever having to explain any of the detail.\nThat is why it was disappointing to see a Labour MSP voluntarily and proactively open two such topics of conversation this morning. All this will do is give red meat to SNP activists and move the conversation away from where Scottish Labour have successfully kept it during the debate on Covid regulations at Holyrood, on helping tenants and supporting neglected sectors of the economy like hospitality, the night time economy and taxi drivers.\nGoing off message is inevitable sometimes and we shouldn’t be robots but to proactively give an interview on these topics, allowing the conversation to be dragged away from where it should be is deeply unhelpful and potentially damaging at a time when we were starting to show we were on people’s side.",
  "https_graemedownie_com/https_graemedownie_com_pressure-on-social-care-could-see-over-50000-fife-patients-spend-longer-in-hospital/content_61.html": "New figures show pressure on social care could see over 50,000 Fife patients spend longer in hospital according to a West Fife council candidate.\nGraeme Downie, Scottish Labour Candidate for West Fife and Coastal Villages, has analysed the latest figures from the Scottish Government and believes over 50,000 people in Fife could see their discharge from hospital delayed, an increase of 69% on last year and up 21% from before the Covid-19 Pandemic.\nThe figures also show pressure on social care is the primary driver for the increase with the number of delayed discharges due to “health and social care reasons” in Fife set to exceed 35,000, more than doubling since last year and increasing by 20% since before the pandemic.\nMr. Downie has called for a “New Deal for Social Care” including pay staff £15 an hour to aid recruitment and provide additional funding to Fife Council to help tackle the problem.\nCommenting on the figures, Graeme Downie, Scottish Labour candidate for West Fife and Coastal Villages, said: “I’m sad to say I’ve repeatedly heard from families how upsetting it is to have a relative stuck in hospital because of health and social care shortages in West Fife and Coastal Villages.”\n“Delayed discharges not only put unnecessary pressure and costs on acute services but prevent a person from living more independently in their home or community, where we know recovery is better.”\n“With health and social care staff continuing to work so hard to protect us from Covid-19, the Scottish Government must provide proper funding for a £15 an hour wage for care workers and provide Fife Council the resources it needs to improve social care so we can begin to reduce the problem of delayed discharges.”\nData\n| Year | All delayed discharges (Fife local authority area)\n|\n“Health and Social Care Reasons” for delay (Fife local authority area) |\n| 2019/20 | 41,735 | 29,278 |\n| 2020/21 | 29,970 | 17,846 |\n| 2021/22 (Apr-Oct) | 29, 970 | 20,656 |\n| 2021/22 (projected) | 50,530 | 35,410 |\nFigures are available for April 2021 to October 2021 inclusive, with projections derived from those 7 months. Previous full year figures have shown no significant drop over the period for October – March indicating this extrapolation is a fair indicator of full 2021-22 figures.\nFull data tables are available via Public Health Scotland.",
  "https_graemedownie_com/https_graemedownie_com_global-climate-challenge-time-to-act-local/content_14.html": "Recently, I was listening to the final episode of my favourite podcast, Talking Politics, which is ending after six educational years. As the team of Professor David Runciman and the incomparable Helen Thompson neared the end of the recording, they listed the things they hadn’t been able to cover in that last episode. Remarkably, this included the future of the UK, the stability of American democracy and climate change. From the COVID pandemic to war in Ukraine, plus the spiralling cost of living and the climate emergency our politicans are not short of challenges although unfortunately we can sometimes find them short of solutions.\nClimate change has been discussed routinely on the show and both hosts believe it will shape global politics of the next decades. But when politicians shaping policy try asking, “what will this mean for the climate?” the discussion becomes impossibly complex very quickly. On a geopolitical level, we seem to be pursuing a strategy of managed decline and praying for a miracle in the form of new technology. That isn’t good enough.\nPoliticians like to keep total control of issues like climate change, following a fallacy that large problems need large solutions. I would suggest large problems need large scaffolding but millions of small pieces of variety to complete the building. The latest research from the Fabians Talking Green shows that the public are supportive of climate action but the language of “net zero” and “green industrial revolution” do not resonate, with working class people and older people particularly less convinced of the economic benefits of taking action and more likely to prioritise protecting jobs over taking action on climate change.\nSo, instead of starting tackling climate change from the almost incomprehensible and unreachable concepts of a global problem, let’s start local.\nPresident Joe Biden said, when he thinks “climate change” he hears “jobs.” Political shorthand to be sure but he is right. There are a few fringe voices suggesting we must choose between a prosperous economy and saving the planet but it is not a view I subscribe to. The job for progressives is to build a broad coaliton of support for climate action and talk about how we can improve peoples lives and job prospects.\nIn the ward where I am a candidate in May, West Fife & Coastal Villages, we have as clear a footprint of Scotland’s industrial heritage as you will find anywhere. From coal-mining communities like Oakley, Blairhall and Valleyfield, to Longannet, once the largest coal-fired power station in Europe, now being slowly demolished, with no firm plan for the future of the massive site.\nThis part of Fife quite literally powered the economy of Scotland and the UK for almost 40 years. From people to skills to raw material, to energy to supply chain, to the UK and European economy. Energy was what they did.\nI know from speaking to people while campaigning that two things feature at the top of their priorities now. Their local economy and their local environment. If an area like this is seized by those two issues, surely the Venn Diagram of using local economies to improve climate is already there?\nIf we are to tackle climate change and hear “jobs” as President Biden does, we will need values like sustainable development and international cooperation but implemented in a way that begins to equalise power, wealth and opportunity. That takes it from the global scaffolding to the local rendering.\nTo do this, we must not only build trust but trust communities to shape their own local economies and local environments. Trust that they already share basic values of wanting better for their children, in both jobs and climate.\nWe must allow communities a greater say through more active, participatory democracy. We must demand better and fairer distribution of power and money to councils and on to communities.\nTrusting in that fashion is difficult and, let’s be honest, risky, with no guarantees of success. But is focussing on local economies to meet a global environmental challenge really any riskier than the situation we find ourselves in, daunted by complexity and hoping for technology to save the day?\nThis piece initially appeared on the Scottish Fabian website:",
  "https_graemedownie_com/https_graemedownie_com_author_graeme-downie/content_8.html": "A UK Labour government will save £300 off the average energy bills for families in Dunfermline & Dollar while bringing good jobs to the local community, the Scottish Labour candidate for the area said today. Graeme Downie said Labour’s Green Prosperity Plan shows...\nA General Election candidate has thanked farmers for their contribution to the local economy, enhancing food security and tackling climate change saying that, if elected, he will listen to and support the local farming community across the Dunfermline & Dollar...\nA Scottish Labour General Election candidate has warned cuts to officer numbers mean Police Scotland will no longer be able to support community events in Fife, putting Armistice Day commemorations and other activities at risk. Graeme Downie, Scottish Labour Candidate...\nCommenting on the Scottish Budget announced this afternoon, Graeme Downie, Labour Candidate for Dunfermline & Dollar, said: “Opportunity, aspiration and ambition should be at the heart of plans for Dunfermline to take advantage of city status, yet the SNP...\nA campaign to reverse a decision to withdraw funding for a new health centre in Kincardine is gathering momentum after a public meeting this afternoon secured the support of a leading MSP. The meeting was organised by Cllr. Graeme Downie, Fife Labour Councillor for...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_fife-councillor-demands-health-secretary-stops-20m-funding-clawback/content_43.html": "A Member of the Fife Health & Social Care Board has written to the Health Secretary, Humza Yousaf MSP, urging him to allow over £20m of Covid money due to be returned to the Scottish Government to be spent addressing the current health crisis in the Kingdom\nCllr. Graeme Downie (Lab, West Fife & Coastal Villages) who sits on the Fife Integrated Joint Board (IJB) says it is a scandal the organisation is being told to return £20m of money allocated to addressing Covid rather than spend it on addressing social care and health issues in Fife.\nThe call comes as the Health Secretary and the First Minister stated this week that Covid is one of the major factors behind the current crisis facing the Scottish NHS.\nCllr. Downie says he has raised the issue at previous meetings of the IJB as and feels their hands are being tied by the SNP Scottish Government in Edinburgh.\nHe has pointed out that figures show clear future costs of Covid in the coming years in Fife and believes Edinburgh is grabbing money that should be spent on improving services locally.\nCommenting, Cllr. Downie, Scottish Labour Councillor for West Fife & Coastal Villages said:\n“Fife health and social care services are facing a crisis, we are seeing it every day in the news and our own experiences of friends and family.”\n“The Health Secretary says Covid is one of the causes of the problems yet the SNP Scottish Government is taking back over £20m of money allocated for Covid spend in Fife. That is a scandal when that money could be used now to help address some of the problems Covid is still causing in our health services.”\n“Surely it is common sense to allow Fife Health & Social Care Partnership to spend that money now to help address the current problems we are facing.”\n“For example, why not use that money to hire short-term staff to deal with the challenges Covid still presents, at least helping prevent burnout of current staff and give them help they deserve?”\n“The crisis we are facing is partly caused by Covid and winter health pressures but doctors and health staff will tell you that those pressures are merely bringing to light structural problems that already existed.”",
  "https_graemedownie_com/https_graemedownie_com_news/content_16.html": "News & Updates\nFind out more about my work as your Member of Parliament for Dunfermline and Dollar here\nLabour government will cut energy bills and create jobs in Dunfermline & Dollar to tackle climate crisis, as SNP abandons targets\nby Graeme Downie | 18 April 2024 | News | 0 Comments\nA UK Labour government will save £300 off the average energy bills for families in Dunfermline & Dollar while bringing good jobs to the local community, the Scottish Labour candidate for the area said today. Graeme Downie said Labour’s Green Prosperity Plan shows...\nThanks due to Farmers for their vital role in local economy, says candidate\nby Graeme Downie | 10 April 2024 | News | 0 Comments\nA General Election candidate has thanked farmers for their contribution to the local economy, enhancing food security and tackling climate change saying that, if elected, he will listen to and support the local farming community across the Dunfermline & Dollar...\nSNP Police cuts threaten Fife Remembrance services and community events\nby Graeme Downie | 13 March 2024 | News | 0 Comments\nA Scottish Labour General Election candidate has warned cuts to officer numbers mean Police Scotland will no longer be able to support community events in Fife, putting Armistice Day commemorations and other activities at risk. Graeme Downie, Scottish Labour Candidate...\nSNP Budget fails Dunfermline & Dollar\nby Graeme Downie | 19 December 2023 | News | 0 Comments\nCommenting on the Scottish Budget announced this afternoon, Graeme Downie, Labour Candidate for Dunfermline & Dollar, said: \"Opportunity, aspiration and ambition should be at the heart of plans for Dunfermline to take advantage of city status, yet the SNP are...\nMomentum builds for Kincardine Health Centre campaign\nby Graeme Downie | 17 October 2023 | News | 0 Comments\nA campaign to reverse a decision to withdraw funding for a new health centre in Kincardine is gathering momentum after a public meeting this afternoon secured the support of a leading MSP. The meeting was organised by Cllr. Graeme Downie, Fife Labour Councillor for...\n“Valleyfield GP service improvements must start immediately”\nby Graeme Downie | 3 October 2023 | News | 0 Comments\nA Fife Councillor who supported a campaign for better GP services at a local health centre has welcomed the awarding of a new GP service contract and said while it might be a long road to bring the service fully up to scratch, he hopes improvements can start...\nTory economic disaster adding £170 a month to Dunfermline mortgages says candidate\nby Graeme Downie | 9 July 2023 | News | 0 Comments\nA local Fife candidate has welcomed news that a UK Labour government would do more to protect mortgage holders after figures showed an average mortgage holder in the Kingdom could see their monthly bill increase by as much as £170. Graeme Downie, Scottish Labour...\nCouncillor and MSP demand restoration of Coalfields funding after 60% cut\nby Graeme Downie | 26 June 2023 | News | 0 Comments\nA Fife Councillor and a Fife MSP have written to the Scottish Government to demand the restoration of funding to the Coalfields Regeneration Trust (CRT) after a further cut of £100k to the organisations budget. Cllr. Graeme Downie (Lab, West Fife & Coastal...\nFife sites like Longannet could be “landmark investments” for GB Energy\nby Graeme Downie | 19 June 2023 | News | 0 Comments\nA Labour candidate says the announcement the Headquarters of a British publicly-owned energy generation company will be based in Scotland is a huge opportunity for sites in Fife such as Rosyth and Longannet. Graeme Downie, Labour candidate for Dunfermline & West...\nJust 3% of Fife’s veterans have received promised ID card as Labour launches listening campaign\nby Graeme Downie | 12 June 2023 | News | 0 Comments\nJust 3% of veterans in Fife have received ID cards from the UK Government to help them access the services they need, as Labour’s General Election candidate for Dunfermline & West Fife launches a Veterans’ Voice campaign to understand concerns from former service...",
  "https_graemedownie_com/https_graemedownie_com_west-fife-councillor-urges-action-on-villages-housing-shortage/content_42.html": "A local Councillor has called for Fife Council to do more to tackle a shortage of social housing in the West Fife Villages.\nCllr. Graeme Downie, Scottish Labour Council for West Fife & Coastal Villages, says housing issues have been one of the issues raised most by constituents since he was elected in May 2022 and believes a shortage of supply is at the heart of the problem.\nCllr. Downie has asked for a meeting with Cllr. Judy Hamilton, Spokesperson for Housing & Building Services, to update her on current shortages and ask what more can be done to increase supply by Fife Council.\nIn particular, Cllr. Downie says he is concerned about shortages of suitable accommodation for those with disabilities or long-term health conditions.\nCommenting, Cllr. Downie, said:\n“Since I was elected, housing is one of the areas that people have been in touch about the most.”\n“I have heard from a wheelchair user living in an upstairs flat who has been waiting on a more suitable home for five years. I have heard from people living in private rented accommodation that is not suitable for them because of health conditions they have. Alongside that I have heard from people in their 30s living with their parents who just want somewhere nearby of their own.”\n“Officers have been fantastic helping with individual cases but it is clear that we have a shortage of appropriate housing for social rent in places like High Valleyfield and Oakley.”\n“These problems will take time to fix, of course, but I have written to Cllr. Hamilton today to ask her provide an assessment of the overall problem and what plans can be put in place to address it.”",
  "https_graemedownie_com/https_graemedownie_com_brutal-snp-cuts-mean-fife-has-almost-80m-road-repairs-backlog-says-candidate/content_57.html": "Cuts by the SNP government in Edinburgh to council budgets has left Fife with an £80m backlog of road repairs, a situation a council candidate has described as “brutal.”\nGraeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, has highlighted the figures obtained by the Scottish Labour Party via a Freedom of Information (FoI) request.\nThey show a total backlog of road repairs in Fife of £77,600,000.\nThe information comes as the Accounts Commission, an independent audit body, also warned of financial uncertainty and an overall reduction in funding for local authorities.\nCommenting, Graeme Downie said:\n“The state of roads in West Fife and Coastal Villages are the most visual impact of SNP cuts to local government. It is the issue that comes up most often on the doorsteps and we have seen reports recently of more than 40 pot holes in just one street in Oakley.”\n“This is the second report just this week warning of the impact of the brutal cuts to council budgets. It is time for the SNP in Edinburgh to wake up and realise the impact of their utter disregard for local communities. If elected, I will work with local people to Demand Better and Fairer funding for local communities across the West Fife Villages.”",
  "https_graemedownie_com/https_graemedownie_com_fife-labour-furious-but-not-surprised-as-snp-say-new-lochgelly-kincardine-health-centres-not-a-priority/content_34.html": "Fife Labour Councillors representing both Kincardine and Lochgelly have said they are “furious but not surprised” that the Health Secretary has said the construction of new health centres in Kincardine and Lochgelly are not a priority for the SNP / Green Scottish Government.\nThe statement by Michael Matheson MSP, Cabinet Secretary for NHS Recovery, Health and Social Care, is included in a letter to Cllr. David Ross (Lab, Kirkcaldy North), Leader of Fife Council.\nCllr. Ross wrote to Mr. Matheson after an Emergency Motion passed by the Labour administration of Fife Council in March said the failure to build the new health centres would “make it harder for NHS Fife to provide effective health care”.\nThe letter from Mr. Matheson says that “the construction of new health centres in Kincardine and Lochgelly were not identified…as a priority” despite being promised for more than a decade. It goes on to add that a further update may not be available until late 2025 meaning it could be over 20 years since new centres were promised before a spade is put in the ground.\nIn a joint statement, Cllr. Graeme Downie (Lab, West Fife & Coastal Villages) and Cllr. Linda Erskine (Lab, Lochgelly, Cardenden and Benarty) said:\n“We are furious but not surprised that the SNP/Green Scottish Government does not consider new health centres in Kincardine & Lochgelly to be a priority.”\n“Both new health centres were promised well over a decade ago, with both current buildings entirely unfit for purpose. Not only does that make it harder to deliver effective health care but also to recruit people to work in a poor workplace environment. Yet all we hear from the SNP is excuse after excuse after excuse, while failing to take any responsibility.”\n“The SNP talk about reducing the health gap and empowering local communities but as with so many other things, they are utterly failing to implement policies to help Fifers.”\n“The people of Kincardine & Lochgelly are being forgotten by the SNP but they will not be forgotten by the Labour Party. We will continue to be on their side and fight with them to deliver these new health centres that their communities need.”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_theft-is-key-to-scottish-labours-future-success/content_28.html": "There is a tendency in opposition to decry all government ideas, call them unworkable or unrealistic. Afterall, oppositions are there to oppose. However, history shows that the most successful political parties steal and refine, from governments, think-tanks, charities, trade bodies, you name it. This can be to improve a policy or, as has happened more recently, take an issue and strip it for parts to create the appearance of having taken action.\nDuring the last election campaign, we saw the SNP claim credit for numerous Scottish Labour policies such as free bus passes and, perhaps most gallingly, Monica Lennon’s Period Poverty Act. We are seeing it again as the SNP seek to implement their own plans for a National Care Service and I suspect we are going to see it once more as they take pieces from Pauline McNeill’s Fair Rents Bill and include them in a forthcoming Housing Bill.\nWhilst this is infuriating, “we thought of that first” is not a particularly effective message. Voters only care who has delivered, or at least is seen to have delivered. The SNP has been ruthless and shameless at this and it should make us examine our own approach to policy theft.\nAnas Sarwar has set what I believe is the correct path of constructive opposition to improve the lives of people in Scotland. That has been, is and, I hope, always will be the purpose of the Scottish Labour Party. We must scrutinise proposed legislation, seek to improve it and highlight the ways in which the SNP are back-sliding or not delivering, even if this approach means they will take credit for our amendments or our ideas. The anger at having our ideas stolen, watered-down and then poorly implemented should give us all the energy we need to know that we must get Scottish Labour back in to power and soon.\nTo do that, we must beat the SNP at their own game. We must steal back. Take policies the SNP ignore or do not want to act on but would improve people’s lives and make them our own. The SNP are particularly vulnerable to this because their unifying mission, a political strength to be sure, is also a strategic weakness. At the final decision point, they are more likely to shy away from any policy which diminishes the chances of independence.\nFor example, the SNP’s Social Justice and Fairness Commission, whose report was published last week, is framed as “building consensus towards a better Scotland with independence”. The strategic weakness exposed in the last two words.\nThe report itself contains a lot of policy ideas Scottish Labour might choose to develop ourselves. In fact, a couple of them are similar to policies in our own 2021 manifesto. That is where our opportunity lies.\nWhile the SNP are trying in vain to build a consensus for independence, we can, and in some cases already are, build a consensus for; a Housing Land Corporation; for modernising housing stock; for better rewards for those working in social care; for effective anti-racist and pro-equality education and; targeted face additional barriers and challenges in finding and maintaining work.\nTo build that kind of consensus, we can reach across political parties and across political divides. It doesn’t happen overnight but we mustn’t be afraid to steal good ideas from wherever we find them.\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_author_graeme-downie_page_2/content_15.html": "A Fife Councillor who supported a campaign for better GP services at a local health centre has welcomed the awarding of a new GP service contract and said while it might be a long road to bring the service fully up to scratch, he hopes improvements can start...\nA local Fife candidate has welcomed news that a UK Labour government would do more to protect mortgage holders after figures showed an average mortgage holder in the Kingdom could see their monthly bill increase by as much as £170. Graeme Downie, Scottish Labour...\nA Fife Councillor and a Fife MSP have written to the Scottish Government to demand the restoration of funding to the Coalfields Regeneration Trust (CRT) after a further cut of £100k to the organisations budget. Cllr. Graeme Downie (Lab, West Fife & Coastal...\nA Labour candidate says the announcement the Headquarters of a British publicly-owned energy generation company will be based in Scotland is a huge opportunity for sites in Fife such as Rosyth and Longannet. Graeme Downie, Labour candidate for Dunfermline & West...\nJust 3% of veterans in Fife have received ID cards from the UK Government to help them access the services they need, as Labour’s General Election candidate for Dunfermline & West Fife launches a Veterans’ Voice campaign to understand concerns from former service...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_scottish-labour-select-west-fife-coastal-candidate/content_71.html": "The Scottish Labour Party has selected local resident, Graeme Downie, as a candidate in the West Fife & Coastal Villages Ward for the local council elections that will take place on Thursday 5 May 2022.\nMr. Downie, lives in Torryburn and runs his own small business. He has said that if elected he will demand more, fairer and better services for all 13 villages in the Ward and will be working hard to speak to as many people across the Ward as possible during the campaign, both online and in-person.\nGraeme Downie has campaigned for over 20 years on campaigns like abolishing the PIP 20 metre rule; bringing homes back in to use; and helping people claim back millions from energy companies. He believes those campaigns have taught him that to achieve the improvements people want to see, everyone should focus on what unites them, rather than what divides them.\nSpeaking after being selected, Graeme Downie said: “I am delighted and very proud to have been selected as a Scottish Labour candidate for West Fife and Coastal Villages. This community has been very lucky to have been served fantastically by Bobby Clelland for so many years. I hope to emulate the hard work he has put in to represent and stand up for people across the 13 villages in the ward.”\n“I believe I have the right skills and experience to win here and to improve the lives of people across the area. I want to listen to what people here want, what they demand. If elected I will demand that, working for them and working with them.”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_getting-voters-to-demand-better-of-local-government-could-kickstart-a-democratic-renewal/content_18.html": "As a local council candidate, what strikes me speaking to people is that everyone, regardless of age, gender, background or political affiliation, wants to make their community and country, however they identify that, better.\nWe know the divisiveness of the constitutional question has led many to believe nothing can be better without Scotland becoming independent, that’s not new. But a side-effect of our current polarisation is a reduction in understanding of the various different levels of government, and in voters confidence it can deliver better and fairer outcomes. The constitutional matters, nothing else.\nAt best that loss of confidence leads to sloppy governing, as I believe we are seeing at Holyrood now. Just keep banging the single question drum and no one cares what else you do. At worst, that level of tribalism can lead to corruption and the effective end to participatory democracy as voters excuse bad behaviour because of the answer to the binary distraction.\nAt local government level, I believe it is manifesting as disinterest among voters. This was evident in the recent polling by Our Scottish Future showing only a quarter of voters were confident they could name the leader of their local council. I think even that figure would drop further if we were to conduct a pop quiz to see if the 25% named the right person.\nOne of the many reasons for this, I believe, is a lack of attention and understanding of local government and what it does. Too many voters, when I have pointed out the role of councils in social care, economic development or education give me the same slightly blank look and talk about, you guessed it, potholes, bins and dog poo.\nThose things are important to providing better communities but they can’t be where local government begins and ends and I don’t think this is the fault of Councillors or voters. I think the constitutional question is causing a cycle of decline.\nOnly focussing on the constitution has led to less interest in effective policy and governing at local level. That, understandably, causes frustration among Councillors and officials trying to govern and inevitably has a negative impact on delivery. Finally, poorer services further lowers voter expectation and convinces some of them only constitutional change can solve the ills and we start around again.\nTo break that cycle, we need to give local government its confidence back and raise voters expectations of it. Voters must know they can demand better and I know Councillors and officials are ready to deliver just that.\nThe elected Mayors or Provosts proposed by Our Scottish Future might be part of a solution but they are far from a silver bullet. We must be honest about that and not fall in to the same trap we have seen with the constitution. We need long-term public education that raises the profile and horizons of local government, to have constituents demand better of their Council and their Councillors.\nThat grassroots pressure can push up and raise standards at other levels, improving governance and policy implementation whichever party is in power at whatever level.\n- This piece first appeared on the ScotlandCan website.",
  "https_graemedownie_com/https_graemedownie_com_snp-police-cuts-threaten-fife-remembrance-services-and-community-events/content_6.html": "A Scottish Labour General Election candidate has warned cuts to officer numbers mean Police Scotland will no longer be able to support community events in Fife, putting Armistice Day commemorations and other activities at risk.\nGraeme Downie, Scottish Labour Candidate for Dunfermline and Dollar has been told Police Scotland will not be carrying out support for events such as Remembrance Day and Galas and that this will affect all events across the Kingdom.\nWith many events requiring Police support to ensure safe road closures, Mr. Downie is concerned that events may not be able to take place at all.\nAn email to Mr. Downie from Fife Council states: “Police Scotland has made us aware that they will not be carrying out the support they have done in previous years at some events such as Remembrance Day and Galas. The level of support given, if any, is to be determined on a case by case basis. All remembrance and gala parades…will be impacted by this change.”\nThe news comes just a week after it was announced that Police Scotland would no longer investigate every crime amid suggestions from the Scottish Police Federation that this was due to financial pressures.\nCommenting, Graeme Downie, Scottish Labour candidate for Dunfermline & Dollar, said:\n“It is a disgrace that SNP cuts mean not only will all crimes not be investigated but that important local events such as to commemorate Armistice Day are under threat.”\n“It is a dereliction of duty by the SNP that they have let the situation slide to a point, where they are not only failing communities across Fife but the rank and file of dedicated Police officers across the country who deserve to be supported.”\n“At a time when people across the Kingdom want to feel safe and secure as well as continue a strong sense of community, the news that crimes won’t be investigated and local events might not be able to go ahead or will cost significantly more will be a bitter blow.”\n“At the next UK General Election, voters in Dunfermline & Dollar will have a choice to continue with the failing SNP and Tory governments or to deliver more Scottish Labour MPs who will deliver the change people need as part of a UK Labour government.”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_author_graeme-downie_page_10/content_73.html": "Scottish Labour’s candidate in West Fife & Coastal Villages for the local elections next year has announced a series of digital events to allow local people to meet their candidate and ask questions in the run-up to the election in May 2022. As well as speaking to...\nThe Scottish Labour Party has selected local resident, Graeme Downie, as a candidate in the West Fife & Coastal Villages Ward for the local council elections that will take place on Thursday 5 May 2022. Mr. Downie, lives in Torryburn and runs his own small...\nYou will all know the joke about Scotland being the only place where a double positive makes a negative? “Aye, right.” Said out loud in most parts of Scotland, we know what that means but it doesn’t travel well and is likely to confuse. Another phrase that got me...\nFirstly, yes, this is a very long sub-tweet. As I have said before, Scottish Labour can continue on a path to recovery and relevance by supporting people’s aspirations and by reaching out to build as broad a coalition as possible. To do that we need to talk about...\nAfter a Westminster election, The British Election Study (BES) can be invaluable in getting behind the punditry and perceived wisdoms to more fact-based lessons and analysis that political parties can use. In 2017, the BES found there was no “youthquake” in favour of...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_west-fife-candidate-welcomes-radical-plans-for-free-residential-social-care/content_59.html": "A council candidate who previously highlighted statistics showing pressure on social care could see over 50,000 Fife patients spend longer in hospital than necessary, has welcomed plans to transform social care in Scotland by delivering free residential care for over 65s.\nGraeme Downie, Scottish Labour candidate for West Fife and Coastal Villages, welcomed the announcement by Scottish Labour Leader, Anas Sarwar MSP and Deputy Leader, Jackie Baillie MSP, at the party’s annual conference which took place in Glasgow this weekend.\nUnder the plans, from 2023/24 future health and care Barnett consequentials will be used to cover the cost of residential care for older people aged over 65 – lifting a huge financial burden from the backs of thousands of Fifers.\nMr. Downie believes that by helping people get the care that they need in residential care, it will free up capacity in the NHS by preventing people from ending up in hospital when they don’t need to be there.\nBetter support in the community can prevent long delays to hospital discharge, reduce the need for hospital care at end of life and prevent unnecessary hospital admissions.\nThe vital importance of our social care sector has only become more apparent through the pandemic.\nThe announcement is part of a bold plan to build a National Care Service worthy of the name and fit for the future including:\n- Delivering fair pay for social care workers, rising to £15 an hour.\n- Plugging the gap in non-residential care funding identified by the Feeley Report.\n- Investing in restoring and increasing respite care to support Scotland’s unpaid carers.\nCommenting on the announcement, Graeme Downie, Scottish Labour candidate for West Fife & Coastal Villages said:\n“I raised the issue of delayed discharge a few months ago with shocking statistics showing that over 50,000 people in Fife could spend longer in hospital than needed because of pressure on social care.”\n“We need bold and immediate action to arrest the crisis we are already seeing in social care services in Fife and which seems will inevitably get worse if radical steps are not taken.”\n“The announcement this weekend by Anas Sarwar and Jackie Baillie is exactly the kind of bold solution we need to tackle the crisis we see in our social care services. This plan would provide residential care to everyone over the 65 who needs it – free at the point of need – and I look forward to campaigning on this issue during the remainder of the campaign and beyond.”",
  "https_graemedownie_com/https_graemedownie_com_category_news_page_7/content_70.html": "Graeme Downie, Scottish Labour’s candidate for West Fife & Coastal Villages will hold his first two “Meet the Voter” events at Marco’s Kitchen in Kincardine and The Stables in Culross later this month. Graeme has confirmed the event series will be held in local...\n9,000 fewer young people in work in Fife since SNP came to power Statistics published this week show almost 9,000 fewer young people in Fife are employed than when the SNP came to power in Edinburgh 14 years ago. The statistics have been called “damning” by one local...\nNew figures show pressure on social care could see over 50,000 Fife patients spend longer in hospital according to a West Fife council candidate. Graeme Downie, Scottish Labour Candidate for West Fife and Coastal Villages, has analysed the latest figures from the...\nI am going to be out and about in Kincardine this Saturday morning, 11 December with a small team knocking on doors and speaking to local people about issues they are concerned about. If you see me around then please do come up and say hello! If there is anyone who...\nScottish Labour’s candidate in West Fife & Coastal Villages for the local elections next year has announced a series of digital events to allow local people to meet their candidate and ask questions in the run-up to the election in May 2022. As well as speaking to...\nThe Scottish Labour Party has selected local resident, Graeme Downie, as a candidate in the West Fife & Coastal Villages Ward for the local council elections that will take place on Thursday 5 May 2022. Mr. Downie, lives in Torryburn and runs his own small...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_aspiration-ambition-and-the-route-through-scottish-marginals/content_10.html": "You could almost hear the eyelid muscles of Scottish Labour activists straining last week as we stared at the results of the YouGov MRP poll that had just been published. Don’t let the eyelids shut. Keep those eyes open. Don’t blink or it might go away.\nBut no, it was most definitely real. The YouGov model showed Labour winning up to 23 seats in Scotland, as the SNP looked to being beaten back across the central belt (political belts are better than political walls, trust me!)\nNot only would that result show a resurgence in Scottish Labour itself but it would make Keir Starmer’s own path to No.10 Downing Street that much easier.\nThe glow has remained, rightly tempered by the message of Anas Sarwar that the only poll that will matter is on Election Day, a day Scotland and the UK needs as soon as possible!\nThe other note of caution from the YouGov poll was the tight margin projected in many of those 23 seats.\nThis highlights the need to keep fighting for every vote, from every household. The margin between 10 Scottish seats and 25 or even 30 is tiny but elections are decided on such knife-edges.\nThe concentration of marginals in Scotland also means it will be more important than ever that we win positive support from voters. It is not enough simply for the Tories and SNP to lose, we must win and I don’t think we are quite there. Yet.\nFor example, The seat I am fighting, Dunfermline & West Fife, showed a margin of just 5% and that was towards the middle or high end of winning margins, with some under 1%. This seat lies in the new heartlands of Scotland, with young aspirational professionals on low to middle incomes perhaps in their first home, working hard to make ends meet.\nTo truly win this vital demographic voters to our side with enthusiasm, we will have to overcome a cynicism that has resulted from SNP failure. A feeling that if they couldn’t do it for them, what makes us think we can.\nVoters might be realising that for the last 17 years, the SNP has painted a vision for the future in watercolours, easily washed away by the latest Scottish shower, dreich morning drizzle or sharp evening Haar.\nBut for us to turn those 1% margins in to 10% margins, we must show that we share the desire of voters for a positive future for Scotland. That we want Scotland to be aspirational, ambitious and filled with opportunities for them, their friends, their families, and their community.\nWhat will win over those swing voters in the mass of Scottish marginals is showing them that when the Labour Party paints its vision for a positive future for Scotland, we will using something a lot more durable.\nWe must convince them we can make permanent changes and show them what will be delivered for Scotland by having two governments working for them, rather than against each other.\nIf we are to achieve that, we must be realistic, yes, but not bashful about the scale of our ambition. Places like Dunfermline can succeed by advancing what we are known for, be that defence engineering, manufacturing and maintenance, heritage and tourism or professional services.\nThe last Labour government saved the Rosyth shipyard and it remains the largest single employer in the constituency, with diverse and secure work for both construction and maintenance of military and civilian shipping.\nContrast that success with the massive empty site of the former Longannet Generating Station at the other end of the constituency, decommissioned in 2016 with the Tories and SNP in power and with no plans for its future use.\nIt is an ideal site for investment through the industrial strategy of an incoming Labour government, seeking to create thousands of jobs in the green economy. An opportunity to show the difference a Labour government can make.\nThis is the kind of contrast we must strike in Dunfermline and marginal seats across Scotland, tangible improvements that match the ambition of communities and will deliver opportunities for people to fulfil their aspirations.\nIf we can achieve that then on the Friday morning after a General Election, the only thing our eyes should have to worry about is perhaps just being a bit bleary and bloodshot!\nThis article first appeared on LabourList",
  "https_graemedownie_com/https_graemedownie_com_category_news_page_4/content_54.html": "A West Fife Councillor has written to companies whose vehicles have been spotted speeding through a dangerous set of traffic lights in Kincardine, urging their drivers to be more careful. The traffic lights and junction at North Road / Feregait / Toll Road in...\nFour West Fife Labour Councillors have written to the Chief Executive of Stagecoach demanding the company rethink plans to change services, urging them to instead invest in services to help people meet challenges caused by price rises across the economy. Stagecoach...\nListen to my full interview with Kingdom FM here. A Fife Councillor has called for more support to help Home Care workers with rising petrol costs as part of Fife Labour Council efforts to mitigate the effects of the SNP / Tory recession. Cllr. Graeme Downie, Scottish...\nAttempts by NHS Fife to plug gaps in GP services with locums are falling short, according to a Fife Labour Councillor, who wants more information about how other interventions can maintain a high level of care for people and communities. Figures obtained through a...\nA local Councillor has called for Fife Council to do more to tackle a shortage of social housing in the West Fife Villages. Cllr. Graeme Downie, Scottish Labour Council for West Fife & Coastal Villages, says housing issues have been one of the issues raised most...\nA West Fife Councillor has criticised their local MSP for opposing compensation for former Miners convicted of certain criminal offences relating to the 1984-85 Miners Strike. Cllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, said...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_west-fife-councillor-says-free-bulky-uplifts-will-tackle-fly-tipping/content_47.html": "A West Fife Councillor has welcomed the decision by Fife Labour Council to remove charges for bulky uplifts from this April.\nCllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, said that the move will tackle the blight of fly-tipping, reduce pressure on recycling centres and help residents struggling with the cost of living crisis.\nAbout 14,200 bulky uplifts take place each year in Fife, with almost 35,000 items collected over 2021/22, such as couches and mattresses that are too big to fit into a wheeled bin and cannot be transported to a recycling centre.\nThe pledge to abolish the charge sees Fife Labour fulfil one of its key election pledges from the election in May 2022.\nCllr. Downie says that fly-tipping is a particular problem in rural parts of Fife, with more verges and unmonitored space making it easier for people to dump things at the side of the road.\nCommenting on the announcement, Cllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages said:\n“It is fantastic news that Fife Labour is delivering on one of our key manifesto pledges to reduce the blight of fly-tipping in rural areas by abolishing the charge for bulky uplifts.”\n“I have seen fly-tipping across West Fife since I was elected and in rural areas with woodland near the road or lay-bys this has been a particular problem and I am hopeful that this move will help tackle that problem.”\n“People should continue to use the excellent recycling facilities where possible but this move will really help with items that are too large or for people who have no means to transport items to a recycling centre.”\nBulky uplifts will continue to be ordered online via www.fife.gov.uk/bulkyuplift and the current points system will continue to be used. Uplifts will be scheduled on a first come first served basis and 180 booking slots will be available on a daily basis to manage demand across Fife. The list of items that can be uplifted will remain the same and black bag landfill material will continue to be accepted.\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_kicking-it-in-kincardine/content_72.html": "I am going to be out and about in Kincardine this Saturday morning, 11 December with a small team knocking on doors and speaking to local people about issues they are concerned about.\nIf you see me around then please do come up and say hello!\nIf there is anyone who wants to help out and join us, whether you are Party Member or not, then please just message me and happy to give you more details.\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_valleyfield-gp-service-improvements-must-start-immediately/content_29.html": "A Fife Councillor who supported a campaign for better GP services at a local health centre has welcomed the awarding of a new GP service contract and said while it might be a long road to bring the service fully up to scratch, he hopes improvements can start immediately.\nCllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, who has campaigned for improvements at the GP surgery in High Valleyfield, was commenting after it was confirmed that the Dr. Gillani & Partners are to take over the GP service contract for the area which covers High Valleyfield, Low Valleyfield, Torryburn, Newmills, Culross and parts of Cairneyhill.\nCllr. Downie said:\n“The local community has led the campaign for improvements at Valleyfield surgery. This news has been a long time coming and it is very welcome that the contract for GP services has finally been awarded.”\n“While bringing the GP service at Valleyfield up to where the community rightly expect it to be will take time, I hope the new providers will start making improvements immediately and I look forward to working with them and assisting in any way I can.”\n“West Fife has seen a number of issues recently with GP services, including the decision by the SNP Scottish Government to delay funding for a new Health Centre in Kincardine. Hopefully this news at Valleyfield will begin to see the delivery of the health services people in the area need and deserve.”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_on-your-side-and-on-scotlands-side/content_4.html": "After a Westminster election, The British Election Study (BES) can be invaluable in getting behind the punditry and perceived wisdoms to more fact-based lessons and analysis that political parties can use.\nIn 2017, the BES found there was no “youthquake” in favour of Jeremy Corbyn and, most recently, showed the beginnings of “realignment” in the 2019 election, now further evidenced in the Hartlepool and Chesham & Amersham by-elections.\nIt is welcome to see the beginnings of this type of study here with the Scottish Election Survey (SES) and I would urge anyone to read the blogs and tweets so far but there was one thing in particular that caught my eye.\nWe know that for Scottish Labour to hope to form part of a government in future, we must not only hold on to our existing, pro-Union, support but take at least a chunk of the SNP vote with us as well. Some have argued this requires us to embrace constitutional change but is that true? It has never made sense to be on the face of it anyway. Afterall, why would SNP voters who are committed to independence, vote for a party that was, at best, reluctant and unreliable supporters of the cause?\nBut what if there were a specific part of the SNP coalition we could target successfully without supporting another divisive referendum. Alongside independence, the SES found that for SNP voters key phrases were “a focus on Scotland” and “standing up for Scotland”. This was very similar to those who voted for Welsh Labour (substitute “Scotland” for “Wales” obviously), showing a party opposed to radical constitutional change could win those voters with the right message.\nTo appeal to this part of the SNP coalition, Scottish Labour would not have to back a referendum or independence but perhaps look to a more traditional metric, often cited as critical in US polling. Is a party or candidate “on my side”.\nTo be “on my side” isn’t about manifestos, policy delivery or even outcomes. It is more nebulous; you just know it when you see it. I think we saw the beginning of that message during the 2021 campaign. “What Unites us, not what divides us” and “recovery, not old arguments”.\nThe SES also indicates that the “yes” supporters are slightly softer on constitutional change. If that part of the SNP coalition start looking for another home in the next few years for whatever reason, Scottish Labour must already be there, “on their side” and willing to “focus on Scotland.”\nTo achieve that, we don’t just need a raft of policies, those policies must embody something more, a better Scotland than what we have today and the prospect of an even better Scotland for future generations. To use the SNP parlance, we have to demonstrate that we are stronger for Scotland. Our policies must show that we understand, really understand, not just what voters complain about but what they want to see.\nWe have to show them we support their aspirations for their careers, their family, their lifestyle, their communities, their services and, yes, for Scotland as a whole. We have to be on Scotland’s side.",
  "https_graemedownie_com/https_graemedownie_com_dunfermline-should-be-new-capital-for-fife-growth-says-local-councillor/content_40.html": "Dunfermline should be the “New Capital” for innovation, investment and economic growth in Fife while delivering excellent public services for communities, according to a local Councillor.\nScottish Labour Councillor Graeme Downie made the comments after speaking to Cllr. David Ross, Leader of Fife Council, who returned from a three-day event in London last week where Dunfermline was centre stage as Scotland’s newest city, with no shortage of interest in bringing new investment to the area.\nAs Scotland’s ancient capital and a rich heritage, from the philanthropy of Andrew Carnegie to ship-building on the Forth, alongside current investment from the likes of Sky UK, Sainsbury’s Bank and FMC Technologies and with the future potential for manufacturing at the Arrol Gibb Innovation Campus (AGIC) in Rosyth and the recent announcement of a Green Freeport designation, Cllr. Downie believes the pieces are all in place for Dunfermline to become a driver of the future economy of Fife.\nCllr. Ross attended Scottish Cities Week in London last week (23-26 January). The event, organised by the Scottish Cities Alliance, enables Scottish cities to showcase their investment potential to a wide range of national and international investors and developers.\nGraeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, said:\n“It is time for the people of Dunfermline to be offered a vision for a new, optimistic and positive future and for that vision to be delivered.”\n“We need to build on the incredible legacy of Dunfermline Labour leaders like Helen Law who worked tirelessly to secure the city status that Dunfermline so clearly deserved.”\n“Dunfermline has a proud history as Scotland’s capital, as a centre for innovation, arts & culture, education, philanthropy and social change but now we have to look to the future.”\n“We need to deliver the change that people in this city thirst for, to put Dunfermline at the centre of Scotland’s economic success, with public services that deliver for communities.”\nLabour Councillor David Ross, Leader of Fife Council, said:\n“I was very pleased to be able to represent Dunfermline at Scottish Cities Week in London last week, as Scotland’s newest city once again took its rightful place alongside the other seven Scottish cities. It was a great chance to showcase what Dunfermline has to offer in its people, skills and investment opportunities.”\n“As the Labour Administration of Fife Council, one of our top priorities is to develop the local economy, encouraging growth and making sure that everyone benefits from the wealth generated within our communities. A key part of this is developing the vision for the future of Dunfermline, putting the new city at the centre of the future success of the rest of Kingdom and the wider region.”\n“The Labour Council is already promoting Dunfermline as a location to attract greater investment, create growth and compete internationally. A successful Dunfermline will benefit not only City residents but it is also critical for the rest of Fife and we need to work to make that a reality.”",
  "https_graemedownie_com/https_graemedownie_com_sarwar-sees-community-work-in-west-fife-villages/content_50.html": "Scottish Labour Leader, Anas Sarwar MSP, has visited villages in West Fife and seen the strength shown by different communities during the pandemic and how they are now tackling the rising cost of living.\nMr. Sarwar was shown around the area by Graeme Downie and Jackie McKenna, the Scottish Labour candidates for West Fife & Coastal Villages in the council elections on 5 May. The group visited three projects around the area:\n- Blairhall Community Pantry\n- Grow West Fife, Culross\n- Shiresmill Therapy Riding Centre\nMr. Sarwar also visited Kincardine and spoke to voters there.\nCommenting after the visit, Anas Sarwar MSP, said:\n“It was great to be out in beautiful Fife today with our Scottish Labour candidates, meeting community groups like Shiresmill Therapy Riding Centre and Grow West Fife. Towns across Scotland are filled with potential and we need to give them the tools to succeed.”\nGraeme Downie, Scottish Labour candidate for West Fife & Coastal Villages said:\n“The villages in West Fife did tremendous work during the pandemic and are doing so again to mitigate some of the effects of the rise in the cost of living. I was very proud to show Anas around the area. If myself and Jackie McKenna are elected on 5 May, we will demand better and fairer funding for this area to deliver services and create opportunities.”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_dunfermline-could-miss-out-after-offshore-wind-leases-sold-on-the-cheap/content_46.html": "Dunfermline and West Fife could miss out on investment, skills and jobs as a result of the knock down sale of offshore wind leases, according to a local Councillor.\nCllr. Graeme Downie, Scottish Labour Councillor for West Fife and Coastal Villages, said estimates that less than a third of contracts for the offshore wind sites could be awarded to Scotland, would represent a huge missed opportunity for places like Dunfermline, Rosyth and Longannet.\nAccording to analysis by the think tank, Common Weal, as much as 71% of the manufacturing spend on ScotWind will end up outwith Scotland (https://www.heraldscotland.com/news/homenews/23300089.scotwind-scotland-faces-loss-60bn-new-offshore-wind-farms/)\nCllr. Downie said there were questions to answer, not only about the price for the leases themselves but also conditions that could have guaranteed more local jobs and investment.\nCommenting, Cllr. Downie said:\n“We know renewable energy is critical to our future and that the electrical, engineering and manufacturing expertise it requires could be vital for growing the economy of Dunfermline and West Fife.”\n“As Scotland’s newest city, Dunfermline has the potential to attract worldwide investment, particularly in manufacturing where there is such skills and experience across the area.”\n“It would be regrettable if another opportunity had been missed because the SNP Scottish Government sold offshore wind licences on the cheap, without guarantees thay would help the local economies of places like West Fife.”\n“Dunfermline and West Fife needs change and a proper vision so these opportunities are not missed, not more of the same empty promises never delivered that we’ve seen for the last 15 years.”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_tory-economic-disaster-adding-170-a-month-to-dunfermline-mortgages-says-candidate/content_24.html": "A local Fife candidate has welcomed news that a UK Labour government would do more to protect mortgage holders after figures showed an average mortgage holder in the Kingdom could see their monthly bill increase by as much as £170.\nGraeme Downie, Scottish Labour General Election candidate for Dunfermline & Dollar, welcomed the announcement made by Shadow Chancellor, Rachel Reeves MP, last week that a UK Labour government would require all lenders to bring in measures such as allowing borrowers to switch to interest only mortgage payments for a temporary period or to lengthen the term of their mortgage period.\nIt follows interest rates rising for the 13th time in June, increasing the painful squeeze on family finances.\nMr. Downie is concerned that the increase in mortgages will hit people in cities like Dunfermline particularly hard with a high number of newer housing.\nHe said the situation is made worse by the SNP’s refusal to use the powers they have and adopt Scottish Labour’s plans for a Mortgage Rescue Scheme to help people lower their payments and provide a safety net for those at risk of losing their homes.\nCommenting, Graeme Downie, Scottish Labour General Election candidate for Dunfermline & Dollar, said:\n“The sudden increases in interest rates and mortgage costs caused by the disastrous handling of the economy by Boris Johnson, Liz Truss and Rishi Sunak is already hitting families in Dunfermline very hard.”\n“By refusing make support measures mandatory, the Conservative Party are putting the fate of households in Dunfermline in the hands of huge banks rather than families.”\n“A UK Labour government will require support to be made available to mortgage holders in Dunfermline, West Fife, Dollar and across Fife and help people with rising living costs and bills.”",
  "https_graemedownie_com/https_graemedownie_com_west-fife-candidate-unearths-gp-surgery-call-scandal/content_53.html": "The candidate for West Fife & Coastal Villages in the council elections on 5 May has published official statistics showing less than 15% of calls were answered at Valleyfield GP Surgery.\nGraeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, obtained figures under the Freedom of Information Act showing January and March 2022, an average of only 13% of the 29,239 calls received were answered.\nAs of January 1 this year there was only one GP listed as working at the practice, according to Public Health Scotland figures, which has 4,126 patients registered.\nCommenting on the figures, Mr. Downie said:\n“It is a scandal that people in the local community cannot even get through to Valleyfield GP surgery to speak to someone, never mind get an appointment. Let’s be clear, this is not the fault of hardworking practice staff or the Doctors at the surgery who are doing their best in impossible circumstances.”\n“NHS Fife must take immediate action to get more staff and GPs in to Valleyfield medical centre. Without urgent action, people’s health will be at greater risk, whilst more pressure is heaped on to services like NHS24 and A&E who are already over-stretched.”\n“This has been by far the single issue I have been told about during the local elections so far and if elected I want to campaign with local people and help them demand better and fairer access to their local GP services.”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_category_news_page_5/content_58.html": "Plans for a major site in Fife that could have delivered thousands of jobs and created training opportunities in areas of high unemployment are in ruins after the Scottish Government agency responsible for economic development admitted plans to bring high-speed train...\nFour Scottish Labour Councillors representing West Fife, Dunfermline and Rosyth have unanimously backed proposals for a Labour minority administration to run Fife Council and called the plans for the next five years, “transformative”. The four have also supported...\nThe candidate for West Fife & Coastal Villages in the council elections on 5 May has published official statistics showing less than 15% of calls were answered at Valleyfield GP Surgery. Graeme Downie, Scottish Labour candidate for West Fife & Coastal...\nScottish Labour Leader, Anas Sarwar MSP, has visited villages in West Fife and seen the strength shown by different communities during the pandemic and how they are now tackling the rising cost of living. Mr. Sarwar was shown around the area by Graeme Downie and...\nCuts by the SNP government in Edinburgh to council budgets has left Fife with an £80m backlog of road repairs, a situation a council candidate has described as “brutal.” Graeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, has highlighted the...\nA council candidate has written to the Chair of NHS Fife asking why the region has the lowest number of accepted referrals to Pain Clinics in Scotland and expressing his concern this might be due to lack of resources for those suffering Chronic Pain. Graeme Downie,...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_home-care-workers-need-support-to-protect-from-effects-of-tory-snp-recession-says-fife-councillor/content_44.html": "Listen to my full interview with Kingdom FM here.\nA Fife Councillor has called for more support to help Home Care workers with rising petrol costs as part of Fife Labour Council efforts to mitigate the effects of the SNP / Tory recession.\nCllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, who is also a member of the Fife Health & Social Care Board, has written to Council Health Spokesperson, Cllr. David Graham, asking for home care workers to be given the same 5p per mile allowance increase granted to NHS staff earlier this year.\nCllr. Downie has asked for the allowance to be increased immediately, payments to be backdated to April 2022 and for the support to continue for the remainder of the financial year.\nIn his email he points out cuts to local government budgets by the SNP Scottish Government and the unwillingness of the UK Tory government to take action but Cllr. Downie believes the Fife Labour Council must do all it can to help home care workers to prevent a staffing crisis.\nCommenting, Cllr Downie said:\n“Home care workers are essential to our health & social care system but they are being penalised because they have to use their cars to be able to help the most vulnerable in our society.”\n“Home care workers should receive the same increase in petrol allowance of 5p per mile that NHS colleagues received back in April and this should be backdated so they receive the same level of assistance.”\n“I have written to Cllr. Graham asking him to explore this issue in more detail as well as the feasibility of having this increase in place for the remainder of the financial year 2022/23.”\nFull text of email to Cllr. David Graham.\n“Dear Cllr. Graham\nThank you for your time earlier this week to discuss my concerns regarding the disparity in mileage allowances between NHS staff and home workers in my Ward and across Fife.\nWe discussed the difficulties of cuts to local budgets by the SNP Scottish Government in Edinburgh and the unwillingness of the UK Tory government to take action to help tackle the impacts of fuel increases.\nI know these circumstances mean we are limited in the action we can take but I believe we must do all we can to help people with rising fuel and food costs, particularly in the face of the oncoming SNP / Tory recession.\nYou will be aware that in April 2022, NHS staff were given temporary increase of 5p per mile in their mileage allowance. As I mentioned to you I am concerned home care workers are being placed at significant disadvantage by not having the same increase granted to them.\nThis situation creates the possibility that our already under pressure social care services feel undervalued, leading to difficulty in maintaining and attracting staff to provide this essential services which looks after the most vulnerable people across Fife.\nAs I mentioned at our meeting, I am asking if you could explore the possibility of:\n- Increasing the mileage allowance for home care works by 5p per mile.\n- Backdating this increase to April 2022.\n- Keeping this measure in place for the remainder of the financial year 2022/23.\nI hope you will agree with me that Fife Labour must do all we can to support and help our social care staff even as the SNP and Tories sit on the sidelines.\nI look forward to your response.”",
  "https_graemedownie_com/https_graemedownie_com_contact/content_76.html": "Get in touch\nGet in touch with me by emailing me at graeme.downie.mp@parliament.uk or my office on 01383 332841.\nConstituency Office Address: 31 Chapel Street, Dunfermline, KY11 7AW, Fife.\nPhone No: 01383 332841\nGet in touch with me by emailing me at graeme.downie.mp@parliament.uk or my office on 01383 332841.\nConstituency Office Address: 31 Chapel Street, Dunfermline, KY11 7AW, Fife.\nPhone No: 01383 332841",
  "https_graemedownie_com/https_graemedownie_com_category_news_page_2/content_33.html": "A local Fife candidate has welcomed news that a UK Labour government would do more to protect mortgage holders after figures showed an average mortgage holder in the Kingdom could see their monthly bill increase by as much as £170. Graeme Downie, Scottish Labour...\nA Fife Councillor and a Fife MSP have written to the Scottish Government to demand the restoration of funding to the Coalfields Regeneration Trust (CRT) after a further cut of £100k to the organisations budget. Cllr. Graeme Downie (Lab, West Fife & Coastal...\nA Labour candidate says the announcement the Headquarters of a British publicly-owned energy generation company will be based in Scotland is a huge opportunity for sites in Fife such as Rosyth and Longannet. Graeme Downie, Labour candidate for Dunfermline & West...\nJust 3% of veterans in Fife have received ID cards from the UK Government to help them access the services they need, as Labour’s General Election candidate for Dunfermline & West Fife launches a Veterans’ Voice campaign to understand concerns from former service...\nA local Councillor has one again urged Scottish Health Secretary, Michael Matheson MSP, to meet with the local community in Kincardine to explain his government’s decision to refuse funding for a new Health Centre, initially promised in 2016. Cllr. Graeme Downie,...\nFife Labour Councillors representing both Kincardine and Lochgelly have said they are “furious but not surprised” that the Health Secretary has said the construction of new health centres in Kincardine and Lochgelly are not a priority for the SNP / Green Scottish...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_scottish-voted-want-change-but-not-for-its-own-sake/content_17.html": "I was delighted to be selected to be the Scottish Labour candidate for the seat where I live, Dunfermline & West Fife, likely to become Dunfermline & East Ochils after boundary changes.\nIt it is a very winnable seat in a General Election, but also could be a proving ground for a number of the messages the Labour Party need to get right if Keir Starmer is to become Prime Minister and have a majority which will allow real change across the country.\nFirst, geographically, Dunfermline and West Fife is positioned perfectly to be a hub for growth, with Glasgow, Edinburgh, Stirling and Perth all within easy reach and the River Forth providing access to the North Sea.\nSecond, it is highly mixed and diverse. From former coal fields to the west, industrial sites at Rosyth, professionals services, customer services and the logistical giant of the Amazon distribution centre as you move east across the constituency.\nIt is also home to Fife College and integrated learning campuses under construction which can train and educate people of all ages to drive forward future success. All of this shows the constituency is a fertile ground for economic expansion, innovation and growth.\nFinally, it is an area with one foot in the past, as the historical capital of Scotland, but that is looking towards the future as Scotland’s newest city, with the status officially conferred by King Charles last year.\nDemographically, it represents the new heartlands of Scotland that Labour must win if it is to win big again in Scotland. Primarily, young aspirational professionals on low to middle incomes perhaps in their first home, working hard to make ends meet. Many may have voted SNP but are now frustrated with years of declining services and hard hit by a cost of living crisis.\nThey are not only looking for change but living in a place with all the ingredients to embrace that change and become a driving force for the rest of Scotland.\nIf we are to achieve that, we must not be modest when selling the potential of the area and its people. Nor should we be bashful about the scale of our ambition. Dunfermline can succeed by advancing what we are known for, be that defence engineering, manufacturing and maintenance, heritage and tourism or professional services.\nThe past 13 years of Tory government at Westminster and 16 years of SNP government at Holyrood has been characterised by areas being told success is only possible after something else happens first.\nWe were told by George Osborne that the pain of austerity that was required for growth, by the SNP that independence was needed for success and then again by Brexiteers that it was leaving the EU that was needed before people’s ambitions could be fulfilled.\nThe challenge for the Labour Party during a campaign and then in government will be to show that there is no barrier to success. That people in Dunfermline and West Fife and across Scotland can be ambitious for themselves and their family, that there are opportunities for them and that their aspirations can be met.\nDunfermline is one of the places in Scotland where that success will be most evident under a Labour government and it is for all of us to go and show people that we share their ambition, that we are on their side and that they can succeed.\nThis piece first appeared on Scottish Fabian website\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_author_graeme-downie_page_6/content_45.html": "A West Fife Councillor has criticised their local MSP for opposing compensation for former Miners convicted of certain criminal offences relating to the 1984-85 Miners Strike. Cllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, said...\nPlans for a major site in Fife that could have delivered thousands of jobs and created training opportunities in areas of high unemployment are in ruins after the Scottish Government agency responsible for economic development admitted plans to bring high-speed train...\nFour Scottish Labour Councillors representing West Fife, Dunfermline and Rosyth have unanimously backed proposals for a Labour minority administration to run Fife Council and called the plans for the next five years, “transformative”. The four have also supported...\nThe candidate for West Fife & Coastal Villages in the council elections on 5 May has published official statistics showing less than 15% of calls were answered at Valleyfield GP Surgery. Graeme Downie, Scottish Labour candidate for West Fife & Coastal...\nScottish Labour Leader, Anas Sarwar MSP, has visited villages in West Fife and seen the strength shown by different communities during the pandemic and how they are now tackling the rising cost of living. Mr. Sarwar was shown around the area by Graeme Downie and...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_councillor-and-msp-demand-restoration-of-coalfields-funding-after-60-cut/content_30.html": "A Fife Councillor and a Fife MSP have written to the Scottish Government to demand the restoration of funding to the Coalfields Regeneration Trust (CRT) after a further cut of £100k to the organisations budget.\nCllr. Graeme Downie (Lab, West Fife & Coastal Villages) and Alex Rowley MSP (Lab, Mid-Scotland & Fife) have written to Shirley-Anne Somerville MSP (Cabinet Secretary for Social Justice) urging her to restore £100k of funding to the CRT which has been cut this year.\nMs. Somerville is also the local MSP for Dunfermline, which encompasses West Fife.\nCllr. Downie and Mr. Rowley are concerned the funding cut will impact vital programmes in former coal-mining areas of West Fife and across the Kingdom.\nThese projects currently include regeneration of the local area, increasing the capacity of local groups and charities and the Game On project which uses football to improve the health and wellbeing of local communities.\nThe latest cut in grant from the Scottish Government, from £750k to £650k in cash terms, comes on top of a freeze since 2011, meaning CRT has seen a real terms reduction of over £400k or almost 60% of their total budget in the last 12 years.\nCommenting, Cllr. Downie, Scottish Labour Councillor for West Fife & Coastal Villages, said:\n“The Coalfields Regenration Trust are a vital part of the local community in the villages of West Fife and across the rest of the Kingdom of Fife. These further savage cuts by the SNP will have a huge impact on communities across West Fife and elsewhere around Dunfermline and beyond.”\n“The SNP have no excuse for taking this action now having already frozen their contribution for over a decade. Shirley-Anne Somerville must reverse this decision and restore the £100k of funding for next year immediately. If she does not she will be hurting people within her own constituency as well as in other parts of Fife.”\nAlex Rowley MSP, Scottish Labour MSP for Mid-Scotland & Fife, said:\n“In the midst of the worst cost-of-living crisis in decades and local authority budget cuts that are pressuring public services to breaking point, we need the work of organisations such as the Coalfields Regeneration Trust now more than ever.”\n“Just last year, Shirley-Anne Somerville was thanking the Coalfields Regeneration Trust at the SNP conference for the outstanding work they do in our constituency– if she is truly grateful, she will reverse the decision to cut £100k from their budget, which will allow them to continue their vital work.”\n“The Coalfields Regeneration Trust has a proven track record and is uniquely placed to support regeneration at a local level across the former coalfield communities of Fife – we must do all that we can to ensure a secure future for this great organisation.”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_crisis-what-crisis-values-what-values/content_25.html": "The quote penned by novelist James Lane Allen “Adversity does not build character, it reveals it” applies about as clearly to the past two years of politics as perhaps at any time of the past.\nIt is therefore worth reflecting on what the responses over the past two years tells us about the character, and indeed values, of Scotland’s two ruling parties, the Tories and the SNP, and their leaders, Boris Johnson and Nicola Sturgeon. They must be considered in the same breath because these two parties and people, for good or bad, are the ones that have led us to this place.\nBut what was revealed about their instincts, their first reactions to a problem? Back in March 2020, we had the Prime Minister putting his fingers in his ears and pretending nothing was happening; missing COBRA meetings, rejecting a furlough scheme until the last minute, playing it all down, reverting to a mythical “Battle of Britain” spirit that somehow could shoot down Covid like Heinkel and Messerschmitt.\nHis and his party’s instincts were clear. A Party, in more ways than one, that wants to say “No”.\nWe saw it time and time again over the past two years, “No, we aren’t going to extend furlough”, “No, there won’t be another lockdown”, “No, Christmas won’t be affected.” You could hear the echos of Margaret Thatcher, “No. No. No.”\nSo to the other government that led us here, the SNP and their First Minister. In some ways their first reaction was worse. The first chance they had to reveal their character and values was the outbreak of Covid at a major Nike conference in Edinburgh. Their reaction? They didn’t just bury their heads in the sand, they actively sought to hide it! We can’t have this here first, this is a London thing at the moment. Always looking to create constitutional mileage out of every crisis.\nI guess their secrecy was effectively implemented at least, taking months until the public knew anything about it but, when we did, it immediately showed the First Minister’s “Honest conversation” schtick as being a sham and not at all her true values.\nInstead, the true values of the SNP exposed over the past two years though, is perhaps summed up by a small green puppet. No, not that one!\nInstead, it’s the one that disappointingly muttered, “Always with you, it cannot be done.” Yoda may as well have been speaking to the First Minister rather than Luke Skywalker. I believe Nicola Sturgeon is fundamentally a good person but in the last two years, she has shown herself as the person who says “yes” a lot, but delivers little and always blames someone else for the stark shortcomings of her government.\nHer instincts and values lead her to know what she should do and what people want her to do but then cynicism takes over and we see a half-baked intervention that sounds good but is overshadowed by blame and grievance. “The party that wants to say yes…. But doesn’t.”\nContrast both of these responses with the last time the Labour Party was in charge during a crisis, The banking crash of 2007 / 08.\nInstead of pretending it wasn’t happening, Gordon Brown and his Chancellor, Alastair Darling, worked to build an international coalition, the type of which had rarely been seen before and certainly not since. Long hours, detailed work and a solution was found.\nNow was that solution perfect? Absolutely not. Should the industry and individuals responsible been punished and conditions attached to their bailout? Of course they should. But a solution to that crisis meant wages were still paid, ATMs still worked and there was still cash to buy food.\nIn that case, the Labour Party’s response showed it’s values. Our first duty is to protect those most in need so just bloody get it done!\nThat crisis also showed another value. That helping those most in need should be done regardless of the political or electoral cost. The Prime Minister, Chancellor and others must have known that by intervening and saving banks, they were binding themselves to the bad guys in the public mind and would be punished by the electorate, as indeed they were. But still, the values were clear. Help the people who need it first and damn the politics. That is courageous leadership.\nCompare and contrast the Labour values that were exposed in a crisis with the last two years of the Tories and SNP. Boris Johnson pretends a crisis isn’t happening, Nicola Sturgeon makes excuses for in-action. Only the Labour Party’s first instinct is to roll up its sleeves and do what is necessary to help those in need.\nThis piece first appeared on LabourHame.\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_councillor-criticises-local-msp-for-letting-down-west-fife-miners/content_49.html": "A West Fife Councillor has criticised their local MSP for opposing compensation for former Miners convicted of certain criminal offences relating to the 1984-85 Miners Strike.\nCllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, said it was a disgrace that Shirley-Anne Somerville MSP had let down former mine workers in her constituency, which was once one of the most important coalfields in Scotland and with a coal industry that lasted right up until 2016 with the closing of the Longannet Power Station.\nShirley-Anne Somerville, the SNP MSP for Dunfermline, along with other SNP MSPs, Scottish Greens and Scottish Conservatives opposed amendments proposed by Scottish Labour MSPs to the Miners Strike (Pardons) Bill at Holyrood last week.\nWhile welcoming the passing of the Miners Strike (Pardons) Bill, which will provide a pardon to miners wrongly convicted of criminal offences during the strike, Cllr. Downie, said an opportunity had been missed to provide financial compensation that could still help former miners and their families.\nCommenting, Cllr. Downie said:\n“West Fife had some of the most important coalfields in Scotland and a story of coal lasting right up to the closing of the Longannet Power Station in 2016. While the pardons for miners wrongly convicted during the 1984-85 strike is welcome, it is a disgrace our local MSP chose not to support measures which would have given those same miners and their families financial compensation.”\n“We must look to the future and build on the skills, ingenuity, hard work and community spirit demonstrated by the mining industry. I hope Shirley-Anne Somerville reflects on her vote last week and seeks to make amends by doing more to help the communities in West Fife.”",
  "https_graemedownie_com/https_graemedownie_com_author_graeme-downie_page_3/content_26.html": "You could almost hear the eyelid muscles of Scottish Labour activists straining last week as we stared at the results of the YouGov MRP poll that had just been published. Don’t let the eyelids shut. Keep those eyes open. Don’t blink or it might go away. But no, it...\nI was delighted to be selected to be the Scottish Labour candidate for the seat where I live, Dunfermline & West Fife, likely to become Dunfermline & East Ochils after boundary changes. It it is a very winnable seat in a General Election, but also could be a...\nA local Councillor has one again urged Scottish Health Secretary, Michael Matheson MSP, to meet with the local community in Kincardine to explain his government’s decision to refuse funding for a new Health Centre, initially promised in 2016. Cllr. Graeme Downie,...\nFife Labour Councillors representing both Kincardine and Lochgelly have said they are “furious but not surprised” that the Health Secretary has said the construction of new health centres in Kincardine and Lochgelly are not a priority for the SNP / Green Scottish...\nThe Scottish Government’s decision to delay funding for a new GP surgery in West Fife means it could be 15 or 20 years after a replacement was promised before it is delivered. In a briefing shared via social media by Fife Health & Social Care Partnership, the...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_fife-council-must-use-green-freeport-opportunity-to-unlock-longannet-site/content_38.html": "A West Fife Councillor believes the successful bid by Forth Ports for a Green Freeport could unlock the economic potential of the site of the former Longannet Generating Station near Kincardine.\nCllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, has written to Cllr. Altany Craik, Spokesperson for Finance, Economy and Strategic Planning, asking him to ensure Fife Councils takes advantage of the opportunity to work with partners to sensitively develop the site to create jobs and skills in the area.\nThe issue of the future of the Longannet was a key part of the local election campaign last year and since his election, Cllr. Downie has campaigned to ensure that Longannet remains a site of strategic importance for Fife Council.\nAlthough not directly included in the bid by Forth Ports, Cllr. Downie believes the proximity of the Longannet site still presents an opportunity to bring businesses and employment to the area.\nCommenting on the Green Freeports announcement, Cllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, said:\n“The Longannet site is of critical importance not only to Kincardine but right across Dunfermline and Fife.”\n“The size of the site, the legacy of the area and the skills that we have here mean it could be a driver and powerhouse for the regional economy for decades if properly and sensitively developed.”\n“I want to ensure Fife Council recognise that importance and will work with the landowner, Scottish Power, along with partners like Forth Ports, Scottish Enterprise and Scottish Government to make sure Longannet is once again at the heart of the economy of central Scotland.”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_labour-government-will-cut-energy-bills-and-create-jobs-in-dunfermline-dollar-to-tackle-climate-crisis-as-snp-abandons-targets/content_11.html": "A UK Labour government will save £300 off the average energy bills for families in Dunfermline & Dollar while bringing good jobs to the local community, the Scottish Labour candidate for the area said today.\nGraeme Downie said Labour’s Green Prosperity Plan shows what could be delivered locally just as the SNP-Green government in Edinburgh is watering down its climate targets and defending the profits of oil and gas giants.\nLabour’s Green Prosperity Plan is the party’s landmark plan to grow Britain’s economy, cut energy bills once and for all, and make Britain energy independent.\nThis policy shows Scotland is essential to making Britain a clean energy superpower by:\n- Tackling the cost of living crisis by saving families up to £300 off their average annual energy bills.\n- Delivering over 50,00 clean power jobs in Scotland.\n- Creating Great British Energy, headquartered in Scotland, to invest in making Scotland Britain’s energy capital. Great British Energy will invest in clean power like floating offshore wind and green hydrogen, as well as build over a thousand local power projects.\n- A Warm Homes Plan to help upgrade hundreds of thousands of homes in Scotland.\nCommenting on how Labour’s Green Prosperity Plan will benefit Dunfermline & Dollar, candidate Graeme Downie said:\n“Labour’s Green Prosperity Plan is about tackling the climate crisis while cutting bills for families and investing in good jobs in Dunfermline & Dollar.”\n“With the SNP opposing a proper windfall tax on oil and gas companies and, along with their coalition partners the Scottish Greens, rolling back on its climate commitments, it is clear the Labour Party is the only hope we have to tackle climate change.”\n“There are so many opportunities for our area to lead on green prosperity, from the site of the former Longannet Generating Station and the cluster of hi-tech companies in Rosyth to the culture, history, skills and business community in the new City of Dunfermline which make it ripe for investment and growth.”\nLabour’s plan will include investments to drive local and economic growth, with a National Wealth Fund will help to create up to half a million jobs in Britain’s industrial heartlands, giving opportunities to plumbers, electricians, welders, and workers in every single nation and region of the country.\nThis historic investment in working people and their communities is the only way out of the high energy bills, energy insecurity, and the doom-loop of low growth, high taxes and crumbling public services under Rishi Sunak’s Conservatives.\nA large part of that investment will be paid for by a proper windfall tax on oil and gas giants, so those who have profited from energy insecurity pay for the investment needed to rebuild industry, lower bills and make sure we are never at the mercy of dictators like Putin again.\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_tackling-alcohol-deaths-must-be-top-priority-post-pandemic-as-fife-fails-to-meet-treatment-standards/content_65.html": "A council candidate has demanded that tackling alcohol-related deaths among at-risk groups is a top priority for Covid-19 recovery plans, new statistics showed NHS Fife had failed to meet national waiting time standards for treatment, and a new report warned of increased death rates from alcohol among high-risk groups during Covid-19.\nGraeme Downie, Scottish Labour candidate for West Fife and Coastal Villages, has called for guarantees of funding and support, highlighting new figures published this week (22 February) showing NHS Fife had failed to meet a national standard that 90% of people referred for problematic drug or alcohol use should wait no longer than three weeks for treatment.\nAt the same time, Mr. Downie highlighted a report by Public Health Scotland showing increased rates of alcohol-specific deaths during the pandemic among groups already at risk, despite an overall reduction in alcohol consumption and hospitalisations in Scotland.\nMr. Downie said he feared a hidden legacy of alcohol addiction and deaths if action wasn’t taken to guarantee better and fairer treatment.\nCommenting on the publication of the statistics and report, Graeme Downie, Scottish Labour candidate for West Fife and Coastal Villages said: “The publication of these statistics and report are more evidence that the pandemic will have long-term consequences for public health. We must demand that Covid-19 recovery plans include better and fairer treatment for those groups most at risk from alcohol related health issues.”\n“The Public Health Scotland report shows that while overall consumption and alcohol-related hospitalisations and deaths were down during the pandemic, there were increased deaths among high-risk groups.”\n“These people must not be abandoned and support for them should be a top priority as recommended by Public Health Scotland.”\n“At the same time, it is disappointing patients in Fife are waiting longer for specialist alcohol and drug when we know the window when someone reaches out for help can close quickly if they don’t receive the right kind of treatment quickly.”\n“NHS Fife must work with Fife Council, charities and local community groups to make sure we can deliver a better and fairer service focussed on those most at risk.”",
  "https_graemedownie_com/https_graemedownie_com_author_graeme-downie_page_7/content_55.html": "The quote penned by novelist James Lane Allen “Adversity does not build character, it reveals it” applies about as clearly to the past two years of politics as perhaps at any time of the past. It is therefore worth reflecting on what the responses over the past two...\nCuts by the SNP government in Edinburgh to council budgets has left Fife with an £80m backlog of road repairs, a situation a council candidate has described as “brutal.” Graeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, has highlighted the...\nRecently, I was listening to the final episode of my favourite podcast, Talking Politics, which is ending after six educational years. As the team of Professor David Runciman and the incomparable Helen Thompson neared the end of the recording, they listed the things...\nA council candidate has written to the Chair of NHS Fife asking why the region has the lowest number of accepted referrals to Pain Clinics in Scotland and expressing his concern this might be due to lack of resources for those suffering Chronic Pain. Graeme Downie,...\nA council candidate who previously highlighted statistics showing pressure on social care could see over 50,000 Fife patients spend longer in hospital than necessary, has welcomed plans to transform social care in Scotland by delivering free residential care for over...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_just-3-of-fifes-veterans-have-received-promised-id-card-as-labour-launches-listening-campaign/content_19.html": "Just 3% of veterans in Fife have received ID cards from the UK Government to help them access the services they need, as Labour’s General Election candidate for Dunfermline & West Fife launches a Veterans’ Voice campaign to understand concerns from former service men and women.\nIn Fife, just 617 veterans ID cards have been rolled out to the around 18,000 total veterans in the Kingdom.\nThe UK Government promised to provide every veteran in the UK with a card in 2019, designed to provide speedy access to health, housing and charity services.\nIn December, Veterans’ Minister Johnny Mercer promised to rollout all remaining ID cards by this summer. However, analysis conducted by the Labour Party also showed that at the current rate of delivery, it will take more than a century to give every veteran a card.\nTo keep his promise, Mr Mercer needs to deliver over 1.7 million in cards in the next three months, having handed out only a fraction of that so far.\nGraeme Downie, Scottish Labour candidate for the next UK General Election for Dunfermline & West Fife, has accused the UK Government of failing veterans.\nTo learn more about concerns facing local veterans, Mr. Downie has organised an event at the Royal British Legion in Dunfermline on 26 June from 1pm as part of Labour’s Veterans’ Voice campaign.\nVeterans’ Voice is Labour’s nationwide listening campaign to link up with veterans and their families and shape the party’s plans for the next general election.\nGraeme Downie, Scottish Labour candidate for Dunfermline and West Fife, said:\n“It is crystal clear the Conservative UK Government is letting down veterans across Fife.”\n“The veterans ID card is supposed to help our society keep its promise to those who serve by ensuring quick access to services like healthcare. But Conservative ministers have delivered just a fraction of the cards needed.”\n“Our veterans don’t need empty promises, they need action. That’s why Labour has launched its Veterans’ Voice campaign to hear directly from former personnel and their families, and put their lived experiences at the heart of our future policy offer.”\n“I am looking forward to discussing these issues and I am sure many others with local veterans at the event I have organised later this month.”",
  "https_graemedownie_com/https_graemedownie_com_lathalmond-clean-up-critical-for-environment-and-job-opportunities-say-local-candidates/content_63.html": "Two local council election candidates have pledged to work together with government bodies and other parties to find a solution to clean up a site just outside Dunfermline which has become a serious environmental hazard and is restricting economic development in the area.\nGraeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, and Gordon Pryde, Scottish Labour candidate for Dunfermline North, want to see action to clear up the over 7000 tonnes of old carpets and plasterboard at the Lathalmond site just outside Dunfermline.\nAfter visiting the site this week and seeing the mess and environmental damage for themselves, the pair have agreed they will prioritise seeking a solution should they be elected in May.\nAlthough the site lies within the West Fife & Coastal Villages Ward, both Mr. Downie and Mr. Pryde believe it will take a coordinated effort to clean-up the site, regenerate the local environment and put in place a plan to use the site to bring jobs to the wider area.\nGraeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, said:\n“Lathalmond has been a blight on this part of West Fife for almost a decade now and it is going to take coordinated if we are to make progress.”\n“The site has the potential to help the local economy and deliver jobs to West Fife but that can’t happen until this unsightly and hazardous waste is properly cleared.”\n“Gordon and I will work together after the election to keep this issue on the agenda and help reach an agreement which will allow speedy progress.”\nGordon Pryde, Scottish Labour candidate for Dunfermline North, said:\n“People across Dunfermline know about the mess up at Lathalmond and it is in everyone’s interest to see this problem sorted quickly.”\n“Cooperation is the only way we will get anything done. The environmental damage being done must be reversed and the site returned to a constructive use.”\n“We need to work with SEPA, Scottish Government and other bodies to find a solution to this problem as quickly as possible.”",
  "https_graemedownie_com/https_graemedownie_com_is-that-helping/content_9.html": "Another phrase that got me thinking this week was I realised I say “Is that helping?” a lot, often in sarcasm and with a wry smile. I was carrying heavy bags of soil in the garden and my wife duly added a trowel on top of them for me to take to the right place. This was met with a sarcastic “is that helping?” from me along with a wry smile.\nIt is one of those phrases where tone and context really are king, otherwise I might have ended up in the…compost.\n“Is that helping?” is a phrase I think Scottish Labour need to use a lot more in any number of contexts and with a variety of different tones.\nWe need to earnestly ask, “is that helping?” when developing our policies and, if so, who is it helping. That moment of pause is helpful to stop our manifestos become laundry lists of commitments that sound good to us but perhaps won’t have the impact we first think.\nWe need to challenge ourselves and ask, “is that helping?” when deciding if a particular decision is contributing to a strategy or increasing our supporters.\nWe need to sceptically ask, “is that helping?” when being constructive in opposition. It is a good way to decide if a government policy deserves support or not. Is it tokenism or is it actually going in the right direction?\nWe need to forcefully ask, “is that helping?” when we see unhelpful contributions from our own side that take us off message and serve only as distractions.\nAnd there should always be room for sarcasm so I am going to ask, “is that helping?” as I realise I should be in the garden and writing this may only have served as procrastination.",
  "https_graemedownie_com/https_graemedownie_com_category_blog/content_3.html": "You could almost hear the eyelid muscles of Scottish Labour activists straining last week as we stared at the results of the YouGov MRP poll that had just been published. Don’t let the eyelids shut. Keep those eyes open. Don’t blink or it might go away. But no, it...\nI was delighted to be selected to be the Scottish Labour candidate for the seat where I live, Dunfermline & West Fife, likely to become Dunfermline & East Ochils after boundary changes. It it is a very winnable seat in a General Election, but also could be a...\nThe quote penned by novelist James Lane Allen “Adversity does not build character, it reveals it” applies about as clearly to the past two years of politics as perhaps at any time of the past. It is therefore worth reflecting on what the responses over the past two...\nRecently, I was listening to the final episode of my favourite podcast, Talking Politics, which is ending after six educational years. As the team of Professor David Runciman and the incomparable Helen Thompson neared the end of the recording, they listed the things...\nAs a local council candidate, what strikes me speaking to people is that everyone, regardless of age, gender, background or political affiliation, wants to make their community and country, however they identify that, better. We know the divisiveness of the...\nYou will all know the joke about Scotland being the only place where a double positive makes a negative? “Aye, right.” Said out loud in most parts of Scotland, we know what that means but it doesn’t travel well and is likely to confuse. Another phrase that got me...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_health-secretary-must-explain-gp-surgery-delay-to-west-fife-community/content_27.html": "The Scottish Government’s decision to delay funding for a new GP surgery in West Fife means it could be 15 or 20 years after a replacement was promised before it is delivered.\nIn a briefing shared via social media by Fife Health & Social Care Partnership, the community in Kincardine were advised that the Scottish Government has confirmed that “…funding is unlikely to be released…within the initially anticipated timescales… As a result resources will likely be provided in the second half of the decade.”\nCllr. Graeme Downie, Scottish Labour Councillor for West Fife & Coastal Villages, has written to Cabinet Secretary for Health & Wellbeing, Humza Yousaf MSP, asking him to visit Kincardine and explain the decision to the local community.\nCommenting, Cllr. Downie said:\n“I will be speaking to people in the local community about how this decision will impact them.”\n“Kincardine has an SNP MP and an SNP MSP and I hope they will join me and the community in a campaign to reverse this decision by the Scottish Government and get Kincardine the GP surgery it was promised.”\nCllr. David Graham (Lab, Buckhaven, Methil and Wemyss villages), Fife Labour Spokesperson for Health and Social Care, said:\n“The SNP have been failing health services across Fife. You see it in A&E, ambulances and in waiting times across medical disciplines. That has to be addressed and promises must be kept. Only the Labour Party is interested in delivering the change Fife needs.”\nLetter to Humza Yousaf MSP\n“Dear Humza\nI am sorry to interrupt your full-time job of running to be First Minister but some of the constituents in my Ward in West Fife think you should be concentrating on turning round the poor state of the health services in their area instead.\nIt seems an announcement was snuck out last week which means the village of Kincardine in West Fife will now not be receiving the new GP surgery it was promised 10 years ago. I know delivery has been a challenge for the SNP in government on issues from policing to roads and infrastructure to health and that excuses have been similarly varied. However, this further delay is unacceptable, will risk the health of people in my Ward and deny an ambitious village the services it needs to thrive.\nThe briefing provided points to the Scottish Government taking a “phased approach to the funding of capital projects” and that “resources will likely be provided in the second half of the decade.”\nPresumably even after these resources are provided, it will still take time for procurement, construction and staffing, meaning it will be at least 15 years, possibly as long as 20 years, since the people in my Ward were promised a new GP surgery.\nIn whatever role you might hold in the next few weeks, can I ask that you come to Kincardine and explain to the people in my Ward exactly how the Scottish Government have managed to fail them quite so badly.\nYours sincerely,”",
  "https_graemedownie_com/https_graemedownie_com_category_news/content_31.html": "A UK Labour government will save £300 off the average energy bills for families in Dunfermline & Dollar while bringing good jobs to the local community, the Scottish Labour candidate for the area said today. Graeme Downie said Labour’s Green Prosperity Plan shows...\nA General Election candidate has thanked farmers for their contribution to the local economy, enhancing food security and tackling climate change saying that, if elected, he will listen to and support the local farming community across the Dunfermline & Dollar...\nA Scottish Labour General Election candidate has warned cuts to officer numbers mean Police Scotland will no longer be able to support community events in Fife, putting Armistice Day commemorations and other activities at risk. Graeme Downie, Scottish Labour Candidate...\nCommenting on the Scottish Budget announced this afternoon, Graeme Downie, Labour Candidate for Dunfermline & Dollar, said: “Opportunity, aspiration and ambition should be at the heart of plans for Dunfermline to take advantage of city status, yet the SNP...\nA campaign to reverse a decision to withdraw funding for a new health centre in Kincardine is gathering momentum after a public meeting this afternoon secured the support of a leading MSP. The meeting was organised by Cllr. Graeme Downie, Fife Labour Councillor for...\nA Fife Councillor who supported a campaign for better GP services at a local health centre has welcomed the awarding of a new GP service contract and said while it might be a long road to bring the service fully up to scratch, he hopes improvements can start...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_fife-sites-like-longannet-could-be-landmark-investments-for-gb-energy/content_20.html": "A Labour candidate says the announcement the Headquarters of a British publicly-owned energy generation company will be based in Scotland is a huge opportunity for sites in Fife such as Rosyth and Longannet.\nGraeme Downie, Labour candidate for Dunfermline & West Fife, said the announcement demonstrates what a UK Labour government will deliver, contrasting it with the UK Tory government and SNP administration in Edinburgh who for over a decade have failed to deliver renewable energy jobs or secure investment in sites such as the former Coal Generating Station at Longannet, near Kincardine.\nMr. Downie was reacting to the announcement by Keir Starmer that Labour’s world leading plan to make Britain a clean energy superpower by 2030 will be “made in Scotland”, as the Labour Leader announced that GB Energy, Labour’s publicly-owned energy company, will be headquartered in Scotland.\nMr. Downie believes Longannet could be a perfect opportunity for investment and delivering thousands of jobs under the next UK Labour government.\nThe site was once the largest power station in Scotland, opening in 1970, closing in 2016. The 80,000m2 site is owned by Scottish Power and while there were attempts to bring train manufacturer, Talgo, to the site in previous years, Scottish Enterprise confirmed this option has lapsed.\nCommenting, Graeme Downie, Labour candidate for Dunfermline & West Fife, said: “Today’s announcement shows what a UK Labour government can deliver for Dunfermline and the rest of Fife, creating opportunities and meeting the aspirations and ambitions of people across the Kingdom.”\n“Previous Labour governments took decisions in the interest of Fife, saving sites such as Rosyth dockyard, while both the Tories and SNP have failed to deliver renewable energy jobs or attract investment for sites such as Longannet, which has such huge potential to reinvigorate the regional economy.”\n“The Tories have no plan to attract investment to Scotland, while the SNP failed to plan for the use of a major site like Longannet, with promises of train factories and offshore wind jobs all falling away.”\n“That is why it is critical we have as many Scottish Labour MPs as possible at the next election, delivering a Labour government that will deliver the change Dunfermline & West Fife needs.”\nMr. Downie has written to Jonathan Reynolds MP, Shadow Secretary of State for Business and Industrial Strategy, inviting him to visit Fife to meet local businesses and skills providers to understand the full potential of the Longannet and other sites.",
  "https_graemedownie_com/https_graemedownie_com_author_graeme-downie_page_5/content_36.html": "A West Fife Councillor has written to companies whose vehicles have been spotted speeding through a dangerous set of traffic lights in Kincardine, urging their drivers to be more careful. The traffic lights and junction at North Road / Feregait / Toll Road in...\nFour West Fife Labour Councillors have written to the Chief Executive of Stagecoach demanding the company rethink plans to change services, urging them to instead invest in services to help people meet challenges caused by price rises across the economy. Stagecoach...\nListen to my full interview with Kingdom FM here. A Fife Councillor has called for more support to help Home Care workers with rising petrol costs as part of Fife Labour Council efforts to mitigate the effects of the SNP / Tory recession. Cllr. Graeme Downie, Scottish...\nAttempts by NHS Fife to plug gaps in GP services with locums are falling short, according to a Fife Labour Councillor, who wants more information about how other interventions can maintain a high level of care for people and communities. Figures obtained through a...\nA local Councillor has called for Fife Council to do more to tackle a shortage of social housing in the West Fife Villages. Cllr. Graeme Downie, Scottish Labour Council for West Fife & Coastal Villages, says housing issues have been one of the issues raised most...\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_west-fife-candidate-calls-for-snp-to-take-action-to-tackle-increasing-cost-of-living/content_64.html": "A West Fife candidate has called for the SNP to help address the rising cost of living by blocking proposed rises in water charges and providing an immediate Fuel Costs Payment to help those most in need meet the rising cost of energy.\nGraeme Downie, Scottish Labour candidate for West Fife and Coastal Villages for the local elections on 5 May, has called for the SNP to review their approval of this year’s 4.2% increase in water charge rises and defer future rises until the current cost of living pressures have reduced.\nWithout intervention, this year’s rise would be followed by increases of an average of 2% above inflation until 2027, despite Scottish Water sitting on at least £400m in reserves.\nMr. Downie has also backed calls for the SNP to use £238 million of Barnett consequentials to provide an immediate Fuel Costs Payment that would put £400 in the pocket of those most in need to help them with sky-rocketing energy bills.\nCommenting, Graeme Downie, Scottish Labour candidate for West Fife and Coastal Villages, said:\n“With Tory Tax rises, growing inflation and increased energy prices, governments at Holyrood and Westminster must take action to help people in West Fife and across Scotland.”\n“The SNP must immediately reverse their approval of a 4.2% rise in water bills and defer plans for future rises until some of the current cost of living pressures have abated.”\n“The SNP should also use Barnett consequentials to provide an immediate Fuel Costs Payment to help those most in need meet rising energy bills.”\n“Only the Scottish Labour Party is demanding action to make West Fife better and fairer. It is time for the Tories and the SNP to wake up and take action before we more people are struggling to make ends meet.”",
  "https_graemedownie_com/https_graemedownie_com_blogs/content_2.html": "Blogs and opinions\nAspiration, ambition and the route through Scottish marginals\nby Graeme Downie | 1 June 2023 | Blog | 0 Comments\nYou could almost hear the eyelid muscles of Scottish Labour activists straining last week as we stared at the results of the YouGov MRP poll that had just been published. Don’t let the eyelids shut. Keep those eyes open. Don’t blink or it might go away. But no, it...\nScottish voted want change but not for its own sake\nby Graeme Downie | 24 May 2023 | Blog | 0 Comments\nI was delighted to be selected to be the Scottish Labour candidate for the seat where I live, Dunfermline & West Fife, likely to become Dunfermline & East Ochils after boundary changes. It it is a very winnable seat in a General Election, but also could be a...\nCrisis, what crisis? Values, what values?\nby Graeme Downie | 21 March 2022 | Blog | 0 Comments\nThe quote penned by novelist James Lane Allen “Adversity does not build character, it reveals it” applies about as clearly to the past two years of politics as perhaps at any time of the past. It is therefore worth reflecting on what the responses over the past two...\nGlobal climate challenge; Time to act local?\nby Graeme Downie | 9 March 2022 | Blog | 0 Comments\nRecently, I was listening to the final episode of my favourite podcast, Talking Politics, which is ending after six educational years. As the team of Professor David Runciman and the incomparable Helen Thompson neared the end of the recording, they listed the things...\nGetting voters to demand better of local government could kickstart a democratic renewal\nby Graeme Downie | 21 January 2022 | Blog | 0 Comments\nAs a local council candidate, what strikes me speaking to people is that everyone, regardless of age, gender, background or political affiliation, wants to make their community and country, however they identify that, better. We know the divisiveness of the...\nIs that helping?\nby Graeme Downie | 2 July 2021 | Blog | 0 Comments\nYou will all know the joke about Scotland being the only place where a double positive makes a negative? “Aye, right.” Said out loud in most parts of Scotland, we know what that means but it doesn’t travel well and is likely to confuse. Another phrase that got me...\nA little more conversation, a little less self-destruction please\nby Graeme Downie | 24 June 2021 | Blog | 0 Comments\nFirstly, yes, this is a very long sub-tweet. As I have said before, Scottish Labour can continue on a path to recovery and relevance by supporting people’s aspirations and by reaching out to build as broad a coalition as possible. To do that we need to talk about...\nOn your side and on Scotland’s side\nby Graeme Downie | 21 June 2021 | Blog | 0 Comments\nAfter a Westminster election, The British Election Study (BES) can be invaluable in getting behind the punditry and perceived wisdoms to more fact-based lessons and analysis that political parties can use. In 2017, the BES found there was no “youthquake” in favour of...\nNo vote is ours by right, but no vote should be out of reach\nby Graeme Downie | 10 June 2021 | Blog | 0 Comments\nComrades, I have bad news. The electorate think Scottish Labour is out of touch and that the party arrogantly believes it is special and somehow morally superior to other political parties. You know why? Because we are out of touch and arrogantly believe we are...\nScottish Labour should mean business as well\nby Graeme Downie | 8 June 2021 | Blog | 0 Comments\nIt has been fantastic watching new Scottish Labour MSPs working so effectively since the election, both at Holyrood and in their communities. It has been equally heartening to see those same MSPs, and others in the group, being so heavily involved in issues that will...",
  "https_graemedownie_com/https_graemedownie_com_west-fife-councillors-demand-rethink-to-bus-timetable-changes/content_37.html": "Four West Fife Labour Councillors have written to the Chief Executive of Stagecoach demanding the company rethink plans to change services, urging them to instead invest in services to help people meet challenges caused by price rises across the economy.\nStagecoach published its revised plans last week and four councillors; Cllr. Graeme Downie (West Fife & Coastal Villages); Cllr. Cara Hilton (Dunfermline South); Cllr. Gordon Pryde (Dunfermline North); and Cllr. Andrew Verrecchia (Rosyth) have received calls, emails and social media messages from local people complaining about the changes.\nIn their letter to Martin Griffiths, the four Councillors say they are worried changes being proposed will add significantly to financial pressures people are facing and make it harder for them to maintain or access jobs and educational opportunities.\nThey highlight specific cases from commuters, wheelchair users and public service workers pointing out the problems with service changes.\nRather than cutting services, the four Councillors have asked for an urgent meeting with Stagecoach to discuss the proposed changes as well as how the company might consider increasing services to help people in West Fife handle an incredibly tough period by increasing the provision of bus services in this area.\n——ENDS——\nFor more information, contact Graeme Downie on 07973 300 184 or at graeme@graemedownie.com\nIMAGE: Cllr. Graeme Downie, Cllr. Cara Hilton, Cllr. Gordon Pryde and Cllr. Andrew Verrecchia at Dunfermline Bus Station.\nFull text of letter (29 August 2022)\n“Dear Mr. Griffiths\nWe are writing to you jointly as Councillors representing Dunfermline and West Fife to ask you to halt changes to Stagecoach’s timetable and, instead, invest in more services in the area to help people meet the difficult financial circumstances they face.\nThe changes being proposed will significantly add to financial pressures people are facing and make it harder for them to maintain or access jobs and educational opportunities.\nEffective public transport is always an essential part of a successful economy but even more so at a time of sky-rocketing petrol prices and with the costs of energy, food and essentials increasing sharply.\nAs a result, more and more people will need to rely on your bus services in West Fife and to slash them in the way you are planning will add another concern to people and families throughout the area.\nSince the launch of the consultation on these plans just a few days ago (23 August), we have been contacted by a number of our constituents worried about the effects they will have:\nIn particular, we have already heard from people in our areas worried about:\n- Parents struggling to collect children from school or childcare because of the need to use a car or get a taxi which also adds significantly to cost.\n- Harder for shift workers such as nurses and refuse workers that will find it harder to get to and from work late at night or early in the morning.\n- Further reductions in rural bus services in West Fife making it harder to travel just a few miles between two villages, when that journey can already take up to two hours and is essential to use particularly health services in the area.\n- Young people unable to access work and educational opportunities as they are less likely to have access to a car.\n- Increased carbon emissions as people are compelled to use their car more\nSpecifically, we have been told of some specific concerns regarding the proposed changes:\n- A person who finishes work in Edinburgh at 5pm will be unable to get home to Saline, a village in rural West Fife, until 8pm unless he pays for a taxi, which he can’t afford.\n- A disabled woman in Abbeyview who will likely have to give up the job she loves as there will now be no bus serving her street and she is unable to walk the length of Aberdour Rd or through Abbeyview to get the proposed alternative service.\n- Fife Council staff will be unable to travel by bus from Dunfermline to Bankhead because two early buses from the city to Glenrothes have been cancelled.\nWe would welcome the opportunity to meet with members of your team urgently to go through these issues in detail.\nIn addition to rolling back these specific changes, we hope to discuss how Stagecoach can help people in our communities through what will be an incredibly tough period by increasing the provision of bus services in this area.\nWe look forward to hearing from you very soon.\nSincerely,”",
  "https_graemedownie_com/https_graemedownie_com_thanks-due-to-farmers-for-their-vital-role-in-local-economy-says-candidate/content_5.html": "A General Election candidate has thanked farmers for their contribution to the local economy, enhancing food security and tackling climate change saying that, if elected, he will listen to and support the local farming community across the Dunfermline & Dollar constituency.\nGraeme Downie, Scottish Labour Candidate for Dunfermline & Dollar for the UK General Election, visited James Adam’s cattle and sheep farm near Townhill, just outside Dunfermline, this week, at the start of lambing season.\nDuring the visit to the farm, organised by NFU Scotland, Mr. Downie witnessed first-hand the dedication and hard work undertaken by Mr. Adam and his family in rearing lambs and cattle for market.\nFife boasts over 1,500 agricultural holdings, collectively employ over 3,000 people, with most of the jobs being full-time positions.\nAs well as seeing the new born lambs and cattle on the farm during the visit, Mr. Adam described the incredible produce made at other farms in West Fife, from fruit and vegetables to milk and cereals, demonstrating the range and scale of the farming sector in the Kingdom.\nCommenting after the visit, Mr. Downie said:\n“The commitment and hard work of people like James and his family is a critical component of our local economy but sometimes farmers feel they are overlooked or taken for granted.”\n“But as well as supporting employment, farming in Fife is critical to improving food security and tackling climate change by providing more local sources of food, reducing reliance on importsand cutting back on food miles.”\n“I am very grateful to James for allowing me to visit at such a busy time and to NFU Scotland for helping to organise. As I told James, if I am fortunate enough to be elected at the General Election this year, I will make sure that the contribution of farms and farmers in Dunfermline & Dollar is not forgotten.”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_digital-meet-the-candidate-sessions-in-west-fife-coastal-villages/content_77.html": "Scottish Labour’s candidate in West Fife & Coastal Villages for the local elections next year has announced a series of digital events to allow local people to meet their candidate and ask questions in the run-up to the election in May 2022.\nAs well as speaking to people in the local area where he lives, Graeme Downie is keen to offer people the chance to speak to him online about the issues most important to them. The events will each last an hour and can be accessed via the campaign Facebook page.\nThe initial dates and times of the digital events are:\n- Thursday 25 November (12.30pm)\n- Sunday 5 December (11am)\n- Monday 6 December (6pm)\n- Saturday 11 December (11am)\n- Thursday 16 December (9pm)\n- Saturday 18 December (2pm)\nCommenting on the announcement of the digital sessions, Graeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, said:\n“I live in this Ward and regularly speak to people in the street, in parks, in shops and around the community. Even so, it is important to offer as many ways as possible for people to get to know me and for me to know what issues are most important to them.”\n“I want people here to demand better and demand fairer for this area and I want to demand that with them. I want to find ways to give young people real opportunities and real choices. I want to improve services in this area and support the fantastic local communities that we have in all 13 villages in the Ward.”\n“I hope people will take up the opportunity to take part and I look forward to speaking to as many people as possible both online and elsewhere throughout this campaign.”\nMore information on how to join is available on the campaign Facebook Page.",
  "https_graemedownie_com/https_graemedownie_com_councillor-urges-vans-and-trucks-to-slow-down-at-notorious-kincardine-traffic-lights/content_48.html": "A West Fife Councillor has written to companies whose vehicles have been spotted speeding through a dangerous set of traffic lights in Kincardine, urging their drivers to be more careful.\nThe traffic lights and junction at North Road / Feregait / Toll Road in Kincardine is set to be redesigned as part of the regeneration of Kincardine High Street but Cllr. Downie believes companies have a responsibility to have their drivers slowdown in the meantime.\nConstituents highlighted concerns over the traffic lights during recent surgeries and Community Council meetings in the village, prompting to Cllr. Downie to write to companies such as Openreach and Diageo urging them to get their drivers to slow down when approaching the junction.\nCllr. Downie said he had already received a positive response from Openreach who have briefed local engineering teams, reminding them of the importance to driving safety and reducing their speed. Diageo have also said they will look in to the issue in more detail with their contractors who go through the village on their way to and from their site in Alloa.\nCllr. Downie is urging local people to get in touch with him to highlight other companies speeding at the junction so he can contact them as well.\nCommenting on the issue, Cllr. Downie, said:\n“The traffic lights at North Road / Toll Road are a serious safety concern for people in Kincardine. There have been collisions at the junction between cars, vans and HGVs as well as near-misses with pedestrians.”\n“It is right the lights and junction are being redesigned to make them safer but that will take time and it is important companies with vehicles who have come through Kincardine make sure their drivers are driving responsibly. Where possible I would urge companies to avoid using the village as a through route at all.”\n“I want to thank both Openreach and Diageo for their positive response and the constructive way they have deal with my requests which I hope will see some improvements. I would ask people to get in touch and let me know of other poor driving in the area and I will follow-up with those companies as well.”\nRecent Comments",
  "https_graemedownie_com/https_graemedownie_com_council-candidate-supports-local-venues-with-first-meet-the-voters-events/content_69.html": "Graeme Downie, Scottish Labour’s candidate for West Fife & Coastal Villages will hold his first two “Meet the Voter” events at Marco’s Kitchen in Kincardine and The Stables in Culross later this month.\nGraeme has confirmed the event series will be held in local business and community venues to support them and understand what issues they are facing, as well as provide an opportunity to hear from local people, ahead of the council election on 5 May.\nThe first two events will take place as follows:\n- Friday 21 January (10am – 11am) – Marco’s Kitchen, Kirk Street, Kincardine\n- Tuesday 25 January (10am – 11am) – The Stables, Culross\nCommenting on the announcement,, Graeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, said:\n“During this campaign, I want to provide as many opportunities as possible for local people to tell me how they think we can work together to make West Fife & Coastal Villages better and fairer.”\n“I have already held a number of digital events and been knocking on people’s doors, and there will be alot more of both before the election, but I want to organise as many different types of event as possible to speak to local people.”\n“I want to thank both venues for allowing me to hold events with them and, while this does not imply any support of my campaign, I want to hear from them as well as members of the community about what issues local businesses and venues are facing and how they might be overcome.”\n“I hope people will come along and tell me what issues are important to them and how I might be able to help them during the campaign and after if I am fortunate enough to be elected.”",
  "https_graemedownie_com/https_graemedownie_com_plan-for-longannet-needed-to-help-address-youth-unemployment-in-west-fife/content_74.html": "9,000 fewer young people in work in Fife since SNP came to power\nStatistics published this week show almost 9,000 fewer young people in Fife are employed than when the SNP came to power in Edinburgh 14 years ago.\nThe statistics have been called “damning” by one local council candidate who has urged the Scottish Government to do more, including focussing on the regeneration of Longannet power station site to bring thousands of jobs to West Fife.\nGraeme Downie, Scottish Labour candidate for West Fife and Coastal Villages believes places like Kincardine are being forgotten about and it is young people in particular who are suffering.\nThe statistics, published by Scottish Government, show that in October 2007 to September 2008, there were 23,500 young people (16-24) in employment in Fife. In October 2020 to September 2021, there were 14,900 young people in employment in Fife. That is a drop of 8,600, or 11.7% over the period.\nCommenting on the statistics, Graeme Downie said:\n“These statistics are absolutely damning and show that while the SNP are focussed on independence, young people in West Fife and across the region are suffering.”\n“Almost 9,000 fewer young people in work has enormous consequences for them, their families and the future of places like Kincardine.”\n“Just last week, we saw the main stack at Longannet come down but still no plan from the SNP about how they can use that site to deliver mass employment to the area.\n“Speaking to residents, neighbours and family it is clear we are suffering a lost generation. Prospects are few, support is minimal and the SNP live in a denial about the harm their policies are causing.”\n“West Fife has been forgotten about by the Scottish Government for too long. If elected I will immediately convene discussions with industry leaders on how best to implement a strategic plan for Longannet and to bring jobs for young people to the area.”",
  "https_graemedownie_com/https_graemedownie_com_author_graeme-downie_page_9/content_66.html": "A local council candidate has urged the SNP-led Scottish Government to delay the implementation of rules that could require homeowners to spend hundreds of pounds on new smoke alarms. Graeme Downie, Scottish Labour candidate for West Fife & Coastal Villages, has...\nGraeme Downie, Scottish Labour’s candidate for West Fife & Coastal Villages will hold his first two “Meet the Voter” events at Marco’s Kitchen in Kincardine and The Stables in Culross later this month. Graeme has confirmed the event series will be held in local...\n9,000 fewer young people in work in Fife since SNP came to power Statistics published this week show almost 9,000 fewer young people in Fife are employed than when the SNP came to power in Edinburgh 14 years ago. The statistics have been called “damning” by one local...\nNew figures show pressure on social care could see over 50,000 Fife patients spend longer in hospital according to a West Fife council candidate. Graeme Downie, Scottish Labour Candidate for West Fife and Coastal Villages, has analysed the latest figures from the...\nI am going to be out and about in Kincardine this Saturday morning, 11 December with a small team knocking on doors and speaking to local people about issues they are concerned about. If you see me around then please do come up and say hello! If there is anyone who...\nRecent Comments"
}