{
  "http_www_cpaparty_net/http_www_cpaparty_net/content_1.html": "please donate to support the cpa\niNTRODUCING THE christian peoples alliance\nCPA: our general election policies\nWe will raise money from:\n1. A turnover tax £40.5bn\n2. Cutting QUANGOs £100bn\n3. Removing additional social requirements from Government contracts £37.9bn\nWE will spend it on :\n1. Supporting Marriage and the Family £3bn\n2. Provision of pro life pregnancy care £2bn\n3. Removing the 5 week waiting period for benefits £12bn\n4. Guaranteeing anyone sleeping rough a night shelter with a free meal £2bn\n5. Cut crime by supporting people leaving prison £3bn\n6. Getting rid of commercial rates £21bn\n7. Rebuild Britain with a new London Airport and links to it £40bn per year.\nComplete HS2 £20bn per year. Take bids for other capital projects £40bn per year.\nOur full manifesto can be found here.\nABOUT CPA\nThe Christian Peoples Alliance is a party set up to promote Christian values in our nation. Our members come from all backgrounds and church traditions. We are focussed on hearing from God and seeking His heart for every sphere of public life. We have developed a detailed manifesto seeking only to say things that are pleasing to God and are based on Biblical values.\nMESSAGE FROM SID CORDLE\nAs the leader of the Christian Peoples Alliance since 2012 I’m glad to say we are now growing as a party. We already have almost 100 candidates lined up working in their areas and standing for election at different levels. But we need more. Only when we have 500 candidates ready to stand in a General Election will we become a real option for Government. Our party is standing 100% for Christian values at every level be it protecting the family, protecting life from conception or caring for the poor. Our policies are fully costed and I commend them to you. The nation needs a Christian option and we need you to help us.\nABOUT CPA\nThe Christian Peoples Alliance is a party set up to represent Christian values in our nation . Our members come from all backgrounds and church traditions. We are focussed on hearing from God and seeking His heart for every sphere of public life. We have developed a detailed manifesto seeking only to say things that are pleasing to God and are based on Biblical values."
}