{
  "https_www_craig-smith_uk_/https_www_craig-smith_uk_escooters/content_9.html": "“E-scooters are becoming increasingly popular, but the current laws are too vague and open to interpretation. This creates a situation where enforcement is inconsistent, and public safety is put at risk. Either these machines need to be banned, or we need clear legislation that allows them to be used responsibly and legally.”",
  "https_www_craig-smith_uk_/https_www_craig-smith_uk_potholes/content_2.html": "As your County Councillor, I have worked hard to get the worst roads in Coalville resurfaced and potholes filled quicker.\nI got Forest Road resurfaced which had 28 potholes and had been a nightmare for residents for years.\nThen I got Ravenstone Cross Roads resurfaced, which had so many potholes it had become one giant crater!\nAnd prior to the restoration work on Mantle Lane (which I funded) I got the whole road resurfaced as it was in such a poor condition.",
  "https_www_craig-smith_uk_/https_www_craig-smith_uk_news_category_European-News/content_5.html": "I will always stand up for what I believe in and against bullies 1st March 2025 Leadership is measured in moments of crisis. What we saw in the Oval Office yesterday was not leadership, it was a spectacle of arrogance and bullying... European News",
  "https_www_craig-smith_uk_/https_www_craig-smith_uk_news_election-isnt-about-me-winning-its-about-coalville-winning/content_6.html": "Four years ago, I had the incredible honour of being elected as your County Councillor for Coalville North, the first and only Conservative ever to win this seat. Coalville has always been seen as a Labour stronghold, and if I’m honest, even I wasn’t expected to win back then. But I did, overturning the Labour Leader’s majority, and I’ve never taken that responsibility for granted.\nFrom the very beginning, I set out to change what people expect from a local councillor. I didn’t just want to do the job, I wanted to do it differently, and do it better.\nI asked myself one simple question: what would I want from my councillor if I were a resident?\nAnd to me, it came down to four key things: accountability, action, hard work, and results.\nAccountability\nI made it a priority to be transparent and accessible. I launched my own website and built up active social media pages where I post updates every single day, from the work I’m doing behind the scenes to important local information. I answer every email and call personally, and for the most part, I’ve been operating 24/7 to make sure you’re heard and supported.\nAction\nI made a promise to tackle the state of our roads, and I kept it. Are they perfect? No. But they’re significantly better than they were four years ago. Through sheer persistence, I secured funding for key improvements on Mantle Lane, Forest Road, and the dangerous Ravenstone Crossroads, areas that had been ignored for far too long.\nHard Work\nIn four years, I haven’t missed a single council meeting. In fact, I’ve often stepped in for colleagues, taking my attendance to an incredible 147%. I’ve reported more road defects than any other councillor in Leicestershire, and we’ve got some great ones. I don’t walk past problems. I take them on. When residents on Highfield Street told me about illegal Sunday work starting at 7am, I was there in my high-vis, stopping it in its tracks. That’s the kind of councillor I am, hands-on, responsive 24/7, and community-focused.\nBut now, I need your help again.\nEvery poll suggests the Conservatives will retain a strong majority at County Hall, but in marginal seats like Coalville North, it’s going to be incredibly close. Tactical voting could hand this division back to another party. And if that happens, it will have real consequences for our community.\nYou see, the decisions that shape our county are made by the Cabinet. If Coalville North is represented by an opposition councillor, they won’t have a seat at that table. They’ll be able to criticise decisions, but they won’t be able to influence them. That means Coalville’s voice could be drowned out.\nAs your sitting councillor, I already do have a seat at that table. I’m a senior, respected member of the County Council. I’ve been involved in making decisions that affect all of Leicestershire, and I always speak up to make sure Coalville gets its fair share.\nBy re-electing me on May 1st, you’re keeping that voice, a strong, trusted voice that will continue to fight for you.\nSo yes, this election is about more than me. It’s about what kind of future we want for Coalville. I believe we deserve better, and I believe we’re only just getting started.\nIf you put your trust in me again, I’ll continue to be the councillor you can count on, always putting Coalville first, and always keeping us at the front of the queue.\nOn May 1st #ChooseCraig to keep Coalville winning",
  "https_www_craig-smith_uk_/https_www_craig-smith_uk_cookies/content_7.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_craig-smith_uk_/https_www_craig-smith_uk_parking/content_4.html": "As your County Councillor, I have worked hard to get the worst roads in Coalville resurfaced and potholes filled quicker.I got Forest Road resurfaced which had 28 potholes and had been a nightmare for residents for years.Then I got Ravenstone Cross Roads resurfaced, which had so many potholes it had\nI’ve spent the last four years standing up for Coalville North and getting things done and now I'm listening to what matters to you.My Track Record for Coalville North:✅ Securing more money for our roads and highways to be resurfaced, like Forest road✅ Opposing plans to build on Hugglescote Recky –\nThe Local Elections will go ahead on May 1st and I need your support.I've been our County Councillor since 2021 and I will keep fighting every step of the way for a better future for Coalville North and beyond.Tell me if I have your support via my survey by clicking here.\n“E-scooters are becoming increasingly popular, but the current laws are too vague and open to interpretation. This creates a situation where enforcement is inconsistent, and public safety is put at risk.\nThere has been a lot of change this year and many are feeling the pinch as a result.I want to know if you can afford Labour's Christmas this year and how it is impacting you and your family at this important time.\nFollowing the Budget, I'm calling on Labour to reverse their tax on British farmers, protecting rural communities as well as stopping prices going up in the supermarket.Help me by adding your name below!",
  "https_www_craig-smith_uk_/https_www_craig-smith_uk/content_1.html": "I'm Craig Smith, the Conservative County Councillor for the Coalville North Division and Parliamentary Spokesman for North West Leicestershire.\nHere, you can find my latest news, campaigns and more about me, including how to contact me. I'm here to help, so please don't hesitate to get in touch.",
  "https_www_craig-smith_uk_/https_www_craig-smith_uk_news_craig-smith-standing-firm-north-west-leicestershires-sole-conservative-county-councillor/content_3.html": "Following Yesterday’s local elections results, I am honoured and humbled to have been re-elected as the County Councillor for Coalville North. I would like to sincerely thank everyone who took the time to vote. Your support means the world to me.\nWe ran a very strong, visible, and community-focused campaign over five months, and I have no doubt that effort was key to keeping Coalville North from falling to Reform. It was a true team effort, and I remain committed to working hard for all residents, regardless of how they voted.\nThat said, the wider result was sobering. All of my fellow Conservative County Councillors in North West Leicestershire lost their seats, with Reform UK making sweeping gains. I know how hard each of them worked and how much they gave to their communities. Having faced a narrow defeat myself in last year’s General Election, I know just how painful that outcome can be, but also how it can galvanise you to come back stronger.\nAcross Leicestershire, the Conservative group now consists of 15 experienced councillors. After a unanimous group decision, we will not enter any coalition with the Lib Dems, Labour, Greens, or Independents. We were elected as Conservatives and we will serve as Conservatives. Our group will now form the official opposition at County Hall.\nThat means robustly scrutinising the new Reform UK administration, holding them to account, and making sure decisions taken truly reflect the needs of our communities.\nThe road ahead starts now.\nCllr Craig Smith\nCounty Councillor, Coalville North",
  "https_www_craig-smith_uk_/https_www_craig-smith_uk_news_i-will-always-stand-what-i-believe-and-against-bullies/content_8.html": "Leadership is measured in moments of crisis. What we saw in the Oval Office yesterday was not leadership, it was a spectacle of arrogance and bullying.\nPresident Zelenskyy, a leader who has fought relentlessly to defend his country against Russian aggression, deserved respect and solidarity. Instead, he was publicly berated by a man who should be standing with him, not undermining him. The optics were shameful, the implications could be devastating.\nThe UK cannot afford to be a bystander. If America is turning inwards, we must step forward. Britain has always been a nation that stands up for its allies and defends freedom against tyranny. This is our moment to show real leadership, diplomatic, strategic, and moral.\nThe silence from some of our political leaders is deafening, but that’s what you tend to get with populist politics. The world is shifting, and we need strong voices, not cautious whispers. The government must act with urgency to reaffirm our unwavering commitment to Ukraine and to rally our allies. Division among Western nations is exactly what Putin wants.\nNow is not the time for weakness. Now is the time for resolve. Britain must be at the heart of shaping the response, reinforcing our alliances, and ensuring that those who fight for their freedom are never left to stand alone.\nEchos of the 1930s"
}