{
  "https_www_helenadollimore_com/https_www_helenadollimore_com_saveourfireservice/content_19.html": "Save our local fire services:\ntell the East Sussex Fire Authority not to downgrade our local Fire Station\nPlans have been proposed to downgrade The Ridge Fire Station. Local Fire Fighters fear that the residents of Hastings, Rye and surrounding villages including Fairlight, Guestling, Pett, Pett Level, Icklesham , Camber, Iden and Peasmarsh would face a long wait to be rescued overnight.\nIn many cases, more than one fire engine is required on the scene to mount a rescue or response. Downgrading The Ridge Fire Station could drastically increase the time it takes for sufficient fire crews to be in place to significantly make a difference, especially in the more rural areas.\nThese cuts come at a time when the demand on our fire service is increasing, with our community seeing more extreme weather events such as the recent flooding and Old Town fire, Storm Eunice, and last July’s extreme heat bringing the risk of wildfires. Join our campaign to oppose this downgrading of our local fire service.",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_ambulancepetition/content_12.html": "top of page\nSign my petition on ambulance waiting times\nWe are asking you to join our petition to ensure that people in Hastings and Rye can get an ambulance within the target times, and to make sure our South East Coast Ambulance Service, and our brilliant hardworking NHS staff have the resources to serve our area to the highest standards.\nbottom of page",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_southernwater/content_15.html": "top of page\nTell Southern Water: support local businesses and residents NOW\nThis year we have seen the taps running dry for 5 days in Hastings (May 2024) and Rye (Sept 2023), major flooding in Hastings town centre, and sewage flooding in St Leonards. For many small businesses and residents these incidents have caused severe financial strain.\nAs the Labour government implements major measures to review the water industry, I am calling on Southern Water to fairly compensate residents and small businesses in Hastings, Rye and the villages beyond the Ofwat legal minimums for the disruption and lost earnings they have caused.\nbottom of page",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_test-our-bathing-water/content_8.html": "top of page\nTell the Environment Agency to test our bathing water all year round!\nThe Labour government has announced plans to test our seawater all year round!\nWe know that water companies pump sewage into the sea around Hastings, Rye and the villages 🤮\nCurrently, the Environment Agency test the water during the bathing season from May - September, with local volunteers picking up this work during the rest of the year.\nThis announcement would mean that more people in Hastings, Rye and the villages could enjoy our beaches and rivers.\nComplete the form below to sign Helena's submission to support this measure 👇\nbottom of page",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_ticketoffices/content_4.html": "Save our local station ticket offices:\nsign my petition to Southern Rail and Southeastern\nOn the 5th July, the Rail Delivery Group confirmed plans to move staff out of ticket offices and into stations, with the consultation on these significant changes to last just 21 days. Many of you have raised concerns with including a number of elderly and disabled people living in Hastings and Rye who rely on train travel. Sign my petition calling on our local train operators to think again and offer assurances for elderly and disabled rail users.\nConsultation extended - hurry - you only have till 31st August!\nOne in nine tickets are still sold at physical ticket offices . Given the fact that many of those passengers relying on ticket offices will be elderly and disabled rail users that may otherwise struggle to use digital alternatives, it is vital that you offer assurances that those rail users will still have access to the support they need to use our rail network with confidence. Research by the RNIB has found that only 3% of people with sight loss said they could use a ticket vending machine without problems and 58% said it was impossible .",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_profile_1066helena_profile/content_18.html": "top of page\nProfile\nJoin date: Jan 24, 2022\nPosts (26)\nFeb 24, 2025 ∙ 2 min\nNo to Conservative Cuts!\nThis week, Conservative-run East Sussex County Council have decided to proceed with their huge cuts to Adult Social Care and Health...\n155\n0\nFeb 7, 2025 ∙ 1 min\nSouthern Water to compensate Hastings residents\nI promised that if I was elected, I would fight every day to hold Southern Water to account. Last year they left 30,000 people in...\n291\n0\nJan 24, 2025 ∙ 2 min\nA green light to fix our potholes\nDid you know there are 100 times more potholes on UK roads than craters on the moon? That’s the situation after 14 years of Conservative...\n94\n0\n1066helena\nAdmin\nMore actions\nbottom of page",
  "https_www_helenadollimore_com/https_www_helenadollimore_com/content_1.html": "About Helena\nHelena is the Labour and Co-operative MP for Hastings and Rye. She was born and bred in East Sussex, attended local state schools and spent her lockdown as a volunteer vaccinator in Hastings supporting the roll out of the Covid-19 vaccine.\nHelena has a professional background in international development. Her work at Save the Children took her from refugee camps in Bangladesh to war zones like Yemen, where she stood up for the world’s most vulnerable children. Now she is using that experience to stand up for Hastings and Rye, campaigning on issues like long ambulance waits and ending the dumping of sewage in our sea. As the Labour MP for Hastings and Rye, Helena will fight for every resident of Hastings and Rye at Westminster to deliver a fairer, greener future for all.",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_account_settings/content_22.html": null,
  "https_www_helenadollimore_com/http_www_helenadollimore_com_donate/content_9.html": "top of page\nDonations\nDonations to a political party are regulated by the Political Parties Elections and Referendums Act 2000.\nThis donation facility is provided for individuals to make donations to the Labour Party. UK companies, Limited Liability Partnerships, Trade Unions and Unincorporated Associations may also make donations to the Labour Party.\n- Donors giving more than £500 must be on a UK electoral register (we will check before accepting a donation).\n- For donors giving more than £1,500 to a Constituency Labour Party or the Scottish Labour Party, or more than £7,500 to the national Labour Party (including the English Regions and Wales) in a calendar year, their name and the value of the donation will be sent to the Electoral Commission which will publish details on its website. The donor’s address will not be made public.\n- Donations must be from the donor’s own funds and may not be passed on from a third party. It is an offence not to reveal the true source of a donation.\n- Donations to political parties are not tax-deductible.\nbottom of page",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_empty-lots/content_5.html": "top of page\nTell me about empty shops in Hastings, Rye and the villages\nThe sight of boarded-up shops has become all too familiar in our town centres.\nThis week, the new Labour government have given councils new powers to fill empty shops. This will bring business back to the high street, as well as helping give charities and community organisations a boost through greater footfall.\nI know of several sites across Hastings, Rye and the villages that I will be referring for these auctions. If you know of any shops that have been sitting empty for more than a year, make sure to refer them to me below.\nbottom of page",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_post_no-to-conservative-cuts/content_7.html": "No to Conservative Cuts!\n- 1066helena\n- Feb 24\n- 2 min read\nThis week, Conservative-run East Sussex County Council have decided to proceed with their huge cuts to Adult Social Care and Health services, including supported accommodation, support services for young people, and mental health services for older people in the community.\nI am strongly opposed to this decision and have expressed my objections to it at every stage of the consultation process, as have Labour county councillors, people who rely on these services, staff and their families.\nThese cuts are wrong-headed at a time when the Labour Government’s Budget saw the first real terms increase in funding to local government since the Conservatives began their agenda of cuts 14 years ago.\nNational Social Care funding from the Government will rise by at least £600m in the 2025 to 26 period, and ESCC could be entitled up to £13m additional funding overall.\nOther benefits from the Budget include the national £86m increase to the Disabled Facilities Grant and, also, Carer’s Allowance weekly earnings limit will be increased from £151 a week to the equivalent of 16 hours at the National Living Wage - £183.04 - to help unpaid carers.\nThe proposed cuts are therefore unnecessary, at a time when funding is at its highest rate in 14 years, and the demand for adult social care is higher than ever.\nMany of the organisations affected by these cuts have written to me, as have their staff and users. All are deeply concerned about the effect that cuts to the services’ funding will have on the levels of support they can provide. Limiting these services would undoubtedly lead to an increase in people facing poverty, addiction, and homelessness, which in turn will increase the demands on ESCC’s other support services.\nNot only will these cuts devastate our communities by exacerbating deprivation, but they would also see an increased cost to the public purse, as Hastings Borough Council, Rother District Council and the NHS would be left to pick up the pieces and fund these services out of their own budgets.\nIn other words, these cuts would increase the costs borne by taxpayers in East Sussex.\n“These cuts would have a real impact on communities such as ours in Hastings, and we Labour County Councillors will try to protect these services, but we know that the Conservative Party control the County Council and hope that they now listen to the concerns that so many have expressed,” County Councillor Godfrey Daniel said.\nI, along with Labour county councillors will continue to keep the pressure on Conservative-run East Sussex County Council, and hold them to account for these devastating cuts.",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_post_six-months-of-change-a-look-back-on-2024/content_21.html": "Six Months of Change: A look back on 2024\n- 1066helena\n- Jan 1\n- 2 min read\nThe New Year brings with it a chance to look back on the year gone by, and what a year it has been!\nLast week marked six months since my election as your MP for Hastings, Rye and the villages. It has been six months marked by huge milestones and positive steps forward, and a fair share of challenges along the way.\nI got to work straight after being elected, delivering my first speech in Parliament at the end of July to highlight some of the best things about Hastings, Rye and the villages – but also the big issues we need to tackle, from Southern Water to Southern Housing.\nAnd in the past six months, I have been tackling them head-on.\nOne of the first bills passed by the new Labour Government took action to clean up the water industry.\nI have been shouting about Hastings, Rye and the villages in every stage of this bill, to make sure our experiences with Southern Water cannot be repeated. Our area took centre stage in the debate on this bill in Parliament, with the Secretary of State for the Environment, Food and Rural Affairs, Steve Reed MP, mentioning his formative experiences of speaking to local residents about water outages.\nAs for Southern Housing, I have met with their CEO several times since being elected and have urged them to move faster, do more and communicate better with my constituents. There has been much talk, but I am pushing Southern Housing into action.\nBetter legal rights for tenants are on their way. The Labour Government has wasted no time introducing the Renters’ Rights Bill to massively expand rights for tenants end the cruel, no-fault Section 21 evictions, which push hundreds of people in our community into homelessness every year.\nI am grateful to everyone who has contacted me since my election to draw my attention to the problems they are facing. It is because of you that I am able to tell Ministers and CEOs your stories and demand better for all.\nMy team and I handle casework related to all sorts of issues that my constituents might be facing. From helping vulnerable adults into sheltered accommodation, to saving a community transport service by writing to the right people in government, to securing a pensioner a payout of £75,000 – it is a large part of my job that largely goes unseen.\nIf you ever need my help, please do not hesitate to get in touch at helen.dollimore.mp@parliament.uk or 01424 424125",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_account_notifications/content_24.html": null,
  "https_www_helenadollimore_com/https_www_helenadollimore_com_hastings-plan-for-neighbourhoods/content_14.html": "top of page\nHow should we spend our £20 million Plan for Neighbourhoods fund to improve Hastings?\nHastings is one of 75 towns to be awarded £20m in funding as part of the Labour Government's Plan for Neighbourhoods. This Labour Government has rightly said that the money should be spend on the priorities of local people, whether that is broken pavements, broken bus shelters, trying to open up important community venues like St Mary in the Castle, fixing up football facilities, or something else.\nWe have seen previous funding schemes sometimes go wrong, such as the money sadly wasted on the short-lived 'family fun factory' Owen's. So this time, I want local people and local businesses to tell us how they think that money could be spent to improve our town. Give me your views and I will take it to the Hastings board.\nbottom of page",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_news/content_2.html": "top of page\nNo to Conservative Cuts!\nThis week, Conservative-run East Sussex County Council have decided to proceed with their huge cuts to Adult Social Care and Health...\nFeb 24\nSouthern Water to compensate Hastings residents\nI promised that if I was elected, I would fight every day to hold Southern Water to account. Last year they left 30,000 people in...\nFeb 7\nA green light to fix our potholes\nDid you know there are 100 times more potholes on UK roads than craters on the moon? That’s the situation after 14 years of Conservative...\nJan 24\nSix Months of Change: A look back on 2024\nThe New Year brings with it a chance to look back on the year gone by, and what a year it has been! Last week marked six months since my...\nJan 1\nbottom of page",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_stateeducationmeeting/content_20.html": "News\nAbout Helena\nCampaigns\nContact\nMore\non Friday 28th March from 6pm - 7.30pm\nSt John's Church Hall, Pevensey Road, St Leonards on Sea, TN38 0LA\nThanks for submitting!",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_post_a-green-light-to-fix-our-potholes/content_10.html": "A green light to fix our potholes\n- 1066helena\n- Jan 24\n- 2 min read\nDid you know there are 100 times more potholes on UK roads than craters on the moon?\nThat’s the situation after 14 years of Conservative decline which has left our roads in a disgraceful state.\nI know that this is a huge problem for all local drivers, so much so that I raised the scale of the problem facing our area in my first ever speech in Parliament.\nPotholes have plagued motorists in Hastings, Rye and the villages for far too long, causing accidents and vehicle damage that can cost hundreds of pounds in repairs.\nThis Labour Government recognises that this situation cannot continue. That is why we are putting our foot on the accelerator on our Plan for Change to invest in our roads by fixing seven million extra potholes each year.\n£21 million is coming to East Sussex to fix potholes, clamp down on disruptive street works, and save drivers hundreds of pounds on repairs.\nBut the Labour Government is making sure that East Sussex County Council spend the money wisely, not just on patch-up jobs.\nThe funding has built-in incentives, with 25% of the money held back until authorities have shown that they are delivering, including taking proactive steps to maintain our roads before potholes start to form.\nThis is a Labour Government that is on the side of drivers.\nAlongside these plans to tackle the pothole plague, we are reversing the Conservatives’ planned rise and freezing fuel duty - saving the average driver £55 next year and tackling out of control car insurance premiums with a new taskforce.\nIt’s time to give the Labour Government’s Plan for Change the green light and get our potholes fixed.",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_post_southern-water-to-compensate-hastings-residents/content_13.html": "Southern Water to compensate Hastings residents\n- 1066helena\n- Feb 7\n- 1 min read\nI promised that if I was elected, I would fight every day to hold Southern Water to account.\nLast year they left 30,000 people in Hastings without water for days on end. I am glad the CEO has finally agreed to pay compensation after I challenged him at the Environment, Food and Rural Affairs Select Committee in Parliament.\nAs you know, up until now customers in Hastings were not given any compensation for the incident during the May bank holiday weekend last year.\nIt is only right that residents in Hastings get the compensation they deserve after what was such a distressing incident for our community.\nI will keep up the pressure on Southern Water to fix their crumbling infrastructure, clean up our sea and guarantee a reliable water supply.\nMost importantly, I have successfully campaigned for the Labour Government to raise the legal amount of compensation that water companies will have to give residents and businesses when water outages happen, and close the loopholes that water companies use to wriggle out of their responsibilities.",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_ubat/content_6.html": "top of page\nGive me your views on UBAT's replacement for our local schools\nThis week, it has been confirmed that UBAT will no longer run our local schools. Please be rest assured that your child will continue to receive their education as normal.\nThere will now be a process to determine who runs our local schools. Whilst I am not the one making the decision, I would like to hear your views on who you would like to take over from UBAT, or who you would not like to take over.\nbottom of page",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_account_my-account/content_23.html": null,
  "https_www_helenadollimore_com/https_www_helenadollimore_com_southernwatercompensation/content_17.html": "Southern Water Compensation: Hastings Water Outage May 2024\nIn February, the CEO of Southern Water finally agreed to pay compensation to people in Hastings, who were left without water for days on end in May 2024 after I challenged him in Parliament.\nIf you lost water for 12+ hours during this outage then your household should be entitled to £50 per 12 hours.\nSouthern Water is going to be writing to everyone who they believe is eligible for compensation. If you don’t hear from them by 22nd March 2025 (letters may take time to arrive in post) then please contact Southern Water at: customeraccounts@southernwater.co.uk to question this.\nAs your MP I will take up your case if you lost water for 12+ hours and aren’t getting compensation from them, or aren’t getting the £50 per 12 hours. If you think you are not getting the compensation you are eligible for, please get in contact with me by filling out the form below.",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_queensway-gateway/content_11.html": "top of page\nTell East Sussex County Council: SORT IT OUT!\nQueensway Gateway Roadworks\nEveryone in Hastings knows how important it is to complete the works on the A21 Sedlescombe Road North, at Queensway Gateway.\nHowever, the roadworks continue to cause major disruption, while the council keep pushing back the finish date.\nI wrote to East Sussex County Council a month ago, and still have not had a response.\nComplete the form below to tell the ESCC that enough is enough 👇\nbottom of page",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_savesilverdalepool/content_3.html": "Save Silverdale School Pool: Sign The Petition!\nChildren and parents at Silverdale Primary Academy recently learned of the shocking closure of the Silverdale Primary swimming pool. Headteacher Mr Morris wrote to parents on the 17 October citing rising energy bills and maintenance costs: “Unfortunately, despite our best efforts, we have reached a point where we must make the heart-wrenching decision to commence the necessary process to permanently close the swimming pool.”\nHelena Dollimore, Labour’s MP candidate for Hastings and Rye, met with parents and children concerned about the loss of a vital service the pool provides for local children. Helena said: “The closure of Silverdale School pool is such a loss for children. Learning to swim can't become an unaffordable luxury in a coastal community like ours.\nIt is something every child should have access to. When Rye Pool closed its doors last Autumn in response to rising energy bills, we launched a campaign with the local community and saved the pool from closing.\nThat is why I am working with local parents to launch this petition to show the strength of feeling in our community, and urging our Conservative MP to look at how the Government can help schools like Silverdale with spiralling pool energy costs. I urge all local families and residents to sign it to show their support.",
  "https_www_helenadollimore_com/https_www_helenadollimore_com_driving-tests/content_16.html": "top of page\nAvailability of driving tests in Hastings and Rye\nAfter 14 years mismanagement, the waitlist for driving tests in Hastings and Rye is far too long. The Labour Government has rightly introduced thousands of extra tests each month to cut waiting times. I want Hastings and Rye to be the first to benefit.\nSign my petition to deliver extra tests and cut waiting times in Hastings and Rye.\nbottom of page"
}