{
  "https_scottishfamily_org_/https_scottishfamily_org/content_1.html": "Our unique policies support parents and family life. Strong families are the foundation of a strong nation. Family breakdown is a factor in countless problems. It's inevitable that some relationships don't work out, but our policies would promote stable family life.\nSNP, Labour, Conservative, Lib Dem, Green, Alba and Reform maintain the legal fiction that a man can become a woman. We would pull up trans ideology by the roots by repealing the 2004 Gender Recognition Act.\nMany Scots are afraid to express perfectly reasonable opinions. We would restore genuine freedom of speech in law, professional life and online.\nWe face serious challenges. Sound bites won’t do. Tough decisions must be made. Safety, prosperity and energy security in the long term must be prioritised.\nInstead of imposing ever more restrictions and costs on businesses, we need to create a positive environment for wealth creation. We all benefit from a strong economy.\nSNP, Labour, Conservative, Lib Dem, Green, Alba and Reform have one thing in common: they all endorse the killing of unborn children. None of them oppose assisted suicide. We are pro-life.\nOur nation is being divided between competing racial, religious, sex and sexuality identity groups: we would aim to bring unity and common purpose.\nDo explore our full policies and see how they would help create a prosperous and flourishing society for all, founded on timeless principles.\nYou may want to try out our GPT policy assistant: AI policy assistant\n(this should be available for free, but one user has reported being asked to upgrade to a paid plan)\nYou can help us get the word out and turn around Scotland.",
  "https_scottishfamily_org_/https_scottishfamily_org_get-involved/content_2.html": "The Scottish Family Party is breaking the silence. We know there are many that agree with us. For example we commissioned ComRes to do a poll about the government's school sex education material, as few as 28% of people thought the material was age appropriate. However no one in parliament objected and the media shows no interest. If you would like to make a difference, you need to break the silence with the people you know and the skills you have.\nTo make this easier The Scottish Family Party produces its own media. It helps you argue for the things you believe in, with the facts and figures to back you up. We place it on social media platforms like Youtube, Facebook, Twitter and Instagram. One way you can help us is by:\nHowever increasingly these platforms are diverting traffic away from socially conservative content. So it is important to share links to videos via email, Whats App, Telegram etc. or by personally showing content to people you know and not just rely on liking.\nMany who express traditional family values are being banned from social media platforms. We do not know if and when this will happen to us. If you support us please sign up to our newsletter. In the event we get deplatformed we want to be able to let you know where to find us.\nWe may organise door to door canvassing, conventions, protests, petitions or social events and we would like to let you know when these are happening.\nMembership is £4 a month. In this campaign each £4 put a leaflet through over 500 doors. For some this is a stretch. We hope that many will choose to make a more substantial monthly donation. Before this campaign began just under 10% of people in Scotland had heard of us. Our supporters gave us enough to put a leaflet through every door in Scotland. Further money we receive before the election will go on social media advertising. If you would like to put you money where your mouth is:\nAssociate membership is available for those who are already members of other political parties. In Scotland, you get two votes, so being a member of two parties is not unreasonable. Associate membership is the same as standard membership except that associate members can’t hold offices in the SFP or stand for election as an SFP candidate.\nYou can also become a non-member regular donor or make a one-off donation.\nYou could also get involved by going along to local branch meetings and other events that we stage, helping with campaigning, and maybe even standing for election (we will support you with adequate training).\nDrop us an email: contact@scottishfamily.org\nWrite to us:\nScottish Family Party\n272 Bath Street\nGlasgow,\nG2 4JR\nFollow us on Facebook and Twitter to find out more.",
  "https_scottishfamily_org_/https_scottishfamily_org_downloads/content_3.html": "Promoting traditional values A4 Poster\nPrint and place in your window\nOur policies stand distinct from other parties, we invite you to review the substantial evidence that supports them.\nA4 folded leaflet\nA4 folded leaflet\nA4 folded leaflet\nA4 folded leaflet\nA4 folded leaflet\nA4 folded leaflet\nA4 folded leaflet\nBook",
  "https_scottishfamily_org_/https_scottishfamily_org_privacy-policy/content_4.html": "Scottish Family Party (“Scottish Family Party”) operates scottishfamily.org and may operate other websites. It is Scottish Family Parties’ policy to respect your privacy regarding any information we may collect while operating our websites.\nWebsite Visitors\nLike most website operators, Scottish Family Party collects non-personally-identifying information\nof the sort that web browsers and servers typically make available, such as the browser type,\nlanguage preference, referring site, and the date and time of each visitor request. Scottish\nFamily Parties’ purpose in collecting non-personally identifying information is to better understand\nhow Scottish Family Parties’ visitors use its website. From time to time, Scottish Family Party\nmay release non-personally-identifying information in the aggregate, e.g., by publishing a report\non trends in the usage of its website.\nGathering of Personally-Identifying Information\nCertain visitors to Scottish Family Parties’ websites choose to interact with Scottish Family\nParty in ways that require Scottish Family Party to gather personally-identifying information.\nThe amount and type of information that Scottish Family Party gathers depends on the nature of\nthe interaction. Those who engage in transactions with Scottish Family Party are asked to provide\nadditional information, including as necessary the personal and financial information required\nto process those transactions. In each case, Scottish Family Party collects such information\nonly insofar as is necessary or appropriate to fulfil the purpose of the visitor’s interaction\nwith Scottish Family Party. Scottish Family Party does not disclose personally-identifying information\nother than as described below. And visitors can always refuse to supply personally-identifying\ninformation, with the caveat that it may prevent them from engaging in certain website-related\nactivities.\nAggregated Statistics\nScottish Family Party may collect statistics about the behaviour of visitors to its websites.\nScottish Family Party may display this information publicly or provide it to others. However,\nScottish Family Party does not disclose personally-identifying information other than as described\nbelow.\nProtection of Certain Personally-Identifying Information\nScottish Family Party discloses potentially personally-identifying and personally-identifying\ninformation only to those of its employees, contractors and affiliated organisations that (i)\nneed to know that information in order to process it on Scottish Family Parties’ behalf or to\nprovide services available at Scottish Family Parties’ websites, and (ii) that have agreed not\nto disclose it to others. Some of those employees, contractors and affiliated organisations may\nbe located outside of your home country; by using Scottish Family Parties’ websites, you consent\nto the transfer of such information to them. Scottish Family Party will not rent or sell potentially\npersonally-identifying and personally-identifying information to anyone. Other than to its employees,\ncontractors and affiliated organisations, as described above, Scottish Family Party discloses\npotentially personally-identifying and personally-identifying information only in response to\na subpoena, court order or other governmental request, or when Scottish Family Party believes\nin good faith that disclosure is reasonably necessary to protect the property or rights of Scottish\nFamily Party, third parties or the public at large. If you send us a request (for example via\nemail or via one of our feedback mechanisms), we reserve the right to publish it in order to\nhelp us clarify or respond to your request or to help us support other users. Scottish Family\nParty takes all measures reasonably necessary to protect against the unauthorised access, use,\nalteration or destruction of potentially personally-identifying and personally-identifying information.\nCookies\nA cookie is a string of information that a website stores on a visitor’s computer, and that the\nvisitor’s browser provides to the website each time the visitor returns. Scottish Family Party\nuses cookies to help Scottish Family Party identify and track visitors, their usage of Scottish\nFamily Party website, and their website access preferences. Scottish Family Party visitors who\ndo not wish to have cookies placed on their computers should set their browsers to refuse cookies\nbefore using Scottish Family Parties’ websites, with the drawback that certain features of Scottish\nFamily Parties’ websites may not function properly without the aid of cookies.\nPrivacy Policy Changes\nAlthough most changes are likely to be minor, Scottish Family Party may change its Privacy Policy\nfrom time to time, and in Scottish Family Parties’ sole discretion. Scottish Family Party encourages\nvisitors to frequently check this page for any changes to its Privacy Policy. Your continued\nuse of this site after any change in this Privacy Policy will constitute your acceptance of such\nchange.\nOther Privacy Policies\nscottishfamily.org is hosted by SiteGround. Please see their privacy policy\nhere.\nWe use a membership site PaySubsOnline. Please see their data protection statement here. We use PayPal and GoCardless for taking donations and membership fees. Please see their respective Privacy Policies here and here. We use Facebook and Twitter. Please see their respective Privacy Policies here and here."
}