{
  "http_markweston_org_uk_/http_markweston_org_uk_campaigns_working-community-groups/content_12.html": "As your local Councillor I am always available to help community groups make our neighbourhoods a better place for everyone. In particular I have:\n- Supported Parks groups protect and improve our parks and green spaces.\n- Worked with local sports groups such as Henbury Football Club or the Riding School as they work with youngsters from across Henbury & Brentry.\n- Helped our local Scout Troops with funding and improvements so that they can continue to provide the opportunities to explore that many of us treasure from our youth.\n- Led the campaign to secure the Community Centre. I wrote the bid, argued our case and remain a trustee of the organisation.\n- Supported the BS10 Parks & Planning Group as we keep an eye on developments that would impact on our area and ensure that residents are notified of impending problems.\nI believe that our community has much to offer residents and is a great example of residents coming together to make things better. I will always support community groups in any way I can.",
  "http_markweston_org_uk_/http_markweston_org_uk_about-rss/content_23.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_markweston_org_uk_/http_markweston_org_uk_news_category_Articles/content_13.html": "NUMBER 2 BUS CONSULTATION - RESPONSE FROM FIRST BUS 2nd July 2019 As residents will know First Bus ran a consultation on proposed changes to the No.2 bus route. On the whole the proposed changes have been rejected but there is... Articles\nNEW RAIL AMBITIONS = NEW STATIONS – LETS DELIVER FOR HORFIELD 14th December 2018 Bristol’s congestion problems can be eased with an ambitious rail strategy including a series of new stations across the City such as in Horfield. The West of... Articles\nCOUNCIL'S ATTITUDE TO THE ASHTON COURT MODEL RAILWAY JUST SEEMS PETTY 13th December 2018 On Tuesday afternoon I took the opportunity to question the Mayor on the future of the miniature railway at Ashton Court. The future of their lease is currently... Articles\nSAVE STOKE LODGE 11th December 2018 For those who don’t know, Stoke Lodge is a site in Stoke Bishop owned by the Council comprising Stoke Lodge House (which runs adult learning courses), a... Articles\nSUPPORT NEEDED FOR NORTH BRISTOL HIGH STREETS 28th November 2018 Councillor Geoff Gollop and I recently took Regional Mayor Tim Bowles around one of the city’s declining shopping centres, Westbury Village. Last month, the... Articles",
  "http_markweston_org_uk_/http_markweston_org_uk_campaigns_delivering-value-money-taxpayers/content_10.html": "I believe that the Council has an obligation to spend the money it has wisely. This is especially true when resources are scarce. I do not support squandering money on vanity projects such as a Bristol Underground (which with a price tag of £4.5bn will never be achieved), payoffs for ex senior executives, hiking the cost of the Mayor’s office or communications team and pouring tens of millions of pounds into an ailing energy company.\nI believe that money should be focused on the front line providing valuable services to residents. All too often we have to campaign to protect local amenities facing the chop whilst money is being frittered away on daft ideas.\nI will always argue that the Council should provide value for money for local taxpayers.",
  "http_markweston_org_uk_/http_markweston_org_uk_accessibility/content_2.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_markweston_org_uk_/http_markweston_org_uk_contact/content_20.html": "Skip to main content\nMark Weston\nfor Henbury & Brentry\nMain navigation\nHome\nAbout Mark Weston\nNews\nCampaigns\nRail Update\nBristol Conservatives\nCommunity Council\nContact\nContact\nLeave this field blank\nMark Weston\n21 Brentry Lane, Bristol, BS10 6QA\n07709 421 667\n[email protected]\nFind Mark on Facebook\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "http_markweston_org_uk_/http_markweston_org_uk_news_conservatives-set-out-alternatives-mayors-budget/content_36.html": "Next week see the Council debate the City budget for another year. This year that debate will be a little different in that we don’t be in the chamber but that doesn’t make the stakes any less important.\nMy colleagues and I are concerned about numerous parts of the Labour Mayors budget and believe that the is a lot of room for improvement. As such we will be tabling our amendments to reflect our own ‘common sense’ spending principles and priorities.\nWe want to make savings by cutting the size of the Mayor’s Office and Corporate Communications teams (which together have grown by 12 full-time staff over the last twelve months). Additional savings have been found from reduced borrowing as a result of delays in building projects.\nInstead, we propose that this money should be spent on:\n- extra support for special educational needs,\n- pay for a reduction in the charge to collect household bulky waste items,\n- the removal of parking charges at the Blaise Estate and Oldbury Court,\n- fund an education programme on the use of life-saving equipment (defibrillators).\nIn addition we want to make changes to the City’s capital reserves by 6m. This would free up money to be spent on:\n- providing new outdoor play equipment,\n- helping restore our parks after the heavy use they have endured during lockdowns\n- mitigating the impact of the CPNN in the north of Bristol,\n- investing in youth provision\n- creating a new (pre-fabricated) housing scheme.\nThis year’s budget deliberations are taking place against the extremely challenging economic, health and social background created by the health crisis. Central Government has provided unprecedented support but none-of-us can yet predict how events and the recovery will yet pan out.\nWe are suggesting changes that can make a practical and tangible difference to people’s lives, for example greater support for parks and play equipment, than money spent on more bureaucracy and political advertising.\nI look forward to making the case for these common-sense preferences and am confident they will resonate with local taxpayers.",
  "http_markweston_org_uk_/http_markweston_org_uk_privacy/content_6.html": "This document outlines how Mark Weston processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Mark Weston\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Mark Weston.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Mark Weston, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Mark Weston via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_markweston_org_uk_/http_markweston_org_uk_events_feed/content_30.html": null,
  "http_markweston_org_uk_/http_markweston_org_uk_invest-rail-cut-congestion/content_14.html": "In order to cut congestion in Bristol we need to improve public transport and reduce commuter traffic on our roads.\nFor too long Bristol has ignored its railway lines. The Mayor may talk about his passion for an Underground but at £4bn it simply isn’t feasible. We need to be doing more to take advantage of the large amount of existing ‘over\nground’ track.\nThe Henbury Line is due to reopen in 2023 – this is good news but more needs to be done.\nI want us to look again at reopening the full Henbury Loop complete with new stations at Horfield and Chittening. If we can connect the primary employment areas of Temple Meads, the Avonmouth Industrial Area and the\nmanufacturing centres at Filton on the one loop line then it is a game changer in our efforts to tackle congestion.\nThe Government has already given additional funding to the region to help deliver on our rail ambitions. I want to work with the Regional Mayor, City Council and the Government to take this even further.\nEvery commuter using rail is one less car using the roads!\nSo what is happening on Rail right now:-\nThere is quite a bit happening with rail which is great – but rail improvements seem to take forever – which is less good.\nSo essentially the regions rail plans fall into two parts – labelled (imaginatively) MetroWest Phase 1 and 2.\nTo be honest here we are most worried about phase two as that is the one that deals with the Henbury Line. MetroWest Phase 2 proposes new stations at Ashley Down, North Filton and Henbury, with an additional half hourly service to Yate (and possibly an extension up to Gloucester) connecting into Temple Meads in the City Centre. It is currently moving through the design and engineering phases.\nThis Temple Meads to Henbury Line is known as the Henbury Spur. Some of us though have been pushing for what is called of the Henbury Loop. If/when this gets approved then the line would run Temple Meads – Henbury – Avonmouth – Clifton – Temple Meads. Hence its name – ‘Henbury Loop’.\nAs part of the Henbury Spur programme there was a consultation on whether the station should be at the old station on Station Road or a new location on the Brentry side of the A4018. In the end it was 49% in favour of the old station and 48% in favour of the Brentry base. With things so evenly balanced it became a case of which would be cheaper. Several factors fed into this one including how many bridges the trains have to pass under, the amount of signalling required and also the fact the old station had been sold off by Network Rail in 2011. This resulted in the Brentry location getting selected (even though they need to sort out the problem that the ground gets very wet there).\nThe development work to date has confirmed the location of Henbury station and Network Rail have developed the outline designs.\nThe next stage of the project is to develop the documentation to submit the planning application. As the station is located in a Flood Zone, the Combined Authority is liaising with the Environment Agency, South Gloucestershire Council and the housing developer, Persimmon, to confirm the requirements for managing the flood risk and flood plain compensation. This involves reviewing the Persimmon plans against our station plans and may require some design rework. This needs to be undertaken prior to submission of the planning application to ensure that the application is of the highest quality.\nThe intention was to submit the planning application in the first quarter of 2021. We are working with the consultant team to address the flooding issues and submit as soon as possible. The priority will be to submit an application that meets the Environment Agency’s requirements.\nFollowing the planning submission, Network Rail will procure a contractor for the design work. We are working towards a late 2023 opening date depending on resolution of the flooding issues and the ongoing impact of the pandemic. This has slipped slightly from the original schedule.\nIn terms of pedestrian and cycling access, a new cycling and walking link is proposed directly from Wyck Beck Road along the Persimmon access route to the station (constructed by Persimmon), with links onwards to the proposed housing development.\nIn addition, as part of the options assessment we are looking at options for a pedestrian and cycle footbridge that would shorten the distance between the A4018 and the station. The footbridge is currently outside the project scope and would require additional funding but could be considered in future.\nSo to summarise the station and line will open, but a little later than planned, and once it is then let's go whole hog and complete the full Henbury Loop!\nSo that’s a very quick update on the Henbury Line – if however, you are a complete rail geek like me then below is what else is happening regarding rail in the Bristol area:\nMetroWest Phase 1, which includes the Portishead line and enhanced services on the Severn Beach and Bristol Bath lines, is still being designed. The West of England Combined Authority (WECA) commissioned a study looking in detail at the engineering and signalling requirements for the project. It highlighted a number of challenges which took a while to investigate fully, such as the works required to the track along the Avon Gorge to enable the required line speed, and the signal work required where the Portishead spur joins the main line. The result of this is that the costs for the Portishead element of the MetroWest Phase One went through the roof, although the other two elements (a better service on the Severn Beach Line and improvements to the Bath to Bristol Line) were fine.\nThe results of this study obviously impacted on the overall scheme as it essentially left it with a multi-million-pound shortfall. In the end the Department for Transport stepped in and agreed to bridge the gap so this too is pressing forward.\nSeparately to the core MetroWest phases, the Authority has been developing a brief for a ‘MetroWest Enhancements’ study, to investigate further potential enhancements such as improved frequencies, new route opportunities and the potential for new stations. As part of this the Joint Transport Strategy includes provision for a new Station at Horfield serving the communities of North Bristol and a recently announced study to reopen the old St Anne’s Station in Brislington.",
  "http_markweston_org_uk_/http_markweston_org_uk_news/content_27.html": "Statement submitted against A4018 Bus Lanes Sunday, 20 October, 2024 Statement from Councillors Mark Weston & Bador Uddin We wish to put on record our objections to the short-sighted misery that you are going to inflict on the residents of north Bristol. Soon this Council will begin it's A4018 Improvement Scheme on Passage Road. A two year construction project that will deliver little other than road rage. This will include a new crossing over the busy road and a... Local News\nOBJECTION LODGED AGAINST YET MORE HOUSES ON FILTON AIRFIELD 27th February 2023 Chris and Mark have now tabled their letter of opposition to the massive increase in housing being proposed on the Filton Airfield site with the housing total... Local News\nBUS LANES ON THE A4018 10th October 2022 As you will know the Council is proposing to put bus lanes on the dual carriageway between the Crow Lane roundabout and the top of Brentry Lane. I have... Local News\nFINAL PLANS SUBMITTED FOR CHARLTON COMMON 14th June 2022 After quite a delay Redrow Homes have now published plans for what they intend to do with the Common. The common is actually in two sections - the majority to... Local News\nYET MORE HOUSING BEING CONSIDERED 24th May 2022 We don’t think anyone will be surprised to know that housing is planned for just over the South Glos border. In total 5700 homes were planned for the Cribbs... Local News\nNumber 2 Bus Route 'Upgrades' - A mixed bag at best 28th January 2022 Just before Christmas the Mayor began a consultation on proposals to 'upgrade' the Number 2 bus route that dissects the City. As you would imagine this has... Local News\nCONSERVATIVES LAUNCH MANIFESTO FOR BRISTOL 20th April 2021 This years elections provide an opportunity for change in Bristol. The last year has been challenging and life has been harder than any of us thought it would... Local News\nWhat is happening with Charlton Common 21st February 2021 There have been a few comments about Charlton Common being built on at the top of Brentry. This isn’t quite right but I wanted to explain what is happening... Local News\nThe South Glos Housing Development (CPNN) 19th February 2021 There has been a lot of discussion in recent days on a whole host of issues. One of the big ones proved to be about what is happening in South Gloucestershire... Local News\nCONSERVATIVES SET-OUT ALTERNATIVES TO MAYOR’S BUDGET! 18th February 2021 Next week see the Council debate the City budget for another year. This year that debate will be a little different in that we don’t be in the chamber but that... Local News",
  "http_markweston_org_uk_/http_markweston_org_uk_news_new-rail-ambitions-new-stations-lets-deliver-horfield/content_31.html": "Bristol’s congestion problems can be eased with an ambitious rail strategy including a series of new stations across the City such as in Horfield.\nThe West of England Combined Authority (WECA) already has plans to improve services along the Severn Beach Line, on the Bath-Bristol Line and to re-open the Henbury Line in 2021 – but by working together as a region, we can be more ambitious.\nI want to see us maximise the use of our suburban rail lines around Bristol. We need a non-road based transport solution and opening up additional stations like one for Horfield would get commuters off the roads and onto rails.\nWe need to be thinking about the next phase of Bristol’s rail improvements. I want to see a re-opened Henbury Loop with new stations to serve it. An underground isn’t remotely feasible but developing our existing infrastructure is.\nLet’s bring forward new stations at Horfield & St Annes in Brislington – all of which I know we are already considering, but let’s look further.\nWe have so much rail potential. Let’s deliver the Henbury Line, deliver a Horfield station and look outward for further rail opportunities.\nIn an effort to stress these options I took the Regional Mayor, Tim Bowles, to North Bristol to see for himself. After which he said: “I am committed to improve our transport network and thanks to devolution, we are being more ambitious about our plans with the support of the Secretary of State. I’ve lived here for over 30 years and we’ve always had congestion – it won’t be solved overnight but by working together as a region, looking at all the options available to us, we can take the steps needed to tackle it. We are exploring innovative light rail options in the region and I hope it will open up further opportunities to re-connect more communities to our railways.”",
  "http_markweston_org_uk_/http_markweston_org_uk_news_number-2-bus-route-upgrades-mixed-bag-best/content_9.html": "Just before Christmas the Mayor began a consultation on proposals to 'upgrade' the Number 2 bus route that dissects the City.\nAs you would imagine this has proven to be a very mixed bag. Some elements are indeed welcome - such as the introduction of the mini-roundabout at the junction of Henbury Road and Crow Lane. This has been a pinch point traffic wise for years now and has been a long term aspiration for the community for years.\nSadly the few good elements are very much outweighed by the misguided and downright foolish ideas that were also being proposed. Such as closing Park Street, installing short bus lanes that will do nothing, narrowing roads (reducing Southmead road from 4 lanes to 2) - the list goes on.\nThere are genuine chances to improve traffic flow in North Bristol - that will benefit both cars and buses - but this grab bag of suggestions will do very little to help. It doesn't help anyone if the improvements increase congestion to the point that the buses are caught in the artificially created traffic jams.\nOn behalf of the Conservative Group I have formally responded hoping that many of the short sighted proposals will be abandoned and that common sense will prevail.\nTo see the formal response please click below.",
  "http_markweston_org_uk_/http_markweston_org_uk_news_support-needed-north-bristol-high-streets/content_35.html": "Councillor Geoff Gollop and I recently took Regional Mayor Tim Bowles around one of the city’s declining shopping centres, Westbury Village.\nLast month, the Westbury-on-Trym Business Association (WOTBA) held a meeting with local people to air concerns over the loss of at least ten businesses in the area and to get backing for a regeneration plan.\nWe used the visit by the Regional Mayor as an opportunity to highlight a crisis affecting even relatively prosperous locations caused by changing shopping habits, high rents and rates.\nA number of initiatives have recently been announced, including the Chancellor’s planned 2% digital or online transaction tax; £900m in business rates relief for small independent traders (which will see these costs reduced by one third for two years); and a £675m package to create a ‘Future High Streets Fund’ and Taskforce.\nIn addition, the West of England Combined Authority (WECA) is allocating £10m towards a ‘Love Our High Streets’ project to fund three pilots across the region (Bedminster East Street having now been chosen for the Bristol trial) to explore ways of dealing with a calamity in bricks-and-mortar retailing that, nationally, is already seeing 16 shops per day close.\nBristol Conservatives have been making the case for major investment to revive our satellite or secondary shopping centres for quite some time now.\nThe Chancellor’s £1.5bn package of measures based around cutting business rates and regeneration funding, together with the WECA scheme, is very welcome and we hope will make a difference in transforming threatened local precincts and community focal points.\nIt is vital that a programme of support is rolled out to other parts of Bristol equally under stress like Westbury Village, Crow Lane in my ward, as well as important traditional shopping destinations such as Shirehampton and Arneside Road (Southmead).\nThis is something that I would urge the Labour Mayor to really get behind in the weeks and months ahead.\nI know that my colleagues agree.\nCllr Gollop (Westbury-on-Trym & Henleaze) added: “It is clear from the number of empty properties in our local village that nowhere is immune to the seismic shift currently underway in the high street.\n“Whilst this evolutionary process is perhaps unstoppable, politicians can take steps through capital expenditure and business rate reliefs to try to control the speed and future shape of this transformation.\n“I believe it is a challenge which is now beginning to be seriously addresses at both a national and regional level.”\nRegional Mayor Tim Bowles commented: “Our high streets are having a tough time as shopping online becomes increasingly popular. The West of England Combined Authority’s Love our High Streets project involves working with our councils and communities to explore how we can get the funding, expertise and support to revive our town centres. The future of our high streets isn’t just about shops, it’s about our businesses, activities, services and homes. We must work together as a region to embrace the future of our high streets in the digital age.”",
  "http_markweston_org_uk_/http_markweston_org_uk_savestokelodge/content_34.html": "For those who don’t know, Stoke Lodge is a site in Stoke Bishop owned by the Council comprising Stoke Lodge House (which runs adult learning courses), a children’s play area and open green space of c26 acres used by residents for decades for walking, informal sport, exercising dogs, and general recreation. The main house and the walls, which wrap around the site, are both Grade 2 listed and so have planning protections.\nAt the moment there is a battle raging between the local community and Cotham School. The School is trying enclose the grounds with a 1.5km long, 2m high fence (paid for by you the taxpayer via a Dept of Education grant!) in order to ‘safeguard’ their pupils when playing sport at Stoke Lodge. This would effectively bar the local community from using the site as they do now - losing a precious green space of which there are so few nowadays.\nI believe that Cotham School’s plans are seriously misguided. Fencing is not required to secure the site for the school’s sports activities. Ofsted have made it clear that a fence is not required for safeguarding and for many years Cotham School have played sport at Coombe Dingle Sports Centre , which has no fence !!\nNow we are at the point, where a strong grass roots campaign group ‘We Love Stoke Lodge’, robustly supported by Councillors and politicians (from across the political spectrum) are working together to try and preserve open access to Stoke Lodge for the community. Fighting to protect open access for everyone, we supported the Town and Village Green Application and, once that fell through, have continued to provide assistance to empower the ‘We Love Stoke Lodge’ campaign group.\nOne of the acute problems we have at the moment is that previously the Council had informed the School that, because the main house and walls were listed, no fence could be erected without first obtaining full planning permission. Then, at the end of November, the Council’s advice suddenly changed and the School were told that the fencing would be covered by ‘permitted development’ and NOT require planning permission. This does seem a bizarre change of mind and understandably there is now a prospect of legal challenge to this decision by residents.\nWe are objecting strongly to this change of advice by the Council and have now written:\n1) to the School urging them to think again and asking them to meet with councillors and residents;\n2) to the Mayor and Council’s Chief Executive asking them to intervene to restore the original advice;\n3) to the Secretary of State for Education asking whether the grant for the fence should be paused for fear that taxpayers’ money could be spent on fencing that might subsequently need to come down.\nYou can read copies of these letters below.\nThis is obviously a quick snap shot but you can find out plenty more about what is going on at welovestokelodge.co.uk. Do please take a read and get involved.",
  "http_markweston_org_uk_/http_markweston_org_uk_news_objection-lodged-against-yet-more-houses-filton-airfield/content_5.html": "Chris and Mark have now tabled their letter of opposition to the massive increase in housing being proposed on the Filton Airfield site with the housing total there going from 3750 homes to 6500.\nThe opposition letter is below. You can review the plans in full by going to the South Glos Planning Portal - https://developments.southglos.gov.uk/online-applications/\nThe application code is P22/02113/O\n—————-\nTo whom it may concern,\nWe write as ward councillors for the Bristol City Council ward of Henbury and Brentry. We are the City ward most impacted by the development of the CPNN and so what happens in the Cribbs Patchway New Neighbourhood will affect our communities.\nDespite massive concerns about the sheer number of housing being built, the huge impact of the traffic avalanche about to hit, the constant delays in important transport infrastructure (the train station delays are just one example) and the years of road disruption we have already suffered from our residents have been very patient and understanding of the need for more housing.\nHOWEVER - what is now being proposed is sheer folly and complete madness.\nYTL were originally given permission for 2750 homes. This was then increased to 3750 when the industrial estate (which was earmarked for 1000 homes) was no longer being brought forward. This didn’t fundamentally alter the housing numbers overall so we didnt oppose this reconfiguration of the development.\nNow though YTL are seeking to increase the numbers again to 6750.\nThis doesn’t include the 3000 of so other homes already being built by other developers.\nThe reality is that this sheer scale will overwhelm the transport infrastructure of the entire northern fringe of Bristol and South Gloucestershire. The mitigations proposed are inadequate to meet the need - in reality we doubt any increase would be able to cope with the already constrained and at-capacity road network.\nHighways England are clearly unhappy with the potential impact and we would echo those concerns.\nAdditionally the inclusion of two 30 storey high residential towers is completely out of character for an out of town location. This is not the city centre - it is a suburb of a major city. This would set a precedent that is unsuitable in this location.\nWe ask that the Council reject this application for reasons of:\n- Unsuitable height of the proposals - specifically the 30 storey proposals\n- Unsuitable density of development\n- Lack of proper supporting infrastructure to mitigate the increase\n- Cumulative impact of the wider CPNN on the Northern Bristol fringe",
  "http_markweston_org_uk_/http_markweston_org_uk_news_bus-lanes-a4018/content_29.html": "As you will know the Council is proposing to put bus lanes on the dual carriageway between the Crow Lane roundabout and the top of Brentry Lane.\nI have submitted the statement at the bottom of this post to next Tuesdays Council Meeting where I will speaking in opposition to them (I support the crossings and cycle lanes for information).\nIf anyone else wishes to submit a statement (you don't need to turn up but it will get read and show your feelings on the issue) then you can do so by sending an email to [email protected]\nYou have until noon on Friday. The statement doesn't have to be long but as the saying goes - nothing ventured, nothing gained.\nMY STATEMENT:\nPublic Statement on the A4018 ‘Improvements’\nCabinet recently approved funding to deliver a series of ‘improvements’ along a section of the A4018. The measures include:\nIntroducing a new 30mph speed limit at Crow Lane to cover the whole of Passage Road\nA new signalised pedestrian crossing north of Dragonswell Road across to Brentry Lane and upgrading of the one south of Crow Lane\nA segregated cycle route, north- and south-bound, between Crow Lane and Charlton Road (up the Brentry Hill)\nInbound and outbound bus lanes, operative all day, from Crow Lane to Charlton Road (these are the ones that proved controversial as most of us argued that they’re weren’t needed as this wasn’t where the bus got stuck - although the lanes are shorter than first proposed they are still going in)\nNew bus stops between Crow Lane and Charlton Road\nInstallation of a pedestrian crossing on Passage Road close to Westbury-on-Trym primary school\nMost of these are supported by residents and communities however it is the fourth point that is proving particularly problematic. We have made reservations regarding the proposed new bus lanes previously. Our concerns are as follows:\nThis isnt actually a stretch of road that buses get delayed on - feel free to ask the local bus users who on the whole agree\nIt is a 24 bus lane without 24 hour buses and actually only the number 1 uses that stretch of road\nThe stretch of road suffers from natural pinch points that will cause real mayhem if this plan if it proceeds:\nAs you travel north towards Cribbs Causeway the traffic crests Brentry Hill and moves from one lane to two lane. This allows a large amount of traffic to flow. Without this increased capacity the traffic will back up and over the hill - delaying the north bound buses. We have seen this previously when the bus lane was first installed by the white tree roundabout. It was too long and caused massive congestion. We in North Bristol remember this and I can assure you this isn’t nimbyism - we understand how the traffic flows in our part of the city as we will live with it all the time.\nBy contrast if you are travelling south into the city you arrive at the crow lane roundabout on two lanes of traffic. If you then move on and suddenly move to one lane (because the bus lane has been installed) then you will create congestion and cause the traffic to back up onto the roundabout as it tries to filter from two lanes to one lane. Again this is predictable.\nI would strongly suggest that you look again at what is being proposed, and ideally remove the lanes entirely, or at the very least massively shorten the bus lanes to allow the proper filtering of traffic and give it time and space to filter from two lanes to one.\nI urge the Mayor to reconsider.",
  "http_markweston_org_uk_/http_markweston_org_uk_news_yet-more-housing-being-considered/content_16.html": "We don’t think anyone will be surprised to know that housing is planned for just over the South Glos border. In total 5700 homes were planned for the Cribbs-Patchway New Neighbourhood (CPNN) – this includes the land around the rugby clubs, the land behind Brentry and the former airfield itself.\nOn top of this was 1000 homes being planned for the Patchway Industrial Estate as it was originally intended to switch the land from industrial to residential. This switch is no longer planned but means that 1000 homes need to be built somewhere else in the Northern Fringe of Bristol.\nYTL (who own the airfield portion of the CPNN and had permission for 2700 homes on their land) had applied to increase the number of houses they could build. Their plans include:\n- 2700 homes originally agreed\n- The 1000 that would no longer be going ahead on the Patchway Industrial Estate\n- A further 2800 units on top of this\n- Several 18 storey buildings and two 30 storey developments\n- It would also be supported by schools, shops, community facilities etc\nWe are utterly opposed to this massive increase in the size, scale and density of the development. We can understand taking on the additional 1000 from Patchway - it just moves it from one area to another – so although we may not like it we can at least see the rationale, but this colossal rise in numbers is simple beyond comprehension.\nWe have formally written to South Gloucestershire Council as part of their planning process and plan to speak at the public meeting when this is discussed.\nOur letter in full is below:\nI write, together with my colleague Councillor Chris Windows, to place on record our objection to this massive revised planning application for the former Filton Airfield that spans into 2036. It has caused huge alarm for many local residents.\nThe first thing to note is the developers attempt to justify their new vision for Brabazon on the grounds that since the granting of the original scheme, other factors need to be taken into account. There are accommodating the planned YTL Arena; the case for maximising housing on brownfield developments; protection of the Green Belt; and a wish post pandemic to create a self-contained Urban locality.\nEven taking these arguments at face value, the sheer scale of this revision is, in our view, excessive, unsustainable, and unacceptable to pre-existing communities (site neighbours) living on the Bristol border.\nThe applicants cite compliance with national planning guidelines and the urban lifestyles policies being developed by South Gloucestershire to railroad through a dramatic increase in density and height in the updated proposals. This envisages installing a number of 18-storey structures and two huge 30-storey buildings. These will have a widespread negative visual impact – affecting the skyscape of all those living in North Bristol. This includes harming the enjoyment of heritage assets like the Blaise Estate in our ward.\nOutline planning permission allowed ‘up to a maximum of 2,675 residential units’. This was already an ambitious target which posed a serious challenge to local transport infrastructure. It is now being proposed to raise this limit to 6,500 (143% uplift) to service potentially 12,000 additional residents.\nYTL Developments concede that this sizeable increase exceeds the ‘approximate capacity of Policy CS26… for the CPNN’ (5,700 homes). However, they suggest that the harm caused by this non-compliance is outweighed by the much-needed boost to the housing supply and other apparent economic or social benefits. Of course, such expansion is then used to defend or necessitate building extra retail, commercial capacity and other public amenities.\nWe have real concerns over the cumulative effects of these changes.\nThe National Planning Policy Framework (NPPF) simply sets out broad principles which are rightly left to local planning authorities to interpret, apply, and contextualise on a case-by-case basis. So, for example, it is not enough to state national and local strategic objectives to provide more housing by making ‘as much use as possible of suitable brownfield and underutilised land.’ The NPPF and permitted development does not provide a free hand to cram as many dwellings as possible into a designated space. It is a matter of degree, and we contend that in this instance this plan fails to meet even the most basic test of acceptability.\nYTL further state their intention to create a retail regional destination which, once realised, will overwhelm any conceivable public transport schemes or improvements. Our belief is based on doubts that the objective of achieving a radical modal shift in personal transport is either likely or realistic.\nIndeed, the developers seem to be setting great store over a supposed innovative phased approach in growth to match the delivery of promised transport infrastructure enhancements. Frankly, we are sceptical around realisation of all of this investment – certainly on the timescales envisaged here - having waited years for local rail improvements. For example, the Henbury Loop, despite fierce campaigning an lobbying, is still effectively an aspiration.\nOn transport projects, for far too long now, local authorities have a broken record of over-promising and underdelivering attractive alternatives to the private car. The four transport phases start off by linking the homes target to relatively modest travel measures such as increased Metrobus and rail services. But, in the end relies on a mass transit system that at present is hypothetical and speculative in nature. It is easy to see the developers uncoupling this link or requirement later down the line, thereby rendering this safeguard as something of a fiction.\nTo conclude, we strongly object to this comprehensive redrawing or reimagining of the Brabazon. It is a huge overdevelopment of the area being supported by some highly contentious claims (due to much higher densities) around environmental and ecological sustainability. It will cause undue harm to North Bristol and the already established communities.\nYours sincerely\nCllr Mark Weston and Cllr Chris Windows\nHenbury & Brentry Ward",
  "http_markweston_org_uk_/http_markweston_org_uk_cdn-cgi_l_email-protection/content_19.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_markweston_org_uk_/http_markweston_org_uk_news_conservatives-launch-manifesto-bristol/content_26.html": "This years elections provide an opportunity for change in Bristol.\nThe last year has been challenging and life has been harder than any of us thought it would be last January. Sadly people have lost their lives and livelihoods. Thankfully though hope is on the horizon. The Government’s vaccine programme has been a national and international success with tens of thousands of Bristolians having already had the vaccine - with more receiving their jabs every day.\nThe pandemic saw many plans altered, including the postponement of last years elections. This has meant we have had to endure under another 12 months of ineffective Labour administration of this great City.\nWe now have a chance to change that by building back better - a better Bristol for all Bristolians.\nWith all this in mind we have launched our plan for Bristol to deliver a brighter future for our City. A future in which we have the opportunity to scrap the entire position of Mayor, to make the leadership of this City more accountable to the public. New leadership that doesn't waste tax payers money, that delivers on the basics that matter to our residents, prioritises funding for our communities and doesn’t ignore the suburbs.\nYour vote is an opportunity for change this May - voting for Councillors, City Mayor, West of England Mayor and Police & Crime Commissioner!\nYou can make a difference - I urge you to do so. Let’s build back better!\nCllr Mark Weston\nConservative Group Leader, Bristol City Council",
  "http_markweston_org_uk_/http_markweston_org_uk_about-mark-weston/content_3.html": "Mark lives in Brentry with his wife and two children - both of which attend local schools.\nHe has been a local Councillor since 2006 and during that time has worked hard to improve our community and protect local services.\nHe has always taken the approach that results are what matters - so has worked cross Party on a wide range of issues. These have included preventing the sell off of local green spaces or stopping the closure of local libraries.\nIn addition he has a good track record of supporting local residents and community groups as we work together to better our neighbourhoods. These groups have ranged from sports groups, to scout troops, to park committees or religious organisations.\nProfessionally he has run night clubs, worked for BT and Bristol & West Mortgages before working in politics. He now works for a Facilities Management Company.\nOutside of politics and work he loves Rugby, American Football, spending time with his family and reading (don't get him started on Science Fiction - you'll be there all day).\nIf you have a problem that you believe Mark can help with then do please get in touch.",
  "http_markweston_org_uk_/http_markweston_org_uk_news_statement-submitted-against-a4018-bus-lanes/content_15.html": "Statement from Councillors Mark Weston & Bador Uddin\nWe wish to put on record our objections to the short-sighted misery that you are going to inflict on the residents of north Bristol.\nSoon this Council will begin it's A4018 Improvement Scheme on Passage Road. A two year construction project that will deliver little other than road rage.\nThis will include a new crossing over the busy road and a new cycle path - both of which we support (although we think that the latter is in the wrong place - but that's another story). Sadly though it will also include the imposition of bus lanes between the Crow Lane Roundabout and the top of Brentry Hill. These will be peak time only and have been slightly shortened which is at least something but our opposition remains for the following reasons:\n- Only one bus uses this route.\n- Hold ups are rare and are caused by the pinch points over the hill not this stretch itself.\n- By forcing traffic from two lanes to one very quickly you risk backing up the traffic over the roundabout and brining our communities to a stand still.\n- By congesting the Crow Lane roundabout you will create a rat run up Brentry Lane. The original consultation spoke about traffic calming along this stretch. This seems to have been quietly dropped. This would need to be urgently added back into the final design.\n- Very few people in the area (those that know the roads) want this at all.\n- The modelling was done in 2020 and traffic events have moved on since.\n- You will also remove a large number of mature trees.\nWhat will happen is you will take a road that copes and turn it into a road that doesn't. It will be engineered congestion.\nWe urged the last administration to think again and we have urged this one to.\nWork will being in a matter of weeks so we know that it is inevitable that this misery before Christmas will happen but please let's not delude ourselves, this was a deliberate act of traffic vandalism.\nEven at the 11th hour we hope that the Council walks away from the project or at the very least heavily edits it.",
  "http_markweston_org_uk_/http_markweston_org_uk/content_1.html": "I'm Mark Weston, one of your Conservative Councillors for Henbury & Brentry. I love my community and think its a great place to live. As your local Councillor I am always working to make it a better place to be. If you are a local residents and have a problem that you think I can help with then do please get in touch via the details on my contact page. I am here to help!",
  "http_markweston_org_uk_/http_markweston_org_uk_campaigns_improving-our-parks-green-spaces/content_4.html": "Our parks and green spaces are vital to our community. They are where we play, exercise and relax. When they were threatened with being sold off in 2011 we rallied around and fought back. We stopped them then and since then have worked together to improve them.\nAs your Councillor I have:\n- Forced the former Mayor to back down on plans to close the Blaise Museum.\n- Secured funding to get a play area restored to Okebourne Park and expanded the play area on Crow Lane. These have been delivered.\n- I lead community litter picks into our green spaces to try and keep them clean.\n- As mentioned above - stopped the sell off proposals.\n- Got additional benches installed and trees planted across Henbury & Brentry.\nI am not resting on my laurels though and I continue to strive to improve them still further - we are due to get a MUGA (multi-use games area) and outdoor gym on the former Crow Lane bowling green and new trim trail installed in the Okebourne Open Space to expand the play area there.\nAfter this we will be looking at new paths, benches and bins.\nWe all love our parks and together we can make them better!",
  "http_markweston_org_uk_/http_markweston_org_uk_news_what-happening-charlton-common/content_17.html": "There have been a few comments about Charlton Common being built on at the top of Brentry. This isn’t quite right but I wanted to explain what is happening. Charlton Common Lane actually splits the common into two sections. The main chunk of the common is to the right of the lane as you look down it towards Cribbs Causeway. There is then a much thinner strip of land that is also common land to the left and running alongside the lane.\nPermission has been given by South Gloucestershire Council (its just over the border) to allow an access road to cut through the left hand section - HOWEVER the common must be compensated so a larger area in size is being added to the right hand side and being redesignated as such.\nThis road that has been given permission then allows RedRow to access the field they own to the left of the lane and behind the common strip. What they are also proposing is to put the common on a partial maintenance programme (basically to mow some paths into it so people can walk through it if they want) but leaving most of it wild as it is now.\nIn 2018/2019 Redrow actually consulted on their proposed changes to the common and although permission was granted you can still read about it HERE.\nSuffice to say that I am not a mad fan on this development because I have worries of traffic on Charlton Road. The problem is that it falls outside of the City border although you can only access it via Bristol Roads. Never the less as part of the permission we did secure several concessions:\n- A play area will be included in the Redrow housing development\n- They will pay for a zebra crossing across Charlton road near the shops.\n- No traffic access will be granted from the red row development into the wider Filton airfield development\nI hope that makes sense but if you have any questions (just because I know what I mean doesn’t mean that everyone else does) then do please get in touch.",
  "http_markweston_org_uk_/http_markweston_org_uk_cookies/content_18.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "http_markweston_org_uk_/http_markweston_org_uk_campaigns/content_21.html": "Protecting Local Facilities We rely on our local services and facilities. They are vital to our community. Sadly all too often these are under threat from the Council. As your local...\nDelivering Value for Money for Taxpayers I believe that the Council has an obligation to spend the money it has wisely. This is especially true when resources are scarce. I do not support squandering...\nCampaigning to improve local transport As your local Councillor I am passionate about improving local transport provision in Henbury and Brentry. This means make our roads safer, better public...\nProtect from Overdevelopment We all know that there are thousands of houses due to be built just over the border in South Gloucestershire (with work due to begin in 2020). I have been...\nWorking with Community Groups As your local Councillor I am always available to help community groups make our neighbourhoods a better place for everyone. In particular I have: Supported...\nImproving our Parks & Green Spaces Our parks and green spaces are vital to our community. They are where we play, exercise and relax. When they were threatened with being sold off in 2011 we...",
  "http_markweston_org_uk_/http_markweston_org_uk_news_final-plans-submitted-charlton-common/content_22.html": "After quite a delay Redrow Homes have now published plans for what they intend to do with the Common. The common is actually in two sections - the majority to the right of Charlton Common Lane and a thinner slither to the left.\nRedrow’s interest stems from their ownership of a field to the left of Charlton Common Lane and behind the thinner section of Common which they have permission to develop for 80 homes. In order to access the field they need to build an access road through the smaller section of common - BUT they then have to compensate the common with additional land to offset the loss.\nEssentially though the plans show:\n- The access road\n- The land compensation\n- The future management and look of the common\n- The protection measures to stop people parking on the common (a concern raised by residents was the travellers might seek to gain access)\nYou can access their plans at the link below.",
  "http_markweston_org_uk_/http_markweston_org_uk_campaigns_protecting-local-facilities-0/content_11.html": "We rely on our local services and facilities. They are vital to our community. Sadly all too often these are under threat from the Council. As your local Councillor I have always fought to preserve and improve on what we have here in Henbury & Brentry.\nWhen the library service was under threat local Conservatives were at the forefront of the campaign to get Mayor Rees to change his plans that would have seen 17 of 27 libraries closed. When Mayor Fergusson was mooting closing the Blaise Museum we forced him to rethink this cultural vandalism and keep it open (we are now trying to improve it).\nI have worked to improve parks, roads, amenities and even wrote the bid that secured the Henbury & Brentry Community Centre for local residents. It is now open (though the fantastic support of its volunteers) and supporting local residents and groups.\nI will continue to work to improve our community and protect local facilities.",
  "http_markweston_org_uk_/http_markweston_org_uk_campaigns_campaigning-improve-local-transport/content_8.html": "As your local Councillor I am passionate about improving local transport provision in Henbury and Brentry. This means make our roads safer, better public transport options and also ensuring that traffic flows as freely as possible in our community.\nI opposed the Mayors ridiculous plans for the A4018 and led the campaign against their introduction in Henbury & Brentry. We delivered thousands of leaflets, ran targeted social media adds and help public meetings. I am delighted to say that we won that fight and most of the silly ideas have now been discarded.\nAs your Councillor I have:\n- Relentlessly campaigned to re-open the Henbury Railway Line - with the Henbury ‘Spur’ option due to open in 2021.\n- Lobbied to improve local bus stops - this is a rolling programme with the No.1 stops being done in 2019 and the No.2 due for upgrades in 2020.\n- Secured money for road safety measures - such as removing the pinch point on Hallen Road, a pedestrian crossing point on Knole Lane, a zebra crossing outside of Aldi and speed restrictions on Kings Weston Road.\n- Led local petitions to restore and improve local bus services - such as the No.76 back to Station Road\nThere is more work yet to do and some campaigns are ongoing but I will always support local residents to improve our local area.\nI am still working to get the entire Henbury Rail ‘Loop’ opened up to passenger travel, to improve the Henbury Ford area, get the promised zebra crossing on Charlton Road installed and many more.\nBy working together I believe we have improved our area and we can achieve so much more!",
  "http_markweston_org_uk_/http_markweston_org_uk_news_south-glos-housing-development-cpnn/content_28.html": "There has been a lot of discussion in recent days on a whole host of issues. One of the big ones proved to be about what is happening in South Gloucestershire regarding the housing due to be built. So I thought that it might be easier to try and spell out what is happening – believe it or not what follows is the shortened summary.\nIn 2010 Filton Airfield closed and the whole area from Haw Wood to the A38 end of the runway began to be discussed by South Gloucestershire as a potential housing development.\nWhat followed was years of debate, petition, argument and discussion. This culminated in 2017 when South Gloucestershire Council gave the final planning consent to new house building on the Former Filton Airfield site and wider area. The whole project is called the Cribbs Patchway New Neighbourhood (CPNN)\nSo here is my quick summary as to what is happening. I have included a map extract to provide some context.\nSo here’s what we know:\n- There will be around 5700 homes built just over the border in South Gloucestershire. Most of which will be built by three major developers – Deeley Freed (to the west of the dual carriageway), Persimmon Homes (immediately behind Brentry) and YTL (on the airfield site itself). There are several smaller developers in and around these ‘bigger fish’.\n- Collectively they have all bought into the ‘Landowner Agreement’ which binds them into providing specific facilities at certain points in the build (such as schools – of which there are 4/5, parks, doctors surgeries, shops etc).\n- A large part of the development will be used for ‘employment land’. This is primarily concentrated at the far end of the runway off the A38.\n- Building started last year but could take up to 15 years.\n- If the normal process is followed then each of the developers will build in 200 house ‘lots’ (taking a couple of years). These will then be sold and work will begin on the next lot and so on. Some of the smaller developers will also start work.\n- Traffic will not be granted access down Fishpool Hill, Charlton Road or Station Road. In the latter two cases it will be public transport only (they are also proposing to move the bus lane to over the station road railway bridge to prevent people doubling back from Crow Lane roundabout and turning down no name road).\n- As part of the plans two new trains stations will be provided at Henbury (on the Brentry side of the dual carriageway on the way to the Crow Lane roundabout) and Filton North (near the Brabazon Hangar where it will serve the new arena).\nSo what will the impact be?:\nIn many ways the development ticks a lot of boxes. It will have local facilities, shops, employment opportunities. It, at least for the moment, seems to be taking a joined up approach. The problem will be traffic which, despite the inclusion of new train stations and bus routes, is going to be bad. How bad it will be we still don’t know but I fear time will tell. I expect we can all agree that the Crow Lane roundabout will be ‘adversely impacted’, and that the road network in North Bristol will get busier.\nThis isn’t a question of if it will happen – sadly at this stage - it is a matter of when.\nYou can get more information at the link HERE – it is from 2013 but does provide some good background but doesn’t have some recent developments such as the final location of the Henbury station or the Arena",
  "http_markweston_org_uk_/http_markweston_org_uk_news_councils-attitude-ashton-court-model-railway-just-seems-petty/content_33.html": "On Tuesday afternoon I took the opportunity to question the Mayor on the future of the miniature railway at Ashton Court. The future of their lease is currently under review.\nPreviously the Mayor has argued that every time the railway is open the Council loses income as the car park near the Golf Course fills up with railway visitors and this deters fee paying golfers.\nThis didn't quite chime with me. So at the Full Council meeting I questioned him on the current lease negotiations as the Council's behaviour just doesn't seem to make sense.\nAt the moment the Council is trying to do two things:\n1) Make the volunteers that run the railway open it more frequently (surely by the Mayor's logic this would cost the Council more money?).\n2) Take away the small car park that sits alongside the railway to force all users to use the car park by the golf course (again surely this would mean it fills up faster and deters even more golfers?).\nFrom the Mayor's response I am really not sure that he understands the illogicality of the Councils negotiating position. In one of his answers he actually tried to argue that removing the car parking would 'enable sustainable transport to be further promoted'. The railway runs on a Sunday with only a VERY irregular bus service available. Trying to get their by public transport would take hours and with small children makes it nigh on impossible. Unless he is suggesting building an underground stop there (miniature or otherwise) it just isn't practical.\nThe Council's attitude just doesn't seem to make any sense to me and just seems petty. We should be trying to work with the fantastic volunteers that run the railway rather than against them. Let us hope for an outbreak of common sense.",
  "http_markweston_org_uk_/http_markweston_org_uk_news_category_Local-News/content_7.html": "Statement submitted against A4018 Bus Lanes 20th October 2024 Statement from Councillors Mark Weston & Bador Uddin We wish to put on record our objections to the short-sighted misery that you are going to inflict on the... Local News\nOBJECTION LODGED AGAINST YET MORE HOUSES ON FILTON AIRFIELD 27th February 2023 Chris and Mark have now tabled their letter of opposition to the massive increase in housing being proposed on the Filton Airfield site with the housing total... Local News\nBUS LANES ON THE A4018 10th October 2022 As you will know the Council is proposing to put bus lanes on the dual carriageway between the Crow Lane roundabout and the top of Brentry Lane. I have... Local News\nFINAL PLANS SUBMITTED FOR CHARLTON COMMON 14th June 2022 After quite a delay Redrow Homes have now published plans for what they intend to do with the Common. The common is actually in two sections - the majority to... Local News\nYET MORE HOUSING BEING CONSIDERED 24th May 2022 We don’t think anyone will be surprised to know that housing is planned for just over the South Glos border. In total 5700 homes were planned for the Cribbs... Local News\nNumber 2 Bus Route 'Upgrades' - A mixed bag at best 28th January 2022 Just before Christmas the Mayor began a consultation on proposals to 'upgrade' the Number 2 bus route that dissects the City. As you would imagine this has... Local News\nCONSERVATIVES LAUNCH MANIFESTO FOR BRISTOL 20th April 2021 This years elections provide an opportunity for change in Bristol. The last year has been challenging and life has been harder than any of us thought it would... Local News\nWhat is happening with Charlton Common 21st February 2021 There have been a few comments about Charlton Common being built on at the top of Brentry. This isn’t quite right but I wanted to explain what is happening... Local News\nThe South Glos Housing Development (CPNN) 19th February 2021 There has been a lot of discussion in recent days on a whole host of issues. One of the big ones proved to be about what is happening in South Gloucestershire... Local News",
  "http_markweston_org_uk_/http_markweston_org_uk_campaigns_protect-overdevelopment/content_24.html": "We all know that there are thousands of houses due to be built just over the border in South Gloucestershire (with work due to begin in 2020). I have been following this whole issue very carefully since it was first mooted in 2010.\nIn many ways the development is well thought through, with schools, community spaces, shops and health facilities but it is the issue of traffic that causes most concern.\nAs part of the planning process we have opposed high rise developments on the site, blocked suggestions of opening up rat runs down Charlton Road and Fishpool Hill, and pushed for public transport provision from the start.\nAs part of this the rat runs have been dropped, high rise plans ditched and public transport imporvements are a key part of the plans.\nThese include:\n- Two new train stations (Henbury and Filton North)\n- Better bus connections (down Charlton Road)\n- Metro Bus connections\n- Improved Cycling provision\nIt isn’t just suggestions from South Gloucestershire developers that we need to be wary of though. Recently the Mayor suggested ‘improvements’ to the A4018 (Passage Road). These would have created a huge amount of artificial congestions, severed our communities and snarled up North Bristol. I campaigned hard against this and by working with residents and community groups we forced him to rethink.\nHis redrawn plans aren’t perfect but they are a vast improvement on what was first suggested. I will continue to try and get them altered to take out the remaining stupidities contained within them.",
  "http_markweston_org_uk_/http_markweston_org_uk_news_feed/content_25.html": null,
  "http_markweston_org_uk_/http_markweston_org_uk_news_number-2-bus-consultation-response-first-bus/content_32.html": "As residents will know First Bus ran a consultation on proposed changes to the No.2 bus route. On the whole the proposed changes have been rejected but there is a change to the Henbury & Brentry Area.\nThe full response is below:\n“During May and June 2019, we consulted with our customers on ways to improve the reliability and punctuality of Service 2.\nWe were delighted to receive over 1,000 responses to the survey, and we also met many people along the route with our consultation bus to hear their views. As well as this, we also engaged with key stakeholders and attended public meetings.\nAfter reviewing the results and listening to what has been said, we are now able to announce the changes that will be made on Sunday 15th September.\nWhat is changing?\nThe route of Service 2 will change in the Brentry and Henbury area...\nFeedback and data have confirmed that traffic congestion on the A4018 approaching the Old Crow roundabout is delaying traffic at peak times. Our proposal was therefore to operate the service via Station Road, Henbury Road and Crow Lane and no longer use the A4018. Two bus stops on the A4018 at Lyppincourt Road would no longer be served by Service 2, however Service 4 would continue to serve these stops. The majority of people who responded to the survey and said they would be affected by the change said they supported it.\nWe will therefore be providing an extra bus to enable us to implement this change which will provide new links to and from Henbury, and also help provide more consistent journey times by avoiding the congestion on the A4018.\nMore frequent evening services...\nAs part of the survey, we asked for your thoughts on the frequency of Service 2. The majority of people were satisfied with the frequency during the day and at weekends.\nHowever, one common piece of feedback was that the service needs to be more frequent on weekday evenings. We are pleased to announce that we will be increasing the frequency Monday to Friday from approximately 19:00 to 21:00. The new timetable is currently being designed and will be published closer to the implementation date.\nMore buses...\nAs well as the improvements already mentioned, we are conducting a detailed review of the timetable to ensure the reliability and punctuality of the service is as robust as possible. Overall, we expect to allocate a number of extra buses into the service from 15th September to make these changes possible.\nFuture improvements...\nThe above changes represent the first step in a significant investment into the service.\nTogether with Bristol City Council, we have been conducting detailed analysis of the congestion hotspots on the route, and although rectifying some of these will require major works that will take some time, we expect to be able to make further improvements to the service in 2020. We will announce these in due course.\nWhat isn’t changing and why?\nThe proposed change to the route in the Henleaze area...\nThere was a big response to our proposed change in the Henleaze area. The proposal to run buses via Henleaze Road and Westbury Road on journeys towards the City Centre was put forward to avoid delays to buses on North View when approaching the White Tree roundabout. The majority of\ncustomers that would be impacted by the change did not support it, with many local residents stressing that Service 2 provides a vital link with local amenities, and that the proposed route would not be easily accessible, particularly for the elderly or less mobile. The feedback was very clear, and as a result, we have decided not to go ahead with this proposal. The feedback did also acknowledge that there was an issue with the congestion in North View. We will be working closely with Bristol City Council to resolve the issue.\nImproving links to and from Southmead Hospital...\nA proposal was made as part of the consultation to improve the links to Southmead Hospital. This would have involved Service 2 serving Southmead Road instead of Doncaster Road and Greystoke Avenue. Again, the majority of customers that would be impacted by the change did not support it. Much of the feedback was from customers who wanted the link maintained between Greystoke Avenue, Cribbs Causeway and Henleaze. After reviewing the feedback, we have decided not to implement this proposed change. There was support and demand for improved links to Southmead Hospital, but we have decided that this should not be achieved by negatively impacting our existing customers and links with other areas. We will continue to look at ways of improving links to and from Southmead Hospital.\nSplitting Service 2 into separate services...\nOptions for splitting Service 2, as well as the option to provide alternative suggestions, were proposed as part of the consultation.\nThere were many differing views on whether and how Service 2 should be split, and after reviewing the data and feedback we have decided at this present time the service will not be split. We will continue to monitor the situation and will engage with customers and stakeholders again for any future changes.\nWe would like to thank all those who took part in the consultation. The feedback has been invaluable in helping us to make informed decisions on the forthcoming changes.”"
}