{
  "https_www_alistairwilloughby_co_uk_/https_www_alistairwilloughby_co_uk_blog/content_3.html": "top of page\nHome\nBlog\nGet in touch\nMore\nUse tab to navigate through the menu items.\nAll Posts\nPriorities\nHealth\nAlistair Willoughby\nDec 8, 2023\nThe Environment & Green Jobs\nAlistair Willoughby\nDec 8, 2023\nAffordable Housing\nAlistair Willoughby\nDec 8, 2023\nbottom of page",
  "https_www_alistairwilloughby_co_uk_/https_www_alistairwilloughby_co_uk/content_1.html": "top of page\nAbout\nme\nMy name is Alistair Willoughby and I am a Labour & Co-operative Councillor for Baldock West in North Hertfordshire. I have lived here, in Baldock, all my life. During this time, I have given my time to many different community organisations, groups, and charities. The experience I have gained from this, as well as my roles in the Labour & Co-operative parties and elected office, has made me eager to continue working for the people I represent. My next challenge is standing for Hertfordshire County Council as a candidate for Baldock & Letchworth East Division.\nGet in Touch\nbottom of page",
  "https_www_alistairwilloughby_co_uk_/https_www_alistairwilloughby_co_uk_post_the-environment-green-jobs/content_5.html": "The Environment & Green Jobs\n- Alistair Willoughby\n- Dec 8, 2023\n- 2 min read\nOver the last 13 years the Conservatives have shown little regard for the environment. This has been topped off with Rishi Sunak reopening coal mines - for foreign export - as well as exploiting North Sea fossil fuels. Having failed to meet their environmental targets, rather than scale up projects that would help, they've moved the goalposts.\nIt doesn't need to be like this. We shouldn't need to decide what's more important, protecting our environment or supporting our economy. We shouldn't need to decide between our rivers and building decent housing. These choices are entirely political and are part of a Conservative regime that takes money from taxpayers yet provides nothing in return.\nWe have several rare chalk streams in North East Hertfordshire that have been neglected for far too long. Their ecological and environmental value cannot be understated and it is up to us to work together to protect them. I will continue to call for better protection for these, and all rivers and waterways. There are few resources that we can not live without, and water is one of them. We must invest in blue infrastructure across our country, including new large-scale projects such as reservoirs.\nWe need to invest in a green jobs revolution that provides workers with a real living wage and protects and provides for our environment. Making sure that the move to renewable energy allows industry workers to smoothly change jobs through retraining is incredibly important. We must ensure that no one is left behind and out of work as we decrease our reliance on the fossil fuel industry.\nReducing our reliance on fuel fossils should also include supporting community energy projects that put control in the hands of local people. With energy prices increasing to unaffordable levels, it has never been more important that we invest in cheap, renewable energy produced locally for local people.\nThese are all things that I will fight for as your Parliamentary Candidate and MP.",
  "https_www_alistairwilloughby_co_uk_/https_www_alistairwilloughby_co_uk_blog_tags_priorities/content_9.html": "top of page\nHome\nBlog\nGet in touch\nMore\nUse tab to navigate through the menu items.\nAll Posts\nPriorities\nAffordable Housing\nThe Conservative government has spent the last 13 years exacerbating the housing crisis Margaret Thatcher created. We’re seeing a lack of...\nAlistair Willoughby\nDec 8, 2023\nbottom of page",
  "https_www_alistairwilloughby_co_uk_/https_www_alistairwilloughby_co_uk_blog_categories_priorities/content_8.html": "top of page\nHealth\nThe Conservatives have spent the last 13 years making our health and social care systems worse. We now see people nationwide unable to...\nAlistair Willoughby\nDec 8, 2023\nThe Environment & Green Jobs\nOver the last 13 years the Conservatives have shown little regard for the environment. This has been topped off with Rishi Sunak...\nAlistair Willoughby\nDec 8, 2023\nAffordable Housing\nThe Conservative government has spent the last 13 years exacerbating the housing crisis Margaret Thatcher created. We’re seeing a lack of...\nAlistair Willoughby\nDec 8, 2023\nbottom of page",
  "https_www_alistairwilloughby_co_uk_/https_www_alistairwilloughby_co_uk_blog_tags_housing/content_7.html": "top of page\nHome\nBlog\nGet in touch\nMore\nUse tab to navigate through the menu items.\nAll Posts\nPriorities\nAffordable Housing\nThe Conservative government has spent the last 13 years exacerbating the housing crisis Margaret Thatcher created. We’re seeing a lack of...\nAlistair Willoughby\nDec 8, 2023\nbottom of page",
  "https_www_alistairwilloughby_co_uk_/https_www_alistairwilloughby_co_uk_privacy-policy/content_2.html": "Our contact details\nName: Alistair Willoughby\nAddress: 34 Hurst Close, Baldock, Hertfordshire, SG7 6TL\nE-mail: Ali4NEHerts@outlook.com\nThe type of personal information we collect\nWe currently collect and process the following information:\n-\nPersonal identifiers, contacts and characteristics (for example, name and contact details)\nHow we get the personal information and why we have it\nMost of the personal information we process is provided to us directly by you for one of the following reasons:\n-\nTo support Alistair Willoughby's selection campaign in North East Hertfordshire CLP.\n-\nWe use the information that you have given us in order to log support for Alistair Willoughby and plan campaign activity.\nWe may share this information with the Labour Party and its volunteers.\nUnder the UK General Data Protection Regulation (UK GDPR), the lawful bases we rely on for processing this information are:\nYour consent. You are able to remove your consent at any time. You can do this by contacting Ali4NEHerts@outlook.com\nHow we store your personal information\nYour information is securely stored.\nWe keep your contact details for the duration of the selection campaign. We will then dispose your information by deleting the database at the end of the campaign.\nYour data protection rights\nUnder data protection law, you have rights including:\nYour right of access - You have the right to ask us for copies of your personal information.\nYour right to rectification - You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete.\nYour right to erasure - You have the right to ask us to erase your personal information in certain circumstances.\nYour right to restriction of processing - You have the right to ask us to restrict the processing of your personal information in certain circumstances.\nYour right to object to processing - You have the the right to object to the processing of your personal information in certain circumstances.\nYour right to data portability - You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances.\nYou are not required to pay any charge for exercising your rights. If you make a request, we have one month to respond to you.\nPlease contact us at Ali4NEHerts@outlook.com if you wish to make a request.\nHow to complain\nIf you have any concerns about our use of your personal information, you can make a complaint to us at Ali4NEHerts@outlook.com\nYou can also complain to the ICO if you are unhappy with how we have used your data.\nThe ICO’s address:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nICO website: https://www.ico.org.uk\n.",
  "https_www_alistairwilloughby_co_uk_/https_www_alistairwilloughby_co_uk_post_health/content_4.html": "Health\n- Alistair Willoughby\n- Dec 8, 2023\n- 3 min read\nThe Conservatives have spent the last 13 years making our health and social care systems worse. We now see people nationwide unable to get appointments with their GPs and dentists when they need them most. There is also a crisis in mental health, mass food insecurity, poverty, and an incredible shortage of healthcare staff.\nI am bringing a motion to North Herts Council to declare a Health Emergency in the district, and I am hopeful that more local authorities will follow because we know we cannot continue like this. We know that health can't be treated as a privilege for the few, while the majority have no route to decent healthcare. We face significant physical and mental health inequalities, which impact women and the LGBTQIA+, Black, Asian, and Minority Ethnic communities disproportionately. The Health Inequalities Steering Board (NHS Hertfordshire) commissioned a piece of work setting out improvements needed from 2023, highlighting some of the mental health issues needing the most attention, and the lack of good services available locally to help people.\nThese health inequalities are exacerbated by the Conservatives' willful inability to support the NHS and work with health and social care staff to find the best outcomes for all. This is bad for the staff, whose working conditions see them on ridiculously long back-to-back shifts that leave them tired, but also places patients' lives at risk. Tired doctors kill. That is the stark truth of it. When healthcare staff are pushed to the brink, there is a danger for patients that cannot be ignored. There is no quick fix for the crisis in healthcare the Conservatives have created. Over the last decade they have devalued our clinicians, forcing many to seek employment abroad, and disincentivised talented young people from pursuing careers in medicine. We need to reset government, show that staff in the NHS are valued and respected, start training more healthcare professionals from care workers to consultants, and we need to start now.\nThe Conservatives' have let waiting times get longer and longer, with thousands now waiting more than a month for a GP appointment, tens of thousands waiting for procedures and care, and cancer treatment waiting list standards cut to shreds.\nMy mum is currently going through cancer treatment and would have been hit much harder if these government cuts to standards were made prior to her diagnosis. She was diagnosed quite late and, had she had to wait any longer, she wouldn't be here only 10 months later. We are incredibly lucky that it was caught when it was, but there are so many who haven't and so many will be lost to a completely avoidable fate.\nIt is about more than just the NHS though. I believe that health must be a consideration in everything that we do. It isn't enough to just support our NHS when we are in government. We must build preventative health interventions into every part of our society and our communities. A person’s opportunity for good health starts before they have the need for healthcare. Therefore, we must fund and empower local authorities to provide the best opportunities for health. Their close position to their communities, as well as their strong local knowledge, gives them the best scope for making health part of everyday lives. This must include their responsibilities for housing and planning, green spaces and leisure, community cohesion and safety, and transport options, among others.\nTogether, we must protect the NHS and its staff, fund and empower local authorities, and challenge poor health outcomes across the country.",
  "https_www_alistairwilloughby_co_uk_/https_www_alistairwilloughby_co_uk_post_affordable-housing/content_6.html": "Affordable Housing\n- Alistair Willoughby\n- Dec 8, 2023\n- 2 min read\nThe Conservative government has spent the last 13 years exacerbating the housing crisis Margaret Thatcher created. We’re seeing a lack of good quality, affordable, sustainable housing being built. Our cities, towns, and villages are losing their community amenities, pubs, and shops, watching helplessly as they are turned into flats and apartments that are too expensive to help ordinary working people and their families thanks to Tory changes to permitted development rights. Our cities, towns, and villages are turning into dormitories, where there is nowhere to go and nothing to do, just housing without community, without people having the space to interact meaningfully with each other.\nShelter has recently reported that half of renters are only ‘one paycheque away’ from potentially losing their home, up from 39% in 2021. 55% of renters report seeing an increase in their rent in the past year. We are seeing rents increasing, a housing market with a lack of good quality and affordable housing, and people all over the country who will become homeless if they lose their income for even one month. It is abundantly clear that we need to challenge this inadequate and unaffordable system. We need a genuine Renters Reform Bill which will boost renters’ rights and protect families across the country, not more dither and delay from a government that is out of touch and out of ideas.\nI support community-led housing. This approach is vital to designing places fit for the future and must play a leading role in solving our housing crisis so that we can have genuinely affordable homes being part of our communities. It will require legislative change to be effective and I am committed to ensuring that happens.\nI grew up in a small town in North East Herts. I have contributed to our communities. I want to protect what makes our communities special. I will fight for the right housing in the right place. I will stand up for good quality, environmentally friendly, and affordable housing. I will work hard to make sure that new developments become part of our communities, not pseudo-neighbourhoods on the edge and distinct from our towns and villages."
}