{
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_campaigns_policing-back-heart-community/content_6.html": "Policing back into heart of the community\nIm proud that I have overseen the recruitment of over 500 additional police officers in West Mercia, taking the force to record levels of officers. Crime and the demands on policing, of course, changes over time but now is the time that communities across West Mercia must now feel the benefit of that investment.\n- Responsive Policing – Ensuring our police respond quickly to calls from the public. Making sure the public are Informed about crime in their area and what action the police are taking to respond and prevent it.\n- Visible Policing – Redirecting funding for 100 more police officers to bolster Safer Neighbourhood teams. Ensuring all communities have a named local police officer and that they see them in their community more often.\n- Accessible Policing - Improving 101 call response times and online crime reporting.\n- Informed Communities – Making sure the public are informed about crime in their area and what action the police are taking to respond and prevent it.\n- Safer Roads - More specialist roads policing teams to tackle the harm and ASB caused on our road. I will continue to focus on the “3 E’s”. Targeted enforcement at those road users causing the harm on our roads, education made available to those who want to improve their driving skills, and continue to work with highway authorities to improve highway safety.\nI will agree with the Chief Constable service standards that the public can expect to be delivered, and will be published as well as performance against them.",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news/content_17.html": "Concerning results in Police Federation Survey Friday, 12 April, 2024 The survey results from the Police Federation are disappointing to read. Policing in West Mercia is delivered by hard working police officers and staff that keep our community safe. One of my first campaign when I got elected in 2016 was “Behind the Badge”, highlighting the personal cost that can be associated with policing. My mission is to ensure officers and staff are supported to do their work... Local News\nI am committed to a safe and timely firearms licensing system in West Mercia 30th March 2024 I am aware of a BASC campaign ahead of the PCC elections in May. The details of the campaign are here https://basc.org.uk/pcc-elections-make-a-difference-to-the... Local News\nA message from The Home Secretary Priti Patel MP ahead of the PCC elections in West Mercia 2nd May 2021 I’m proud to have the support of The Home Secretary Priti Patel in my work as your Commissioner. With your support on Thursday May 6th at the PCC elections in... Articles\nMy Plan to tackle Rural Crime in West Mercia 29th April 2021 The three beautiful counties that make up the West Mercia force area have some of the most beautiful countryside in the UK; that countryside is home to many... Articles\nMy Plan to ensure the community is always at the heart of policing in West Mercia 27th April 2021 “Policing by consent” is at the heart of the British model of policing. Maintaining that consent by ensuring there is effective community policing has been at... Articles\nJohn Campion; My Plan for crime prevention 19th April 2021 Over the past five years John Campion as Commissioner has consistently focused West Mercia Police on fighting crime, catching criminals and making our... Articles\nPolice taking action over crime concerns in Shrewsbury Town Centre 13th April 2021 John Campion is seeking to reassure the communities in Shrewsbury that as Commissioner he is confident West Mercia Police are aware and responding to the recent... Articles\nJohn Campion sets out his plan to cut Crime further across the Three Counties 6th April 2021 John Campion has set out his plan to cut crime further with some key commitments to target criminals and keep the communities of West Mercia safe. By relentless... Articles\nMy Plan to make West Mercia’s roads Safer 30th March 2021 I have set out my plan to make the roads in West Mercia safer with some key commitments to tackle deaths and anti-social behaviour on our roads. On average one... Articles\nJohn Campion launches re-election bid for West Mercia PCC 24th March 2021 I have launched my bid as the Conservative candidate to be re-elected as the West Mercia Police and Crime Commissioner. I have today submitted my nomination... Articles",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com/content_1.html": "My plan to cut crime\nOver the past 8 years I have overseen total recorded crime fall in West Mercia; most recent published figures show it has fallen 7% on the previous year.\nI have overseen the recruitment of over 500 additional officers to West Mercia Police, taking the force to record numbers of police officers.\nI am determined that the communities of West Mercia must feel the full benefit of that investment – where crime falls further, victims are better supported and communities feel safer.",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_concerning-results-police-federation-survey/content_11.html": "The survey results from the Police Federation are disappointing to read. Policing in West Mercia is delivered by hard working police officers and staff that keep our community safe. One of my first campaign when I got elected in 2016 was “Behind the Badge”, highlighting the personal cost that can be associated with policing.\nMy mission is to ensure officers and staff are supported to do their work keeping us safe, in line with our communities priorities. My independent commissioned survey shows that 82% of the public have confidence in West Mercia Police – that is something West Mercia officers and staff should be very proud of.\nWhilst disappointing, there has been some progress as “Intention to leave rates” have improved with less staff planning to leave than last year and when compared to the national average West Mercia is in a more positive position. As very small positive in a concerning picture overall.\nAs PCC I am ultimately accountable for the totality of policing, and I know that the Chief Constable (who is responsible for leading the force) and his team are focused on addressing the issues highlighted in this survey. There is limited progress, but it is clear it needs to be faster and sustained – I will continue to play my part in making it that happen.\nRead the full report here https://www.polfed.org/westmercia/news/2024/force-has-second-worst-leve…;",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_category_Local-News/content_27.html": "Concerning results in Police Federation Survey 12th April 2024 The survey results from the Police Federation are disappointing to read. Policing in West Mercia is delivered by hard working police officers and staff that... Local News\nI am committed to a safe and timely firearms licensing system in West Mercia 30th March 2024 I am aware of a BASC campaign ahead of the PCC elections in May. The details of the campaign are here https://basc.org.uk/pcc-elections-make-a-difference-to-the... Local News\nBudget Proposals invest in community policing 30th December 2020 *** I want your views *** As PCC I set the budget for West Mercia #Police and the amount you pay in Council Tax. I am proposing you will pay on average £15 more... Local News\nJohn Campion, West Mercia Police & Crime Commissioner endorses Rt Hon Sajid Javid MP for the Conservative Party Leadership 10th June 2019 John Campion, the Conservative Police and Crime Commissioner for West Mercia has today endorsed Rt Hon Sajid Javid MP to be the next Leader of the Conservative... Local News\nThank you for your support 7th May 2016 I am exceptionally honoured to have been elected as the next Police and Crime Commissioner in West Mercia. Local News\nMinister backs John for Police Commissioner role 3rd May 2016 A Home Office Minister has backed the Conservative candidate to become the new Police and Crime Commissioner for West Mercia on a recent visit to Worcester. Local News\nMPs and Conservative Activists out in force before key Redditch Elections 18th April 2016 John Campion, the Conservative Candidate for West Mercia Police & Crime Commissioner was joined by MPs Karen Lumley and Harriet Baldwin, Economic Secretary to... Local News\nShropshire, Telford and Wrekin MPs endorse John Campions Commissioner bid 10th April 2016 Having a joined up approach in how public services are run is vital. I have a great relationship with the 13 MPs from across West Mercia. It was good to receive... Local News\nCampaign launch for Conservatives in Redditch 10th April 2016 Conservatives in Redditch have simultaneously launched their local and police and crime commissioner election campaigns. Both elections take place on 5 May with... Local News",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_campaigns_supporting-victims-and-survivors/content_12.html": "Supporting Victims & Survivors\nIn my mission to cut crime in West Mercia, I am clear we have to do ever more to support those that have been victim of crime. My commitment is clear, that I will ensure ever more resources and focus is given to supporting victims and survivors.\n- Advocacy - Supporting those that might not otherwise be heard, ensuring the voice and experiences of victims and survivors are at the heart of policing in West Mercia. I have worked hard as PCC since 2016 to ensure victims and survivors are heard, and some progress has been made, but I am resolute that we must do more. Compassion is one of our greatest strengths, and understanding the experiences and views of victims of crime in how we shape policing and the wider criminal justice system is absolutely in the spirit of that quality.\n- Creating a Victims Hub - Ensuring victims of crime get the support they need, when they need it. I will build on the progress of the West Mercia Victim Advice Line, investing further to ensure the support to victims is better coordinated.\n- Specialist Training - Investing in Police Officer training focused on supporting victims. West Mercia Police is made up of dedicated police officers and staff, working hard to tackle crime and support those who have been the victim of crime. I will support their dedication by providing further specialist training to ensure victims and survivors are ever better supported to cope and recover.\n- Keeping Victims Informed - Providing regular and meaningful updates for victims of crime. I hear directly from victims and survivors that they are often frustrated at the perceived lack of timely information in their case. I will ensure West Mercia Police are fully compliant with the Victims Code, and that victims kept informed, through improving processes and the systems that support them.",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_campaigns_secure-west-mercia/content_4.html": "Over the past 8 years I have overseen total recorded crime fall in West Mercia; most recent published figures show it has fallen 7% on the previous year.\nI have overseen the recruitment of over 500 additional officers to West Mercia Police, taking the force to record numbers of police officers.\nI am determined that the communities of West Mercia must feel the full benefit of that investment – where crime falls further, victims are better supported and communities feel safer.\nBuilding on my track record of delivering for West Mercia, I will make sure our investment is maximised by:\nCutting Crime:\n- Safer Town Centres - Expanding dedicated Town Centre Teams with multi-agency plans supporting our town centres to thrive.\n- Safer Homes - Investing in specialist resources to target offenders of domestic abuse, sexual violence and exploitation.\n- Safer Businesses - Working with businesses to prevent crime and ensure they get a robust response when it does happen.\n- Safer Countryside - Enhancing rural teams with more police officers working with rural communities & businesses to tackle crime.\n- Targeting Illegal Drugs - Leading the fight against drugs and the harm it causes in our society.\n- Tackling Organised Crime - Investing in more resources and technology to tackle Organised Crime, targeting those benefiting from criminality.\n- Prompt Investigations - Ensuring West Mercia Police respond promptly to reports of crime and conduct thorough investigations in a timely manner – ensuring more offenders are brought to justice.\nSupporting Victims & Survivors\n- Advocacy - Supporting those that might not otherwise be heard, ensuring the voice and experiences of victims and survivors are at the heart of policing in West Mercia.\n- Creating a Victims Hub - Ensuring victims of crime get the support they need, when they need it.\n- Specialist Training - Investing in Police Officer training focused on supporting victims.\n- Keeping Victims Informed - Providing regular and meaningful updates for victims of crime.\nPolicing back into heart of the community\n- Responsive Policing – Ensuring our police respond quickly to calls from the public. Making sure the public are Informed about crime in their area and what action the police are taking to respond and prevent it.\n- Visible Policing – Redirecting funding for 100 more police officers to bolster Safer Neighbourhood teams. Ensuring all communities have a named local police officer and that they see them in their community more often.\n- Accessible Policing - Improving 101 call response times and online crime reporting.\n- Informed Communities – Making sure the public are informed about crime in their area and what action the police are taking to respond and prevent it.\n- Safer Roads - More specialist roads policing teams to tackle the harm and ASB caused on our road.\nI have consistently delivered on my promise to keep the amount residents pay for policing low, ensuring policing spends the resources it has efficiently and effectively before asking you to pay anymore. I will keep the police element of the council tax below the prevailing rate of inflation.\nWest Mercia Police is made up of hard-working officers and staff; I am resolute in the belief that they and the communities of West Mercia deserve a hard-working Commissioner who is focused on fighting crime, supporting victims and putting policing back at the heart of the community.\nWith your support on Thursday 2nd May, we can continue to build a Safer West Mercia.\nYours sincerely,\nJohn Campion\nPrepared by Election Agent M Bayliss, 28 Bewdley Road North, Stourport, Worcs, DY13 8PS",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_what-are-police-and-crime-commissioners/content_9.html": "Police and Crime Commissioners (PCCs) are the voice of the public, responsible for keeping communities safe. They lead policing and criminal justice in their police force area.\nPCCs set the precept (local tax), budget and resourcing requirement for policing. They determine how policing, criminal justice and community safety should be delivered over a five year period. They hire and, if necessary, fire the chief constable.\nPCCs are expected to connect and engage with local people and to play a direct role in shaping the policing services that local people rely on. They have a significant role in commissioning services to tackle crime and disorder, and for services to victims of crime.\nPCCs have an increasingly important leadership role in working with directors of public health to prevent and tackle drug use, and to provide treatment for addicts so that they and their families can restart their lives. PCCs work with partners to prevent crime and anti-social behavior and to deal with offenders. They have a statutory duty to work with agencies across the criminal justice system to join up disparate agencies and make it deliver better for victims.\nPCCs have a powerful new role in championing the rights of victims of crime across England and Wales. They have discretion to develop different models, befitting the different communities they represent. PCCs are a driving force behind new services and the all-important reform of policing which they were created to deliver.\nA PCC is a leader. PCCs have the opportunity to be innovative, vibrant, passionate advocates for change. They are the people to get things done, to tackle crime and make the justice system work for the public.",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_campaigns_cutting-crime/content_10.html": "Cutting Crime:\nI will continue to focus on cutting crime further. Whilst we have seen crime continue to fall, there is much more to do.\n- Safer Town Centres - Expanding dedicated Town Centre Teams with multi-agency plans supporting our town centres to thrive. Our town and city centres are the hearts of our communities, I will ensure more police resources are based at the heart of our towns, visible and accessible, targeting the prolific offenders of shoplifting and antisocial behaviour.\n- Safer Homes - Investing in specialist resources to target offenders of domestic abuse, sexual violence and exploitation. There continues to be too many incidents of domestic abuse, sexual violence and exploitation, including of children in communities across the three counties. I will continue to focus additional specialist resources to target the offenders of these terrible crimes to bring them to justice, I am will also provide further resources for perpetrator programmes to ensure we help break the cycle of abuse.\n- Safer Businesses - Working with businesses to prevent crime and ensure they get a robust response when it does happen.\n- Safer Countryside - Enhancing rural teams with more police officers working with rural communities & businesses to tackle crime. I hear too often from too many rural communities that they do not see police in their community regularly or understand what their police are doing to tackle local crime. I will continue to invest resources and focus scrutiny to ensure this changes.\n- Targeting Illegal Drugs - Leading the fight against drugs and the harm it causes in our society. I will ensure a whole system approach including targeting those proliferating drugs in our community and ensuring there is support to those with addiction.\n- Tackling Organised Crime - Investing in more resources and technology to tackle Organised Crime, targeting those benefiting from criminality.\n- Prompt Investigations - Ensuring West Mercia Police has the resources and systems in place to respond promptly to reports of crime and conduct thorough investigations in a timely manner – ensuring more offenders are brought to justice.\nMaintaining the confidence of the communities across West Mercia in policing is vital to protecting our country’s ‘policing by consent’ model. I will agree with the Chief Constable a number of service standards, which I will publish, and regularly publish performance against those standards.\nCrime will continue to fall in West Mercia, ensuring our community is safe, and feels safe.",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_category_Assembly-News/content_20.html": "PCC John Campion welcomes report into court delays 19th January 2021 I have long been speaking out and fighting for a justice system that works for victims, witnesses and defendants. I have called on the Government for to take... Assembly News",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_contact/content_13.html": "To contact John in his official capacity as West Mercia Police & Crime Commissioner please email [email protected] or check www.westmercia-pcc.gov.uk for contact details.\nI would like to be kept up-to-date by John Campion on future issues that matter to me:",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_cdn-cgi_l_email-protection/content_29.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_message-home-secretary-priti-patel-mp-ahead-pcc-elections-west-mercia/content_5.html": "I’m proud to have the support of The Home Secretary Priti Patel in my work as your Commissioner.\nWith your support on Thursday May 6th at the PCC elections in West Mercia, I can continue my work to build a Safer West Mercia by working in partnership with Government.\n#conservatives #pccelections2021 #worcestershire #shropshire #telfordandwrekin #herefordshire",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_category_Westminster-News/content_28.html": "John Campion discusses force priorities with Prime Minister and Home Secretary 11th January 2016 John Campion, the Conservative Police and Crime Commissioner Candidate for West Mercia, has met with Prime Minister David Cameron and Home Secretary Theresa May... Westminster News\nAutumn Statement - Police Funding Protected 25th November 2015 Conservative Police Commissioner Candidate welcomes Government Pledge on Police Funding Westminster News",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_privacy/content_15.html": "This document outlines how John Campion processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is John Campion\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact John Campion.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of John Campion, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact John Campion via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_pcc-john-campion-welcomes-report-court-delays/content_26.html": "I have long been speaking out and fighting for a justice system that works for victims, witnesses and defendants. I have called on the Government for to take action, including in a letter to the Home Secretary and Lord Chief Justice in May 2020. My concern about the current situation and associated backlogs in cases as a result of the Covid pandemic are well known.\nI am committed to the needs of victims and witnesses in West Mercia. Any delay can represent further trauma to victims and witnesses and they are likely to suffer avoidable stress and anxiety.\nIn the report, released by the Criminal Justice Joint Inspection (link below) it highlighted ‘grave concerns’ around the potential long-term impact of Covid related court backlogs on the criminal justice system across England and Wales.\nThis report is very welcome as it further highlights the worrying state of the criminal justice system. Any delays in court hearings could be justice denied. The performance prior to the pandemic wasn’t at an acceptable level, and it certainly isn’t now. We need to see the system continue to challenge itself to do better for victims, not just celebrate that ‘it could be worse.\nWe need to start seeing these figures as real people, and as victims and witnesses of horrific crimes who don’t want to have to wait for 13 months to have their case heard. They may even withdraw because they can’t suffer having the process drag out for that long.\nI have pledged to play my part, and I will continue to, for the communities of West Mercia. I recognise the dedication of the staff working within the system to deliver, and I also recognise the situation is worse elsewhere, however I urge the courts to go further and faster for the sake of so many victims and witnesses.\nhttps://www.justiceinspectorates.gov.uk/hmicfrs/news/news-feed/crown-co…",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_category_Speeches-in-Parliament/content_14.html": "Theresa May: There must be no let-up in reform 9th December 2015 The Home Secretary set out in a major speech yesterday her vision for the next stage in police reform. Her challenge to the Chief Constables and Police and... Speeches in Parliament",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_feed/content_8.html": null,
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_about-rss/content_7.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_accessibility/content_19.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_category_Opinions/content_25.html": "Commissioner hopeful pledges to Protect Worcester City Centre Cops 1st February 2016 Conservative Police and Crime Commissioner Candidate John Campion recently discussed the city’s crime issues with Robin Walker MP and pledged to protect the... OpinionsLocal News",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_john-campion-west-mercia-police-crime-commissioner-endorses-rt-hon-sajid-javid-mp-conservative/content_30.html": "John Campion, the Conservative Police and Crime Commissioner for West Mercia has today endorsed Rt Hon Sajid Javid MP to be the next Leader of the Conservative & Unionist Party and the next Prime Minster as nominations open in Westminster.”\nMr Campion says, “As Commissioner I have seen first hand Sajid Javids vision, leadership and drive as Home Secretary and as a constituency MP in Bromsgrove. He not only has listened and understood the support our police service and his community need, he has worked hard to deliver it.”\nJohn added, “The Conservative Party and the Country needs a leader that will deliver Brexit, then get on with delivering vital public service reform and investment. Sajid Javid is the leader my Party and our Country needs, ensuring we boldly leave the European Union to a brighter future of a more prosperous and fairer society.”\nENDS\nNOTES TO EDITORS\nA call for candidates for Leader of the Conservative and Unionist Party will be made at 5pm on Friday 7th June. Nominations will be received from 10am Monday 10th June 2019 and will close at 5pm on the same day. There will be a series of ballots by MPs, with the final two nominations being put to the Party Membership.\nInformation about Sajid Javids Leadership bid can be found here www.teamsaj.com",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_category_Articles/content_22.html": "A message from The Home Secretary Priti Patel MP ahead of the PCC elections in West Mercia 2nd May 2021 I’m proud to have the support of The Home Secretary Priti Patel in my work as your Commissioner. With your support on Thursday May 6th at the PCC elections in... Articles\nMy Plan to tackle Rural Crime in West Mercia 29th April 2021 The three beautiful counties that make up the West Mercia force area have some of the most beautiful countryside in the UK; that countryside is home to many... Articles\nMy Plan to ensure the community is always at the heart of policing in West Mercia 27th April 2021 “Policing by consent” is at the heart of the British model of policing. Maintaining that consent by ensuring there is effective community policing has been at... Articles\nJohn Campion; My Plan for crime prevention 19th April 2021 Over the past five years John Campion as Commissioner has consistently focused West Mercia Police on fighting crime, catching criminals and making our... Articles\nPolice taking action over crime concerns in Shrewsbury Town Centre 13th April 2021 John Campion is seeking to reassure the communities in Shrewsbury that as Commissioner he is confident West Mercia Police are aware and responding to the recent... Articles\nJohn Campion sets out his plan to cut Crime further across the Three Counties 6th April 2021 John Campion has set out his plan to cut crime further with some key commitments to target criminals and keep the communities of West Mercia safe. By relentless... Articles\nMy Plan to make West Mercia’s roads Safer 30th March 2021 I have set out my plan to make the roads in West Mercia safer with some key commitments to tackle deaths and anti-social behaviour on our roads. On average one... Articles\nJohn Campion launches re-election bid for West Mercia PCC 24th March 2021 I have launched my bid as the Conservative candidate to be re-elected as the West Mercia Police and Crime Commissioner. I have today submitted my nomination... Articles\n25 Electric Bikes - latest edition to West Mercia Police fleet 19th March 2021 I am proud that 25 electric bikes will be whizzing their way across West Mercia following my investment as PCC. As part of my wider refer agenda to support the... Articles",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_i-am-committed-safe-and-timely-firearms-licensing-system-west-mercia/content_2.html": "I am aware of a BASC campaign ahead of the PCC elections in May. The details of the campaign are here https://basc.org.uk/pcc-elections-make-a-difference-to-the-future-of-fi…\nI am very proud to work with BASC over my time as PCC. My response to the email template generated can be found below.\nAs the PCC in West Mercia, I can reassure you that I have consistently prioritised over the past 8 years the commissioning of an efficient and effective system of firearms licencing in a part of the country that has a high number of licenced firearms holders. You will also be aware that over that period there has been significant changes to the way firearms are licensed.\nAs PCC, I have continued to shine a light on the experiences of communities facing delays, scrutinise the performance of the Firearms Licensing Unit and taken action by providing significant resources to deliver change.\nTo ensure progress is made without compromising public safety, I invested £460,000 of additional funding into the unit. To maximise the benefits of this investment, I have supported West Mercia Police’s plans to carry out a range of operational changes:\n- More than doubling the number of Firearms Enquiry Officers, who carry out important enquiries and background checks, nine additional officers have already been recruited. New positions have also been created to ensure greater oversight of cases to speed up the process.\n- Changes will also see the rollout of bespoke training for new roles within the department, ensuring recruits are best equipped to understand the latest statutory guidance and systems.\nI hear regularly from residents and local MPs about the firearms licensing delays that many in our shooting communities are experiencing. I am listening and remain committed to ensuring the additional investment I have made available to the force is speeding-up the process while maintaining a focus on public safety.\nI welcome the changes being introduced and will use all the powers available to me to support and challenge the Chief Constable on delivering the promised progress.\nI have consistently held the Chief Constable to account for the performance of licencing of firearms – details of which can be found on my official website (www.westmercia-pcc.gov.uk).\nI trust the above is reassuring to you and BASC members, and my commitment to ensure West Mercia Police has a safe and timely system of licencing firearms in West Mercia.\nKind regards\nJohn Campion\nThe Conservative Candidate for\nWest Mercia Police and Crime Commissioner\nKeep up to date with John's campaign via\nFacebook: Facebook.com/Campion4WestMercia\nWebsite: www.Campion4WestMercia.com\nTwitter: @johnpaulcampion\nPromoted by M Bayliss on behalf of JP Campion, both of 28 Bewdley Road North, Stourport on Severn, Worcs DY13 8PS",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_25-electric-bikes-latest-edition-west-mercia-police-fleet/content_24.html": "I am proud that 25 electric bikes will be whizzing their way across West Mercia following my investment as PCC.\nAs part of my wider refer agenda to support the police to be more visible and accessible to communities and to reduce the impact of policing on our environment, I have allocated £25,000 to fund electric bikes for policing teams across West Mercia.\nThe bikes will enable officers to police harder to reach areas, such as town centres, alleyways and river and canal paths. The bikes will also help improve police visibility as they tackle community concerns like anti-social behaviour and drug use.\nAs Commissioner, I have always promised to ensure that West Mercia Police is as efficient and effective as it can be in tackling the issues that matter most to our communities.\nI have listened when communities have said that they want to see an increase in officer visibility as well as a reduction of the impact of policing on the environment and these additional electric bikes are a great example of this commitment in action.",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_my-plan-tackle-rural-crime-west-mercia/content_31.html": "The three beautiful counties that make up the West Mercia force area have some of the most beautiful countryside in the UK; that countryside is home to many communities, businesses and visitors. I am committed to ensuring that all parts of West Mercia are safe and feel safe. Over the last five years I have developed a Rural Crime Strategy, funded more police officers posted to rural outstations, funded dedicated rural crime prevention officers, funded mobile police stations whilst ensuring West Mercia Police are focused on tackling crime in our rural communities.\nAhead of the Police and Crime Commissioner elections on Thursday 6th May, I have set out a series of pledges to tackle rural crime in West Mercia:\n• Expand the number of dedicated rural crime prevention officers\n• Roll out of “We Don’t Buy Crime Farm Packs” to more rural businesses across West Mercia to reduce thefts from farms and rural businesses\n• Expand network of dedicated wildlife crime officers to tackle issues such as hare coursing\n• Hold West Mercia Police to account for delivering the Local Policing Community Charter to ensure the police are visible and accessible in our rural communities\n• Work more effectively with local councils and communities to tackle illegal Flytipping\nToo many of our rural communities do not feel the benefit of the low crime area we live in, too many still tell me they don’t feel they see enough of the benefit of the uplift in police officer numbers. I remain determined that all communities will continue to hold West Mercia Police to account to ensure they serve all communities in West Mercia.\nI will build on the progress I have made in rural crime prevention to ensure rural businesses across the three counties can be supported to thrive. I will ensure that our rural communities are safe, that they feel safe and have confidence in West Mercia Police.",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_my-plan-make-west-mercias-roads-safer/content_18.html": "I have set out my plan to make the roads in West Mercia safer with some key commitments to tackle deaths and anti-social behaviour on our roads.\nOn average one person a week dies on the roads in West Mercia, cutting short too many lives and ripping families apart with grief. There are too many communities across #Worcestershire, #Herefordshire, #Shropshire and #Telford blighted by the effects of speeding and anti-social use of the roads such as noisy exhausts.\nAs Commissioner over the past five years, I have taken action to reduce the harm caused on our roads by launching a Safer Roads Strategy, recruiting more roads police officers, ensuring the police are targeting speeding drivers.\nI am pledging if re-elected to build on this by:\n- Recruiting more specialist roads policing officers to target those motorists causing the most harm\n- Greater use of technology including introducing Average Speed Cameras on “Highest Harm Routes” across the three counties\n- Ensuring Community Policing team have the resources to work with community to tackle areas of concerns\n- Targeting dangerous drivers with enforcement and education to break the cycle of roads deaths\n- Providing resources to make cycling safer on our roads, including educating drivers and cyclists on how to share our roads safely\n- Targeting more funding for Community Speed Watch, and grants for community speed reduction schemes ensuring the local residents’ priorities are being addressed\nI have consistently heard from the community their concerns about safety on some of our local roads. Too many lives are being prematurely ended on our roads, with families losing loved ones. My pledge is to redouble our efforts to tackle this sad fact. Deaths on our roads must never just be accepted as inevitable – we must make our roads safer.\nI am also committed to reducing other impacts of the anti-social use of our roads including issues such as speeding and noisy exhausts. Too many communities have been blighted by those using their vehicles not having consideration for other residents, including illegally modified vehicles with loud exhausts and street racing. I will ensure the police have the resources and are held to account to reduce the harm associated with our roads.\n#policing #pcc #roadsafety #pccelections",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_about-john-campion/content_3.html": "I was elected as West Mercia Police and Crime Commissioner in May 2016. The role was previously held by an Independent PCC who did not seek re-election.\nI have a broad background in the private and public sector. I was elected as a Wyre Forest District Councillor in 2004, and became the authority’s youngest Leader in 2007. I led the Council through difficult times, including the Icelandic banking collapse, the recession and the subsequent austerity measures. I led the process that envisaged and delivered a new cemetery and crematorium for the District. I led the reinvention of the Council's economic regeneration strategy in response to the recession, which has seen many millions of pounds invested and hundreds of jobs created as a result.\nWhilst Leader I also led a process to reduce the number of District Councillors from 42 down to 33. I am proud that I led a council that managed to reduced its annual spend by nearly a third, whilst minimising the impact on our communities, including centralising the staff on one single site saving £750k pa. When I stepped down as Leader, I was the Council's longest continuous serving leader.\nI was elected as a Worcestershire County Councillor in 2005 and have held a number of roles within the County Council. As a Cabinet Member, I led the process that saw significant budget reductions achieved by the Library Service, whilst maintaining the number of libraries and protecting the service that our communities receive. The model I championed saw the voluntary sector play a much larger role in the running of their libraries. In more recent times I have been given the challenge of working with young people and their families, including tackling the ever rising number of young people we have in care.\nI have a BSc (Hons) in Business Information Systems from Liverpool John Moores University. I have previously worked in private business as well as in the High Security Prison system.\nI enjoy spending time with my family and friends as well as being a keen amateur baker.",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_cookies/content_23.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_my-plan-ensure-community-always-heart-policing-west-mercia/content_32.html": "“Policing by consent” is at the heart of the British model of policing. Maintaining that consent by ensuring there is effective community policing has been at the heart of my work as Commissioner over the past five years.\nAhead of the Police and Crime Commissioner elections on Thursday 6th May, I have set out a series of pledges to maintain that public consent:\n- Named Policing teams for every community in West Mercia, with their names and direct contact details published online\n- Holding West Mercia Police to account for effectively delivering “The Local Police Community Charter” ( www.westmercia.police.uk/SysSiteAssets/media/downloads/west-mercia/publ… ) including ensuring local residents’ priorities are understood and acted upon\n- Ensure West Mercia Police Stations are accessible to the public, including providing “digital front counters” and simple measures such as door bells\n- Expand the number and use of West Mercia Police Mobile Police Stations ensuring policing teams are accessible at the heart of our community\n- Publish Crime Data and Police Performance that is relevant to communities\nI’ve striven as Commissioner to ensure that the community is at the heart of policing in West Mercia. I have made sure West Mercia Police have the resources they need to keep us safe, but my priority is to also make sure we feel the full benefit of that investment with crime falling further and communities feeling safer.\nMaintaining the consent of West Mercia communities for policing means that the force has to ever greater focus on the priorities of the community it serves. As Commissioner I will ensure West Mercia Police are visible and accessible to our community, both out in our community and in police buildings. I will ensure that they are engaged with our communities to understand their concerns and acting upon them.",
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_events_feed/content_16.html": null,
  "https_www_campion4westmercia_com_/https_www_campion4westmercia_com_news_john-campion-sets-out-his-plan-cut-crime-further-across-three-counties/content_21.html": "John Campion has set out his plan to cut crime further with some key commitments to target criminals and keep the communities of West Mercia safe.\nBy relentless focus and shrewd targeted investment as Commissioner over the past five years, John has overseen crime being reduced including burglary by nearly a third. As Police Officer numbers rise, and the structural investment in policing is embedded, now is the time to maximise that investment for the benefit of the communities of Shropshire, Herefordshire, Worcestershire and Telford & Wrekin by cutting crime further.\nJohn has pledged to build on this if re-elected by:\n• Building on the 400 additional Police Officers he has already recruited, by pledging tocontinue to recruit record numbers to ensure West Mercia Police has the highest number of officers it has ever had\n• Building on his record of reducing crime in West Mercia, by maintaining the relentlessly focus on pursuing criminals – giving the police the resources, and holding them to account for tackling those criminals causing the most harm in our society.\n• Ensuring every Community has a visible and accessible Policing team working with them to tackle crime affecting their community\n• Denying the criminals use of our roads with enhanced roads policing\n• Investment in technology including Automatic Number Plate Recognition and specialist digital forensics\n• More Specialist Investigators targeting organised criminals dealing drugs and exploiting vulnerable children and adults\n• More Specialist Police resources focused on confiscating the proceeds of crime – making sure that criminals know that crime will never pay\n• Ensuring West Mercia Police has the resources and a clear plan to tackle rural and business crime\n• Ensuring all victims of crime have regular updates from officers investigating their complaint\nJohn Campion said: “Whilst West Mercia is a low crime area, crime can never just be accepted as inevitable – our community expects and deserves better. Criminals should live in fear of being caught, held accountable for their actions and have the proceeds of their crimes confiscated. I, like our community, expect our police to target criminal behavior, investigate crime, protect the vulnerable and help deliver justice for victims and the wider community. Reports of crime should be taken seriously, proportionate investigations undertaken with victims kept updated. Too often this is not happening, whilst I have made progress as Commissioner to focus our police on fighting crime and holding them to account, now is the time to maximise the benefit of our investment in policing with better service to the community and crime continuing to fall.”\nHe added “To achieve this I will ensure the Police have the resources and focus they need to relentlessly fight crime to keep our community safe. I will continue to hold the Chief Constable to account in an evidenced and professional way to ensure the community has a strong voice at the heart of policing delivering results. Over the past five years I have made progress but there is always more to do. My commitment to the communities of West Mercia is clear – fighting crime will always be at the heart of my mission as Commissioner.”"
}