{
  "https_www_PenistoneReform_UK/https_www_PenistoneReform_UK/content_1.html": "BRITAIN IS BROKEN.\nBRITAIN NEEDS REFORM.\nIt hasn't taken long for Labour to go back on their promises, every commitments and even the word of their manifesto they swore by only a few months ago.\nThey are now imposing their true, extreme left-wing, anti-British agenda upon us and the Conservatives appear to be cheering them on from the side-lines.\nThe only voice of opposition to them is Reform UK. Our 5 amazing patriotic members of Parliament will stand firm in their commitment to stand up for the British people. To put the rights and safety of the British people first and foremost above all else and to get our country back.\nBut the fight isn't over to save our country. We are currently fighting a by-election and could really use your help. If you can lend your time or skills please get in touch. If you want to stand to be a candidate should a by-election arise in your area please let us know. If you can help by chipping in financially then you can click the donate button below. We don't have \"unions\" dolling over thousands of pounds like they do in Labour (who coincidently then happily commit billions of tax payer money to give these same unions huge pay rises and concessions as soon as they gain power).\nWe are just normal people who, through our pure desire to save our country, are willing to put our time, money and effort in to bring about the change our country desperately needs.\nTogether we can get the job done, the last election was a huge success. We did better than we had hoped in every metric. Now is the time to build from this. So get in touch today!\nYours sincerely,\nEdward Dillingham\nReform UK Spokesman\nPenistone & Stocksbridge Constituency\nDONATE\nFrequency\nOne time\nMonthly\nAmount\n£10\n£25\n£50\n£100\n£200\nOther\n0/100\nComment (optional)\nWe are required by law to ensure all donations exceeding £500 are permissible by verifying that the donor is either an individual registered on the electoral register or a UK company. We reserve the right to reject a donation by returning it to source within 30 days of receipt, if we are unable to return funds to source the funds are surrendered to the Electoral Commission.\nDetails of your donation will be retained for compliance purposes. Providing false or misleading information is a criminal offence, we reserve the right to request documentary evidence to ensure the donation is permissible. Name must match exactly as displayed on card. AVS check must pass.\nDonations to political parties are regulated by the Political Parties, Elections and Referendums Act 2000.\nFurther guidance relating to donations can be obtained directly from the Electoral Commission."
}