{
  "https_wakefieldgreenparty_org_uk_crofton-ryhill-walton_/https_wakefieldgreenparty_org_uk_get-involved/content_4.html": "Be part of the change\nWe meet monthly except in August and December. Most of our meetings are currently held on line as this makes it easier for members who have family commitments and transport challenges. It also enables us to include outside speakers on from anywhere in the UK without them having to travel. We have outside speakers on policy and campaigning topics at most online meetings.\nAt least twice a year we meet in person and at least twice a year we get together for just a social get together. On top of this members meet up regularly during election time and over campaigns.\nIf you want to join us for part of a meeting or a social event without joining the Party please get in touch. We are a lively, committed and friendly group of activists including teenagers and pensioners and everything in between.\nOur Area\nWakefield Green Party covers the Parliamentary constituencies of Wakefield, Pontefract & Castleford and Hemsworth, plus Wrenthorpe, Outwood and Stanley which are part of the Morley and Outwood constituency. As well as the local council wards of:-\n- 1 Ackworth, North Elmsall and Upton\n- 2 Airedale and Ferry Fryston\n- 3 Altofts and Whitwood\n- 4 Castleford Central and Glasshoughton\n- 5 Crofton, Ryhill and Walton\n- 6 Featherstone\n- 7 Hemsworth\n- 8 Horbury and South Ossett\n- 9 Knottingley\n- 10 Normanton\n- 11 Ossett\n- 12 Pontefract North\n- 13 Pontefract South\n- 14 South Elmsall and South Kirkby\n- 15 Stanley and Outwood East\n- 16 Wakefield East\n- 17 Wakefield North\n- 18 Wakefield Rural\n- 19 Wakefield South\n- 20 Wakefield West\n- 21 Wrenthorpe and Outwood West\nWe campaign on local, national and international issues and stand candidates in local and general elections.\nJoin the Green Party\nWe welcome all members and however you feel you can contribute, from supporting our online presence, campaigning or standing in an election.\nVolunteer\nEven if you don’t want to make the commitment of joining us, we always welcome supporters and volunteers. Volunteers can help with our campaigning work. Could you help deliver leaflets to your street, or go out with our campaign team and speak to local residents about their concerns?\nDo you have fundraising experience or web design, press, research and administrative skills? Whatever your level of experience and however much or little time you can give, we would love to hear from you.\nContact Kate Dodd by email for more information about ways you can get involved.\nLocal Elections\nIn 2023, we will stand a candidate in every ward. You can help us to achieve this.\nWe need lots of enthusiastic, committed and hard-working candidates. We are particularly keen to ensure diversity amongst our candidates.\nCandidates must be paid-up members of the Green Party and support its main aims and policies.",
  "https_wakefieldgreenparty_org_uk_crofton-ryhill-walton_/https_wakefieldgreenparty_org_uk_our-people/content_5.html": "Officers of the Wakefield Green Party\nCo-ordinator: Kate Dodd – info@wakefieldgreenparty.org.uk\nTreasurer: Ashton Howick\nNominations Officer: Ruth Love\nSocial Media Officer: Dan Russell\nMedia Officer: Lyn Morton\nMembership Secretary: Ollie Watkins\nCo-ordinator: Kate Dodd – info@wakefieldgreenparty.org.uk\nTreasurer: Ashton Howick\nNominations Officer: Ruth Love\nSocial Media Officer: Dan Russell\nMedia Officer: Lyn Morton\nMembership Secretary: Ollie Watkins",
  "https_wakefieldgreenparty_org_uk_crofton-ryhill-walton_/https_wakefieldgreenparty_org_uk_manifesto/content_2.html": "Our plan for change\nWe want faster, more ambitious change to a fairer society, making more sustainable use of earth’s resources and reducing and repairing the damage done to our environment. The major parties in Wakefield are not responding to the climate emergency with the seriousness it deserves, nor are they planning for a fair and just transition to sustainable ways of living for the future. Elected Green Party politicians make a real difference to the pace and fairness of change.\nBetter Quality of Life for All\n- Warmer, more affordable homes; making more use of non-carbon energy sources.\n- Support for reducing the cost of living by providing more reducing, repairing and recycling.\n- Better support for struggling families, and families in crisis.\n- Free WiFi\nFairer, more equal Society\n- Stronger support for cohesive communities, celebrating equality and diversity.\n- Improved social care and mental health provision.\n- More Council support and funding for voluntary sector and food banks\nStronger, Connected Communities\n- More investment in local and village facilities and transport services.\n- More investment in bus, cycle, and electric vehicle transport.\n- Better integrated, and more regular public transport.\n- Safer routes for cycling and walking\nGreener economy\n- More flexible working, and WFH where possible.\n- Active promotion of living wage through Council contracts and procurement.\n- Promoting and investing in lifelong learning for green skills for transition to low/no carbon energy sources.\n- Support for Small Medium Enterprise’s (SMEs) undertaking green energy and digital transition work\nSustainable future\n- Plan for zero-carbon distribution infrastructure and protect employment.\n- Demand new builds and conversions are no-carbon to avoid costly retrofitting.\n- Promote jobs in digital, creative, and green technology.\n- Actively support businesses to transition to carbon neutral.\nGreener city & district\n- Council support for cheaper, and noncarbon energy for all.\n- No new road building unless all greener alternatives have been exhausted and ensure adequate replacement schemes to capture carbon.\n- Provide more play areas, allotments, improved green spaces.\n- Improve and clean up waste disposal, recycling, and water and air quality.",
  "https_wakefieldgreenparty_org_uk_crofton-ryhill-walton_/https_wakefieldgreenparty_org_uk_crofton-ryhill-walton/content_1.html": "We’re ready to do politics differently. See our manifesto\nStanding for change in Crofton, Ryhill & Walton\nI’m Garry. I was born in Wakefield but moved to Derbyshire in 1972 and returned to West Yorkshire in 2007 due to a new job. Fed up with travelling between counties I eventually upped sticks and officially moved to Knottingley in 2008 and finally to Walton in 2021.\nI work as a Quality, Health & Safety and Environmental Manager at a Wakefield manufacturing organisation. My interest in Environmental Management Systems completely changed my views and beliefs and I became a member of the Green Party.\nI have served on the Walton Parish Council since 2022.",
  "https_wakefieldgreenparty_org_uk_crofton-ryhill-walton_/https_wakefieldgreenparty_org_uk_contact-wakefield-green-party/content_3.html": "Contact Email: info@wakefieldgreenparty.org.uk FollowFollowFollow Name *Email Address *Phone NumberMessage Send Message"
}