{
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_manifesto/content_2.html": "for Suffolk PCC\nHome\nMy Manifesto\nBusiness Manifesto\nAbout Tim\nTalk To Tim\nMore\nPlease use the menu below to navigate the manifesto",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_the-workforce-estate-and-dedicated-policing-teams/content_5.html": "The Workforce, Estate and Dedicated Policing Teams\nKeeping the whole workforce content and motivated is vital. Pay and conditions matter and need to encourage career progression and keep staff turnover to a minimum.\n-\nAttending to workforce wellbeing and mental / occupational health will be a central theme and resources provided accordingly. Training and development will be prioritised.\n-\nMore remains to be done on making sure the workforce reflects the demographic and ethnic profile of Suffolk which will have my full support.\n-\nBetter use of scarce natural resources is paramount and reducing our carbon footprint but must not compromise operational policing, emergency response and is affordable. A new estates strategy will be implemented within the next year including pragmatic ways to reduce our carbon footprint and eliminate waste.\n-\nCapital investment to improve performance will be maintained coupled with full economic assessments and business cases.\n-\nFirearms licensing must have sufficient capacity and an advisory board established.\n-\nExpand the Rural Crime team and Kestrel teams to tackle neighbourhood crime including car crime and anti-social behaviour.\n-\nEstablish dedicated teams / initiatives to police retail crime, fraud, town centre security, tourism gangs and illegal drugs.\n-\nRoads policing capacity, including the commercial vehicle unit need more capacity which I will prioritise, because of an increased population, economic recovery and several major infra-structure projects – Sizewell C, Highpoint Prison, military base expansion at Mildenhall and Lakenheath and Freeport East.\n-\nThe volunteer cadet scheme and volunteering options including the Special Constabulary will be expanded as demand increases.",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_contact-and-control-room/content_14.html": "Contact and Control Room (CCR)\nThe transformation of the Control Room (the heartbeat of the Constabulary) will continue to look at all forms of engagement and communication and improve performance.\n-\nThe CCR will remain in Suffolk.\n-\nA new / or upgraded estate facility for the CCR will be planned this year and construction will start as soon as possible (weeks) afterwards. It will be future proofed for the next decade at least using up to date technology whenever possible.\n-\nExamining new options for public engagement with the CCR will be ongoing, building on the successes of the new digital desk, live chat, Single Online Home and web reporting.\n-\nNew methods for reporting crime more easily will be considered and lobbied for accordingly as appropriate.",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_the-criminal-justice-system/content_9.html": "The Criminal Justice System\nThe back log of cases remains high, but progress is being made. The hard work of the judiciary is to be commended and is discussed regularly at the local criminal justice board. The increase in numbers of officers and the new policing model will result in more crime being solved and offenders brought to justice. The public expect to see suitable punishment / sanctions for offenders to act as a deterrent and the needs of victims fulfilled. This will enhance public trust and confidence.\n-\nLack of capacity is a difficulty and access to justice can be compromised for residents on low incomes, remote locations and reliance on public transport. Use of new technology could help. I will continue to lobby for an overhaul of the whole criminal justice system to increase capacity and reduce the courts backlog. I support a Royal Commission to make recommendations for a fit for purpose criminal justice system we can all respect and be proud of.\n-\nRe-offending rates need to be reduced and work with prison authorities, probation services and the voluntary sector presents the opportunity deliver a range of exciting new and innovative initiatives for the rehabilitation of inmates and other offenders.\n-\nI will support alternative forms of sanction / punishment and victim reparation need developing such as Restorative Justice.",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_victims-and-commissioning/content_11.html": "Victims and Commissioning\nHaving successfully campaigned for a variable speed limit on the Orwell Crossing the delays and closures are significantly reduced, but it is still not enough. Suicide prevention schemes are under discussion for example which I hope will add further improvements.\n-\nA new commissioning strategy will be in the next police and crime plan including consideration of an increase in the maximum funding guidance for the Crime Disorder and Reduction Fund.\n-\nViolence against women and girls, domestic abuse and violence, coercive control will continue to be very significant areas of work. More will be delivered on prevention of these crimes.\n-\nMulti-year funding agreements will become mainstream in more situations for victims’ commissioning.\n-\nLooking after victims remains a top priority in the new police and crime plan. The victims code will be offered to all victims and applied when requested.\n-\nOur current arrangement with the Suffolk Community Foundation will continue for crime disorder and reduction grants.\n-\nFurther consideration will be given to support those victims’ charities that deal with hidden harm such as serious sexual offences, domestic abuse and violence, forced labour and modern-day slavery and child sexual exploitation. Hate crime in its various guises will receive more attention.\n-\nThe perils of online exploitation will have a new stay safe online campaign specifically for our young people.\n-\nNew funds will be established for Youth Intervention and Reducing re-offending.",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_performance-and-governance/content_8.html": "top of page\nPerformance and Governance\nThis is a key area of work for all PCCs. Poor governance is never acceptable and can lead to corporate failure in extreme cases.\n-\nA new performance framework to assist with governance and ensuring value for money will be implemented.\n-\nThe regular reports form His Majesty’s Inspector of Constabularies Fire and Rescue Services make recommendations for improving policing in Suffolk. These are important recommendations to consider and must assist in delivery of the new police and crime plan.\n-\nThe annual Force Management Statements will assist in shaping the new Police and Crime Plan.\nbottom of page",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_partnerships-demand-reduction-and-crime-prevention/content_7.html": "Partnerships, Demand Reduction and Crime Prevention\nDemand on our Constabulary continues to rise at an extraordinary rate. The demographic changes and an aging and expanding populations present further challenges.\n-\nThe range of partnership working in Suffolk is second to none and I am committed to expanding this approach, regardless of which economic sector is involved.\n-\nThe school exclusion rate and numbers of looked after and missing children are too high. New multi-agency partnerships will be established to help reduce demand.\n-\nOur Crime Disorder and reduction grants scope and provision will be expanded.\n-\nCommunity Safety Partnerships and responsible authorities are integral to preventing crime. Voluntary organisations such as Neighbourhood Watch, Citizens Advice Bureaus are important partners in this work. Their inputs will be formalised on an annual basis.\n-\nInvolvement of design out crime officers in the planning process should become mainstream for all Suffolk planning authorities.\n-\nThe Roadsafe Board will continue to look at ways to improve road user safety and utilise any unallocated reserves.\n-\nThe joint estates programme with Suffolk Fire and Rescue is one of the most significant nationally. I will actively encourage and explore more joint working and response with SFRS as well as other policing bodies.",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_policing-protests-in-suffolk/content_4.html": "top of page\nPolicing Protests in Suffolk\nManaging protests has a much higher profile and whilst supporting the right to protest it is unacceptable that demonstrations prevent society going about its daily business and should be policed accordingly.\n-\nThe force will do everything possible to deliver the above robustly.\nbottom of page",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site/content_1.html": "top of page\nPutting Suffolk first and keeping Suffolk safe.\nI'm delighted to announce that I will be standing for re-election as the Police and Crime Commissioner for Suffolk.\nMy Key Pledges\nIf re-elected I will continue to do everything I possibly can to:\nPut Suffolk first.\nProtect homes and businesses.\nFocus on victims' needs.\nProvide greater Officer numbers and visibility.\nTarget drug gangs and organised crime groups.\nListen to the public.\nSubscribe\nbottom of page",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_public-trust-and-confidence/content_13.html": "Public Trust and Confidence\nThe new policing model launched last December is working very well and will be reviewed and adapted as necessary on a six-monthly basis. The key advantages of better accessibility, approachability and visibility need developing.\nThe complaints process against officers (internally and externally) often takes far too long to reach conclusions. This is unfair on the individual under investigation and on the complainant. It also can consume large sums of taxpayers’ money.\n-\nPCSOs will remain an important part of the new policing model and their school liaison work will be expanded. The budgeted numbers of PCSOs will remain to support the success of the new policing model.\n-\nAs the numbers of fully trained officers increase uniformed visibility must increase further.\n-\nListening to the public and providing a range of opportunities for dialogue are fundamental to the role of a PCC. New forms of online consultation, social media and discussion will be employed throughout the next term.\n-\nFeedback from our regular public meetings, individual surgeries, talks, presentation and liaison meetings will continue to help hold the force to account and shape future policing work ad budgets for the following financial year.\n-\nThe complaints procedure needs more capacity and should be quicker. The IOPC needs to expedite matters far more quickly and I will lobby for this. I will make sure the force has sufficient capacity to discharge its functions effectively and efficiently.\n-\nFull and comprehensive explanations will be provided for all complaints, including a rationale for the decisions taken in accord with the Victims Code of Practice.\n-\nThere will be a refresh of our bi-monthly public Accountability and Performance panels to help improve force performance, transparency and confidence. The new format will include contract management and procurement decisions.\n-\nThe review of the communication department will be completed within a year with a key requirement to help improve trust and confidence. There will be sufficient capacity provided to deliver this objective.\n-\nThe Stop and Search Reference Group run by ISCRE will continue to have a prominent role in helping scrutinise the use of police powers and thus improving trust and confidence.\n-\nThe voice of business is crucial in helping shape policing in Suffolk. Yearly summits will be held with business membership organisations. Whilst current dialogue is excellent with the NFU, Chambers of Commerce, CLA, SAA and the BIDs I welcome relationships with other key organisations such as the Federation of Small Business, IoD, RHA, CBI and others.\n-\nThe agreed timelines within the internal audit annual plan will be sharpened up and adhered to.",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_my-pledge-to-businesses/content_10.html": "My Pledge To Businesses\nThis election is what is best for policing and crime prevention in Suffolk. I will\nalways put the interests of our county before anything else regardless of\npolitics.\nSupporting business and in particular the private sector is essential for\neconomic growth and wealth generation. The country is struggling under a sea\nof debt, so I pledge to support businesses – large or small. This will be a major\ncomponent of the next Suffolk Police and crime Plan.\nThere is a strong correlation between poverty and lack of opportunity and\nincreased levels of crime, addition, abuse and anti-social behaviour. There\nmust not be any ambivalence towards crime at any time. Equally whilst\noffenders need punishing individuals do deserve a proper second chance to\nredeem themselves and business can certainly assist here.\nWe must also remember that businesses are victims of crime and crime costs\nus all. It must not be tolerated in Suffolk.\nThe overall budget for policing in the current year is £183.2 million and I will\ncontinue to make sure every penny is properly spent. This includes better\nmajor project investment and greater transparency and openness. The audit\ncommittee for both internal and external audit has a crucial role in helping me\nhold the force to account and delivering value for money for the taxpayer.",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_talk-to-tim/content_12.html": "for Suffolk PCC\nHome\nMy Manifesto\nBusiness Manifesto\nAbout Tim\nTalk To Tim\nMore\nReach Me Anytime\nFor press and general inquiries, please fill in the form below:\nThanks for submitting!",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_finance/content_6.html": "Finance\nFinancial performance is generally good, and, in most years, there has been an underspend. The damage done to budgets by Covid and the Ukraine invasion cannot be underestimated. Levels of borrowing are low.\n-\nRaising income from section 106 agreements, Community Infra-structure Levies, various government grants, the pooled business rates fund has huge potential. I will ensure the department is able to maximise these income generation opportunities.\n-\nInvestment of reserves has potential to make greater contributions and will be reviewed accordingly.\n-\nThe Proceeds of Crime act needs amending to provide opportunities for forces to recoup their costs. I will lobby HM Treasury and the Home Office for this.\n-\nFull cost recovery options should be available for policing public commercial events – the law needs amendment, and I will lobby for this via the APCC and relevant government departments.\n-\nProductivity can be improved shrewd investment in technology (facial recognition, data robotics, CCTV, ANPR for example), and better working practices. There will be a review on how productivity can be improved.\n-\nStaff costs are not there to be simply manged downwards and there needs to be proper recognition of the vital work civilians deliver for policing in Suffolk. Ongoing savings will remain part of the annual financial budgeting process.\n-\nLevels of sickness and absenteeism are reducing and the recent progress in this area needs to continue. Numbers of agency staff and vacancies must be minimised. This will be monitored at our regular HR meetings with appropriate actions and timelines documented.\n-\nThe huge (and unjust) variation in Home Office funding per resident across forces needs to be scrapped. Suffolk has the fourth lowest funding per resident in England and Wales taking no account of our large rural area. The campaign for a fairer funding settlement continues until a\nsuitable formula is in place.",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_about/content_3.html": "Hi, I'm Tim Passmore.\nA BIT ABOUT ME\nI was born in Felixstowe in 1959 and have lived in Suffolk all my life. I was educated at Ipswich School and then took a degree in agriculture at Wye College, University of London. My career in practical farming included consultancy work in the UK and abroad, and in rural economic development before I was elected as PCC. I was also elected to Mid Suffolk District Council in 2003 and was the council leader for eight years from 2004.\nI have a business and farming background and am an Eastern Counties rugby union referee. For 27 years I ran the First Eye Scout Troop and fully appreciate the benefits our county has from our vast army of volunteers and charitable organisations.\nMy hobbies include growing English scented roses, cooking and fine British ales. I was an accomplished amateur bassoon player until a serious hand injury in 2010.\nA THRIVING CAREER\nI was privileged to be elected as Suffolk’s PCC in 2012 and\nre-elected in 2021. We are fortunate to have one of the best police forces in the country. Suffolk remains one of the safest areas in England and this encourages economic growth and inward investment. However, there is a clear link between higher levels of deprivation and low social mobility, and increases in crime, abuse, addiction and anti-social behaviour.\nTherefore, if re-elected I will continue to do everything I possibly can to:\n• Put Suffolk first.\n• Protect homes and businesses.\n• Focus on victims’ needs.\n• Cut crime through greater officer recruitment and increasing visibility.\n• Improve public communication and engagement.\n• Work and listen to suggestions for improving community safety, including children.\n• Target drug gangs and organised crime groups.",
  "https_tim4suffolkpcc_wixsite_com_my-site/https_tim4suffolkpcc_wixsite_com_my-site_business-manifesto/content_15.html": "My Business Manifesto\nThis election is what is best for policing and crime prevention in Suffolk. I will always put the interests of our county before anything else regardless of politics.\nSupporting business and in particular the private sector is essential for economic growth and wealth generation. The country is struggling under a sea of debt, so I pledge to support businesses – large or small. This will be a major component of the next Suffolk Police and crime Plan.\nThere is a strong correlation between poverty and lack of opportunity and increased levels of crime, addition, abuse and anti-social behaviour. There must not be any ambivalence towards crime at any time. Equally, whilst offenders need punishing, individuals do deserve a proper second chance to redeem themselves and business can certainly assist here.\nWe must also remember that businesses are victims of crime and crime costs us all. It must not be tolerated in Suffolk.\nThe overall budget for policing in the current year is £183.2 million and I will continue to make sure every penny is properly spent. This includes better major project investment and greater transparency and openness. The audit committee for both internal and external audit has a crucial role in helping me hold the force to account and delivering value for money for the taxpayer.\nFraud\nI will establish a dedicated Suffolk fraud unit with links to other enforcement agencies such as Trading Standards. Preventing and combatting this crime needs to be taken far more seriously locally and nationally and properly resourced.\nProcurement\nSome good progress has been made in making sure Suffolk business benefits from our expenditure on goods and services. This has considerable potential to be increased by raising the level of social value as part of tendering and contract processes. I am totally committed to this process – Suffolk’s interests must be a top priority. A great opportunity for self-help using taxpayers’ money.\nRural Crime\nAs in the main manifesto the focus on rural business crime needs further development so I will expand the current rural wildlife and heritage crime team. As chairman of the National Rural Crime Network, I am committed to delivering the network’s 10-point action plan following the acclaimed report into the effects of organised crime groups in the countryside. The damage caused by illegal fly-tipping needs a far more vigorous and tough response including deterrent sentencing for offenders.\nSuffolk has one of the highest levels of firearms ownership nationally. The licensing team is run jointly with Norfolk Police and must have sufficient capacity to issue and renew firearms licenses in a timely way. An independent oversight group can assist with making sure standards are maintained without compromising public safety. Organisations with specific expertise will be invited to take part such as the British Association for Shooting and Conservation.\nBorder Control and Port Security\nOur county has a long and vulnerable coastline and is home to the largest national container port in Felixstowe as well as the major ports of Lowestoft and Ipswich. There are also many smaller ports and marinas which can act as a conduit for illegal immigration and organised crime groups such as the illegal\ndrugs trade. Border Force needs to take this issue much more seriously in Suffolk and it is time the Home Office recognised this. Biosecurity is another weakness to be addressed.\nPlant Machinery and Vehicle Theft\nTheft of items such as GPS kits, agricultural machinery and construction equipment can be ruinous for too many of Suffolk’s businesses. NaVCIS (National Vehicle Crime Intelligence Service) have had some excellent results at Port of Felixstowe for identifying stolen machinery and high value vehicles. Whilst not a Suffolk funded policing body it has a vital role to combat organised crime groups locally and nationally. The organisation is woefully under-resourced and this needs to be prioritised by the Home Office.\nRoads Policing\nFree flowing traffic is vital for Suffolk Businesses. Having a well-equipped and properly resourced roads and armed response capability will never be compromised whilst I am PCC. I am 100% committed to supporting campaigns for the A14, A12 and A11 improvements. National Highways provide very little traffic officer support for Suffolk because none of our roads are motorways. This is unacceptable and the Department of Transport needs to change this short-sighted approach.\nIncreased patrols will help reduce issues such as fuel theft and lorry-jacking. The new Commercial Vehicle Unit is delivering excellent results and the multi- agency days of action are fundamental to removing criminality from our roads and can be expanded into other areas countywide. I will also ensure the vehicle fleet is fit for purpose.\nOrwell Crossing Closures\nHaving successfully campaigned for a variable speed limit on the Orwell Crossing the delays and closures are significantly reduced, but it is still not enough. Suicide prevention schemes are under discussion for example which I hope will add further improvements.\nFreeport East, Sizewell C and USAF Military Base Expansion\nThese significant inward investment projects will provide a major stimulus to our local economy. Adequate policing resources will be provided and are already being planned to ensure their safe and successful conclusion. Serious and Organised Crime\nThe threat in Suffolk is currently quite low but we cannot be complacent. The role of the National Crime Agency and Eastern Region Special Operations Unit makes powerful contribution to crime reduction in Suffolk. Threats from County Lines and Gangs are ever present and strong local policing units\ncomplement this work. Establishing dedicated teams to combat the drugs trade in particular is desirable.\nInvestment in Technology and Cyber Crime Unit\nIncreasing the coverage of ANPR (Automatic Number Plate Recognition) will help keep Suffolk safe. Body worn video cameras, digital forensics, robotic data extraction, DNA evidence have all made huge contributions in keeping crime levels low. Nearly all crime has a digital footprint and investment in our cyber unit will be maintained.\nI see no reason why WhatsApp technology cannot be used more widely and expect the Police Digital Service to work with private sector bodies to progress this.\nTown Centre Management and Retail Crime\nApart from our major towns Suffolk has many delightful market towns which all need policing. PCSOs have a crucial role in providing public confidence and reassurance. Numbers of PCSOs will be maintained and directly funded PCSOs are to be encouraged along the successful initiatives in place such as Ipswich, Bury St Edmunds and Lowestoft.\nShop lifting is theft and is not to be tolerated in any circumstance. Thieves must be caught and prosecuted. Developing more town centre policing teams similar to the successful Kestrel teams will be delivered.\nOffences against retail staff is totally unacceptable. Offenders need to be prosecuted and punished accordingly – a top priority.\nRelationships with Business Improvement Districts are strong and particularly helpful, especially for small businesses. Looking at easier ways to report crime will be examined along with colleagues from the BIDs – for small self-employed and independent retailers the reporting procedure is time consuming and cumbersome and must be changed.\nDays of action to act as a strong deterrent will help town centre security building on successful multi agency initiatives.\nPartnerships and Joint Ventures\nTackling business crime involves all of us so partnership working is critical whilst progress can be frustrating. Using the powers of duty to co-operate more can be done to improve results. Joint ventures between business and policing / private sector organisations will be seriously considered for future\nprojects where appropriate so the expertise of the private sector can be harnessed appropriately.\nThe new Digitech Centre, Adastral Park and the importance of evidence through academic research can really help progress crime reduction and prevention initiatives and is to be encouraged. Even greater use of their collective capabilities can provide exciting future opportunities.\nPolicing Protests\nWhilst I support the right to protest it is unacceptable (and sometime dangerous) for protests to disrupt or intimidate people going about their lawful daily business. Suffolk police must ensure this happens and will have my full support.\nBusiness Engagement and Communication\nThe major Control Room investment is now paying dividends. The speed to respond to calls received during the last six months has witnessed a transformation in the level of service with Suffolk now ranked 7th out of 43 forces.\nListening to the voices of business is fundamental. I will continue to engage with business groups whenever possible and act on your ideas and concerns accordingly.\nThe current re-design of the communication team needs to ensure there is sufficient capacity so external communication is proactive and employs new channels and innovative techniques.\nGood and effective communication remains an absolute priority.\nThe Estate and Environmental Impact\nBetter use of scarce natural resources and reducing environmental impact (including carbon footprint) is another key component of the next Police and Crime Plan.\nThe aspiration to reduce carbon footprint is progressing well. However, operational effectiveness and efficiency cannot be compromised in our emergency service so a pragmatic approach will be taken. Considerable changes will be needed to our estate and for the vehicle fleet electrification may well be very beneficial, but we should not ignore hybridisation or hydrogen technology. Recent developments by JCB are encouraging and Hydrogen East could be a significant player. Running pilot projects will be considered - rural policing requirements are very different from urban areas.\nThe built estate needs continual investment and improvement following detailed assessment on what is required. There will be a new built estate strategy which will deliver facilities that are fit for purpose for the next 25 years or so."
}