{
  "http_www_gavinwilliamson_org_/http_www_gavinwilliamson_org/content_1.html": "My Campaigns\nAm I your MP?\nEnter your postcode\nSign up to my newsletter\nKeep in touch on Facebook\nStone, Great Wyrley and Penkridge\nSee activity from Gavin in the area.\nFollow me on Twitter\nContact\nConstituency Enquiries\nHaling Dene Centre, Cannock Road, Penkridge, Stafford, ST19 5DT\n01785 847027",
  "http_www_gavinwilliamson_org_/http_www_gavinwilliamson_org_cdn-cgi_l_email-protection/content_8.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_gavinwilliamson_org_/http_www_gavinwilliamson_org_news_category_Speeches/content_5.html": "Gavin participates in Living Streets panel discussion on making streets pedestrian friendly 3rd October 2013 Gavin Williamson, MP for South Staffordshire, took part in Living Streets’ ‘ Beyond Portas: Can walking friendly places save the high street?’ panel discussion... Speeches",
  "http_www_gavinwilliamson_org_/http_www_gavinwilliamson_org_news_gavin-attends-stone-st-georges-day-event/content_4.html": "Sir Gavin Williamson attended Stone’s St George’s Day event on Saturday, 26th April to celebrate national identity and heritage.\nThe event, organised by Stone Town Council and a number of hardworking volunteers, provided spectacular entertainment with a parade as well as a thrilling battle between St George and the Black Knight.\nThere was also a medieval fancy dress costume for children, various stalls, and other entertainment for the whole family to enjoy.\nSir Gavin said: “I was delighted to join in the celebrations to mark St George’s Day in Stone and see a fantastic parade and re-enactment.\n“It was wonderful to see many people enjoying a brilliant event, with the community coming together and marking an important day in our calendar.\n“St George’s Day is an excellent way to promote our culture and national identity. It was great to see people of all ages coming together to fly the flag and learn historical moments in our nations history.\n“I would like to thank Stone Town Council and all of the amazing volunteers for their hard work in organising such a special event.”",
  "http_www_gavinwilliamson_org_/http_www_gavinwilliamson_org_news_category_Reports/content_6.html": "Gavin welcomes growing employment 13th November 2013 Gavin Williamson has welcomed today's announcement by the Office for National Statistics that the number of people in work has increased by 177,000 this quarter... Reports",
  "http_www_gavinwilliamson_org_/http_www_gavinwilliamson_org_news_gavin-celebrates-aerospace-industry/content_7.html": "Sir Gavin Williamson attended a Parliamentary event to celebrate the aviation industry which is boosting Staffordshire’s economy and creating hundreds of jobs.\nTwelve aerospace organisations with a UK presence took part in the Aerospace Manufactuer Parliamentary Event, hosted by trade association ADS. This included Collins Aerospace, which employs hundreds of people in Staffordshire and wider West Midlands.\nThe event provided MP’s and industry leaders with an excellent opportunity to discuss the latest innovations in aerospace and hear about the value this sector brings to communities.\nFigures released by ADS shows that in 2023, the UK aerospace sector was worth £10.3 billion to the UK economy and turnover was £30.5 billion.\nBalaji Srimoolanathan, ADS Director Aerospace & Space, said: “The UK’s aerospace sector is a world leader in aerospace technology, from developing the aircraft wings of the future to advanced propulsion.\n“It was encouraging to welcome almost 40 political stakeholders at ADS Aerospace’s Manufacturers Parliamentary drop-in, which showcased some of the world leading UK aerospace innovation, convening decision makers on the challenges and opportunities our sectors face every day.\n“We look forward to continuing our work in supporting our fellow parliamentarians such as our ongoing sponsorship of the Future of Aviation, Travel, and Aerospace APPG, which ensures our UK aerospace sector has the support it needs to remain a world leading sector whilst delivering economic security and prosperity to the whole of the UK.”\nSir Gavin said: “I was delighted to meet with leading UK aerospace companies who contribute significantly to Staffordshire’s economy by increasing manufacturing, investing in skills, and creating jobs for so many.\n“As the sector looks to decarbonise, I strongly welcome further investment to unlock opportunities for local people, and it is reassuring to see the sector aim for net-zero in an innovative way that looks after the best interests of its employees.\n“I remain committed to supporting the UK aerospace sector in driving decarbonisation and developing the green industrial workforce, whilst being mindful of ensuring such policies do not affect employment and supply chains.”",
  "http_www_gavinwilliamson_org_/http_www_gavinwilliamson_org_news/content_2.html": "Gavin urges national inquiry into child grooming scandal Thursday, 1 May, 2025 Sir Gavin Williamson is urging the Government to launch a full National Inquiry into child sexual grooming. In January, Labour voted against an amendement to launch a National Inquiry as part of the Children’s and Schools Wellbeing Bill. The amendment called on the Government “to develop new legislative proposals for children’s wellbeing including establishing a national statutory inquiry into... Articles\nGavin commits to standing up for MS sufferers 28th April 2025 Sir Gavin Williamson is marking Multiple Sclerosis (MS) awareness week (28th April to 4th May 2025) by urging the Government and health authorities to focus on... Articles\nGavin attends Stone St George’s Day Event 26th April 2025 Sir Gavin Williamson attended Stone’s St George’s Day event on Saturday, 26th April to celebrate national identity and heritage. The event, organised by Stone... Articles\nGavin calls for urgent WMI action 24th April 2025 Sir Gavin Williamson is urging the bosses of the West Midlands Interchange (WMI) scheme to urgently clarify when works on the A449 will be completed as... Articles\nGavin attends Stone Traders Event 16th April 2025 Sir Gavin Williamson attended Stone Traders’ AGM and social event as he continues to offer support to businesses across Staffordshire. Stone Traders are a group... Articles\nGavin visits Institute of Technology to chart construction progress 14th April 2025 Sir Gavin Williamson visited Stafford College’s Institute of Technology (IoT) to witness first hand the excellent progress that is being made on the £22.5... Articles\nGavin celebrates aerospace industry 3rd April 2025 Sir Gavin Williamson attended a Parliamentary event to celebrate the aviation industry which is boosting Staffordshire’s economy and creating hundreds of jobs... Articles\nGavin hosts a roundtable with Staffordshire NFU Members 1st April 2025 Sir Gavin Williamson hosted a roundtable with Staffordshire NFU members as farmers continue to be drastically affected by the Government’s punitive policies... Articles\nGavin joins Stone Spring Clean 25th March 2025 Sir Gavin Williamson joined dozens of Stone residents as part of the Town’s Spring Clean to bring communities together and maintain appeal for visitors and... Articles\nGavin backs community pharmacies in Staffordshire 18th March 2025 Sir Gavin Williamson recently met with Staffordshire based pharmacies in Parliament to support their work and to campaign for greater transparency regarding... Articles",
  "http_www_gavinwilliamson_org_/http_www_gavinwilliamson_org_campaigns/content_3.html": "Calling on the Government to scrap tax increases for farmers I am concerned about the Government’s plans to tax farmers leaving their farm to their family. This move would not affect “wealthy landowners”. In fact, the...\nWhat can I do for you? As your Conservative Candidate, it is incredibly important that I stand up for the issues that matter to people in Staffordshire. That’s why I have recently...\nProtecting the Green Belt Like many of you, I was shocked and concerned by plans to build 1,900 new houses on Green Belt land between Linthouse Lane and Kitchen Lane in Essington. I...\nOpposing Preston Hill Solar Farm Many of you have been in contact with me to express your anxiety at plans to build a solar farm in Penkridge. I wholeheartedly share your concerns: this...\nFighting Bank Closures Across Staffordshire, there is a concerning trend towards the closure of banks. This can have devastating consequences for the vulnerable and the elderly, who...\nPushing Back Against the Reckless Use of Asylum Hotels in Staffordshire I share my constituents' real anger at the reckless use of hotels and student accommodation to house asylum seekers. I am concerned about the harm this policy...\nClamping Down on Crime I’m proud to share with you the success we’ve had with Operation Bormus, an initiative the Staffordshire police have undertaken to clamp down on vehicle crime...\nWorking to abolish the Duty to Cooperate Currently, the duty to cooperate – which demands local authorities cooperate with each other on planning and other strategic matters – is leading to thousands...\nSUCCESS: The end of mandatory housing targets that damage our Green Belt Mandatory housing targets have historically led to housing being forced onto Green Belt, regardless of local concerns. I have campaigned for the preservation of...\nSUCCESS: Barclays Bank to keep a presence in Codsall and Bilbrook I am glad to share some good news around Barclays continued presence within Codsall and Bilbrook. During the summer of 2022, Barclays announced their plans to..."
}