{
  "https_ccarubia_wixsite_com_4wirralsouth/https_ccarubia_wixsite_com_4wirralsouth/content_1.html": "top of page\nHello,\na bit about me:\nIt is an honor and a priviledge to represent the Eastham ward that I live in as one of its Councillors.\nAfter eight years working closely in the heart of our community, and within the wider borough, I believe that I have gained the knowledge and experience to represent all of our residents as your Member of Parliament for Wirral South.\nbottom of page",
  "https_ccarubia_wixsite_com_4wirralsouth/https_ccarubia_wixsite_com_4wirralsouth_contact/content_2.html": "HOME\nRESUME\nCAMPAIGNS\nPHOTO'S\nMEDIA\nCONTACT\nMore\nT: 07720847265\nchriscarubia@wirrallibdems.com\nFollow me\n© 2023 by Chris Carubia.\nSuccess! Message received.",
  "https_ccarubia_wixsite_com_4wirralsouth/https_ccarubia_wixsite_com_4wirralsouth_campaigns/content_5.html": "top of page\nSuccessful Campaign to give emergency services free travel through Mersey Tunnels - Aug 2015\nA campaign was launched to give emergency vehicles free travel through the Birkenhead and Wallasey Tunnels saving the Blue light services upward of £185,000 per year.\nParking Charges in our Country Parks.\nThe largest petition ever received (at that time) by Wirral Borough Council from residents against this proposal presented by me and a Tory councillor from Wirral West, was ignored and ruled out by the Labour run administration. This is still being disputed, and the hope is that the decision will soon be overturned.\nSaving Our Walk-in Center\nWe have successfully stopped our walk-in center from being closed now Twice. This U-turn from the CCG was brought about by a lot of hard work from all parts of the community and a cross party effort proving that working together can produce great results.\nTo see more or discuss possible work let's talk >>\nbottom of page",
  "https_ccarubia_wixsite_com_4wirralsouth/https_ccarubia_wixsite_com_4wirralsouth_media/content_4.html": "top of page\nThis site was designed with the\n.com\nwebsite builder. Create your website today.\nStart Now\nLIBERAL DEMOCRAT\nParliamentary Candidate\nWirral South\nCHRIS\nCARUBIA\nHOME\nRESUME\nCAMPAIGNS\nPHOTO'S\nMEDIA\nCONTACT\nMore\nUse tab to navigate through the menu items.\nbottom of page",
  "https_ccarubia_wixsite_com_4wirralsouth/https_ccarubia_wixsite_com_4wirralsouth_resume/content_6.html": "top of page\nAnchor 1\nProfessional\ninfo\nI began my working life by succefully completing a 4yr indentured electrical engineering apprenticeship for a company based in Birkenhead. Following the depression in the construction industry in the late eighties I returned to education to undertake a degree from Sheffield University in Infomatics, a hybrid degree in information technology and business management.\nI worked as a consultant for companies such as Compaq, IBM and Toshiba before taking a post with a large global company in Finland who sent me to the Cranfield School of Management to further my managerial accreditations as I traveled and worked for them across Europe, the Scandinavian countries, the USA and Canada before accepting an IT Directors role with an American/Israeli Firm.\nI am currently serving my second term as the Councillor for the ward of Eastham in Wirral South where I have lived for over fifty years.\nLibDem Dept Leader and spokesperson for the Children and Family's and Education committee, along with a seat on the looked after children's corporate parenting board.\nI Chair Wirral's anti slavery group and sit on the Merseyside Pensions Fund, one of the largest funds in the country.\nChair of Governors in my local primary school and I have held a weekly advice surgery at the local library for over seven years helping residents from not only Eastham but from Bromborough, Bebington, Clatterbridge, New Ferry and as far afield as Birkenhead.\nWirral\nCouncillor\nElections\nI have succefully fought two local elections.\nOne to gain my seat on the council and the second to defend it which I did with over 50% of the vote.\nI stood for the Merseyside Police and Crime Commissioner in 2016 increasing our vote from %3 to %13.4 with just under 35,000 votes. and have previously fought a general election.\nbottom of page",
  "https_ccarubia_wixsite_com_4wirralsouth/https_ccarubia_wixsite_com_4wirralsouth_photo-s/content_3.html": "top of page\nThis site was designed with the\n.com\nwebsite builder. Create your website today.\nStart Now\nLIBERAL DEMOCRAT\nParliamentary Candidate\nWirral South\nCHRIS\nCARUBIA\nHOME\nRESUME\nCAMPAIGNS\nPHOTO'S\nMEDIA\nCONTACT\nMore\nUse tab to navigate through the menu items.\nbottom of page"
}