{
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2024_06_04_thank-you-for-all-the-support/content_14.html": "Olga’s dedication to our community has only grown through standing in the elections.\nThis year’s council elections in Chorley South West saw a repeat success and put Olga Cash and the Green Party in second place again.\nOlga said: “I am grateful for every single vote cast for me. Being a Green Party candidate is all about turning challenges into opportunities on the journey of bringing positive change for all – 562 votes is a great result for us to build on.”\nSince she stepped up last autumn to be your Green Party candidate, Olga has enjoyed meeting so many of you and working together on improving our area. She will continue to offer a credible, hardworking, and community-minded alternative to Labour or the Conservatives.\n“My dedication to our community has only grown through standing in the elections,” Olga added. “I am looking forward to getting out and speaking to you again. If you need anything, please get in touch!”",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_contact/content_36.html": "Skip to content\nSkip to footer\nChorley\nMenu\nNews\nAbout us\nOur People\nLocal Links\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nContact Us\nHome\nContact Us\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2021_01_03_happy-new-year-from-chorley-green-party/content_29.html": "2020 was difficult for many of us – many people lost loved ones, many felt isolated, many lost their jobs.\nSome of us have seen positives too – communities coming together to support the most vulnerable, spending more time exercising or enjoying nature, or finding time to learn new skills.\nThough nothing changed at the stroke of midnight on New Years’ Eve, there is hope that the vaccines currently being rolled out will bring brighter days by Spring and 2021 may be a very different year from 2020.\nAt Chorley Green Party we’ve adapted and found new ways to keep going during 2020. We’ve moved our meetings and events online, we’ve managed to do some work in our communities in socially distanced ways and we’ve continued to grow in numbers, though we are looking forward to when we can be together in person again!\nWishing you all the best for 2021 from all of us at Chorley Green Party!",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_chemical-spraying/content_48.html": "Council to Stop Spraying Dangerous Chemicals 22nd May 2020 / 23rd June 2024 by Council to end use of glyphosates after receiving Green Party petition Last November, around 800 people signed Chorley Green Party’s petition for the council to stop spraying dangerous pesticides in public spaces. Glyphosates are used by the council as a weed-killer, and have already been banned in several countries. There is increasing evidence that they […] Read more » chemical spraying chorley environment petition",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2025_04_06_a-busy-spring-2025/content_12.html": "Campaigning is underway to elect Green Party Lancashire Councillors. Our Chorley Green Party members and volunteers have been out and about (even more than usual!) over the last few weeks, talking to local people and supporting other local causes such as the Save Chorley A&E campaign. Our membership is growing quickly – join us! For more information on all our Green candidates, look here.\nLancashire County Council election – 01/05/2025",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2024_06_22_action-day-ledbury/content_9.html": "Chorley Green Party supporters travelled to Herefordshire on 22nd June to help with campaigning there. It was an early start but a great day working on the Greens’ campaign to get Ellie Chowns elected in North Herefordshire. Lots of Vote Green posters on display! Get yours here or contact Chorley Green Party.\nThe Green Party regularly hold National Action Days where members from all over the country can join in and help out.\nTo find out more about National Action Days, look here.\nChorley Greens also hold Action Days! Check out our Action Network page to see details of the latest events, and sign up to get emails when new Action Days are organised.\nSign up for a national or local Action Day and let’s get Greens elected! Find out about our crowdfunder here.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_county-elections/content_6.html": "OUR VOTE GREEN posters are appearing! 15th April 2025 / 15th April 2025 by Sef_C In Chorley this week we saw Green Party posters in lots of windows., April 2025. Read more » chorley Chorley South West Coppull County Elections Olga Cash\nA busy Spring 2025 6th April 2025 / 6th April 2025 by Sef_C Campaigning is underway to elect Green Party Lancashire Councillors. Our Chorley Green Party members and volunteers have been out and about (even more than usual!) over the last few weeks, talking to local people and supporting other local causes such as the Save Chorley A&E campaign. Our membership is growing quickly – join us! For […] Read more » chorley County Elections Olga Cash",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_action-day/content_38.html": "Action Day Brighton! 22nd June 2024 / 23rd June 2024 by Sef_C Madeleine Houghton from Chorley Green Party travelled to Brighton to join in with campaigning there on 22 June. As well as meeting with lots of other Green supporters, Madeleine also sent us these surprise celebrity snaps. Actor and comedian Steve Coogan joined campaigners to show support for Sian Berry, the candidate for Brighton Pavilion. Read more » Action Day General Election volunteer\nAction day Ledbury! 22nd June 2024 / 23rd June 2024 by Sef_C Chorley Green Party members went to Herefordshire to help with campaigning there. It was an early start but a great day working on the Greens' campaign to get Ellie Chowns elected in Herefordshire. The Green Party regularly hold National Action Days where members from all over the country can join in and help out. Read more » Action Day General Election Mark Tebbutt Olga Cash volunteer",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2024_06_16_voting-green-in-the-general-election/content_65.html": "Register to Vote by 18 June 2024\nA General Election has been called for 4 July 2024. Register to vote by 11:59pm on 18 June 2024.\nhttps://www.gov.uk/register-to-vote\nIf you have not already registered to vote in the General Election, the deadline is 18th June 2024 – or 19th June to register for a postal vote. Register here.\nRemember Your Voter Photo ID\n14,000 people were turned away at polling stations during the 2023 local elections in England – because they did not bring with them an acceptable form of voter ID . (Source ) Since May 2023, voters in England and Wales have been required to bring photo ID. 4th of July 2024 will be the first time voters must bring photo ID for a General Election.\n“Voters in England need to show photo ID to vote at polling stations in the UK Parliamentary general election on 4 July. If you don’t have accepted photo ID, you can apply for a free voter ID document, which is known as a Voter Authority Certificate. The deadline to apply for a Voter Authority Certificate to vote in the Parliamentary general election on Thursday 4 July is 5pm on Wednesday 26 June.”\nhttps://www.electoralcommission.org.uk/voting-and-elections\nSee their full guidance here.\nAccepted forms of ID\nAcceptable types of photo ID include a UK driving licence, UK passport, Older Person’s Bus Pass funded by the UK Government, or a Blue Badge. See the full list here. You only need to show one form of photo ID. It needs to be the original version, and not a photocopy or a digital version.\nIf you don’t have an acceptable photo ID\nApply for a Voter Authority Certificate by 26 June here.\nA proxy vote If you know you won’t be able to vote in person, you can get a proxy vote, which means you ask someone you trust to cast your vote for you. You can even get an emergency proxy on the day of the election itself. Find out more.\nRemember the deadline to register to vote in the General Election is 18th June 2024. Register here.\nSupport Chorley’s Green candidate Mark Tebbutt\nUnlike Labour and the Conservatives, we do not receive huge donations from trade unions, big business and the super rich. We rely on donations from individuals like you to support our grassroots campaign. All donations made will go towards Mark’s deposit as well as supporting election literature to be delivered to all households in Chorley so that our message can reach residents across the constituency. Support Mark here.\nInformation on this page has been drawn from the website of The Electoral Commission, the independent body which oversees elections in the UK. See their website for more.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_news_page_2/content_15.html": "Thank you for all the support! 4th June 2024 / 4th June 2024 by Sef_C This year’s council elections in Chorley South West saw a repeat success and put Olga Cash and the Green Party in second place again. Read more » chorley Council Election Olga Cash\nMark Tebbutt is Green Party candidate for Chorley on 4th of July 3rd June 2024 / 27th June 2024 by Sef_C Chorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election. Mark was selected by Green Party members in a vote in December 2022. Read more » chorley General Election Mark Tebbutt\nGreen Party Select local air pollution campaigner as candidate for next General Election 17th January 2023 / 27th June 2024 by andyhr Chorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election. Read more » chorley General Election Mark Tebbutt\nWarm, affordable homes must be a key part of Council climate strategy, say Greens 29th March 2022 / 23rd June 2024 by andyhr In 2019, Chorley Council declared a Climate Emergency and pledged that the borough would be carbon neutral by 2030. The Council are consulting at the moment on a draft Climate Change Strategy and the local Green Party are concerned about the pace of progress, and about the emphasis of the report. “Chorley Green Party fully […] Read more »\nLetter – Local and National Government are Failing Us on Climate Change 18th August 2021 / 23rd June 2024 by andyhr Last Monday the Intergovernmental Panel on Climate Change (IPCC) released a report described by the UN chief as a “code red for humanity”. It said we are changing the planet in “unprecedented and sometimes irreversible ways”. In a year in which we have seen record breaking heat waves, floods and wildfires around the world it’s […] Read more »\nChorley Green Party stand a record number of candidates 14th March 2021 / 23rd June 2024 by andyhr Chorley Green Party have launched their local election campaign to get Councillors elected to the Borough and County Councils, and they are putting forward candidates in every ward for the upcoming May 6th local elections. Andy Hunter-Rossall, Coordinator of Chorley Green Party, said “I’m so pleased to be part of a team of 22 Green […] Read more »\nControversial Weed Killer Still Widely Used in Chorley 5th February 2021 / 23rd June 2024 by andyhr In 2019 almost 1000 people signed a Chorley Green Party petition to Chorley Council calling for them to stop spraying Glyphosates in public spaces. In March 2020 Chorley Council introduced thermal weeding equipment and committed to reducing the amount of glyphosates used. Chorley Green Party Coordinator Andy Hunter-Rossall has been checking in on progress against […] Read more »\nHappy New Year from Chorley Green Party 3rd January 2021 / 23rd June 2024 by andyhr 2020 was difficult for many of us – many people lost loved ones, many felt isolated, many lost their jobs. Some of us have seen positives too – communities coming together to support the most vulnerable, spending more time exercising or enjoying nature, or finding time to learn new skills. Though nothing changed at the […] Read more »\nGreens call on supermarkets to protect against stock piling 4th November 2020 / 23rd June 2024 by andyhr News of a second lockdown across England was announced over the weekend and with it came concerns of access to groceries. Chorley Green Party are calling on supermarkets to urgently limit sales of baby formula amid worries of limited supplies for parents. In spring we saw necessary products such as this sell out fast leaving […] Read more »\nChorley A&E Remains Closed 23rd October 2020 / 23rd June 2024 by andyhr UPDATE – since this story was first published in print, a new opening date for the A&E service has been annouced. The service is due to return from 8am to 5pm from 2nd November. A&E services were due to return to Chorley on 28th September. But a week before the planned reopening, Lancashire Teaching Hospitals […] Read more »",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_petition/content_64.html": "Council to Stop Spraying Dangerous Chemicals 22nd May 2020 / 23rd June 2024 by Council to end use of glyphosates after receiving Green Party petition Last November, around 800 people signed Chorley Green Party’s petition for the council to stop spraying dangerous pesticides in public spaces. Glyphosates are used by the council as a weed-killer, and have already been banned in several countries. There is increasing evidence that they […] Read more » chemical spraying chorley environment petition",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_chorley/content_7.html": "OUR VOTE GREEN posters are appearing! 15th April 2025 / 15th April 2025 by Sef_C In Chorley this week we saw Green Party posters in lots of windows., April 2025. Read more » chorley Chorley South West Coppull County Elections Olga Cash\nA busy Spring 2025 6th April 2025 / 6th April 2025 by Sef_C Campaigning is underway to elect Green Party Lancashire Councillors. Our Chorley Green Party members and volunteers have been out and about (even more than usual!) over the last few weeks, talking to local people and supporting other local causes such as the Save Chorley A&E campaign. Our membership is growing quickly – join us! For […] Read more » chorley County Elections Olga Cash\nThank You Chorley 5th July 2024 / 11th July 2024 by Sef_C Thank you to all our voters in Chorley for giving us our best result yet in a General Election by voting for Green candidate Mark Tebbutt. Read more » chorley General Election Mark Tebbutt\nHustings 21st June 2024 / 21st June 2024 by Sef_C Chorley Trades Union Congress (TUC) held a hustings at the Royal British Legion in Coppull on 19th June. Of the various candidates standing in Chorley, only the Green Party candidate, Mark Tebbutt, and the Chorley Trades Union Congress and Socialist Coalition (TUSC) candidate, Martin Powell-Davies, attended, though the other candidates were invited. Mark and Martin had seven minutes each to introduce themselves and their aims for Chorley, should they be elected as Chorley's MP, followed by questions from the audience. Read more » chorley Coppull General Election Hustings Mark Tebbutt\nVoting Green in the General Election 16th June 2024 / 16th June 2024 by Sef_C Register to vote by 18th June 2024. Voters in England need to show photo ID to vote at polling stations in the UK Parliamentary general election on 4 July. Read more » chorley General Election Mark Tebbutt Register to Vote\nMark Tebbutt launches Green General Election Campaign in Chorley 10th June 2024 by Sef_C Mark Tebbutt, a longtime campaigner for cleaner air in Chorley, is standing in the General Election on July 4th 2024 Read more » chorley crowdfunder General Election Mark Tebbutt volunteer\nThank you for all the support! 4th June 2024 / 4th June 2024 by Sef_C This year’s council elections in Chorley South West saw a repeat success and put Olga Cash and the Green Party in second place again. Read more » chorley Council Election Olga Cash\nMark Tebbutt is Green Party candidate for Chorley on 4th of July 3rd June 2024 / 27th June 2024 by Sef_C Chorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election. Mark was selected by Green Party members in a vote in December 2022. Read more » chorley General Election Mark Tebbutt\nGreen Party Select local air pollution campaigner as candidate for next General Election 17th January 2023 / 27th June 2024 by andyhr Chorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election. Read more » chorley General Election Mark Tebbutt\nMental Health Awareness Week 22nd May 2020 / 23rd June 2024 by According to NHS Digital, mental health issues have increased by 30% in the last decade. Has our mental health declined or has the stigma of being diagnosed been disrupted? Many cite the climate crisis as impacting their wellbeing and ‘eco-anxiety’ has been a key driver in the rise of environmental activism. The recent pandemic has […] Read more » chorley Mental health nature wellbeing",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_hustings/content_57.html": "Hustings 21st June 2024 / 21st June 2024 by Sef_C Chorley Trades Union Congress (TUC) held a hustings at the Royal British Legion in Coppull on 19th June. Of the various candidates standing in Chorley, only the Green Party candidate, Mark Tebbutt, and the Chorley Trades Union Congress and Socialist Coalition (TUSC) candidate, Martin Powell-Davies, attended, though the other candidates were invited. Mark and Martin had seven minutes each to introduce themselves and their aims for Chorley, should they be elected as Chorley's MP, followed by questions from the audience. Read more » chorley Coppull General Election Hustings Mark Tebbutt",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2024_06_03_mark-tebbutt-is-green-party-candidate-for-chorley-on-july-4th/content_62.html": "Chorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election. Mark was selected by Green Party members in a vote in December 2022.\nThe date of the next General Election is 4th of July 2024.\nMark says:\n“I’m so honoured to be the Green Party candidate for Chorley. Many people feel as if they’ve had their vote taken away as Labour, Tories and Lib Dems chose not to stand against the Speaker in the last General Election. But we will make sure people have another option and can support the Green Party this time.\n“A vote for the Green Party is a vote to defend our NHS, protect our seas and rivers from sewage and take real action on climate change.\n“I am Chorley born and bred. I have been and remain a passionate campaigner for improving air quality across the Chorley borough, installing 11 air pollution monitors and lobbying Chorley council to monitor particulate air pollution since 2017″\nMark tweets frequently about these issues and can be followed on @mwt2008.\nUnlike Labour and the Conservatives, we do not accept huge donations from trade unions, big business and the super rich. We rely on donations from individuals like you to support our grassroots campaign. All donations made will go towards Mark’s campaign as well as supporting election literature to be delivered to all households in Chorley so that our message can reach residents across the constituency.\nSupport Mark’s campaign to give Chorley a choice on polling day. Click here to donate.\nPublished and promoted by Andy Hunter-Rossall on behalf of the Green Party, both at 19 Coniston Road, Chorley, PR7 2JA.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_local-links/content_2.html": "Environmental Groups\nChorley and District Natural History Society\nGreen Living Chorley Facebook page\nEPiC (Environmental Projects in Chorley)\nLocal Campaign Groups\nProtect Chorley & South Ribble Hospital\nCouncil\nChorley Borough Council\nLancashire County Council",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2020_10_23_chorley-ae-remains-closed/content_46.html": "UPDATE – since this story was first published in print, a new opening date for the A&E service has been annouced. The service is due to return from 8am to 5pm from 2nd November.\nA&E services were due to return to Chorley on 28th September. But a week before the planned reopening, Lancashire Teaching Hospitals announced that they had been unable to recruit the staff needed to open safely.\nLocal Green Party campaigner Andy Hunter-Rossall said, “This will come as a massive blow to many residents. We have been without A&E services in Chorley for 6 months. The Health Secretary told us at the start of May he was working hard to reopen the service “as soon as possible”, but more than 4 months later we appear no closer! No new timetable for reopening has been given and that is just not good enough.”\nChorley and South Ribble Hospital continues to have a 24 hour Urgent Care Centre for minor injuries and illnesses, whilst A&E services are can be accessed at the Royal Preston Hospital.\nThere is an ongoing campaign to restore and protect Chorley and South Ribble A&E service – you can find out more on the campaign’s Facebook page.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_category_council-elections/content_4.html": "15th April 2025 / 15th April 2025 by Sef_C\nIn Chorley this week we saw Green Party posters in lots of windows., April 2025.\nRead more »\n6th April 2025 / 6th April 2025 by Sef_C\nCampaigning is underway to elect Green Party Lancashire Councillors. Our Chorley Green Party members and volunteers have been out and about (even more than usual!) over the last few weeks, talking to local people and supporting other local causes such as the Save Chorley A&E campaign. Our membership is growing quickly – join us! For […]\n4th June 2024 / 4th June 2024 by Sef_C\nThis year’s council elections in Chorley South West saw a repeat success and put Olga Cash and the Green Party in second place again.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_nell-lane/content_41.html": "Nell Lane Trees Under Threat 20th May 2020 / 23rd June 2024 by Join us in objecting to the loss of trees in Nell Lane. Read more » Cuerden Kitty Frances Nell Lane Trees",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_manifesto/content_53.html": "Green Party Manifesto top of rankings 24th June 2024 / 24th June 2024 by Sef_C Friends of the Earth and Greenpeace analysed political parties' election manifestos and the Green Party manifesto came out on top. Read more » Manifesto\nOur 2024 General Election Manifesto 17th June 2024 / 19th June 2024 by Sef_C Read the Green Party 2024 manifesto here. There are easy-reading, short and long versions available to download, or read our manifesto online. Read more » General Election Manifesto",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_olga-cash/content_34.html": "OUR VOTE GREEN posters are appearing! 15th April 2025 / 15th April 2025 by Sef_C In Chorley this week we saw Green Party posters in lots of windows., April 2025. Read more » chorley Chorley South West Coppull County Elections Olga Cash\nA busy Spring 2025 6th April 2025 / 6th April 2025 by Sef_C Campaigning is underway to elect Green Party Lancashire Councillors. Our Chorley Green Party members and volunteers have been out and about (even more than usual!) over the last few weeks, talking to local people and supporting other local causes such as the Save Chorley A&E campaign. Our membership is growing quickly – join us! For […] Read more » chorley County Elections Olga Cash\nAction day Ledbury! 22nd June 2024 / 23rd June 2024 by Sef_C Chorley Green Party members went to Herefordshire to help with campaigning there. It was an early start but a great day working on the Greens' campaign to get Ellie Chowns elected in Herefordshire. The Green Party regularly hold National Action Days where members from all over the country can join in and help out. Read more » Action Day General Election Mark Tebbutt Olga Cash volunteer\nThank you for all the support! 4th June 2024 / 4th June 2024 by Sef_C This year’s council elections in Chorley South West saw a repeat success and put Olga Cash and the Green Party in second place again. Read more » chorley Council Election Olga Cash",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_register-to-vote/content_32.html": "Voting Green in the General Election 16th June 2024 / 16th June 2024 by Sef_C Register to vote by 18th June 2024. Voters in England need to show photo ID to vote at polling stations in the UK Parliamentary general election on 4 July. Read more » chorley General Election Mark Tebbutt Register to Vote",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_people/content_37.html": "Who We Are\nWe are proud to do politics differently.\nThe Green Party is run by its members – members set our policy, members elect the teams that run the party, and members campaign on the local issues that matter to their communities.\nJoin us today to be part of the only party dedicated to fighting for climate justice!\n2025 County Council Election Candidates\nThe Green Party is standing candidates in all 8 areas for the 2025 Lancashire County Council elections. Here’s a quick overview.\nChorley Central – Debbie Brotherton\nChorley North – Anne Calderbank\nChorley Rural East – Simon Cash\nChorley Rural West – Sef Churchill\nChorley South – Olga Cash\nClayton with Whittle – Amy Coxley\nEuxton, Buckshaw and Astley – Pauline Summers\nHoghton with Wheelton – Jon Royle\nRead more about our 2025 candidates:\nOlga Cash – Chorley South\n“I live in Chorley with my husband and have been working at universities in Lancashire for the last 26 years. I have a lot of experience in organisational change, supporting young people, and delivering well-being initiatives. I am no stranger to rolling up my sleeves and getting stuck in – as my hard work in Chorley South has shown. I love living here and know there are many ways our corner of Chorley could be improved – having an active, hardworking local councillor, who listens to residents and is here all year, not just at election time, is a large part of that. The Green Party came second in the last election and this year we are certain we can win!”\nPauline Summers – Euxton, Buckshaw and Astley\n“I grew up in Chorley going to local schools and brought up my own children here. I am passionate about the environment at a local level as well as globally. I believe we need to look after the world we live in for future generations and that starts at home with small actions such as recycling, looking after our green areas and teaching our children the importance of caring for animals and plants as well as other people. As a Green councillor I would promote Green policies at local government level and endeavour to have a Green voice heard.”\nAnne Calderbank – Chorley North\n“I am 56, a Chorley resident, born and bred. I lived abroad in my 20s. I have 3 children, one of whom is disabled and accesses services in Lancashire. I am currently a MPhil student researching how urban greening may help in our cities during heatwaves and floods. Before that I was an architectural technician and interior designer, working mostly on schools and Sure-Start centres. I have also been a house-parent for a few years and worked in theatre and film art departments in my youth. I’ve played in a band as a hobby for the last 22 years. I’m a keen gardener and nature-lover, and love Lancashire and its countryside. I have been a member of the Green Party since the Noughties.”\nJon Royle – Hoghton with Wheelton\n“My name is Jon. I have lived in the Brinscall and Withnell area for more than 20 years. I have a great appreciation for this area and its community. I enjoy fell running on the moors, playing my trumpet in a music group and canoeing on the canal. I have only recently become involved with the Green Party as I am passionate about environmental justice. I believe that the government’s action, both locally and nationally, on green issues is fundamental in protecting future generations. I am looking forward to giving people in the area the opportunity to vote Green.”\nJon Royle, Chorley North East\nSef Churchill – Chorley Rural West\n“I’m a 53 year old mum. I’ve lived in Chorley for 18 years, and I work full time in IT. I’m horrified by recent governments’ actions in reversing green policies –fracking, oil drilling– as well as by their ‘economic growth is everything’ approach, which ignores other measures of success and relies on increasing the profits of a few based on the labour of the many. Whilst I want to see sweeping new climate policies at government level, it is vital that we consider Green principles at local level too. Every day our natural environment is threatened by development, and it always seems like the ‘eco’ rules are done to the bare minimum.\nAt the same time I live in the real world. It’s hard for us all to live sustainably, because of the way systems are set up for profit – such as transport, and local services. This needs to change.”\nAmy Coxley – Clayton with Whittle\n“Born and raised in Lancashire, I have grown up with the Chorley landmarks on my doorstep. To be able to enjoy Cuerden or Yarrow Valley on the doorstep, across to the gardens at Rivington or a wander through Astley Park is something we are so fortunate to have access to. Since having my two children though, I’ve become increasingly worried about the future we are leaving behind for these generations and the rise of both climate skeptics and populism in our collective decision- making.\nI believe that local people should be making decisions for local issues, and sometimes it can feel hard to know how best to come about changing the status quo. I like to focus much of my spare time in grassroot projects where I believe my voice, with others, can be a real force for good.”\nAmy Coxley – Clayton with Whittle\nDebbie Brotherton – Chorley Central\n“As a teacher, I take a keen interest in education policy and provision for young people and families in our town. I am also passionate about improving our local NHS offer, especially mental health services. I believe that wellbeing should be at the heart of all that we do in this beautiful county, and we all have the right to access well-maintained green spaces as well as healthy food and clean air and water, free from pollution.\nLancashire County Council is dominated by the two main parties. If elected as your Green councillor, I will be an advocate for you, and use my experience as an activist to push for a fairer and greener Chorley. As a grass roots party, we believe in listening to the wishes and needs of our residents, and unlike the other big parties, our candidates are free to vote with their conscience and to fully represent constituents’ views when making decisions which affect them. Along with our dedicated team of local volunteers, I will continue to work hard for our community all year round, not just at election time.\nSo I hope you will consider voting for me on the 1st May – every Green Party voice on our County Council means we can make a real difference to the old ‘business as usual’ in Lancashire.”\nDebbie Brotherton – Chorley Central\nSimon Cash – Chorley Rural East\nSimon Cash – Chorley Rural East\nOur Coordination Team\nAndy Hunter-Rossall\nCo-Ordinator\nOlga Cash\nCo-Ordinator\nPauline Summers\nSecretary\nAnne Calderbank\ntreasurer\nCoordinator – Andy Hunter-Rossall (joint)\nCoordinator – Olga Cash (joint)\nSecretary – Pauline Summers\nTreasurer – Anne Calderbank\nComms Coordinator – Debbie Brotherton\nElections Officer – Mark Tebbutt\nMark Tebbutt – Election Officer\nMark is 51 years old, Chorley born & bred. He ran the Broadband 4 Brinscall campaign back in 2002 helping to bring broadband to Brinscall and the surrounding villages for the first time. He has been monitoring air pollution in the borough since October 2017 and has funded a PM2.5 air pollution monitoring network at 12 volunteer homes in the Chorley borough. The years of campaigning combined with the pollution data Mark has collected persuaded Chorley council to start monitoring PM2.5 pollution. Mark works in IT and has a keen interest in Climate Change and low carbon technology.\n“I decided to stand in local elections to persuade Chorley Council to take climate change and air pollution (which are two sides of the same coin) more seriously and with a greater sense of urgency.”\nVarious members, candidates, and officers",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2024_06_24_green-party-manifesto-top-of-rankings/content_5.html": "Friends of the Earth and Greenpeace analysed political parties’ election manifestos and the Greens’ manifesto came out on top.\nTheir verdict:\n🥇Green Party = 98%\n🥈 Lib Dems = 79%\n🥉 Labour = 51%\n❌ Tories = 13%\nFriends of the Earth and Greenpeace have compared the Green Party manifesto with Labour, Tories and Liberal Democrats.\nFrom the Friends of the Earth website:\nParties were scored across a range of measures, not just the environment. The Green Party came out on top by some distance. The rankings include top scores for Greens on Housing, Justice, and Transport – and a near perfect score for Energy too.\nAs the Friends of the Earth website puts it: “Manifestos are solemn pledges between political parties and the electorate at general elections, so what they include matters.” Read the Green Party manifesto here.\nIf having an MP whose voice supports the Green manifesto matters to you, vote Green Party on 4 July.\nTo support Chorley Green Party and our candidate Mark Tebbutt’s campaign, donate here. Unlike Labour and the Conservatives, the Green Party does not receive huge donations from trade unions, big business or the super-rich. We rely on donations from individuals like you to support our grassroots campaign. All donations made will go towards Mark’s deposit, supporting election literature and the Chorley Green Party funds. Support Mark’s General Election campaign here and let’s get a Green voice for Chorley!",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_about-us/content_31.html": "The Green Party is growing fast. We have 4 representatives in Parliament and in an ever-growing number of local councils, as well as in the London Assembly.\nHere in Chorley we are currently working to elect our first Green Councillors to add that much needed voice to the Council chamber to address the critical issues facing our communities and our planet.\nWe’re working progressively on local issues; to improve the lives of all people in Chorley and to improve our local environment. As part of the Green Party of England & Wales, we share a deep concern for social and environmental justice; we believe fair is worth fighting for.\nWe rely on people power rather than corporate finance in all that we do. Get involved with us today so that we can achieve so much more for Chorley.\nThe Green Party Political Programme sets out what Greens are in politics to do: to end the system that keeps hurting the environment and all of us who rely on it – and to build a better alternative.\nThis Programme isn’t like other parties’ manifestos, it has not been squeezed through focus groups and stripped down according to the latest polling. Instead it has been built from policies proposed and voted on by our members, looking to secure the long-term future of the places and people they love.\nIt’s a vision of a better world, and together we can deliver it.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk/content_1.html": "We’re an active and friendly group of Green Party members in the Borough of Chorley. We hold a range of events throughout the year – from campaigning, to meetings, to social events.\nCampaigning is underway to elect Green Party Lancashire Councillors. Our Chorley Green Party members and volunteers have been out and about (even more than usual!) over the last few weeks, talking to local people and supporting other local causes such as the Save Chorley A&E campaign. Our membership is growing quickly – join us! For… Read more: A busy Spring 2025\nMadeleine Houghton from Chorley Green Party travelled to Brighton to join in with campaigning there on 22 June. As well as meeting with lots of other Green supporters, Madeleine also sent us these surprise celebrity snaps. Actor and comedian Steve Coogan joined campaigners to show support for Sian Berry, the candidate for Brighton Pavilion.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_donate/content_16.html": "You can make a one-off donation of any amount to Chorley Green Party. You can also set up a standing order or make a one-off donation via bank transfer. Please contact us if you would prefer to donate that way.\nYou can make a one-off donation of any amount to Chorley Green Party. You can also set up a standing order or make a one-off donation via bank transfer. Please contact us if you would prefer to donate that way.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_author_sef_c_page_2/content_35.html": "4th June 2024 / 4th June 2024 by Sef_C\nThis year’s council elections in Chorley South West saw a repeat success and put Olga Cash and the Green Party in second place again.\nRead more »\n3rd June 2024 / 27th June 2024 by Sef_C\nChorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election. Mark was selected by Green Party members in a vote in December 2022.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_chorley_page_2/content_54.html": "Council to Stop Spraying Dangerous Chemicals 22nd May 2020 / 23rd June 2024 by Council to end use of glyphosates after receiving Green Party petition Last November, around 800 people signed Chorley Green Party’s petition for the council to stop spraying dangerous pesticides in public spaces. Glyphosates are used by the council as a weed-killer, and have already been banned in several countries. There is increasing evidence that they […] Read more » chemical spraying chorley environment petition",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2022_03_29_warm-affordable-homes-must-be-a-key-part-of-council-climate-strategy-say-greens/content_22.html": "In 2019, Chorley Council declared a Climate Emergency and pledged that the borough would be carbon neutral by 2030. The Council are consulting at the moment on a draft Climate Change Strategy and the local Green Party are concerned about the pace of progress, and about the emphasis of the report.\n“Chorley Green Party fully supports the Council’s aspiration for the borough to be carbon neutral by 2030, and encourages the Council to take action and speed up the rate of progress – the Council are not acting like we are living through a climate emergency,” says co-ordinator Andy Hunter-Rossall. “It has taken two and a half years to publish a strategy, and much of the strategy consists of commitments to publish more detailed plans by 2024!”\nWith about a third of the borough’s carbon emissions coming from transport, and over a quarter coming from heating buildings, Hunter-Rossall also expressed concern about the lack of emphasis on these areas.\n“The Council’s strategy is lacking in targets for reducing the energy consumption of our existing housing,” said Hunter-Rossall. “At a time when many are already facing a huge increase in the cost-of-living, and with energy prices likely to rise again, making our homes warm, insulated and efficient should be a top priority for the Council.”\nCo-Leader of the Green Party of England and Wales, Carla Denyer, visited Chorley this weekend, and spoke to local members and supporters about what councils should be doing on Climate Change. She echoed Hunter-Rossall’s emphasis on transport and housing. “In Lewes, Green Councillors have begun a programme to retrofit 40,000 social homes with insulation and renewable energy installations [2],” Denyer said. “The project will train a big new retrofit workforce and build a local supply chain, using local materials and local suppliers. It’s a great example of what can be done by councils to drive climate innovation at scale.”\nThe Council’s Climate Change Strategy consultation is open until 25th April, and you can read the strategy and submit your response here: https://yoursay.citizenspace.com/communications/climate-change-strategy-consultation/",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_author_andyhr/content_56.html": "17th January 2023 / 27th June 2024 by andyhr\nChorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election.\nRead more »\n29th March 2022 / 23rd June 2024 by andyhr\nIn 2019, Chorley Council declared a Climate Emergency and pledged that the borough would be carbon neutral by 2030. The Council are consulting at the moment on a draft Climate Change Strategy and the local Green Party are concerned about the pace of progress, and about the emphasis of the report. “Chorley Green Party fully […]\n18th August 2021 / 23rd June 2024 by andyhr\nLast Monday the Intergovernmental Panel on Climate Change (IPCC) released a report described by the UN chief as a “code red for humanity”. It said we are changing the planet in “unprecedented and sometimes irreversible ways”. In a year in which we have seen record breaking heat waves, floods and wildfires around the world it’s […]\n14th March 2021 / 23rd June 2024 by andyhr\nChorley Green Party have launched their local election campaign to get Councillors elected to the Borough and County Councils, and they are putting forward candidates in every ward for the upcoming May 6th local elections. Andy Hunter-Rossall, Coordinator of Chorley Green Party, said “I’m so pleased to be part of a team of 22 Green […]\n5th February 2021 / 23rd June 2024 by andyhr\nIn 2019 almost 1000 people signed a Chorley Green Party petition to Chorley Council calling for them to stop spraying Glyphosates in public spaces. In March 2020 Chorley Council introduced thermal weeding equipment and committed to reducing the amount of glyphosates used. Chorley Green Party Coordinator Andy Hunter-Rossall has been checking in on progress against […]\n3rd January 2021 / 23rd June 2024 by andyhr\n2020 was difficult for many of us – many people lost loved ones, many felt isolated, many lost their jobs. Some of us have seen positives too – communities coming together to support the most vulnerable, spending more time exercising or enjoying nature, or finding time to learn new skills. Though nothing changed at the […]\n4th November 2020 / 23rd June 2024 by andyhr\nNews of a second lockdown across England was announced over the weekend and with it came concerns of access to groceries. Chorley Green Party are calling on supermarkets to urgently limit sales of baby formula amid worries of limited supplies for parents. In spring we saw necessary products such as this sell out fast leaving […]\n23rd October 2020 / 23rd June 2024 by andyhr\nUPDATE – since this story was first published in print, a new opening date for the A&E service has been annouced. The service is due to return from 8am to 5pm from 2nd November. A&E services were due to return to Chorley on 28th September. But a week before the planned reopening, Lancashire Teaching Hospitals […]",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_andy-hunter-rossall/content_24.html": "On the Right Path 20th May 2020 / 23rd June 2024 by Jane Weston has been working to get paths resurfaced in Chorley South West. Read more » Andy Hunter-Rossall Chorley South West Jane Weston",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2020_05_20_nell-lane-trees-under-threat-may-2020/content_42.html": "A developer has submitted plans to remove hedgerow lining Nell Lane. Kitty Speakman has been working to make residents aware of the destructive plans.\nThe plans are to provide access to a new housing development, which could be provided from other nearby residential roads.\n“Nell lane is used by many locals as access to Cuerden Valley and it is teaming with wildlife.” says Kitty.\n“The lane is barely wide enough for 2 cars and has no footpath so is not suitable for access to a development of 115 houses. We’ve been in touch with Chorley Borough Council to raise our concerns over the loss of habitat, safety issues and potential pollution increase in this local rural area.”\nIf you would like to help us protect these trees please post an objection through the council website before the 25th May. We have included a template letter which you are welcome to use.\nIf you’d like to help us protect these trees please post an objection through the council website –\nApplication no: 20/00377/FULMAJ\nDownload our template objection letter below:",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_coppull/content_17.html": "OUR VOTE GREEN posters are appearing! 15th April 2025 / 15th April 2025 by Sef_C In Chorley this week we saw Green Party posters in lots of windows., April 2025. Read more » chorley Chorley South West Coppull County Elections Olga Cash\nHustings 21st June 2024 / 21st June 2024 by Sef_C Chorley Trades Union Congress (TUC) held a hustings at the Royal British Legion in Coppull on 19th June. Of the various candidates standing in Chorley, only the Green Party candidate, Mark Tebbutt, and the Chorley Trades Union Congress and Socialist Coalition (TUSC) candidate, Martin Powell-Davies, attended, though the other candidates were invited. Mark and Martin had seven minutes each to introduce themselves and their aims for Chorley, should they be elected as Chorley's MP, followed by questions from the audience. Read more » chorley Coppull General Election Hustings Mark Tebbutt",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2020_05_22_council-to-stop-spraying-dangerous-chemicals/content_51.html": "Council to end use of glyphosates after receiving Green Party petition\nLast November, around 800 people signed Chorley Green Party’s petition for the council to stop spraying dangerous pesticides in public spaces. Glyphosates are used by the council as a weed-killer, and have already been banned in several countries.\nThere is increasing evidence that they are harmful to both to wildlife and to human health, including being “potentially cancer causing”.\n“The use of glyphosates is an unnecessary risk to human health and to our wildlife” said the Green Party’s Andy Hunter-Rossall. “Many councils have moved to using harmless methods for weed-control, including using heat.”\nThe council has now announced that it will stop using glyphotsates for most weed control, using thermal weeding equipment instead. The council will continue to use glyphosates in some circumstances, such as in “high traffic areas”.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_news/content_8.html": "OUR VOTE GREEN posters are appearing! 15th April 2025 / 15th April 2025 by Sef_C In Chorley this week we saw Green Party posters in lots of windows., April 2025. Read more » chorley Chorley South West Coppull County Elections Olga Cash\nA busy Spring 2025 6th April 2025 / 6th April 2025 by Sef_C Campaigning is underway to elect Green Party Lancashire Councillors. Our Chorley Green Party members and volunteers have been out and about (even more than usual!) over the last few weeks, talking to local people and supporting other local causes such as the Save Chorley A&E campaign. Our membership is growing quickly – join us! For […] Read more » chorley County Elections Olga Cash\nThank You Chorley 5th July 2024 / 11th July 2024 by Sef_C Thank you to all our voters in Chorley for giving us our best result yet in a General Election by voting for Green candidate Mark Tebbutt. Read more » chorley General Election Mark Tebbutt\nGreen Party Manifesto top of rankings 24th June 2024 / 24th June 2024 by Sef_C Friends of the Earth and Greenpeace analysed political parties' election manifestos and the Green Party manifesto came out on top. Read more » Manifesto\nAction Day Brighton! 22nd June 2024 / 23rd June 2024 by Sef_C Madeleine Houghton from Chorley Green Party travelled to Brighton to join in with campaigning there on 22 June. As well as meeting with lots of other Green supporters, Madeleine also sent us these surprise celebrity snaps. Actor and comedian Steve Coogan joined campaigners to show support for Sian Berry, the candidate for Brighton Pavilion. Read more » Action Day General Election volunteer\nAction day Ledbury! 22nd June 2024 / 23rd June 2024 by Sef_C Chorley Green Party members went to Herefordshire to help with campaigning there. It was an early start but a great day working on the Greens' campaign to get Ellie Chowns elected in Herefordshire. The Green Party regularly hold National Action Days where members from all over the country can join in and help out. Read more » Action Day General Election Mark Tebbutt Olga Cash volunteer\nHustings 21st June 2024 / 21st June 2024 by Sef_C Chorley Trades Union Congress (TUC) held a hustings at the Royal British Legion in Coppull on 19th June. Of the various candidates standing in Chorley, only the Green Party candidate, Mark Tebbutt, and the Chorley Trades Union Congress and Socialist Coalition (TUSC) candidate, Martin Powell-Davies, attended, though the other candidates were invited. Mark and Martin had seven minutes each to introduce themselves and their aims for Chorley, should they be elected as Chorley's MP, followed by questions from the audience. Read more » chorley Coppull General Election Hustings Mark Tebbutt\nOur 2024 General Election Manifesto 17th June 2024 / 19th June 2024 by Sef_C Read the Green Party 2024 manifesto here. There are easy-reading, short and long versions available to download, or read our manifesto online. Read more » General Election Manifesto\nVoting Green in the General Election 16th June 2024 / 16th June 2024 by Sef_C Register to vote by 18th June 2024. Voters in England need to show photo ID to vote at polling stations in the UK Parliamentary general election on 4 July. Read more » chorley General Election Mark Tebbutt Register to Vote\nMark Tebbutt launches Green General Election Campaign in Chorley 10th June 2024 by Sef_C Mark Tebbutt, a longtime campaigner for cleaner air in Chorley, is standing in the General Election on July 4th 2024 Read more » chorley crowdfunder General Election Mark Tebbutt volunteer",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_general-election/content_27.html": "Thank You Chorley 5th July 2024 / 11th July 2024 by Sef_C Thank you to all our voters in Chorley for giving us our best result yet in a General Election by voting for Green candidate Mark Tebbutt. Read more » chorley General Election Mark Tebbutt\nAction Day Brighton! 22nd June 2024 / 23rd June 2024 by Sef_C Madeleine Houghton from Chorley Green Party travelled to Brighton to join in with campaigning there on 22 June. As well as meeting with lots of other Green supporters, Madeleine also sent us these surprise celebrity snaps. Actor and comedian Steve Coogan joined campaigners to show support for Sian Berry, the candidate for Brighton Pavilion. Read more » Action Day General Election volunteer\nAction day Ledbury! 22nd June 2024 / 23rd June 2024 by Sef_C Chorley Green Party members went to Herefordshire to help with campaigning there. It was an early start but a great day working on the Greens' campaign to get Ellie Chowns elected in Herefordshire. The Green Party regularly hold National Action Days where members from all over the country can join in and help out. Read more » Action Day General Election Mark Tebbutt Olga Cash volunteer\nHustings 21st June 2024 / 21st June 2024 by Sef_C Chorley Trades Union Congress (TUC) held a hustings at the Royal British Legion in Coppull on 19th June. Of the various candidates standing in Chorley, only the Green Party candidate, Mark Tebbutt, and the Chorley Trades Union Congress and Socialist Coalition (TUSC) candidate, Martin Powell-Davies, attended, though the other candidates were invited. Mark and Martin had seven minutes each to introduce themselves and their aims for Chorley, should they be elected as Chorley's MP, followed by questions from the audience. Read more » chorley Coppull General Election Hustings Mark Tebbutt\nOur 2024 General Election Manifesto 17th June 2024 / 19th June 2024 by Sef_C Read the Green Party 2024 manifesto here. There are easy-reading, short and long versions available to download, or read our manifesto online. Read more » General Election Manifesto\nVoting Green in the General Election 16th June 2024 / 16th June 2024 by Sef_C Register to vote by 18th June 2024. Voters in England need to show photo ID to vote at polling stations in the UK Parliamentary general election on 4 July. Read more » chorley General Election Mark Tebbutt Register to Vote\nMark Tebbutt launches Green General Election Campaign in Chorley 10th June 2024 by Sef_C Mark Tebbutt, a longtime campaigner for cleaner air in Chorley, is standing in the General Election on July 4th 2024 Read more » chorley crowdfunder General Election Mark Tebbutt volunteer\nMark Tebbutt is Green Party candidate for Chorley on 4th of July 3rd June 2024 / 27th June 2024 by Sef_C Chorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election. Mark was selected by Green Party members in a vote in December 2022. Read more » chorley General Election Mark Tebbutt\nGreen Party Select local air pollution campaigner as candidate for next General Election 17th January 2023 / 27th June 2024 by andyhr Chorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election. Read more » chorley General Election Mark Tebbutt",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_mental-health/content_26.html": "Mental Health Awareness Week 22nd May 2020 / 23rd June 2024 by According to NHS Digital, mental health issues have increased by 30% in the last decade. Has our mental health declined or has the stigma of being diagnosed been disrupted? Many cite the climate crisis as impacting their wellbeing and ‘eco-anxiety’ has been a key driver in the rise of environmental activism. The recent pandemic has […] Read more » chorley Mental health nature wellbeing",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_category_uncategorised_page_2/content_30.html": "20th May 2020 / 23rd June 2024 by\nJane Weston has been working to get paths resurfaced in Chorley South West.\nRead more »",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2020_05_22_mental-health-awareness-week/content_20.html": "According to NHS Digital, mental health issues have increased by 30% in the last decade. Has our mental health declined or has the stigma of being diagnosed been disrupted? Many cite the climate crisis as impacting their wellbeing and ‘eco-anxiety’ has been a key driver in the rise of environmental activism.\nThe recent pandemic has brought mental health to the forefront on a global scale. We only need to scroll through social media to see how varied the response is. Some are relishing the simpler way of life while others are in deep shock and struggling to process the events. One thing is for sure, we’re all talking about it.\nMany have reported the permitted daily exercise, encouraging more time in nature, has accounted for some improvements in mental health. There are multiple proven benefits to spending time outside including the increase of vitamin D exposure along with the production of serotonin while being active.\nWhile some have experienced an improvement in their wellbeing, The World Health Organisation (WHO) predict a huge downturn in mental health as the pandemic recedes caused by economic challenges, trauma and burnout.\nTime outdoors could continue to provide a cost-effective solution after lockdown ends. Research carried out by Leeds Beckett University found that prescribing time in nature provides excellent value for money when compared with alternatives, particularly when volunteering on ecological projects. The study, conducted for the Wildlife Trust, found that 95% of people reported improvements after 6 weeks of working in nature. Calls for investment in nature programmes as treatments for mental health issues have never been more important and would support rewilding of the environment the planet so desperately needs.\nby Kitty Speakman",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2024_06_17_our-2024-general-election-manifesto/content_13.html": "17th June 2024 / 19th June 2024 by Sef_C\nRead the Green Party 2024 manifesto here.\nThere are easy-reading, short and long versions available to download, or read our manifesto online.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2021_03_14_chorley-green-party-stand-a-record-number-of-candidates/content_40.html": "Chorley Green Party have launched their local election campaign to get Councillors elected to the Borough and County Councils, and they are putting forward candidates in every ward for the upcoming May 6th local elections.\nAndy Hunter-Rossall, Coordinator of Chorley Green Party, said “I’m so pleased to be part of a team of 22 Green candidates in the local elections. More and more people are joining and supporting the Green Party as they see we are active in our communities, and we stand up for the issues people care about.\n“In my ward, we have been busy over the last year signposting coronavirus support, working with residents on issues like speeding and anti-social behaviour – issues that residents told us were the most important to them!”\nHunter-Rossall, who is a worker and co-owner of a large workers’ cooperative, is standing in Chorley South West, alongside local university teacher Olga Gomez-Cash, and Jane Weston, who works in a veterinary surgery.\n“We want to protect our A&E, our thriving town centre and our beautiful parks and green spaces for future generations.” Hunter-Rossall continued. “We also want to prioritise support for young people, many of whom have been hit hard by the pandemic.”\nThe Green Party is growing fast across the UK and in the North West in particular, doubling its councillor numbers in the region at the last local elections.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_mark-tebbutt/content_45.html": "Thank You Chorley 5th July 2024 / 11th July 2024 by Sef_C Thank you to all our voters in Chorley for giving us our best result yet in a General Election by voting for Green candidate Mark Tebbutt. Read more » chorley General Election Mark Tebbutt\nAction day Ledbury! 22nd June 2024 / 23rd June 2024 by Sef_C Chorley Green Party members went to Herefordshire to help with campaigning there. It was an early start but a great day working on the Greens' campaign to get Ellie Chowns elected in Herefordshire. The Green Party regularly hold National Action Days where members from all over the country can join in and help out. Read more » Action Day General Election Mark Tebbutt Olga Cash volunteer\nHustings 21st June 2024 / 21st June 2024 by Sef_C Chorley Trades Union Congress (TUC) held a hustings at the Royal British Legion in Coppull on 19th June. Of the various candidates standing in Chorley, only the Green Party candidate, Mark Tebbutt, and the Chorley Trades Union Congress and Socialist Coalition (TUSC) candidate, Martin Powell-Davies, attended, though the other candidates were invited. Mark and Martin had seven minutes each to introduce themselves and their aims for Chorley, should they be elected as Chorley's MP, followed by questions from the audience. Read more » chorley Coppull General Election Hustings Mark Tebbutt\nVoting Green in the General Election 16th June 2024 / 16th June 2024 by Sef_C Register to vote by 18th June 2024. Voters in England need to show photo ID to vote at polling stations in the UK Parliamentary general election on 4 July. Read more » chorley General Election Mark Tebbutt Register to Vote\nMark Tebbutt launches Green General Election Campaign in Chorley 10th June 2024 by Sef_C Mark Tebbutt, a longtime campaigner for cleaner air in Chorley, is standing in the General Election on July 4th 2024 Read more » chorley crowdfunder General Election Mark Tebbutt volunteer\nMark Tebbutt is Green Party candidate for Chorley on 4th of July 3rd June 2024 / 27th June 2024 by Sef_C Chorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election. Mark was selected by Green Party members in a vote in December 2022. Read more » chorley General Election Mark Tebbutt\nGreen Party Select local air pollution campaigner as candidate for next General Election 17th January 2023 / 27th June 2024 by andyhr Chorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election. Read more » chorley General Election Mark Tebbutt",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_trees/content_43.html": "Nell Lane Trees Under Threat 20th May 2020 / 23rd June 2024 by Join us in objecting to the loss of trees in Nell Lane. Read more » Cuerden Kitty Frances Nell Lane Trees",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2024_07_05_thank-you-chorley/content_50.html": "Thank you to all our voters in Chorley for giving us our best result yet in a General Election by voting for local Green candidate Mark Tebbutt. Mark achieved 13% of the vote here and it’s clear that there is an appetite for the Green Party’s policies.\nThis is reflected in the stunning national General Election result for the Green Party in achieving four Green MPs.\nMark’s result from the BBC Election pages:",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2024_06_10_mark-tebbutt-launches-green-general-election-campaign-in-chorley/content_52.html": "Mark launched his parliamentary election campaign on 3rd June with a crowdfunder and a message for voters in Chorley.\nMark, a longtime campaigner for cleaner air in Chorley, is standing in the General Election on July 4th 2024 – standing against Lindsay Hoyle, formerly Labour MP for Chorley but now unaffiliated to any party as Speaker of the House.\nMark offers the chance of a Green voice for Chorley in Parliament, and ongoing work locally – on air quality, and pursuing the Green aims of preserving workers’ rights, defending our NHS and tackling the scandalous state of our sea and rivers.\nGet involved\nChorley Green Party relies on a team of committed volunteers and activists who work all year round for our local area – not just during election time. You don’t have to be a member of The Green Party to volunteer your time with us.\nStart volunteering today, contact us here.\nSupport Mark’s campaign\nUnlike Labour and the Conservatives, we do not receive huge donations from trade unions, big business or the super-rich. We rely on donations from individuals like you to support our grassroots campaign. All donations made will go towards Mark’s deposit, supporting election literature and the Chorley Green Party funds.\nSupport Mark’s General Election campaign here and let’s get a Green voice for Chorley!",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_wellbeing/content_19.html": "Mental Health Awareness Week 22nd May 2020 / 23rd June 2024 by According to NHS Digital, mental health issues have increased by 30% in the last decade. Has our mental health declined or has the stigma of being diagnosed been disrupted? Many cite the climate crisis as impacting their wellbeing and ‘eco-anxiety’ has been a key driver in the rise of environmental activism. The recent pandemic has […] Read more » chorley Mental health nature wellbeing",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2020_05_20_on-the-right-path-may-2020/content_47.html": "Time outdoors has become a lifeline for many of us during lockdown. Jane Weston has been making it that little bit easier, after working to get paths in Chorley South West resurfaced.\nThe footpaths, like those between Woodlands Meadow and Firtree Close (pictured), are popular with local walkers and dog owners. But many were in dire need of resurfacing in February.\nJane says “This path was impassable for prams and wheelchairs in the winter months. I reported it to the council and asked them to make sure it is accessible for all local residents.”\nJane is currently self-isolating, but Andy Hunter-Rossall has been to see the results of the resurfacing work.\nAndy says, “Before lockdown the paths were often muddy and inaccessible to prams and wheelchairs. Now they are a great way to enjoy our daily exercise and to access the green spaces around Chorley.”",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_category_uncategorised/content_25.html": "29th March 2022 / 23rd June 2024 by andyhr\nIn 2019, Chorley Council declared a Climate Emergency and pledged that the borough would be carbon neutral by 2030. The Council are consulting at the moment on a draft Climate Change Strategy and the local Green Party are concerned about the pace of progress, and about the emphasis of the report. “Chorley Green Party fully […]\nRead more »\n18th August 2021 / 23rd June 2024 by andyhr\nLast Monday the Intergovernmental Panel on Climate Change (IPCC) released a report described by the UN chief as a “code red for humanity”. It said we are changing the planet in “unprecedented and sometimes irreversible ways”. In a year in which we have seen record breaking heat waves, floods and wildfires around the world it’s […]\n14th March 2021 / 23rd June 2024 by andyhr\nChorley Green Party have launched their local election campaign to get Councillors elected to the Borough and County Councils, and they are putting forward candidates in every ward for the upcoming May 6th local elections. Andy Hunter-Rossall, Coordinator of Chorley Green Party, said “I’m so pleased to be part of a team of 22 Green […]\n5th February 2021 / 23rd June 2024 by andyhr\nIn 2019 almost 1000 people signed a Chorley Green Party petition to Chorley Council calling for them to stop spraying Glyphosates in public spaces. In March 2020 Chorley Council introduced thermal weeding equipment and committed to reducing the amount of glyphosates used. Chorley Green Party Coordinator Andy Hunter-Rossall has been checking in on progress against […]\n3rd January 2021 / 23rd June 2024 by andyhr\n2020 was difficult for many of us – many people lost loved ones, many felt isolated, many lost their jobs. Some of us have seen positives too – communities coming together to support the most vulnerable, spending more time exercising or enjoying nature, or finding time to learn new skills. Though nothing changed at the […]\n4th November 2020 / 23rd June 2024 by andyhr\nNews of a second lockdown across England was announced over the weekend and with it came concerns of access to groceries. Chorley Green Party are calling on supermarkets to urgently limit sales of baby formula amid worries of limited supplies for parents. In spring we saw necessary products such as this sell out fast leaving […]\n23rd October 2020 / 23rd June 2024 by andyhr\nUPDATE – since this story was first published in print, a new opening date for the A&E service has been annouced. The service is due to return from 8am to 5pm from 2nd November. A&E services were due to return to Chorley on 28th September. But a week before the planned reopening, Lancashire Teaching Hospitals […]\n22nd May 2020 / 23rd June 2024 by\nAccording to NHS Digital, mental health issues have increased by 30% in the last decade. Has our mental health declined or has the stigma of being diagnosed been disrupted? Many cite the climate crisis as impacting their wellbeing and ‘eco-anxiety’ has been a key driver in the rise of environmental activism. The recent pandemic has […]\nCouncil to end use of glyphosates after receiving Green Party petition Last November, around 800 people signed Chorley Green Party’s petition for the council to stop spraying dangerous pesticides in public spaces. Glyphosates are used by the council as a weed-killer, and have already been banned in several countries. There is increasing evidence that they […]\n20th May 2020 / 23rd June 2024 by\nJoin us in objecting to the loss of trees in Nell Lane.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2024_06_22_action-day-brighton/content_55.html": "Madeleine Houghton from Chorley Green Party travelled to Brighton to join in with campaigning there on 22 June. As well as meeting with lots of other Green supporters, Madeleine also sent us these surprise celebrity snaps. Actor and comedian Steve Coogan joined campaigners to show support for Sian Berry, the candidate for Brighton Pavilion.\nWriter Aaron Bastani tweeted “Not bad for Sian Berry!” and shared a photo. The Brighton Argus also featured the news.\nSign up for a national or local Action Day and let’s get Greens elected! Find out about our crowdfunder here.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_volunteer/content_60.html": "Action Day Brighton! 22nd June 2024 / 23rd June 2024 by Sef_C Madeleine Houghton from Chorley Green Party travelled to Brighton to join in with campaigning there on 22 June. As well as meeting with lots of other Green supporters, Madeleine also sent us these surprise celebrity snaps. Actor and comedian Steve Coogan joined campaigners to show support for Sian Berry, the candidate for Brighton Pavilion. Read more » Action Day General Election volunteer\nAction day Ledbury! 22nd June 2024 / 23rd June 2024 by Sef_C Chorley Green Party members went to Herefordshire to help with campaigning there. It was an early start but a great day working on the Greens' campaign to get Ellie Chowns elected in Herefordshire. The Green Party regularly hold National Action Days where members from all over the country can join in and help out. Read more » Action Day General Election Mark Tebbutt Olga Cash volunteer\nMark Tebbutt launches Green General Election Campaign in Chorley 10th June 2024 by Sef_C Mark Tebbutt, a longtime campaigner for cleaner air in Chorley, is standing in the General Election on July 4th 2024 Read more » chorley crowdfunder General Election Mark Tebbutt volunteer",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_crowdfunder/content_44.html": "Mark Tebbutt launches Green General Election Campaign in Chorley 10th June 2024 by Sef_C Mark Tebbutt, a longtime campaigner for cleaner air in Chorley, is standing in the General Election on July 4th 2024 Read more » chorley crowdfunder General Election Mark Tebbutt volunteer",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_chorley-south-west/content_59.html": "OUR VOTE GREEN posters are appearing! 15th April 2025 / 15th April 2025 by Sef_C In Chorley this week we saw Green Party posters in lots of windows., April 2025. Read more » chorley Chorley South West Coppull County Elections Olga Cash\nOn the Right Path 20th May 2020 / 23rd June 2024 by Jane Weston has been working to get paths resurfaced in Chorley South West. Read more » Andy Hunter-Rossall Chorley South West Jane Weston",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_kitty-frances/content_23.html": "Nell Lane Trees Under Threat 20th May 2020 / 23rd June 2024 by Join us in objecting to the loss of trees in Nell Lane. Read more » Cuerden Kitty Frances Nell Lane Trees",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2024_06_21_hustings/content_11.html": "Chorley Trades Union Congress (TUC) held a hustings at the Royal British Legion in Coppull on 19th June. Of the various candidates standing in Chorley, only the Green Party candidate, Mark Tebbutt, and the Chorley Trades Union Congress and Socialist Coalition (TUSC) candidate, Martin Powell-Davies, attended, though the other candidates were invited. Mark and Martin had seven minutes each to introduce themselves and their aims for Chorley, should they be elected as Chorley’s MP, followed by questions from the audience.\nThe audience was made up of TUC members and supporters, Green Party members and supporters, and representatives of several local activism groups, as well as members of the public. The chairperson was Andy Cunningham, Secretary, Chorley & District TUC.\nMark outlined his aims, focusing on the urgency of the climate crisis and the need to fund and rebuild the NHS.\nThe audience asked questions on a broad range of topics, including the candidates’ views on the situation in Gaza, the war in Ukraine, anti Islamic public sentiment, WASPI women’s pension compensation, trans rights, and how to engage young voters.\nIn response, Mark variously spoke about the Green Party’s aim for an immediate bilateral ceasefire in Gaza, continuing to support Ukraine, the Green principles of fairness and inclusivity, and the Green goal of enabling people to self identify should they choose. In mentioning younger voters, Mark emphasised the Green Party promise to fight for a fairer, greener future.\nNext hustings on 23rd June.\nSupport Mark’s election campaign\nMark Tebbutt, a longtime campaigner for cleaner air in Chorley, is standing in the General Election on July 4th 2024. Unlike Labour and the Conservatives, the Green Party does not receive huge donations from trade unions, big business or the super-rich. We rely on donations from individuals like you to support our grassroots campaign. All donations made will go towards Mark’s deposit, supporting election literature and the Chorley Green Party funds. Support Mark’s General Election campaign here and let’s get a Green voice for Chorley!",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2023_01_17_chorley-green-party-mark-tebbutt-general-election-2025/content_63.html": "Green Party Select local air pollution campaigner as candidate for next General Election\nChorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election. Mark was selected by Green Party members in a vote in December.\nThe date of the next General Election has not been announced, but will be at the very latest January 2025, and could be earlier. [Edit – this article was written before the date of the General Election was announced as 4th July 2024. A more recent article can be found here.]\nMark said: “I’m so honoured to have been selected as the Green Party candidate for Chorley. Many people feel like they’ve had their vote taken away as Labour, Tories and Lib Dems chose not to stand against the Speaker in the last General Election. But we will make sure people have another option and can have a say on who speaks for Chorley. I’ll be standing for protecting our crippled public services and putting climate change, and a sustainable future, at the top of the political agenda.”\nMark is Chorley born and bred and ran the Broadband 4 Brinscall campaign back in 2002, helping to bring broadband to Brinscall and the surrounding villages for the first time. He has been monitoring air pollution in the borough since October 2017, lobbying both Chorley and Lancashire County Council to start monitoring particulate air pollution, and campaigning for Chorley Council to invest in real time monitors.\nMark tweets frequently about these issues and can be followed on @mwt2008.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_cuerden/content_28.html": "Nell Lane Trees Under Threat 20th May 2020 / 23rd June 2024 by Join us in objecting to the loss of trees in Nell Lane. Read more » Cuerden Kitty Frances Nell Lane Trees",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_author_sef_c/content_33.html": "15th April 2025 / 15th April 2025 by Sef_C\nIn Chorley this week we saw Green Party posters in lots of windows., April 2025.\nRead more »\n6th April 2025 / 6th April 2025 by Sef_C\nCampaigning is underway to elect Green Party Lancashire Councillors. Our Chorley Green Party members and volunteers have been out and about (even more than usual!) over the last few weeks, talking to local people and supporting other local causes such as the Save Chorley A&E campaign. Our membership is growing quickly – join us! For […]\n5th July 2024 / 11th July 2024 by Sef_C\nThank you to all our voters in Chorley for giving us our best result yet in a General Election by voting for Green candidate Mark Tebbutt.\n24th June 2024 / 24th June 2024 by Sef_C\nFriends of the Earth and Greenpeace analysed political parties' election manifestos and the Green Party manifesto came out on top.\n22nd June 2024 / 23rd June 2024 by Sef_C\nMadeleine Houghton from Chorley Green Party travelled to Brighton to join in with campaigning there on 22 June. As well as meeting with lots of other Green supporters, Madeleine also sent us these surprise celebrity snaps. Actor and comedian Steve Coogan joined campaigners to show support for Sian Berry, the candidate for Brighton Pavilion.\nChorley Green Party members went to Herefordshire to help with campaigning there. It was an early start but a great day working on the Greens' campaign to get Ellie Chowns elected in Herefordshire. The Green Party regularly hold National Action Days where members from all over the country can join in and help out.\n21st June 2024 / 21st June 2024 by Sef_C\nChorley Trades Union Congress (TUC) held a hustings at the Royal British Legion in Coppull on 19th June. Of the various candidates standing in Chorley, only the Green Party candidate, Mark Tebbutt, and the Chorley Trades Union Congress and Socialist Coalition (TUSC) candidate, Martin Powell-Davies, attended, though the other candidates were invited. Mark and Martin had seven minutes each to introduce themselves and their aims for Chorley, should they be elected as Chorley's MP, followed by questions from the audience.\n17th June 2024 / 19th June 2024 by Sef_C\nRead the Green Party 2024 manifesto here. There are easy-reading, short and long versions available to download, or read our manifesto online.\n16th June 2024 / 16th June 2024 by Sef_C\nRegister to vote by 18th June 2024. Voters in England need to show photo ID to vote at polling stations in the UK Parliamentary general election on 4 July.\n10th June 2024 by Sef_C\nMark Tebbutt, a longtime campaigner for cleaner air in Chorley, is standing in the General Election on July 4th 2024",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_news_page_3/content_18.html": "Mental Health Awareness Week 22nd May 2020 / 23rd June 2024 by According to NHS Digital, mental health issues have increased by 30% in the last decade. Has our mental health declined or has the stigma of being diagnosed been disrupted? Many cite the climate crisis as impacting their wellbeing and ‘eco-anxiety’ has been a key driver in the rise of environmental activism. The recent pandemic has […] Read more » chorley Mental health nature wellbeing\nCouncil to Stop Spraying Dangerous Chemicals 22nd May 2020 / 23rd June 2024 by Council to end use of glyphosates after receiving Green Party petition Last November, around 800 people signed Chorley Green Party’s petition for the council to stop spraying dangerous pesticides in public spaces. Glyphosates are used by the council as a weed-killer, and have already been banned in several countries. There is increasing evidence that they […] Read more » chemical spraying chorley environment petition\nNell Lane Trees Under Threat 20th May 2020 / 23rd June 2024 by Join us in objecting to the loss of trees in Nell Lane. Read more » Cuerden Kitty Frances Nell Lane Trees\nOn the Right Path 20th May 2020 / 23rd June 2024 by Jane Weston has been working to get paths resurfaced in Chorley South West. Read more » Andy Hunter-Rossall Chorley South West Jane Weston",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_council-election/content_10.html": "Thank you for all the support! 4th June 2024 / 4th June 2024 by Sef_C This year’s council elections in Chorley South West saw a repeat success and put Olga Cash and the Green Party in second place again. Read more » chorley Council Election Olga Cash",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_jane-weston/content_67.html": "On the Right Path 20th May 2020 / 23rd June 2024 by Jane Weston has been working to get paths resurfaced in Chorley South West. Read more » Andy Hunter-Rossall Chorley South West Jane Weston",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2020_11_04_greens-call-on-supermarkets-to-protect-against-stock-piling/content_39.html": "News of a second lockdown across England was announced over the weekend and with it came concerns of access to groceries. Chorley Green Party are calling on supermarkets to urgently limit sales of baby formula amid worries of limited supplies for parents.\nIn spring we saw necessary products such as this sell out fast leaving them depleted providing little or no access for others. It’s vital parents have a continuous supply of the essential product and supermarkets are responsible for ensuring this.\nWith job losses and economic hardship growing, many parents will be unable to stockpile such items. Limiting number of purchases per customer provides a fair access to all. Supermarkets need to act quickly to ensure shelves remain stocked.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2021_08_18_letter-local-and-national-government-are-failing-us-on-climate-change/content_21.html": "Last Monday the Intergovernmental Panel on Climate Change (IPCC) released a report described by the UN chief as a “code red for humanity”. It said we are changing the planet in “unprecedented and sometimes irreversible ways”. In a year in which we have seen record breaking heat waves, floods and wildfires around the world it’s becoming increasingly clear that action on climate change is no longer just about protecting future generations.\nBut we are seeing a failure of leadership on climate change at every level. Our national government has pledged to be net zero by 2050, but is allowing plans for new coal fields in Cumbria and new oil fields off the Shetlands to continue, against recommendations from the International Energy Agency.\nLocally, we had large public demonstrations in September 2019, including several local schools “striking for the climate”, leading our Council to declare a climate emergency and pledging to be a net zero borough by 2030. As we approach 2 years since the Council declared this emergency – 2 years out of only a decade in which to transition our energy, our business, our homes and our land – we have yet to see an overall plan for how the Council will achieve this.\nLocally and nationally, targets are not enough. We need proactive leadership and decisive action to avert the IPCC’s worst case scenarios.\nAndy Hunter-Rossall\nChorley Green Party",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_nature/content_58.html": "Mental Health Awareness Week 22nd May 2020 / 23rd June 2024 by According to NHS Digital, mental health issues have increased by 30% in the last decade. Has our mental health declined or has the stigma of being diagnosed been disrupted? Many cite the climate crisis as impacting their wellbeing and ‘eco-anxiety’ has been a key driver in the rise of environmental activism. The recent pandemic has […] Read more » chorley Mental health nature wellbeing",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2021_02_05_controversial-weed-killer-still-widely-used-in-chorley/content_49.html": "In 2019 almost 1000 people signed a Chorley Green Party petition to Chorley Council calling for them to stop spraying Glyphosates in public spaces.\nIn March 2020 Chorley Council introduced thermal weeding equipment and committed to reducing the amount of glyphosates used.\nChorley Green Party Coordinator Andy Hunter-Rossall has been checking in on progress against this commitment, and found that there is still a long way to go.\nAndy reported this pavement for weeding and was shocked when he found it was sprayed with glyphosates\nAt a Chorley Council meeting in January, Andy challenged the Council on their use of the chemicals on residential roads, and asked what they were doing to go further than the 35% reduction managed so far.\nAndy said, “Glyphosates are still being used across the borough by other bodies, including the County Council, housing associations and various other landowners and grounds maintenance contractors. Can the Council confirm that their commitment to reducing the use of glyphosates extends to promoting the use of alternatives with partners and contractors, and does the Council have any measure of the total quantities of the herbicide still being used in the borough.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_2025_04_15_our-vote-green-posters-are-appearing/content_3.html": "Whilst our members and volunteers were out and about in Chorley this week we saw Green Party posters in lots of windows. Here are some we snapped.\nWe have spoken to a large number of residents in Chorley over the last few months – maybe you’ve seen us . Or maybe you’ve asked Olga Cash for help with a local issue.\nOlga has been busy sorting out various issues for Chorley residents, including graffiti, fly-tipping incidents and a LOT of potholes.\nThe Green Party members and volunteers are busy in our area all year round, not just at election times.\nIf you’d like a VOTE GREEN poster to show your support for us, please get in touch.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_category_general-election-2024/content_61.html": "5th July 2024 / 11th July 2024 by Sef_C\nThank you to all our voters in Chorley for giving us our best result yet in a General Election by voting for Green candidate Mark Tebbutt.\nRead more »\n24th June 2024 / 24th June 2024 by Sef_C\nFriends of the Earth and Greenpeace analysed political parties' election manifestos and the Green Party manifesto came out on top.\n22nd June 2024 / 23rd June 2024 by Sef_C\nMadeleine Houghton from Chorley Green Party travelled to Brighton to join in with campaigning there on 22 June. As well as meeting with lots of other Green supporters, Madeleine also sent us these surprise celebrity snaps. Actor and comedian Steve Coogan joined campaigners to show support for Sian Berry, the candidate for Brighton Pavilion.\nChorley Green Party members went to Herefordshire to help with campaigning there. It was an early start but a great day working on the Greens' campaign to get Ellie Chowns elected in Herefordshire. The Green Party regularly hold National Action Days where members from all over the country can join in and help out.\n21st June 2024 / 21st June 2024 by Sef_C\nChorley Trades Union Congress (TUC) held a hustings at the Royal British Legion in Coppull on 19th June. Of the various candidates standing in Chorley, only the Green Party candidate, Mark Tebbutt, and the Chorley Trades Union Congress and Socialist Coalition (TUSC) candidate, Martin Powell-Davies, attended, though the other candidates were invited. Mark and Martin had seven minutes each to introduce themselves and their aims for Chorley, should they be elected as Chorley's MP, followed by questions from the audience.\n17th June 2024 / 19th June 2024 by Sef_C\nRead the Green Party 2024 manifesto here. There are easy-reading, short and long versions available to download, or read our manifesto online.\n16th June 2024 / 16th June 2024 by Sef_C\nRegister to vote by 18th June 2024. Voters in England need to show photo ID to vote at polling stations in the UK Parliamentary general election on 4 July.\n10th June 2024 by Sef_C\nMark Tebbutt, a longtime campaigner for cleaner air in Chorley, is standing in the General Election on July 4th 2024\n3rd June 2024 / 27th June 2024 by Sef_C\nChorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election. Mark was selected by Green Party members in a vote in December 2022.\n17th January 2023 / 27th June 2024 by andyhr\nChorley Green Party have selected local air pollution campaigner Mark Tebbutt as their parliamentary candidate for the next General Election.",
  "https_chorley_greenparty_org_uk_/https_chorley_greenparty_org_uk_tag_environment/content_66.html": "Council to Stop Spraying Dangerous Chemicals 22nd May 2020 / 23rd June 2024 by Council to end use of glyphosates after receiving Green Party petition Last November, around 800 people signed Chorley Green Party’s petition for the council to stop spraying dangerous pesticides in public spaces. Glyphosates are used by the council as a weed-killer, and have already been banned in several countries. There is increasing evidence that they […] Read more » chemical spraying chorley environment petition"
}