{
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_11_19_where-are-gloucestershires-great-ideas/content_135.html": "In May this year, Westminster released £2 billion of funding for safe walking and cycling routes to help councils reduce the health pressure of the pandemic. While councils such as Brighton responded with ambitious plans such as a segregated sea-front cycle lane, Gloucestershire County Council’s vision for Cheltenham went no further than a few unsightly red-and-white bollards in front of a few shops on Bath Road.\nYet even this gesture only came after fierce pressure from Cheltenham residents, who were tired of having to choose between breaking physical distancing guidelines and walking in the road with on-coming motorists. I doubt, however, that the “bollard solution” is what anybody had in mind…\nThis week, we discover that GCC was awarded just £864K out of a possible pot of £1.15 million for safe walking and cycling routes. Why? Because the award depended on how well the first batch of funding from May was spent.\nThe question the people of Cheltenham need to ask is: Do we think GCC’s “bollard solution” was a good example of our funding well spent? And if not, what would we have liked to see?\nDon’t get me wrong: I’m glad GCC got the funding – it’s been far too long coming – but the fact remains: GCC could have (and should have) got more than it did. The reason it didn’t was because it’s run out of ideas and isn’t brave enough to put forward the vision the county needs post-covid.\nGCC urgently needs a shot of imagination and ambition, underpinned by new ideas and fresh insight from across the generations. In short, we need more diverse representation to revitalise and bring new perspectives to a council that has become narrow-sighted and stale. Because without imagination, Gloucestershire will keep missing out.\nJess West – Green Candidate for All Saints Ward",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_housing/content_112.html": "University of Gloucestershire – Student Rents 10th January 2021 by tabijoy Students cannot afford to pay for accommodation they cannot use - and universities must make sure rental conditions are fair. Read more » communities housing rent students university University of Gloucestershire",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_democracy/content_65.html": "Climate People’s Assembly 18th August 2019 / 23rd August 2019 by Cheltenham Green Party Attending the first people's climate assembly for Cheltenham! Read more » community engagement democracy",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_07_30_we-can-learn-lots-from-france/content_32.html": "Many of us have been watching the Olympics in Paris and cheering on team GB. Aside from the sporting excellence on show, the UK should look to replicate some of the amazing policies the French are adopting when it comes to the environment. All could and should be implemented here.\nInvestment In Rivers\nThe Triathlon was part-hosted in the river Seine following huge investment to clean it up. In 1923, swimming in the Seine was outlawed as the river was so filthy. Over a century later, it is clean enough for the Olympics. If Paris can, so can London and other UK cities.\nReusable Packaging\nIf you walk into any eatery in France, even in fast-food restaurants such as McDonald’s, your meal will be served in ‘reusable packaging’ – usually just a plate and cutlery. Since it was introduced in January 2023, it has been estimated they are saving 180,000 tonnes of packaging every year. We should look to copy the ban on all single-use packaging for eat-in sales to help tackle the climate crisis. Plastic pollution is one of the biggest environmental issues we face. Yet in hundreds of thousands of cafes, bars and restaurants across the UK, we’re still being served food and drink in single-use packaging – even when we are eating in.\nTackle Fast Fashion\nFrance plans to introduce a law which will force fast fashion producers to inform customers about the environmental impact of their clothing. A surcharge linked to fast fashion’s ecological footprint starting at around £4 and rising to £10 per item will then be introduced.\nPrioritise Circular Economy\nFrance has introduced grants to support covering the cost of repair for shoes and clothing as well as for electronic gadgets and appliances. We do not need to buy new all of the time. For many goods it should become the exception not the rule.\nFruit & Veg Packaging\nStop using plastic in packaging on fruit and vegetables. France started banning the use of plastic wrapping on fruit and vegetables in supermarkets two years ago and will have a complete ban by 2026.\nDomestic Flights\nStop short-haul domestic flights where train journeys are as quick, if not quicker, door to door. France successfully introduced this last year, and we should look to do the same.\nKind regards,\nDaniel Wilson,\nParliamentary Candidate for Cheltenham Green Party.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_voting-reform/content_148.html": "Green Party calls for PR in Cheltenham 8th April 2023 / 8th April 2023 by Cheltenham Green Party Read more » Cheltenham Green Party proportional representation voting reform",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2021_08_09_what-difference-could-greens-make-on-our-council-copy/content_139.html": "2020 was absolute chaos, and 2021 has been just as stress-inducing. We are seeing the old ways of the world disintegrating. And today the IPCC report for 2021 has been released – hugely anxiety-inducing for people already well-informed on climate issues, but raising vital awareness among people who have the influence to make key changes, yet have so far done nothing.\nThe good news is that since the last IPCC report was released in 2018, we’ve seen climate strikes, Fridays for Future, the meteoric rise of the Green New Deal movement. People are calling for action and a new agenda is being set.\nIt is time to move on from individualistic changes, and it’s time to collectivise! To mire yourself in panic and depression is not going to change anything – but to join a group, like Cheltenham Green Party, you can be on the same level as people who know the stakes, and are taking action for a better world.\nThis year, Cheltenham Green Party came third place in local elections across Cheltenham, and second place out of six candidates in St Paul’s ward, our target ward. We are at the forefront of the change that people want to see. And we want to be there with you.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_climate-activism/content_76.html": "Spiritual Activism with Heather Redington 24th January 2020 / 24th January 2020 by Cheltenham Green Party Read more » climate activism faith groups grief support",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_jan-foster-prestbury/content_11.html": "24th March 2025 / 25th March 2025 by Cheltenham Green Party\nFinally, we have launched the Prestbury and Swindon Village Community Speedwatch Group! It’s taken a while, with training, meetings and far more paperwork than I ever imagined! I’ve suggested that Swindon Village come in with us, which will hopefully increase the pool of available volunteers. We found that the sight of people in hi-viz jackets […]\nRead more »\n1st February 2025 / 1st February 2025 by Cheltenham Green Party\nBelated New Year greetings and Good Wishes to everyone celebrating a festival this month! The last few weeks have brought foul weather and associated problems of mud. I reported mud around the mini roundabouts at the bottom of Blacksmiths Lane, which was subsequently cleaned up, but sadly not the cycleway and areas of the pavement. […]\n16th December 2024 / 16th December 2024 by Cheltenham Green Party\nThis month I’ve been working to get the message out to eligible pensioners to apply for Pension Credit. You have to have applied by 21st December in order to get the Winter Fuel Payment. Apply at https://www.gov.uk/pension-credit/how-to-claim. A cross party group of councillors has produced an information sheet which I’ve been distributing in the ward. […]\n17th November 2024 / 17th November 2024 by Cheltenham Green Party\nFirst of all, I must apologise for last month’s misinformation about Post Office facilities in Prestbury. I received an email from the Post Office on 12th September asking me to spread the word. Unfortunately I didn’t receive a follow up to say it wasn’t happening! I hope no-one was inconvenienced. Prestbury this month has been […]\n16th September 2024 / 16th September 2024 by Cheltenham Green Party\nPost Office:- Great news – Prestbury is to have a ‘light’ Post Office Service on Mondays, Fridays and Saturdays at ‘Dearly Pre-Loved’ on the High Street, for parcels, bill payments and phone top-ups. See here for more info: Consultation Hub – Prestbury High St Drop & Collect GL52 3AR. Spread the word! Idsall Drive and […]\n13th August 2024 / 13th August 2024 by Cheltenham Green Party\nIt was lovely to chat to so many people last month at my first surgery at the library. Also, thanks to all the Prestbury residents who have contacted me over the last month, or stopped me on the footpath. It’s great that so many people care about the community and can be bothered to try […]",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_proportional-representation/content_103.html": "Green Party calls for PR in Cheltenham 8th April 2023 / 8th April 2023 by Cheltenham Green Party Read more » Cheltenham Green Party proportional representation voting reform",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_environmental-protections/content_110.html": "Reflection on Brexit 1st February 2020 / 1st February 2020 by Cheltenham Green Party Read more » brexit environmental protections human welfare",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_climate-change/content_72.html": "A Green take on health and wellbeing 24th August 2023 / 24th August 2023 by Cheltenham Green Party Read more » Cheltenham Green Party Climate Change NHS Strikes",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_05_03_supporting-positive-business-through-coronavirus/content_84.html": "There’s a lot going on right now and it’s an unsettling time. The coronavirus is going to have a huge effect on our society and our economy.\nWe need to proactively support the things that we want to survive this crisis – and like our local shops and suppliers, we need to put our money where our mouths are.\nIf you’re looking for ways to make your money work for the common good, and help other people out of this crisis, here are some places to get started.\nWant to make your domestic energy climate-neutral? It can make a big difference, not only to your wallet – a lot of providers aren’t owned by shareholders, or are run as ethical businesses, so more of your money is reinvested to develop more renewable energy, and make things even better. Check out some information and compare providers here.\nCar standing idle? Want to try more active travel? Now’s a very good time for bikes and forming good habits. We’re lucky in Cheltenham not only to have some amazing cycle shops, but we have fairly flat roads that are currently pretty quiet. Get your bike repaired and ready to go, join a local cycling advocacy and campaigns group, or arrange an appointment. Don’t forget to help support our independent shops once they reopen.\nHow’s your banking looking? You could almost definitely switch to a better bank, given that so many of the biggest banks profit off unfair fees while also funnelling gigantic subsidies to destructive practices. Triodos sets a high standard for transparency and ethical investment, but requires a monthly fee and has no physical branches. However, you can also find fairer practices through building societies, such as Coventry or Nationwide, or credit unions, all of which tend to be more economically resilient as well as supporting local communities.\nCan you positively invest? Obviously we can’t give you advice on what to add to your portfolio, but there are a lot of cool ethical investment opportunities available right now that make life fairer even as they bring in some decent rates of interest. Some funds take contributions from £50, making the whole process relatively accessible, and lowering risk for first-time investors.\nJust switching a few things around in our lives can make a massive difference – so if you can, please support positive business.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_02_06_cycle-summit-event/content_142.html": "Cheltenham and Tewkesbury Cycling Campaign are organising a cycling summit for local cyclists on Saturday 22nd February, from 3.30pm to 6pm.\nThis is following up from September’s meeting, discussing problems people were finding with routes and pathways in town, as well as other barriers to cycling including bike parking and car drivers. We want to develop some workable solutions to key cycling problems around Cheltenham town, and to start developing an events and engagement program for Bike Week, which takes place from 6-14 June 2020.\nThis event will be taking place at the Friends Meeting House, Warwick Place, Cheltenham GL52 2NP.\nRefreshments will be provided at the event.\nWheelchair accessible toilets and front entrance ramp, and secure bike parking available in the courtyard behind the building.\nPlease direct any questions to Tabi at tabi.joy@cheltenham.greenparty.org.uk or membership@cyclecheltenham.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_cheltenham-council_climate-emergency/content_116.html": "28th February 2020 / 28th February 2020 by Cheltenham Green Party\nRead more »\n14th February 2020 / 14th February 2020 by Cheltenham Green Party\n9th August 2019 / 24th August 2019 by Cheltenham Green Party\nLocal Greens attended Cheltenham Council's climate emergency summit on 6th August.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_environmentalism/content_123.html": "Australia Is Burning – Strike a Light Fundraiser 4th February 2020 by Cheltenham Green Party Read more » australia wildfires environmentalism fundraising social causes",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_event/content_115.html": "Get your tickets for a special Green Forum with Jonathon Porritt now! 30th September 2023 by Cheltenham Green Party Read more » by-election event green party jonathon porritt prestbury",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_07_09_things-can-only-get-better/content_31.html": "Congratulations to Keir Starmer and the Labour Party on their victory in last week’s General Election.\nA major factor for the result was the utter contempt the public had for the Conservatives. As such, the Labour government has a lot to prove in the coming months and years. The vote certainly shouldn’t be seen as an endorsement of their lacklustre manifesto. I fear Labour’s pledges will do little to solve the many crises the country faces, be that in the NHS, housing, poverty, the environment, transport, energy, or foreign policy. I hope for the country’s sake I am proved wrong.\nI also want to congratulate Max Wilkinson. He had a resounding win in Cheltenham. The Lib Dems now have the MP, as well as the majority of the county and borough councillors for Cheltenham. They must deliver as there is no longer anyone else to blame.\nWe need to see the cyber park completed on time and on budget. We need to see our hospital services restored and we need to see our town’s needs being met on housing, jobs, the environment and nature. This rests on the Lib Dems’ shoulders now. The Cheltenham Green Party and I will offer our support but be assured we will also call them out when they are getting it wrong.\nThe Greens are coming…\nThe Green Party continues to win across the country. In 2019 we won just one seat, we now have four and have gained an additional 1m votes. Thank you to all the members, volunteers and the voters who supported me to stand at this election. We received a record vote share, which is particularly encouraging when we know many voted tactically in Cheltenham to bring down the Conservative Government. Just imagine what will be possible at the next result now the need to tactically vote is over…\nThank You, Alex Chalk.\nParty politics to one side, I want to thank Alex Chalk for what he has done for Cheltenham over the past nine years. Having campaigned, won three general elections and served the town for that long is to be commended. He helped put Cheltenham on the map within Westminster and was the first local MP to become a Cabinet minister. I sincerely hope he will not be the last. Thank you for your efforts, Alex. You leave big shoes for Max to fill.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_brexit/content_91.html": "Reflection on Brexit 1st February 2020 / 1st February 2020 by Cheltenham Green Party Read more » brexit environmental protections human welfare",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_uncategorised/content_37.html": "15th October 2023 / 21st October 2023 by Cheltenham Green Party\nRead more »\n30th September 2023 by Cheltenham Green Party\n5th September 2023 by Cheltenham Green Party\n24th August 2023 / 24th August 2023 by Cheltenham Green Party\n8th June 2023 / 8th June 2023 by Cheltenham Green Party\n8th April 2023 / 8th April 2023 by Cheltenham Green Party\n31st August 2022 / 31st August 2022 by Cheltenham Green Party\n27th July 2022 / 27th July 2022 by Cheltenham Green Party\n18th June 2022 / 31st August 2022 by Cheltenham Green Party\n18th June 2022 / 18th June 2022 by Cheltenham Green Party",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_all-saints-ward/content_64.html": "Jessica West for All Saints Ward 9th August 2019 / 23rd August 2019 by Cheltenham Green Party Our first councillor candidate - Jessica West for All Saints. Read more » All Saints ward cheltenham council 2020 Jessica West",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_community-engagement/content_41.html": "Climate People’s Assembly 18th August 2019 / 23rd August 2019 by Cheltenham Green Party Attending the first people's climate assembly for Cheltenham! Read more » community engagement democracy",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_05_10_congratulations-to-our-new-cheltenham-councillors/content_109.html": "I want to congratulate all 40 newly elected councillors. Cheltenham expects and needs you to put the town’s interests first and that you represent all the residents in the wards you were elected in, not just those who voted for you.\nThe Green Party is delighted Tabi Joy was re-elected in St Paul’s. Ashleigh Davies joins Tabi in the ward as the second Green councillor while Jan Foster became the first for the Prestbury area. Thank you to all those who supported our Green candidates.\nThe state of democracy…\nThe Liberal Democrats have long championed PR for general elections and I call upon the Cheltenham Lib Dems to finally support the change when it comes to local government.\nThey have 90% of the councillors on the borough council and did this with 52% of the vote. Conversely the Conservatives polled 25% and have no councillors while the Greens polled a record 16% of the vote and have less than 8% of the seats.\nIt is not a good for democracy to have one party dominate the chamber in this way. If it hadn’t been for the Green Party and PAB we would have a one party town and surely the Lib Dems do not support that?\nAn astonishing 36 of the 40 councillors are from one party. This leaves St Paul’s and Prestbury as the only areas with representatives from other parties.\nJust as concerning is the drop in voter participation. Only 35% of the town decided to vote and, in some areas, this was as low as 19%. This should be of concern for us all and parties should urgently consider how turnout can be improved in future elections.\nThank you to the outgoing councillors\nIrrespective of party allegiance, I want to thank the outgoing councillors for their service to the town. Let us not forget, being a councillor carries a lot of responsibility and requires a lot of personal commitment.\nI want to make a special mention to Wendy Flynn, the outgoing Green Councillor for Hester’s Way. She was first elected in 2002 and during her 22 years has always put the interests of the constituents first. Thank you, Wendy. You will be missed in the chamber.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_jan-foster/content_28.html": "Greens finish strong second in Prestbury, look to 2024 15th October 2023 / 21st October 2023 by Cheltenham Green Party Read more » by-election cheltenham Cheltenham Green Party green party jan foster local elections prestbury\nPrestbury by-election announced 5th September 2023 by Cheltenham Green Party Read more » by-election green party jan foster prestbury",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_05_24_the-general-election-cheltenham-has-a-positive-choice/content_27.html": "If Rishi Sunak has done one good deed this year, it is to finally announce the date for the General Election. The Tory administration has failed on nearly every measure it was elected upon – Brexit, levelling up, the economy, public health, schools, the health service, defence, prisons, immigration system, the pound, the reliance on food banks, local government services, the country’s international standing – all worse now than when they took office in 2019. Surely the worst government in living memory?\nThe good news is the Tories are highly likely to lose the election – all political commentators agree on that. Labour is expected to win irrespective of what happens in Cheltenham.\nThis means everyone who historically voted Lib Dem to try to stop the Tories, or voted Tory to stop the Lib Dems, have a choice. They can for the first time in years vote for the candidate and party they like the most and not the one they hate the least. There will be at least 5 parties standing in the town so if ever there was an opportunity to shake up the political fortune of the town – this is the time to do it!\nThe Greens came second to the Lib Dems in the council election…..so there is nothing to say we couldn’t come second or even first in the General!\nHow can the fifth largest economy be failing to provide basic human needs?\nThe charity School Food Matters polled 10,000 teachers in England on the extent of pupil hunger at their schools and the impact it is having on children and their learning. It found that four in ten teachers surveyed said pupils in their class were regularly too hungry to learn, with the figure jumping to 63 per cent in the most deprived areas. More than a fifth of teachers said this issue has worsened since the start of the academic year.\nIt is not rocket science. Humans need food, water, shelter, clear air and warmth to function. Yet why is it on nearly every measure the fifth leading economy in the world fails to look after so many. Children going hungry, contaminated drinking water, record levels of homelessness, air pollution levels regularly missing safe standards and our housing too poorly insulated and costly to heat. It is time free school meals are provided for all. It is time water companies are renationalised. It is time to implement a radical social housing renovation and building plan and it is time to have a clear strategy which reduces deaths caused by poor air quality.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2023_12_15_we-need-more-transparency-from-lib-dems/content_106.html": "Those are not my words but those of the Lib Dem leader of Gloucester City Council! It would appear\nCheltenham Borough Council, which co-owns Gloucestershire Airport, has been in talks to sell off the\nairport without consulting many of their colleagues who represent the other shareholder\n…..Gloucester City Council. Are we surprised? Sadly not. This is yet another action being carried out by the borough council\nwithout consultation. We saw much the same with their decision to disband Cheltenham Borough\nHomes. The logic for bringing CBH in house remains as clear as the River Chelt after Severn Trent has\ndischarged more sewerage into it. We need more transparency from our elected officials. Engagement in local democracy is already\nlow in Cheltenham and that is not a good thing. COP28\nAs the COP28 climate talks continue, the Green Party has set out three key demands.\nFirst, we need a clear unambiguous commitment from the UK government to the 1.5C Paris\nAgreement target which was signed by 196 countries eight years ago at COP21. The government\nmust do whatever it takes to get this target back on track. An ambitious strategy is now necessary as\na result of dither and delay by countries like the UK in taking the bold action needed. Second, the fair and managed phase-out of all fossil fuels. As one of the rich countries most\nresponsible for the climate crisis, the UK must stand on the side of future generations and those on\nthe front line of climate breakdown. The government must resist pressure from the petrostates and\nothers at COP who wish to continue with business as usual and keep the world hooked on fossil\nfuels. At home this means leading by example with an immediate end to all new oil and gas licences\nand a rapid acceleration towards renewable energy. Thirdly, these climate talks must recognise that it is a super-rich elite who are super-heating the\nplanet. The government must be willing to challenge the grotesque inequality driving climate\nbreakdown and reform our tax system to make the polluter pay. This means taxing the wealth of the\nsuper-rich and introducing a carbon tax on the most polluting corporations and individuals.\nIntroduced globally these could generate a generous new Loss and Damage Fund to finance climate\naction in the poorest countries – those suffering the most from the impacts of climate breakdown\nbut contributing the least to the crisis.\nIf you have any questions about this article or want to raise any issues with me as your Green Parliamentary Candidate for Cheltenham, you can contact me at directly at daniel.wilson@cheltenham.greenparty.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_cheltenham-green-party/content_101.html": "Greens finish strong second in Prestbury, look to 2024 15th October 2023 / 21st October 2023 by Cheltenham Green Party Read more » by-election cheltenham Cheltenham Green Party green party jan foster local elections prestbury\nA Green take on health and wellbeing 24th August 2023 / 24th August 2023 by Cheltenham Green Party Read more » Cheltenham Green Party Climate Change NHS Strikes\nGreen Party calls for action on speeding and street crossings 8th June 2023 / 8th June 2023 by Cheltenham Green Party Read more » 20 is plenty Cheltenham Green Party street crossings\nGreen Party calls for PR in Cheltenham 8th April 2023 / 8th April 2023 by Cheltenham Green Party Read more » Cheltenham Green Party proportional representation voting reform",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_20-is-plenty/content_54.html": "Green Party calls for action on speeding and street crossings 8th June 2023 / 8th June 2023 by Cheltenham Green Party Read more » 20 is plenty Cheltenham Green Party street crossings",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_national-action/content_143.html": "Skip to content\nSkip to footer\nCheltenham\nMenu\nNews\n2025 Candidates\nCouncillors\nGet Involved\nContact Us\nJoin\nDonate\nSearch\nSearch\nJoin\nDonate\nMenu\nSearch\nHome\nNational Action\nNational Action\nWater Is Life\n27th January 2020\nby\nCheltenham Green Party\nRead more »\nsustainability\nTo top",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_by-election/content_40.html": "Greens finish strong second in Prestbury, look to 2024 15th October 2023 / 21st October 2023 by Cheltenham Green Party Read more » by-election cheltenham Cheltenham Green Party green party jan foster local elections prestbury\nGet your tickets for a special Green Forum with Jonathon Porritt now! 30th September 2023 by Cheltenham Green Party Read more » by-election event green party jonathon porritt prestbury\nPrestbury by-election announced 5th September 2023 by Cheltenham Green Party Read more » by-election green party jan foster prestbury",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2025_02_01_prestbury-ward-news-january-25/content_3.html": "Belated New Year greetings and Good Wishes to everyone celebrating a festival this month!\nThe last few weeks have brought foul weather and associated problems of mud. I reported mud around the mini roundabouts at the bottom of Blacksmiths Lane, which was subsequently cleaned up, but sadly not the cycleway and areas of the pavement. I strongly believe that pedestrians and cyclists have as much right to mud-free passage as motorists so, after further communication, there is agreement to clean the pavement, despite strained resources. I shall keep checking until it’s done!\nI am continuing regularly to contact the County Council about other Highways issues in Prestbury such as flooding and speeding. The police Road Safety and Traffic Management Officer has agreed to meet me and look at the situation. If anyone has anything they would like me to take forward, please do get in touch.\nSome residents of Prestbury have been in touch about Tetrapak/carton recycling. There is a ‘Waste Wizard’ tucked away on the council website which tells us where we can take them (often a long drive) so wouldn’t it be better to have Tetrapak/cartons collected at the kerbside? Your Green Councillors are asking for this to be funded in the forthcoming budget. In the meantime, the link to the Waste Wizard is below.\nhttps://www.cheltenham.gov.uk/info/5/bins_and_recycling/1781/waste_wizard\nThe big political news in December was that Gloucester County Council (GCC) wrote to parliament to request that the County Council elections in May be postponed. This is because a major shake-up of local government is planned. GCC drafted the letter without any consultation with other local councils and the Cheltenham Green councillors do not support postponing the elections.\nPlease note, my next surgery at the library will be on 8th February, NOT 15th as previously advertised.\nPlease continue to contact me with your concerns and comments!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_strikes/content_92.html": "A Green take on health and wellbeing 24th August 2023 / 24th August 2023 by Cheltenham Green Party Read more » Cheltenham Green Party Climate Change NHS Strikes",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2022_04_26_ofgem-standing-charge-apr22/content_63.html": "FAO: Jonathan Brearley, CEO of OFGEM\n26th April 2022\nDear Mr Brearley,\nHaving worked for several years in domestic energy supply, I am deeply conscious of the profound and destructive effect of rising energy prices upon prepayment meter users, most of whom are renters in precarious circumstances.\nI understand that standing charges are set at a base rate for all energy users so that supply and infrastructure can be maintained. However, it doesn’t make sense for it to be the same rate regardless of the amounts of actual energy used – since wealthier householders use a much greater supply of energy, so put far more pressure on the grid. It simply isn’t fair or reasonable to expect them to pay the same amount as people who use a fraction of their supply demands.\nDomestic energy supply to warm our homes, light our space and cook our meals is something that no-one in the UK can live without. We have no choice but to pay for unfair standing charges that are set by yourselves. OFGEM cannot exist as an entity to make the market more fair for consumers if we are working from a catastrophic flaw at the foundation of pricing structure.\nIn addition to these standing charges – and the variable and highly unpredictable costs of energy for prepayment users who cannot simply be shifted to energy plans, a new supplier or direct debit payments that are normally recommended to people wishing to save money – I am also very concerned that these users are also now expected to shoulder the costs of failed energy suppliers. Those suppliers that haven’t gone into closure are passing their own costs onto their customers and raising prices – this should not be, under any circumstances, the route that we can take. People are terrified of the effects this is having on their household budgets and standard of living.\nI am writing to ask you urgently to do as has been suggested by Fuel Poverty Action, which has written to you asking you to:\n-Stop financing the cost of failed suppliers from the standing charge on customers’ bills.-Drastically reduce standing charges.\n-Work towards eliminating standing charges altogether, as a move towards Energy for All.\n-Stop charging prepayment customers more than people who pay bills by direct debit.\n-No imposition of prepayment meters – these should be a voluntary option, not a weapon against people who run into debt.\n-Energy for All: free energy to cover basic needs, to be paid for by a windfall tax on energy companies’ profits, the ending of subsidies to fossil fuels, and higher prices for profligate energy use by people who can afford it.\nI look forward to your addressing this unconscionable situation as early as possible.\nMany thanks,\nTabi Joy\nCheltenham Green Party\nIf you’d like to send OFGEM CEO Jonathan Brearley an email of your own, Fuel Poverty Action has a simple form to help you get in touch with your views.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tabi-joy/content_93.html": "Councillor for St Pauls\nCouncillor Tabi Joy, St Paul’s\nHello! I’m really proud to be elected Borough Councillor in St Paul’s Ward!! Thank you so much for your support in making it happen. If you have a local issue you’d like me to address, please get in touch hereSt Pauls has been taken for granted by the Lib Dems for more than two decades now and deserved better representation on the council. There are particular concerns about traffic, safety and street maintenance, as well as a clear need for better public transport, better housing provision, and improved facilities for older people. There’s also the issue that, caught between the middle of town and the university campus, the needs of both students and long-term residents are often overlooked.\nNow I’m on the council and have a seat at the table to represent you, I want to push for the changes we need to see.\nSince moving to Cheltenham in 2017, I’ve worked in External Liaisons for Cheltenham Welcomes Refugees, and at the weekly hub with people seeking asylum. I’ve been a committee member with the Cheltenham and Tewkesbury Cycling Campaign to campaign for better road planning and active travel links across town. My background is in customer services, so I always want to try to tackle problems head-on and make positive progress.\nI’m also helping to develop the Young Greens group and carry out public outreach activities to local groups and schools. If you’d like me to come to speak about our work or local climate action, please shoot me a message!\nI look forward to seeing you out and about around St Pauls, but please feel free to reach out with comments or suggestions of ways I can help:\nCorrespondence address: c/o Municipal Offices, Promenade, Cheltenham GL50 9SA\nEmail: cllr.tabi.joy@cheltenham.gov.uk\nMobile: 07532 698 461",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2019_10_01_a-week-of-climate-action/content_35.html": "With an increase of interest in climate issues this year, we attended the University of Gloucestershire’s Freshers Fayre and the Cheltenham Climate Strike.\nManaging the Freshers stall through Wednesday, we tried to cut through some of the overwhelm students might have been feeling with flyers and invitations to the climate strike. We had some great conversations with students fed up with politics as usual, and had a lovely time connecting with people on the issues we care about.\nThe worldwide climate strike on Friday 20th September drew supporters of over 4 million people in total, around 400 of whom were in Cheltenham. Numerous cars honked support along the route of the march, and we saw people leaning out of upstairs windows along the high street and waving down at us.\nThe crowd stopped for a protest in front of the borough council municipal offices. Three PPCs – Tabi Joy for the Greens, Max Wilkinson for the Liberal Democrats, and Alex Chalk for the Conservatives – gave speeches. Alex was booed and shouted down by protesters until he couldn’t go on speaking – the frustration at the lack of concrete action taken to address climate change was palpable.\nThe Cheltenham Ladies College turned up right in the middle of things with another hundred protestors, which really galvanised the energy of the crowd. Again we were reminded of the young people who will live to see the chaos that this climate emergency will unleash. We’re going to keep fighting for a better future for them.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_climate-emergency/content_30.html": "Cheltenham Council Climate Summit 9th August 2019 / 24th August 2019 by Cheltenham Green Party Local Greens attended Cheltenham Council's climate emergency summit on 6th August. Read more » cheltenham council climate emergency",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_health/content_141.html": "Essential Support for Essential Workers 14th January 2021 / 14th January 2021 by tabijoy Read more » community coronavirus frontline workers health",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_01_19_the-post-office-scandal/content_128.html": "hundreds of honest, hard-working people at the Post Office. We shouldn’t need a TV drama to get the Government to do the right thing and address a manifest\ninjustice on this scale. The severity and scale of the scandal was made worse by the economic model chosen for the Post\nOffice. Ministers washed their hands of responsibility while this public corporation – with the\nGovernment as the sole shareholder – was told to chase profits and allowed to take risks with\nunproven, outsourced technology. No one was in charge, no one cared and when it all went wrong, no one was responsible. We need\nmodels of ownership that put public interest and accountability first. The scandal also raises\nquestions about the obsession from all government parties with outsourcing and avoiding\nresponsibility. It is right that every wrongful conviction is overturned as quickly as possible, but the fact that the\nGovernment has been forced to bring forward emergency legislation that overrides the justice\nprocess underlines how ministers let this tragedy drift on into a full-blown crisis.\nThis is not the first time government has been found wanting when the lives of people have been\nturned upside down by failings in public administration. Too many are still waiting for justice, from\nGrenfell residents and infected blood scandal victims to nuclear test veterans.\nEvery one of these injustices needs resolving as soon as possible. Reduce, Reuse, Recycle\nI want to give a shout out to Vision 21 and the repair cafes they run each month. They run 10-1pm\non the first Saturday of the month at St Andrew’s Church on Montpellier Street.\nWith the ongoing cost of living crisis and climate emergency, there is no better way to do your bit by\nkeep using things you already have. This cafe repairs anything from electrical goods to textiles. It is time the UK follows the lead set by France, where the public can claim back anything between\n€6 and €25 of the cost of mending clothes and shoes at registered businesses from the government.\nThey have also introduced a similar scheme for repairing electronic gadgets and appliances. Such\nschemes will significantly help to reduce waste and boost the circular economy. Before you head to the shops to replace something which is damaged or no longer works, consider\npaying a visit to Cheltenham’s repair cafe – it might save you money and help the planet at the same\ntime.\nIf you have any questions about this article or want to raise any issues with me as your Green Parliamentary Candidate for Cheltenham, you can contact me at directly at daniel.wilson@cheltenham.greenparty.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_01_21_zero-west-conference-2020/content_125.html": "On Thursday last week, Cheltenham Green Party attended the Zero West Winter Conference.\nZero West are paving the way for ambitious co-operative action. Progress is slow-going due to crumbling national infrastructure, funding cuts and planning restrictions, and theirs is absolutely essential work that needs to accelerate to make a zero-carbon society.\nBristol Councillor Carla Denyer gave the keynote opening address, and other guests included Transport for Greater Bristol Alliance, Friends of the Earth, and numerous experienced speakers. The conference included workshops on zero carbon transport, creative public engagement, personal action on climate change and fossil fuel divestment, among plenty of others.\nThe public engagement session in particular, led by Encounters Arts, was very provocative and sensitive, challenging us to think differently about our work, and encourage people to dismantle dysfunctional social values.\nOverall it was an enriching and useful day of activity and discussion. It’s exciting for Cheltenham to have a place at the table, reimagining what our energy generation and distribution of the future could look like. It’s simple, but it’s vital! We’d love to see this energy spreading to our town.\nIf you’d like to learn more about Zero West, or get involved with their work, please check out their website – it’s packed with information and ways to help make amazing change. Individuals can join as members for free, and receive updates and chances to participate in group actions – highly recommended.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2022_08_31_daniel-wilson-parliamentary-candidate/content_130.html": "Cheltenham Green Party has just announced its parliamentary candidate to challenge the Conservatives at the next UK General Election.\nSt Paul’s resident and local businessman Daniel Wilson was selected in a ballot that was open to all local Green Party members.\nThe Greens have seen rapid growth in Cheltenham in recent years, coming a strong third ahead of Labour in the 2021 and 2022 elections. The party has committed to standing in every future election in the town to challenge the two-party status quo in Cheltenham.\n“For too long residents in Cheltenham have felt let down and ignored by their politicians and forced to choose between two very similar parties. But now, as people feel the full force of the cost-of-living crisis and with the climate crisis on our doorstep, it is time for serious change“, says Daniel.\n“The Green Party has the ideas to tackle these crises, calling for a nationwide home insulation program to cut bills, a move to renewable energy to lessen dependency on gas and oil, taking energy suppliers into public ownership and cutting the energy price tariff to deal with the huge cost of living crisis we all face this winter. The big solutions are there, but we need the government to step up.”\nDaniel’s selection comes off the back of the Greens causing an upset by winning their first ever councillor in Cheltenham in this May’s local elections by taking a seat off the Liberal Democrats, followed by the defection of Liberal Democrat Wendy Flynn (Hesters Way) to the Greens.\nDaniel said:\n“People from all political parties are turning to the Greens because they know that we work for their community and don’t take their support for granted. I will stand up for local residents in Cheltenham and shake up the tired old “Conservative vs Lib Dem” story that has dominated politics here.“\nGreen Group co-leader Councillor Tabi Joy (St Paul’s) said:\n“I’m really proud to support Daniel as Green parliamentary candidate for Cheltenham. Daniel gets climate and social justice issues and combines that with a track record as a successful local businessman, he would be an excellent local MP. It is Greens who offer possibilities beyond business-as-usual politics.”",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_author_cheltenham-green-party/content_9.html": "24th March 2025 / 25th March 2025 by Cheltenham Green Party\nFinally, we have launched the Prestbury and Swindon Village Community Speedwatch Group! It’s taken a while, with training, meetings and far more paperwork than I ever imagined! I’ve suggested that Swindon Village come in with us, which will hopefully increase the pool of available volunteers. We found that the sight of people in hi-viz jackets […]\nRead more »\n1st February 2025 / 1st February 2025 by Cheltenham Green Party\nBelated New Year greetings and Good Wishes to everyone celebrating a festival this month! The last few weeks have brought foul weather and associated problems of mud. I reported mud around the mini roundabouts at the bottom of Blacksmiths Lane, which was subsequently cleaned up, but sadly not the cycleway and areas of the pavement. […]\n16th December 2024 / 16th December 2024 by Cheltenham Green Party\nThis month I’ve been working to get the message out to eligible pensioners to apply for Pension Credit. You have to have applied by 21st December in order to get the Winter Fuel Payment. Apply at https://www.gov.uk/pension-credit/how-to-claim. A cross party group of councillors has produced an information sheet which I’ve been distributing in the ward. […]\n17th November 2024 / 17th November 2024 by Cheltenham Green Party\nFirst of all, I must apologise for last month’s misinformation about Post Office facilities in Prestbury. I received an email from the Post Office on 12th September asking me to spread the word. Unfortunately I didn’t receive a follow up to say it wasn’t happening! I hope no-one was inconvenienced. Prestbury this month has been […]\n2nd October 2024 / 2nd October 2024 by Cheltenham Green Party\nCompared with towns of a similar size, Cheltenham has a good range of sports and recreation facilities. We have plenty of green spaces within the town and the Cotswold hills are on our doorstep. We also have several sports fields and tennis courts dotted across the town, as well as the amazing Lido. For over […]\n16th September 2024 / 16th September 2024 by Cheltenham Green Party\nPost Office:- Great news – Prestbury is to have a ‘light’ Post Office Service on Mondays, Fridays and Saturdays at ‘Dearly Pre-Loved’ on the High Street, for parcels, bill payments and phone top-ups. See here for more info: Consultation Hub – Prestbury High St Drop & Collect GL52 3AR. Spread the word! Idsall Drive and […]\nThe Budget at the end of October will set the course for the rest of this parliament. Green MPs do not accept the need for public spending cuts. On the 4th July, the public didn’t vote for things to get worse. We want a bold budget for investment in our broken public services and the […]\n1st September 2024 / 9th September 2024 by Cheltenham Green Party\nBoris Johnson is not welcome in this town. This is the man who allowed the Cheltenham Festival to go ahead despite the risk of covid. Cheltenham suffered as a result of that failure. The pandemic spread here much faster than in other areas with our hospital having the highest number of coronavirus hospital admissions in […]\n26th August 2024 / 26th August 2024 by Cheltenham Green Party\nThe cyber park is going to be a big development within Cheltenham, and it’s important that we ensure that we push for this to be the best that it can be for the people of Cheltenham. With more than 1000 new houses, and the promise of 35% of those to be affordable, it’s also likely […]\n13th August 2024 / 13th August 2024 by Cheltenham Green Party\nIt was lovely to chat to so many people last month at my first surgery at the library. Also, thanks to all the Prestbury residents who have contacted me over the last month, or stopped me on the footpath. It’s great that so many people care about the community and can be bothered to try […]",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_wildlife/content_68.html": "UoG Hedgehog Society 14th February 2020 / 14th February 2020 by Cheltenham Green Party Read more » hedgehogs students University of Gloucestershire wildlife",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_cheltenham-council/content_43.html": "Cheltenham Council Climate Summit 9th August 2019 / 24th August 2019 by Cheltenham Green Party Local Greens attended Cheltenham Council's climate emergency summit on 6th August. Read more » cheltenham council climate emergency",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_jonathon-porritt/content_74.html": "Get your tickets for a special Green Forum with Jonathon Porritt now! 30th September 2023 by Cheltenham Green Party Read more » by-election event green party jonathon porritt prestbury",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_daniel_ppc/content_16.html": "Posts by Daniel Wilson PPC\n2nd October 2024 / 2nd October 2024 by Cheltenham Green Party\nCompared with towns of a similar size, Cheltenham has a good range of sports and recreation facilities. We have plenty of green spaces within the town and the Cotswold hills are on our doorstep. We also have several sports fields and tennis courts dotted across the town, as well as the amazing Lido. For over […]\nRead more »\n16th September 2024 / 16th September 2024 by Cheltenham Green Party\nThe Budget at the end of October will set the course for the rest of this parliament. Green MPs do not accept the need for public spending cuts. On the 4th July, the public didn’t vote for things to get worse. We want a bold budget for investment in our broken public services and the […]\n1st September 2024 / 9th September 2024 by Cheltenham Green Party\nBoris Johnson is not welcome in this town. This is the man who allowed the Cheltenham Festival to go ahead despite the risk of covid. Cheltenham suffered as a result of that failure. The pandemic spread here much faster than in other areas with our hospital having the highest number of coronavirus hospital admissions in […]\n26th August 2024 / 26th August 2024 by Cheltenham Green Party\nThe cyber park is going to be a big development within Cheltenham, and it’s important that we ensure that we push for this to be the best that it can be for the people of Cheltenham. With more than 1000 new houses, and the promise of 35% of those to be affordable, it’s also likely […]\n30th July 2024 / 13th August 2024 by Cheltenham Green Party\nMany of us have been watching the Olympics in Paris and cheering on team GB. Aside from the sporting excellence on show, the UK should look to replicate some of the amazing policies the French are adopting when it comes to the environment. All could and should be implemented here. Investment In Rivers The Triathlon […]\n9th July 2024 / 13th August 2024 by Cheltenham Green Party\nCongratulations to Keir Starmer and the Labour Party on their victory in last week’s General Election. A major factor for the result was the utter contempt the public had for the Conservatives. As such, the Labour government has a lot to prove in the coming months and years. The vote certainly shouldn’t be seen as […]\n25th June 2024 / 13th August 2024 by Cheltenham Green Party\nIt has been the same two-horse political race in Cheltenham for too long. You can change that on July 4th. History has shown us this can happen. In 1997, the Green Party polled 2.7% of the vote in Brighton Pavilion. 13 years later Caroline Lucas was elected as the first Green MP to an area […]\n15th June 2024 / 13th August 2024 by Cheltenham Green Party\nI am standing as your Parliamentary candidate for the Green Party. I am married with 4 daughters and have lived in the area for over 20 years. I am not a career politician, having worked in business all my life, building and leading successful companies across Europe. I am a trustee of the Cheltenham Trust where I […]\n24th May 2024 / 13th August 2024 by Cheltenham Green Party\nIf Rishi Sunak has done one good deed this year, it is to finally announce the date for the General Election. The Tory administration has failed on nearly every measure it was elected upon – Brexit, levelling up, the economy, public health, schools, the health service, defence, prisons, immigration system, the pound, the reliance on […]\n10th May 2024 / 13th August 2024 by Cheltenham Green Party\nI want to congratulate all 40 newly elected councillors. Cheltenham expects and needs you to put the town’s interests first and that you represent all the residents in the wards you were elected in, not just those who voted for you. The Green Party is delighted Tabi Joy was re-elected in St Paul’s. Ashleigh Davies […]",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2021_01_10_university-of-gloucestershire-student-rents/content_124.html": "Cheltenham Green Party have written this week to the Vice-Chancellor of the University of Gloucestershire. Students are facing an economic crisis as well as a health and climate crisis – part-time student jobs are far more likely to disappear during lockdown, and bursaries and grant support have been cut to the point of vanishment over the past few years.\nIt is time to take urgent action to help our next generation, and stop them from falling into deep and irreversible uncertainty.\n================================================================9th January 2021\nRE: Partial accommodation and tuition fee refunds for students.\nDear Vice-Chancellor Stephen Marston,\nAfter the Prime Minister’s statement regarding a third national lockdown on Monday 4th January and with a subsequent press conference on Tuesday 5th January, we are writing to you to raise our urgent concerns about the welfare of University of Gloucestershire students.\nWhile Cheltenham Green Party acknowledges and respects the University’s sovereignty, it is vital, and feel it is only right, to protect the interests of our student constituents and future generations.\nDuring Monday’s announcement, the Prime Minister failed to utter a single word in acknowledgment of the deep uncertainty and economic impact being presently faced by university students. That despite the fact over 2 million students live in England and Wales and are suffering and curtailed, yet again, due to tightened restrictions.\nWith another national lockdown in place, students are being discouraged from returning to their term-time addresses if they have not already done so. Furthermore, a proportion of students’ accommodation fees are used for running services and facilities they are no longer able to access, such as the gyms, social events, cafes and bars at Pittville Student Village. To expect University of Gloucestershire students to pay full fees for accommodation they cannot live in, and services they cannot use, is unreasonable and unjust.\nCovid restrictions have removed many, if not all, practical elements to several courses. Laboratories have been closed off, field trips have been cancelled, and overseas fieldwork and work experience opportunities have disappeared. Despite the utmost effort of lecturers, no form of online learning can adequately replicate the development of practical skills so many students rely on for future careers. Burdening students with tuition fees is already an immoral policy, but forcing students to pay upwards of £9,250 for an experience falling so far short of expectations is even more so, especially since that experience is one metric used to justify fees and the marketisation of higher education in the first place.\nThese students made the choice to apply for a place at the University of Gloucestershire based on the unique range of services and amenities that they are now missing out on. The University is profiting from their loss of opportunity and their disappointment. It is not a\nfit start in life for any person, let alone anyone who has trusted you and your staff to guide them into their adulthood. You have an opportunity to provide the support that they deserve.\nMr Marston, we are urging you to initiate negotiations with your students concerning partial refunds for tuition and for accommodation costs. It is unjust for the University to profit from its students while these same students are legally prohibited from returning to term-time addresses without extenuating circumstances, are having a learning experience that does not reflect what they were sold and facing job shortages as a result of the pandemic.\nWe are also urging you to join your colleagues at Universities UK in lobbying the Department of Education for financial support for our higher education institutions. Without centralised funding, the UK’s world-leading universities face financial collapse in the very near future, creating damage that may take years to repair.\nYou have the platform to persuade our Government to provide the funding packages that would rescue our universities from economic failure and safeguard the UK’s higher education and research for the future.\nThank you for taking time to read our letter. We look forward to your response.\nYours sincerely,\nCheltenham Green Party",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_01_19_air-pollution-in-cheltenham/content_158.html": "Cheltenham has a perennial problem with air pollution. Much of this, unfortunately, comes straight from high rates of traffic.\nWe have almost forty car dealerships in the Cheltenham area, there’s unsustainable competition for offroad parking, and we’re in the middle of an unsustainable trend for SUVs, sales of which outnumber electric vehicles 20 to 1.\nExisting landscaping and infrastructure conditions aren’t ideal either. We have a complex one-way system that’s not necessarily the most effective way to move traffic around the town centre. And we’re surrounded by hills that trap dirty air, circulating pollution around homes, schools, and places of work.\nAgainst all this, alternative forms of transportation such as cycling or buses aren’t being given proper investment or support, when they’re very cost-effecting and efficient ways of getting around town.\nCheltenham Green Party is expanding an air pollution monitoring scheme across Cheltenham to try to pin down the scientific evidence and address the situation. We already have two established sites in Leckhampton at the moment, and we’re looking at other locations.\nWe urgently need better coverage across the whole town.\nSo we’ve decided to take further action and empower our local community to face up to the situation. We’re launching a crowdfunder campaign in a few weeks time, and hoping to raise around £2500 to £3500. This would pay for ten new monitors, which can give us a huge amount of extra data.\nWatch out for more on this in coming days!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_social-causes/content_151.html": "Australia Is Burning – Strike a Light Fundraiser 4th February 2020 by Cheltenham Green Party Read more » australia wildfires environmentalism fundraising social causes",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_09_16_the-country-voted-for-change-and-hope-when-does-it-begin/content_5.html": "The Budget at the end of October will set the course for the rest of this parliament. Green MPs do not accept the need for public spending cuts. On the 4th July, the public didn’t vote for things to get worse.\nWe want a bold budget for investment in our broken public services and the green economy of the future. By increasing taxes on the wealthiest and reforming the entire system, we can avoid slashing public spending or cuts to winter fuel allowance. This fairer approach will also deliver something that is in short supply in Labour’s plans – real hope.\nThe Green Party wants tax changes to generate the funds needed to increase public health budgets to 2015/16 levels and boost GP funding; enable the government to restore social care charging reforms; restore and increase funding for nature-friendly farming and embark on a major programme of home insulation.\nWe need to invest in defending public services and protecting our environment – and we can do so with some changes to the tax system to ask the wealthiest in society to pay a little more. These tax changes are modest by the standards of many other European countries who recognise that having high quality public services and a greener economy needs investment.\nThis government risks pushing more people into poverty. They have removed winter fuel payments for pensioners and won’t budge on the cruel two-child benefit cap. Meanwhile, our NHS is severely overstretched, and this government has reduced funding for nature-friendly farming, just as this crucial scheme was starting to take off.\nWe can tackle poverty and inequality, improve wellbeing and protect our environment. These are political choices.\nThere are several vital proposals that Green MPs are calling for in the October budge, including:\n- Introduce a wealth tax on multi-millionaires and billionaires\n- Reform Capital Gains Tax so it aligns with income tax rates\n- Align tax rates on investment income with National Insurance rates on employment income\n- Remove the Upper Earnings Limit on National Insurance – stopping the tax break for higher earners.\n- Reform inheritance tax, ensuring that intergenerational transfers of wealth are taxed more fairly\n- Close the loopholes in the fossil windfall tax\n- Raise fuel duty to speed up the move to electric vehicles and generate funds to invest in public transport, active travel and fixing our potholed roads",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_09_16_prestbury-ward-news-september-24/content_18.html": "Post Office:- Great news – Prestbury is to have a ‘light’ Post Office Service on Mondays, Fridays and Saturdays at ‘Dearly Pre-Loved’ on the High Street, for parcels, bill payments and phone top-ups. See here for more info: Consultation Hub – Prestbury High St Drop & Collect GL52 3AR. Spread the word!\nIdsall Drive and The Bank:- A planning application has been submitted for Idsall Drive car park site, Ref No: 24/01353/FUL, for one dwelling. People are already concerned about access to The Bank and Idsall Drive being restricted by builders’ lorries if permission is granted. The parking management team have been informed of these fears and residents should contact the police if the builders break highway laws.\nTrees:- Sadly we’ve lost a couple of mature trees in the village recently. The Borough Council have adopted an updated Tree Inspection Protocol which includes an Ash Die-back Management Plan to help look after all the trees for which they are responsible.\nHighways:- I know that some of Prestbury’s pavements and roads are in a bad state. I have reported pavement potholes on Fix My Street and I regularly badger our County Councillor about the state of our roads. I am assured that something will be done about them, eventually.\nConsultation: – the Borough Council are currently having a public consultation on the Council Tax Support Scheme 2025-2026, at https://www.cheltenham.gov.uk/info/21/consultations. This is a chance for Cheltenham residents to give their views, whether or not they are claiming the benefit. The consultation closes on 4th October so don’t delay!\nSurgeries:- My next surgery is on Saturday September 21st, 10.00 -12.00 at the library. It’s always nice to meet people and hear what’s on your minds. You can also contact me by email at cllr.jan.foster@cheltenham.gov.uk.\nKind regards,\nJan Foster,\nGreen Councillor for Prestbury.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_01_24_spiritual-activism-with-heather-redington/content_121.html": "Morgan, one of our local members, is organising a local short course addressing climate anxiety, and giving people a toolkit to help them shape their faith into action.\nIf you’re struggling to handle the feelings of grief and overwhelm that climate change can often inflict on us, please make sure you’re connecting with people and taking care of yourself. Things are tough right now, but we have to believe we can continue to make good changes to the earth.\nA COURSE IN SPIRITUAL ACTIVISM\nIn the service of the Earth, her creatures and each other.\nWednesdays 6.30-7.30pm from 19th Feb for 6 weeks (until 25th March)\nat Cheltenham Quaker Meeting House, Warwick Place, Cheltenham GL52 2NP\nYou will learn how to:\n- Develop the power of your heart and your breath.\n- Mobilise the power of intention.\n- Discover the enhanced power that comes with working with a group.\nThe first sessions will focus on learning how to develop a full heart centred breath and how this can be directed in the service of intention.\nEach session will also include a group intention practice.\nThis will be of interest to those who care deeply about the planetary crisis and are seeking ways in which to contribute on an inner, energetic level as well as those already engaged in active protest\nPay what you can afford – suggested donation £3 – £5 per session to cover costs\nThe course is taught by Heather Redington, psychotherapist and teacher of Heart Rhythm Meditation, (www.iamheart.org) and draws on the work of Lynne McTaggart’s Power of Eight.\nPlease get in touch if you feel drawn to this course.\nContact Morgan for further details and to book a place\nmorgan@phonecoop.coop 07708 022 608",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_get-involved/content_23.html": "Cheltenham Green Party made our first breakthrough in 2022, and we are now the official opposition on Cheltenham Borough Council. We know exactly how to win here in Cheltenham, just like we have across Gloucestershire – from Tewkesbury to the Forest of Dean, from the Cotswolds to Stroud – and we need your help to do it.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2022_06_18_may2022results/content_70.html": "We are delighted to announce that Tabi Joy has been elected as the first ever Green Party Councillor in the heart of Cheltenham in St Paul’s ward. Tabi secured a massive swing to the Greens, with over 50% of local people going Green – many for the first time – and is now co-leader of the Greens Group on Cheltenham Borough Council.\nIn further exciting news, Hesters Way Councillor Wendy Flynn has left the Liberal Democrats and joined the Green Party! We are absolutely delighted to have Wendy on board, and her 20 years service for the people of Hesters Way brings a wealth of experience and passion to the Green Party here in Cheltenham. Wendy has joined Tabi as co-leader of the Greens Group on Cheltenham Borough Council.\nThese elections saw us confirmed as the third largest and fastest growing party in Cheltenham. We have ambitious plans for growth here, why not volunteer for us and help make change happen?\nAt every election, we have the opportunity to send a clear message that people want change. Cheltenham has been taken for granted by the both the Liberal Democrats and the Conservatives for far too long now, and people are demanding better.\nSuccess for the Green Party sends a clear message that we want to shift our political priorities to tackle widening social inequality, build back better from Covid, bring in new thinking, and take urgent and vital action on climate change.\nYou can help change the course of local and British politics – join the Green Party today!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_uncategorised_page_3/content_134.html": "19th January 2020 by Cheltenham Green Party\nRead more »\n17th January 2020 by Cheltenham Green Party\n14th January 2020 by Cheltenham Green Party\n11th January 2020 / 11th January 2020 by Cheltenham Green Party\nCome and meet us! Cheltenham’s local Green Party is setting up a monthly office surgery session. Today we had our first meeting and had a great time discussing Prevent and Extinction Rebellion, the ongoing refugee crisis, how to meet with local MPs to voice concerns, the roles of faith groups in green campaigning, and Cheltenham’s […]\n1st October 2019 / 1st October 2019 by Cheltenham Green Party\nWith an increase of interest in climate issues this year, we attended the University of Gloucestershire’s Freshers Fayre and the Cheltenham Climate Strike. Managing the Freshers stall through Wednesday, we tried to cut through some of the overwhelm students might have been feeling with flyers and invitations to the climate strike. We had some great […]\n18th August 2019 / 23rd August 2019 by Cheltenham Green Party\nAttending the first people's climate assembly for Cheltenham!\n9th August 2019 / 23rd August 2019 by Cheltenham Green Party\nOur first councillor candidate - Jessica West for All Saints.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_local-action/content_58.html": "15th October 2023 / 21st October 2023 by Cheltenham Green Party\nRead more »\n30th September 2023 by Cheltenham Green Party\n5th September 2023 by Cheltenham Green Party\n24th August 2023 / 24th August 2023 by Cheltenham Green Party\n8th June 2023 / 8th June 2023 by Cheltenham Green Party\n20th May 2023 / 21st May 2023 by Cheltenham Green Party\n7th May 2023 / 7th May 2023 by Cheltenham Green Party\n8th April 2023 / 8th April 2023 by Cheltenham Green Party\n31st August 2022 / 31st August 2022 by Cheltenham Green Party\n27th July 2022 / 27th July 2022 by Cheltenham Green Party",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_ctcc/content_105.html": "Skip to content\nSkip to footer\nCheltenham\nMenu\nNews\n2025 Candidates\nCouncillors\nGet Involved\nContact Us\nJoin\nDonate\nSearch\nSearch\nJoin\nDonate\nMenu\nSearch\nHome\nTag:\nCTCC\nTag:\nCTCC\nCycle Summit Event\n6th February 2020\nby\nCheltenham Green Party\nRead more »\nbike week\nCTCC\ncycling\nTo top",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_councillor-elections-2020/content_127.html": "9th August 2019 / 23rd August 2019 by Cheltenham Green Party\nOur first councillor candidate - Jessica West for All Saints.\nRead more »",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2021_04_12_what-difference-could-greens-make-on-our-council/content_126.html": "It’s hard to see what the future holds. While there’s a lot of stuff to be frightened of – because it IS frightening – there’s also a huge amount of opportunity. Many of these opportunities can be taken locally.\nLocal elections for Cheltenham and Gloucestershire are taking place on Thursday 6th May. These elections are significant this time around because they’re the first chance since 2019 for the British public to take action on the causes in democracy that matter to them. And it’s a chance to take a new direction, and build back better through the pandemic.\nSo it’s definitely a good opportunity to have someone advocating on your behalf who can make a positive difference and be a voice for change!\nCheltenham Green Party are running candidates in all wards this May, and we all have some really good ideas about work we’d like to do.\n- We want to make sure that new housing developments are future-proofed and focused around walkable communities.\n- We could create local community energy projects using solar and wind power that would be cheaper for people to use.\n- We could test out a basic income so that people can reach their potential without needing to fight for their own survival.\n- Roll out a retrofitting scheme to make warmer homes.\n- Create bee corridors and rewilded areas across town and in the countryside.\n- We could create training programs to help people get jobs in a new green economy, and we can create worker protections so that human happiness is prioritised before just profit.\n- We can create better local food networks so that there’s less food waste, and our supply chains are more resilient.\n- We can find better ways to prevent and mitigate flooding so there’s less damage done by unpredictable weather.\nIf you’re feeling excited about these ideas, please consider voting Green!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_cycling/content_157.html": "Skip to content\nSkip to footer\nCheltenham\nMenu\nNews\n2025 Candidates\nCouncillors\nGet Involved\nContact Us\nJoin\nDonate\nSearch\nSearch\nJoin\nDonate\nMenu\nSearch\nHome\nTag:\ncycling\nTag:\ncycling\nCycle Summit Event\n6th February 2020\nby\nCheltenham Green Party\nRead more »\nbike week\nCTCC\ncycling\nTo top",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_communities/content_99.html": "University of Gloucestershire – Student Rents 10th January 2021 by tabijoy Students cannot afford to pay for accommodation they cannot use - and universities must make sure rental conditions are fair. Read more » communities housing rent students university University of Gloucestershire",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_12_16_its-in-the-air-we-breathe-we-need-to-address-pollution-now/content_150.html": "A London coroner ruled today that air pollution was a factor in the death of Ella Kissi-Debrah, a nine-year old girl living with asthma who was exposed to nitrogen dioxide and particulate matter (PM) pollution in excess of World Health Organisation guidelines, the main source of which were traffic emissions. Cheltenham Green Party demanded that the borough council start taking some action to tackle air pollution in the town.\nTabi Joy, speaking on behalf of the Greens said:“The results of this inquest have been almost seven years in the making. That’s seven years of pain for Ella’s family and friends. It’s impossible to tell how many other people have died, or will die, from the consequences of air pollution – how many lives will be touched by a health crisis we can solve.\n“It’s something that our councils can change. They have a legal responsibility for addressing health issues in our environment, and it should not be the responsibility of the people at risk to advocate for their own safety.\n“We can clearly see that children and elderly people, people with existing health conditions or chronic illnesses, those living in high-traffic areas in town centres, and people from Black and Asian communities who tend to face inequalities of healthcare and housing – all of whom are statistically most likely to die of the effects of air pollution – will continue to suffer from our communal lack of diligence in making better futures for everyone.”\nTabi added: “This isn’t an issue isolated to big cities. It’s here on our doorstep – on our pavements, on our driveways. The last Air Quality Action plan for Cheltenham expired in 2019, coming up to nearly two years ago. Where’s the new plan which should have come into force this year?\n“The council promised at a cabinet meeting in January 2020 that it would start measuring particulates for the first time, through some new AQ Mesh Pod monitors. Science has shown that particulates can cross the blood-brain barrier, causing heart disease, cancer, brain damage. When will the data from particulate measurements in Cheltenham be published?\n“The council said at the same time that they would start measuring Nitrogen Dioxide levels in real time. When will this data be shared with the public?\n“Air pollution levels for both nitrogen dioxide and particulates are at illegal levels in parts of Cheltenham, and if we are slow to address this, we will pay the price in residents’ health. Independent measurements by the Parish Council in Leckhampton show that the levels of particulates (PM2.5) in a suburb of town are averaging above the World Health limit. The council’s own measurements of Nitrogen Dioxide show average levels past the legal limit in the centre of town. This is an urgent crisis. Yet nothing meaningful is being done.\n“We can’t wait another seven years for action. We need immediate commitment. We’ve lost lives. We’ve done the research. We have the data, even if it’s not being widely shared.\n“Please work with people across Cheltenham to help uplift all of us.”\n———————————————————————————————————–Further information:\ncontact: Tabi Joy\nTabi.Joy@cheltenham.greenparty.org.uk\nBackground information\nCheltenham Borough Council Nitrogen Dioxide data\nThe council measures average monthly Nitrogen Dioxide levels through diffusion tubes at various sites in town.The latest published data is for 2019, full year data for 2020 is not yet available.\n2019 data shows illegal levels at 3 sites. Cheltenham Borough Council claims that Nitrogen Dioxide levels are improving…\nThe council stated at the January 2020 cabinet meeting that NO2 levels were falling. This is not the case.\nThe table and chart below compares NO2 levels, as measured by CBC’s diffusion tube monitors, at 8 sites across the town, over the period 2011 to 2019.\nThe 8 sites shown have not been ‘selected’ in any way – they are the only 8 sites that CBC has consistently monitored over the last 9 years. We have also shown the average reading of the 3 diffusion tubes sited at St Georges Street/Swindon Rd, where they are co-located with the reference monitor. This site has only been producing full data since 2013.\nFigures highlighted in red are above the annual 40 ug/m3 legal limit.\nThe 9 monitoring sites given above are broadly in the town centre. It isn’t possible to look at air quality trends in other areas of the town, as CBC has not consistently monitored locations outside the town centre over the last 9 years. But this data clearly does not support the conclusion that there has been ‘steady improvement’ and a ‘generally positive trajectory’ in air quality in Cheltenham.\nWe can see the essentially static levels of air pollution in the town centre by looking at the average readings across the 8 sites for which there is full data for the 9 year period. (Data for the 3 co-location sites only exists for 7 years.)\nThe variance between 2011 and 2019 is only 1.2 ug/m3 NO2 – around 2.9%. This is within the margin of error of diffusion tube sampling.\nBear in mind also that 12 out of the 72 data points (8 sites x 9 years) have some months where data is missing.\nWhen looking at pollution data, DEFRA stresses that it is important not to look at a single year in isolation due to the influence of weather conditions.\nThe data shows that the average town-centre NO2 levels for 2011 and 2017 were identical. There was a dip in 2018, but this almost been completely reversed in 2019.\nGiven the margin of error in diffusion tube monitoring, the issue of missing data from some of the monthly sampling, and the possible influence of weather conditions, the only conclusion is that air pollution levels in Cheltenham have remained broadly static over the last 9 years.\nIt is impossible to conclude from the data that there has been a ‘slow but steady improvement in air quality’. A much more accurate statement would be that air quality has been essentially unchanged over the last 9 years.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2019_08_09_jess-west-all-saints/content_34.html": "This month, we’ve announced our first local council candidate: Jessica West, running in All Saints.\nJess has lived in All Saints for the past two years, working locally as a freelance translator and passionate social campaigner.\n“Ongoing climate change will affect everything in our daily lives, from house prices and insurance costs, to food costs and transportation,” Jess has said. “Supporting our community in the face of these challenges will be at the centre of my campaign.”\nJess is often out and about around All Saints, frequently litter-picking and weeding her street, so stop by for a chat.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_author_cheltenham-green-party_page_4/content_45.html": "24th August 2023 / 24th August 2023 by Cheltenham Green Party\nRead more »\n8th June 2023 / 8th June 2023 by Cheltenham Green Party\n20th May 2023 / 21st May 2023 by Cheltenham Green Party\n7th May 2023 / 7th May 2023 by Cheltenham Green Party\n8th April 2023 / 8th April 2023 by Cheltenham Green Party\n31st August 2022 / 31st August 2022 by Cheltenham Green Party\n27th July 2022 / 27th July 2022 by Cheltenham Green Party\n18th June 2022 / 31st August 2022 by Cheltenham Green Party\n18th June 2022 / 18th June 2022 by Cheltenham Green Party\n3rd May 2020 / 3rd May 2020 by Cheltenham Green Party",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2019_08_18_climate-assembly/content_51.html": "Earlier this month, Cheltenham Greens attended the Extinction Rebellion Cheltenham People’s Assembly at Bayshill Unitarian Church.\nIt was a very well-planned and responsive event. Almost 70 people attended to share their views.\nMany people advocated for community engagement and government accountability. We want better public services, local business support, and improved awareness of food production. We also want to see direct action to protect our wildlife and green spaces.\nXR Cheltenham are building a public report on the event to be shared very soon. We’re really looking forward to working with them again!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_sustainability/content_155.html": "Skip to content\nSkip to footer\nCheltenham\nMenu\nNews\n2025 Candidates\nCouncillors\nGet Involved\nContact Us\nJoin\nDonate\nSearch\nSearch\nJoin\nDonate\nMenu\nSearch\nHome\nTag:\nsustainability\nTag:\nsustainability\nWater Is Life\n27th January 2020\nby\nCheltenham Green Party\nRead more »\nsustainability\nTo top",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_grief-support/content_154.html": "Spiritual Activism with Heather Redington 24th January 2020 / 24th January 2020 by Cheltenham Green Party Read more » climate activism faith groups grief support",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_rent/content_153.html": "University of Gloucestershire – Student Rents 10th January 2021 by tabijoy Students cannot afford to pay for accommodation they cannot use - and universities must make sure rental conditions are fair. Read more » communities housing rent students university University of Gloucestershire",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_green-new-deal/content_102.html": "Supporting Positive Business Through Coronavirus 3rd May 2020 / 3rd May 2020 by Cheltenham Green Party Read more » banking green energy green new deal green society\nZero West Conference 2020 21st January 2020 / 21st January 2020 by Cheltenham Green Party Read more » future vision green energy green new deal",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_11_17_prestbury-ward-news-october-2024/content_19.html": "First of all, I must apologise for last month’s misinformation about Post Office facilities in Prestbury. I received an email from the Post Office on 12th September asking me to spread the word. Unfortunately I didn’t receive a follow up to say it wasn’t happening! I hope no-one was inconvenienced.\nPrestbury this month has been dominated by roadworks. With the roadworks on the A435, it seems as if many drivers are not following the designated diversion on A roads, but cutting across Southam Lane and down the hill to the Noverton Lane roundabout. Half-term week was particularly bad as there were temporary traffic lights in the High Street and severe congestion. I spoke to an officer from the Highways department but apparently they don’t have the authority either to impose a lower speed limit on the hill or to restrict access.\nOn the subject of roads, I know that many Prestbury residents are concerned by speeding, particularly in Mill Lane. Would a 20 mph limit be the answer? Please let me have your views.\nHeavy rain in October inconvenienced many, as Lake Street and Blacksmiths Lane again became ponds with inadequate drainage. Please, keep reporting problems on https://www.fixmystreet.com/ and I will keep badgering the County Council and Highways Department on your behalf.\nCheltenham residents have until 21st November to express their views on a Public spaces protection order (PSPO) consultation – Town Centre East car park. The link is at https://www.cheltenham.gov.uk/info/21/consultations.\nThe next Green Councillor Surgery is at the library on November 16th. In the meantime if you want to contact me the email is cllr.jan.foster@cheltenham.gov.uk or phone 07858865821.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_liberal-democrats/content_120.html": "Cheltenham Borough Council in denial on air pollution crisis in Cheltenham, say Cheltenham Greens 28th February 2020 / 28th February 2020 by Cheltenham Green Party Read more » air pollution air quality borough council liberal democrats",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2023_09_30_jonathon_porritt_event/content_83.html": "Join us for a special event hosted by environmentalist and former Green Party Chair Jonathon Porritt in the beautiful surroundings of the St Philips and St James Church, Leckhampton. Buy tickets here!\nAs well as reflections from Jonathon on 50 years of the Green Party and the state of play in 2023, we will be discussing how green shoots are growing in Cheltenham and what it takes for Cheltenham to turn Green as we look ahead to the 2024 local elections. And if you want to be a part of our big plans for 2024, this is the perfect opportunity to find out more.\nTickets are £5 each, with all monies going to support Green Party campaigns here in Cheltenham.\nThough this is a Green Party event you do not have to be a member to attend, family and friends all welcome! Get your tickets here whilst you can!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_daniel_ppc_page_2/content_61.html": "Posts by Daniel Wilson PPC\n26th April 2024 / 13th August 2024 by Cheltenham Green Party\nThe dumping of sewage into our rivers and seas by water companies more than doubled in 2023. According to the Environment Agency, there were 3.6 million hours of sewage discharges, compared with 1.75 million hours in 2022. The FT recently exposed the fact that two of Britain’s biggest water firms have failed to map large […]\nRead more »\n29th March 2024 / 25th May 2024 by Cheltenham Green Party\n15th March 2024 / 25th May 2024 by Cheltenham Green Party\n1st March 2024 / 25th May 2024 by Cheltenham Green Party\n25th February 2024 / 25th February 2024 by Cheltenham Green Party\n2nd February 2024 / 18th February 2024 by Cheltenham Green Party\n19th January 2024 / 25th February 2024 by Cheltenham Green Party\n5th January 2024 / 18th February 2024 by Cheltenham Green Party\n15th December 2023 / 18th February 2024 by Cheltenham Green Party\n1st December 2023 / 18th February 2024 by Cheltenham Green Party",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_human-welfare/content_86.html": "Reflection on Brexit 1st February 2020 / 1st February 2020 by Cheltenham Green Party Read more » brexit environmental protections human welfare",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_councillors/content_6.html": "WE are the opposition in Cheltenham\nWe have 3 Green Party councillors in Cheltenham working hard for local people. We received over 16% of all votes cast in the May 2024 elections, which saw us confirmed as the official opposition party in Cheltenham, replacing the Conservatives, who have been wiped out here.\nWe have ambitious plans for growth here in Cheltenham, why not volunteer for us and help make change happen?\nCheltenham has been taken for granted by the Liberal Democrats and the Conservatives for far too long now, and people are demanding better.\nThe Green Party has an ambitious set of policies, and will focus in on in particular:\n● The NHS, health, and social care\n● Affordability and availability of housing\n● Water quality – sewage in the sea or pollution in rivers\n● Standard of living\n● Climate and nature\nWe will look to bring these into focus and campaign on them here in Cheltenham, as Greens are doing across the UK.\nYou can help change the course of both local and national British politics – join the Green Party today!\nReal Hope. Real Change.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_frontline-workers/content_59.html": "Essential Support for Essential Workers 14th January 2021 / 14th January 2021 by tabijoy Read more » community coronavirus frontline workers health",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_author_cheltenham-green-party_page_3/content_25.html": "25th February 2024 / 25th February 2024 by Cheltenham Green Party\nRead more »\n2nd February 2024 / 18th February 2024 by Cheltenham Green Party\n19th January 2024 / 25th February 2024 by Cheltenham Green Party\n5th January 2024 / 18th February 2024 by Cheltenham Green Party\n15th December 2023 / 18th February 2024 by Cheltenham Green Party\n1st December 2023 / 18th February 2024 by Cheltenham Green Party\n17th November 2023 / 18th February 2024 by Cheltenham Green Party\n15th October 2023 / 21st October 2023 by Cheltenham Green Party\n30th September 2023 by Cheltenham Green Party\n5th September 2023 by Cheltenham Green Party",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_faith-groups/content_98.html": "Spiritual Activism with Heather Redington 24th January 2020 / 24th January 2020 by Cheltenham Green Party Read more » climate activism faith groups grief support",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2023_08_24_greenparty_nhs/content_67.html": "On Health and Wellbeing\nWhen Nye Bevan implemented the National Health Service, it was recognised that providing good health to all, free at the point of access, is vital to the prosperity, health, prosperity, and safety of the country. When people are healthy, they thrive, are less stressed, live longer and over their life time, they will cost the country less, both financially and by their contribution to society.\nHaving worked in various health settings, here and abroad, I can see that the NHS has been prevented from delivering for the nation in recent years. For the first time, the life expectancy in the UK has not been increasing, even prior to the pandemic, and more people are sick and unable to work1. 4.2 million children (29% of all UK children) are now in poverty – up from 3.6 million in 2010-11, with more children suffering dental decay, obesity and asthma, especially in deprived areas2. The challenge to improve the UK’s health is complex.\nWe need a health and care service, that is publicly owned, run with local community involvement, including both staff and users of heath & care, with a focus on preventing poor health. Government policies are rarely evaluated for the impact on health. Poor housing, unemployment, exposure to pollution and inequality lead to costs to health that equate to about 1/5 of the total NHS budget3.\nThe NHS and care sector are currently facing a massive staffing crisis. Both NHS and care staff are leaving the profession due to poor pay – for example care staff not being paid the minimum wage when working a “sleepover” shift, or more than a decade of below inflation NHS pay rises. Despite strike action by nurses and doctors, the government continues to offer sub-inflation pay rises. Furthermore, the loss of staff is leading to a vicious cycle of increased workload for remaining staff, and patients becoming angry with the long waits, making those remaining in the profession even more burnt out, leading to sickness and further loss of experienced, dedicated staff. The rates of pay are significantly less than offered by other English speaking countries, and therefore we lose the staff, that we paid to train, to work abroad. The recent announcement to increase training for doctors and nurses is a start, but consultants take 10 years to train, and experienced nurses take at least 6 years.\nNHS services have been fragmented. Private companies now are paid by the taxpayer to deliver various services the NHS used to provide. The private healthcare profits made from our taxes, now go to the shareholders and executives, instead of being reinvested in the NHS, as happened when it was under public control. Furthermore, these services require doctors, nurses, and care staff, and can pay more attractive rates, which is contributing to the loss of staff to the NHS.\nFinally, but importantly, we need to review our care services. Currently there are insufficient nursing homes, sheltered housing, community care and care services for children. As a result of this deficit, more people who need care, become unwell and put more strain in the NHS.\nThe Green party has a detailed policy for improving the nation’s health. They recognise that improving the nation’s health by preventative measures is the most cost effective strategy. Most importantly, they identify that reducing air pollution, preventing further climate change, and mitigating for the risks, will lead to improved health immediately, and in the long term. The Green Party wants to see health and care brought back under local control and public ownership. These policies see health improvement as an integral part of all measures, including addressing inequality and the cost of living crisis, providing housing that is fit for habitation & not damp, supporting people to be more active, including making walking, cycling & public transport appealing & enjoyable. By making savings from improved health, we can invest even more in our health & care staff, so that they are appropriately rewarded for their hard work, and ensure that our highly trained & experienced staff want to stay in this country.\nWe urgently need to address the health & care crisis in the UK, integrated with immediate action to tackle the Climate Emergency, if the UK is to prosper, and be able to support the most disadvantaged communities, and reverse the trend in preventable deaths & declining health of our nation.\nDr Diane Cook, Locum Consultant Psychiatrist\nReferences",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_10_02_the-future-of-sport-and-leisure-in-cheltenham/content_14.html": "Compared with towns of a similar size, Cheltenham has a good range of sports and recreation facilities. We have plenty of green spaces within the town and the Cotswold hills are on our doorstep. We also have several sports fields and tennis courts dotted across the town, as well as the amazing Lido.\nFor over 40 years, we have also benefited from the Leisure Centre and the Prince of Wales Stadium. These were some of the best facilities in the country when they opened. For instance, very few leisure centres around the country have a diving pool and even fewer towns have a dedicated athletics stadium. Sadly, both are now in urgent need of significant investment.\nThe running track is no longer up to the required standard and until it is resurfaced it will not be able to host some athletic meets. The state of the leisure centre building means it is increasingly blighted with closures due to emergency structural work. Compared with towns of a similar size, Cheltenham has a good range of sports and recreation facilities. We have plenty of green spaces within the town and the Cotswold hills are on our doorstep.\nThe Cheltenham Trust does an amazing job to operate both aging facilities but without the right level of investment coming from the council, I do worry for the future of our sport and leisure in our town. The council needs to start explaining to the people of Cheltenham what they intend to do and how they will find the money needed.\nExtreme weather needs to be treated like Covid\nThe leisure centre wasn’t the only building to suffer as a result of the almost biblical rains we have had in recent weeks. Much of Cheltenham was affected with roads flooded, roofs leaking, trains cancelled and schools closed.\nExtreme weather events are becoming increasingly common. One report from the UN has estimated they has quadrupled in the last 50 years.\nThe world, led by governments such as our own, needs to treat this with the same seriousness as it did for Covid. Many of the key issues the world is facing today such as immigration, wars and famine are directly or indirectly due to climate change. The world came together to find a solution to Covid and it has to do the same when it comes to dealing with the climate emergency.\nNatalie Bennett coming to Cheltenham\nFormer Green Party leader, Baroness Bennett, will be coming to Cheltenham on the 29th October.\nThe event will be held at the Steam and Whistle pub near the train station and will start at 7.30pm.\nTickets are on sale now https://allevents.in/cheltenham/300040073712",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_01_11_858/content_140.html": "Come and meet us!\nCheltenham’s local Green Party is setting up a monthly office surgery session. Today we had our first meeting and had a great time discussing Prevent and Extinction Rebellion, the ongoing refugee crisis, how to meet with local MPs to voice concerns, the roles of faith groups in green campaigning, and Cheltenham’s unique identity.\nDo you have ideas about campaigns you’d like to see in Cheltenham? Would you like an opportunity to talk to us about key local issues? Please drop by for a chat about how we might be able to help – we’d like to hear more about local people’s views on just about anything affecting where we live.\nWe can be found 11am-1pm at Food Loose Café, 16 Portland Street, Cheltenham GL52 2PB, every second Saturday of the month. Next dates of meetings are:\nSaturday 9th February\nSaturday 8th March\nSaturday 12th April\nSaturday 10th May",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_04_26_it-is-time-to-nationalise-the-water-companies/content_24.html": "The dumping of sewage into our rivers and seas by water companies more than doubled in 2023. According to the Environment Agency, there were 3.6 million hours of sewage discharges, compared with 1.75 million hours in 2022.\nThe FT recently exposed the fact that two of Britain’s biggest water firms have failed to map large parts of their sewage networks, underscoring the inability of privatised utility companies to fix their poor environmental record and reduce spills.\nIt is a scandal.\nLast year there was the equivalent to 186 days worth of sewage discharges in the rivers around Cheltenham – the biggest being in Andoversford which recorded an outrageous 87 days alone.\nThis must stop. The Green Party would end this failed experiment in privatisation, bringing the water companies back into public control so we can clean up this industry.\nThe Council needs to focus more support on the poorest areas I call upon the Lib Dem-run council, particularly its newly elected members, to focus on those who need the most support and not on loss-making projects such as the ice rink.\nThe ice rink ran at a £74,000 loss last year.\nThe cost-of-living crisis on the back of 14 years of Tory austerity has left Cheltonians needing the council’s support more than ever. Many cannot afford to travel into town, let alone the high prices to use the ice rink. They could, however, have benefited from a share of the £74,000 to fund additional support such as help insulating housing in the most deprived areas of the the town. The town centre continues to receive a disproportional amount of council funds and I would urge them to consider abandoning the ice rink and using the money for something which supports the areas most in need of the help.\nWe need a general election now\nVoters up and down the country, including here in Cheltenham, have once again made it clear to Rishi Sunak that they are fed up with his Conservative government. It is time for change.\nWhilst the Prime Minister can in theory limp on until January 2025 before he needs to go to the polls, he should look at the recent local results and accept it is time to hold a general election at the earliest opportunity.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_uncategorised_page_2/content_44.html": "3rd May 2022 by tabijoy\nRead more »\n26th April 2022 by tabijoy\n9th August 2021 by tabijoy\n12th April 2021 / 9th August 2021 by tabijoy\n14th January 2021 / 14th January 2021 by tabijoy\n10th January 2021 by tabijoy\nStudents cannot afford to pay for accommodation they cannot use - and universities must make sure rental conditions are fair.\n3rd May 2020 / 3rd May 2020 by Cheltenham Green Party\n14th February 2020 / 14th February 2020 by Cheltenham Green Party\n4th February 2020 by Cheltenham Green Party\n1st February 2020 / 1st February 2020 by Cheltenham Green Party",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2022_05_03_your-vote-makes-the-difference/content_114.html": "At every election, we have the opportunity to send a clear message that people want change. Cheltenham has been taken for granted by the Lib Dems and Conservatives for too long now, and people are demanding better.\nAlmost 5000 people voted Green here in Cheltenham at the local elections in 2021, making us the third largest and fastest growing party. In St Paul’s, we came second place from a standing start, out of six candidates. The Green Party can win in Cheltenham!\nVotes for the Green Party also send a message that we want to shift our political priorities to tackle widening social inequality, build back better from Covid, bring in new thinking, and take urgent and vital action on climate change.\nYou can help change the course of local and British politics – by voting for change this Thursday 5th May.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_cheltenham-council-2020/content_39.html": "Jessica West for All Saints Ward 9th August 2019 / 23rd August 2019 by Cheltenham Green Party Our first councillor candidate - Jessica West for All Saints. Read more » All Saints ward cheltenham council 2020 Jessica West",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_08_13_our-first-prestbury-newsletter/content_13.html": "It was lovely to chat to so many people last month at my first surgery at the library. Also, thanks to all the Prestbury residents who have contacted me over the last month, or stopped me on the footpath. It’s great that so many people care about the community and can be bothered to try to fix things.\nMany people are concerned about traffic problems such as speeding, inconsiderate parking and air quality. Uneven pavements and impassable footpaths are also hot topics. I have arranged to meet up with County Councillor Stephan Fifield to discuss what can be done to improve traffic related problems.\nAlthough Prestbury has a rural village atmosphere, we share some of the same problems as more urban wards, such as litter, fly-tipping and graffiti. I was shocked to find a heavy duty bag of rubbish concealed among weeds on Priors Road and sad to have to report graffiti in a different location in Prestbury.\nWe tend to blame litter on the anti-social few. However, the Green Councillors had a really interesting meeting with the Environmental Partnerships manager recently and learned that some litter is simply caused by thoughtlessness – like not folding cardboard to fit properly into the blue bags so that it then won’t fit into the unit on the lorry, or overfilling the recycling box. A household may have up to four green boxes, so if you need more you can phone 01242 262626 or email cleansing@cheltenham.gov.uk.\nOn a positive note, homeowners might like to check out the Future Fit Homes project to get expert advice on how to lower their energy bills by making their home ‘future fit’. Information is at Planet Cheltenham.\nI will be holding surgeries at the library on the third Saturday of the month. Even if you have no pressing concerns, feel free to come and say ‘Hello’!\nKind regards,\nJan Foster,\nGreen Councillor for Prestbury.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2023_11_17_homelessness-is-not-a-lifestyle-choice/content_42.html": "is not a ‘lifestyle choice’. The latest attack by the Home Secretary Suella Braverman comes on the\nback of a litany of extreme statements by a minister who should not be allowed to hold office.\nI call on Alex Chalk to stand up against such nonsense coming from his front bench. Let’s ensure the crisis in Gaza doesn’t fuel hate elsewhere.\nI unequivocally condemn the atrocities of the October 7 attacks carried out by Hamas. That attack\nhas not only left thousands of innocent people dead or injured, but it has also led to a rise in hate\nand polarised opinion in the region and around the world. I caution anyone against trying to turn the\nescalating crisis in Gaza into either a pro-Palestine or pro-Israel issue. It is more complex than that.\nWe can be anti-terrorist but pro-Palestinian state. We can support the rights of the people of Israel to\nlive in peace without fear of attack but condemn the behavior of the Israeli government when it breaches\ninternational law. We need to separate the Israeli state from its people as much we separate Hamas from\nPalestinians. Few Muslims support the actions of Hamas, and few Jews support the mounting civilian death\ntoll in Gaza therefore we must also try and keep religion out of the debate. A state should have the right to defend itself, but not an unconditional right. Cutting off food, water\nand fuel to hundreds of thousands of civilians is a war crime and may serve to help grow support for\nHamas within Palestine, making things even worse. The political rhetoric coming from the UK government and some parts of the media is often not\nhelpful. Claiming all those taking part in peace marches are promoting hate is nonsense. The vast\nmajority of people joining the protests are as worried for the Israelis held hostage as they are for the\ncivilians of Gaza. The European Commission recently warned anti-Semitism across Europe is at levels not seen since\nthe rise of the Nazis in the 1930s. Some Jewish communities in the UK are scared to leave their\nhomes. Now is the time more than ever we need to come together to stand united against terrorism;\nunited against any state which breaches international law and united against hate in all forms be it\nanti-Semitic or anti-Islamic. No ifs, no buts.\nThe Green Party has called for an immediate end to the violence in Israel and Palestine.\nIf you have any questions about this article or want to raise any issues with me as your Green Parliamentary Candidate for Cheltenham, you can contact me at directly at daniel.wilson@cheltenham.greenparty.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_02_14_uog-hedgehog-society/content_144.html": "Hedgehogs are experiencing significant decline in the British Isles – just in the last 20 years we’ve lost 30% of the hedgehog population. It’s a serious crisis affecting this charismatic animal.\nThis week, Tabi, Billy and Ed from Cheltenham Green Party met up with the Prickly Finders Hedgehog Society of the University of Gloucestershire to talk about how we can help hogs in our community.The Prickly Finders are working towards a silver award initiative for a hedgehog-friendly campus at Francis Close Hall, having already completed bronze award level for their incredible work.\nThey carry out regular litter picks, hold public information sessions for local students, and build houses and shelters for wandering hogs. It was really exciting to learn about their work, and really inspiring to know that hedgehogs are so valued to Cheltenham residents.\nTabi has a few years’ background experience working with hedgehogs, both through two-day first aid training courses with Hedgehog Helpline Cymru, and at Brockworth Hedgehog Rescue. She gave an hour-long presentation on hedgehog habits, basic first aid and health checks, with a quick Q&A afterwards.\nIf you’d like to learn more about Hedgehog Friendly Campuses, check out the website here.\nTabi’s always up for giving her first aid presentation and helping Cheltenham learn more about hedgehogs, so if you need a short overview of hedgehog care, please drop her a line.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2023_04_08_proportional_representation/content_38.html": "Cheltenham Green Party calls on all local parties to back proportional representation\nGreen Councillors Tabi Joy and Wendy Flynn surprised as Lib Dems vote against motion calling for proportional representation at local elections.\nVoting reform is an absolute necessity to start rebuilding trust in politics. We want everyone to have a voice, not just those who have the loudest voices, the deepest pockets or the most powerful friends.\nGreen Party councillors recently had the opportunity to propose a motion to council to support the introduction of proportional representation at local elections, tacking on to a national campaign asking Councils to write to the Cabinet Office to state support for PR at Westminster elections.\nBizarrely, the Liberal Democrats voted against the PR amendment, missing a golden opportunity to show backing for PR at all levels of our democracy. We call on all parties to back PR in local elections.\nGreen proposals to expand youth involvement in local politics have also been voted down by the Liberal Democrats.\nWe will continue to fight for a fair voting system in which every vote counts, ensure that decisions made nationally and locally are based upon genuine consultation, negotiation and accountability, including with young people. For that to happen we need fresh ideas and a change to the “one party state” we have here in Cheltenham.\nIf you are fed up of the status-quo and want to see real change, you can join our campaigns here, and join the Green Party here.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_university/content_71.html": "University of Gloucestershire – Student Rents 10th January 2021 by tabijoy Students cannot afford to pay for accommodation they cannot use - and universities must make sure rental conditions are fair. Read more » communities housing rent students university University of Gloucestershire",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_action-in-the-south-west/content_156.html": "19th November 2020 / 19th November 2020 by tabijoy\nGCC urgently needs a shot of imagination .\nRead more »\n21st January 2020 / 21st January 2020 by Cheltenham Green Party",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_02_25_labour-abandons-their-green-plans/content_69.html": "Labour ditches £28 billion green investment plan: A backward step for climate and economy\nIt’s not about the economy’s capacity, it’s about political will and priorities.\nThis is a massive backward step – for the climate, for the economy and for good quality jobs. Both the security of our planet for the next generations and the nation’s future prosperity is dependent on greening our economy and that requires large scale investment.\nLabour have chosen to wear their fiscal rules as a millstone around their neck. A different approach through tax reforms, in particular by introducing a wealth tax on the super-rich, could help pay for the green transition. There is more than enough money to pay for this. The Green Party would go further and faster, spending at least double what Labour originally pledged.\nGreens recognise that investing in a green future will provide people with economic, social and environmental security. By decarbonising industry, insulating buildings, and ramping up renewable energy infrastructure, we can drastically reduce emissions, cut household bills, and create well-paid and secure jobs in every corner of the country.\nAccording to the Office for Budget Responsibility, early investments in climate initiatives are not only cost-effective but essential. Delaying action escalates costs and exacerbates the climate crisis. It’s high time we prioritize our planet’s health over short-term economic apprehensions.\nWe advocate for a progressive tax reform, ensuring the wealthiest contribute their fair share towards combating climate change. This strategy also includes substantial support for those hardest hit by the cost-of-living crisis, offering tangible solutions such as home retrofitting to reduce both bills and carbon footprints.\nWe are one of the richest countries in the world. We can choose to do this if we want to. Labour has chosen not to.\nThe state of the NHS in Cheltenham\nNot a week goes by without me hearing about someone’s challenges with the badly underfunded health service in Cheltenham. These challenges include a lack of A&E provision; staff shortages affecting our maternity wards; ambulance delays; waiting lists; the search for affordable dental care; poor mental health services and not least, a workforce feeling unloved, unsupported and under resourced.\nWe cannot let this continue. I am therefore calling upon all local parties to pledge to stop the blame game and work together for the good of the town. We have to ensure the local NHS in all its forms gets the resources it so desperately needs.\nIf you have any questions about this article or want to raise any issues with me as your Green Parliamentary Candidate for Cheltenham, you can contact me at directly at daniel.wilson@cheltenham.greenparty.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_cheltenham-council/content_66.html": "15th October 2023 / 21st October 2023 by Cheltenham Green Party\nRead more »\n16th December 2020 by tabijoy\n28th February 2020 / 28th February 2020 by Cheltenham Green Party\n14th February 2020 / 14th February 2020 by Cheltenham Green Party\n9th August 2019 / 24th August 2019 by Cheltenham Green Party\nLocal Greens attended Cheltenham Council's climate emergency summit on 6th August.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_banking/content_50.html": "Supporting Positive Business Through Coronavirus 3rd May 2020 / 3rd May 2020 by Cheltenham Green Party Read more » banking green energy green new deal green society",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_hedgehogs/content_52.html": "UoG Hedgehog Society 14th February 2020 / 14th February 2020 by Cheltenham Green Party Read more » hedgehogs students University of Gloucestershire wildlife",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_jessica-west/content_33.html": "Jessica West for All Saints Ward 9th August 2019 / 23rd August 2019 by Cheltenham Green Party Our first councillor candidate - Jessica West for All Saints. Read more » All Saints ward cheltenham council 2020 Jessica West",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_future-vision/content_97.html": "Zero West Conference 2020 21st January 2020 / 21st January 2020 by Cheltenham Green Party Read more » future vision green energy green new deal",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_environmental-health/content_87.html": "It’s in the air we breathe: we need to address pollution now 16th December 2020 by tabijoy Read more » air pollution environmental health",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_contact-us/content_15.html": "ENQUIRIES\nIf you would like to get into contact with Cheltenham Green Party, you can email us on:\ncoordinator@cheltenham.greenparty.org.uk\nIf you want to contact us about a local matter, you might like to contact one of our ward councillors or activists. Use the Your Councillors page to find your local contact.\nIf you are looking to get involved as a volunteer, then you can volunteer here.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2023_05_20_tewkesbury_greens_council/content_57.html": "Tewkesbury Green Councillor Cate Codey appointed lead member for community\nTewkesbury Borough Council was Conservative run, but no longer. Our friends in Tewkesbury Greens defeated 3 sitting Conservative councillors going from one Green councillor to 4, and this along with other parties making gains means the council is in “no overall control“. This is actually a good thing as it means parties have to cooperate to get things done, a snapshot of what could be possible under Proportional Representation rather than a winner takes all First Past the Post system.\nAs a large group in Tewkesbury Borough Council don’t have overall control, the Greens will now be integral to decision making, and could be able to influence a wide range of outcomes with amongst other things Cllr Cate Codey taking on the role of Lead Member for Community. Congratulations to Cate, where she has a fantastic opportunity to shape Council thinking to be more green and forward looking than ever before.\nAs more Greens get elected across the country, we have more influence over local policy. It also shows that we do not need to win all the seats to effect change. Newly elected Greens are working collaboratively to run councils right now all over the country, for example in Harborough District Council, North Somerset, Exeter and many more. And Greens are for the first time in full control of a local council in Mid-Suffolk.\nThese fantastic results mark a big step forward for the Greens, all made possible by local volunteers working together.\nIt’s our turn in 2024 here in Cheltenham, and the fight is on to get more Greens elected to push for the greener, local politics we need. We’ve had almost 15 years of low ambition green washing from the Tories and Liberal Democrats alike in Cheltenham, it is time for change!\nReady to help turn Cheltenham green?\nJoin our local leafleting team in Cheltenham, and help us win big in 2024.\nSign up here!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_borough-council/content_104.html": "Cheltenham Borough Council in denial on air pollution crisis in Cheltenham, say Cheltenham Greens 28th February 2020 / 28th February 2020 by Cheltenham Green Party Read more » air pollution air quality borough council liberal democrats",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_02_01_reflection-on-brexit/content_145.html": "Yesterday was Brexit Day, but it’s not yet clear what it’ll mean for us.\nWe have another year of negotiations ahead – on trade, on land management, on environmental and working standards, on security, education, data handling…\nWe won’t be crashing out without a deal at this point, which is good news.\nBut it’s vital to stay connected to what’s happening – apologies to those tired of hearing about Brexit in the news! – and staying connected is the main way to ensure we eventually get what we want.\nThe reason many people voted for Brexit was because they wanted more of a say in how our country’s being run. They were promised democracy, and certainly we all deserve to decide how we’d like to be treated, and express what our lives should look like.\nThe only way to make Brexit work for everyone is to gather together, and decide on these matters together. We need citizens’ assemblies, and votes on what we’d like to have happen.\nWe need community groups to campaign to protect our NHS, our green spaces, our wildlife. We need to invest responsibly in our transport links and infrastructure.\nWe need politicians who will listen to us – not choose for us, or simply promote business over human welfare.\nBrexit was publicised as an opportunity to start again with a blank slate, and we can fight for fairness, for decent working conditions, for effective use of legislation and human rights. We must stay engaged in doing this, even if we’re already a bit worn out from all these sweeping changes.\nIt’s sad that we’re leaving the friends we’ve made across the EU, which was designed primarily as a peace project, that would help neighbouring countries grow past the crises of the 20th century. We must hold peace, respect and kindness at the heart of all we do going ahead – because that is the only way humanity can truly flourish.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_01_14_gloucestershire-county-council-budget-survey/content_49.html": "They’re also allocating the budget for other areas, including children’s services, schools, and roadways.\nWe’re disappointed that while £1million is being allocated to addressing climate breakdown, yet 150 times that amount is being spent on road improvements over the next three years.\nWe need to invest far more in public transportation, cycling and pedestrianisation so that roadways are managed in that context, and climate change is being addressed along with it.\nThe public has a chance to commentate on the new budget with a survey. It closes on Friday 17th January 2020, and is a great opportunity to share views on how essential climate action is. Full details of the budget proposal can be found here.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2023_10_15_prestbury_2024/content_107.html": "Our amazing candidate Jan Foster came a strong second in Prestbury, defeating both the Liberal Democrats and Conservatives. PAB retained the seat with a much depleted majority.\nIt is clear that the Green message resonated with voters in Prestbury. People want change, and Jan will be working hard to earn the trust of local people over the next 6 months before the May 2024 local elections.\nGiven how ineffective PAB have been recently in standing up for Prestbury, we will be keeping a close eye on events and helping where we can. Jan can be reached at jan.foster@cheltenham.greenparty.org.uk\nWhat does this result mean for Cheltenham?\nGreens prove again they can defeat the Lib Dems\nThis marks the second time that Greens have defeated both the Liberal Democrats and Conservatives in an election here in Cheltenham.\nThis matters. The Liberal Democrats and their divisive election messaging here divides people into “us and them”. When people vote positively for change and vote Green, our hard working candidates can and do defeat the mainstream parties. This result in Prestbury shows 2024 is a chance to bring real change to Cheltenham.\nThe Conservative vote is collapsing\nThe Conservative vote in Prestbury fell from 2nd place in 2021 to last place in 2023, falling by over 60% in 2 years. That is an enormous drop, and we believe that this pattern will be repeated right across Cheltenham next year. Voters real choice at the next election will be between the Green Party and more of the same from the Liberal Democrats.\n2024 will be a huge political year in Cheltenham\nWith the collapse in the Conservative vote, there is a huge opportunity for a Green breakthrough here in Cheltenham next year. 2024 will be a rare 40 seat council election, so in one election we have the chance to make a huge impact on the council and elect multiple Green councillors. The recent elections in Prestbury and St Paul’s clearly shown that the Lib Dems tired old mantra of “vote for us or let the Tories in” is a hollow election slogan. We will be calling on people in Cheltenham to vote for positive change with the Green Party.\nGloucestershire is experiencing a green surge, with over 37 Green councillors now working hard for local residents across the county. Next year is Cheltenham’s turn.\nExcited about 2024?\nWant to help make a Green win a reality? We need volunteers like you to help in our big 2024 election campaign.\nClick the button to help, or contact coordinator@cheltenham.greenparty.org.uk\nI want to help the Greens here!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_03_01_blood-from-a-stone-council-budgets-at-breaking-point/content_89.html": "Why are Local Council budgets at breaking point?\nAfter 40% cuts to council funding by governments over the past 14 years, I feel for all council leaders trying to consistently do more for less. We need urgent changes to council funding arrangements, and I hope the Labour Party copy Green policy and add that to their manifesto. The likes of Cheltenham Borough Council will be bust in a matter of years unless something changes.\nAlmost 10 years overdue, North Place car park redevelopment plans submitted\nPlans were submitted last week to finally develop one of the town’s biggest eyesores: North Place car park.\nThe fact it has taken the Lib Dem-led borough council nine years to find a developer at a time when affordable housing is at an all-time low is beyond a joke. By the time anything is approved and built it will have been more than 12 years since the Morrisons development was scrapped.\nThis is one of the most prized areas in Cheltenham which has been left as a dusty wasteland for too long. Meanwhile other housing developments have been completed or approved on the precious green belt surrounding the town.\nWhilst overdue, the proposal for 153 houses is welcome. As is the fact that the developers aim to provide homes for a broad socio-economic range, such as young people, families and downsizing older generations.\nI hope the loss of the car park will encourage those travelling to the town from farther afield to use the under-utilised park and ride. Few, if any, visitors drive into Bath or Oxford these days and Cheltenham should be aspiring for the same.\nAs someone who lives close to the development, I will study the application and urge others to do the same.\nMore barriers to recycling at Swindon Road?\nIf cutting the opening times was not bad enough, the council has introduced a reservation system which means we will have to pre-book to take our recycling to the Swindon Road centre.\nThe council claims it will improve the customer experience, yet I cannot see how. Many people drop recycling off on their way elsewhere, but a booking system makes impromptu trips more difficult. We should be helping the town to recycle rather than adding barriers.\nIf you have any questions about this article or want to raise any issues with me as your Green Parliamentary Candidate for Cheltenham, you can contact me at directly at daniel.wilson@cheltenham.greenparty.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2023_12_01_cheltenham-can-have-a-green-led-council-and-a-green-mp/content_132.html": "Those are not my words but those of Caroline Lucas, Green Party MP for Brighton Pavilion, who was in Cheltenham last week. Caroline made the point that some 20 years ago, Brighton was a two-party battleground between the Conservatives and Labour.\nIt has since elected an MP in four consecutive general elections and twice made the Greens thelargest party on the council. The town is a healthy three-way fight, which is something Cheltenham should and could aspire to have.\nCheltenham doesn’t have to continue in a two-party system it is time for change.\nGreen PPC Daniel Wilson on stage with Caroline Lucas MP at an event in Cheltenham Inadequate Investment in Flood DefencesWith expected shifts in the British climate to more intense rainfall and greater frequency of flash\nfloods, government investment plans for flood defences contain no guarantee that the country will\nbe more resilient to flooding. The warning comes as a report from the National Audit Office highlights that the Environment\nAgency (EA) has reduced the predicted number of properties it will be able protect by 2027 from\n336,000 to 200,000. Due to cuts from central government, the Environment Agency has had to remove 500 of the 2,000\nnew flood defence projects that were originally included. As the thousands who have been flooded will testify, prevention is better than cure. The\nGovernment should allow those in vulnerable areas to apply for small grants to protect their\nbusinesses and households before a flood hits, rather than afterwards. There also needs to be a greater emphasis on creating natural flood defences through practices such\nas planting trees and hedges that absorb water and restoring bends in rivers. And rather than\nbulldozing planning laws, as Labour proposes, we need to reassess regulations which\nunbelievably still allow for building on flood plains. A statement of failure\nJeremy Hunt’s Autumn Statement was notably missing any significant green policy or investment –\nwith the Chancellor even bragging about new oil and gas licences granted by the Conservatives.\nLast week’s statement contained only short-term fixes. The £960m investment by 2030 for a new\n“green industries growth accelerator” programme is not, as BusinessGreen’s James Murray puts it,\n“going to move the dial”. Green Party co-leader Carla Denyer rightly dismissed the statement as “another failed opportunity\nto end the cost-of-living crisis, tackle the climate crisis and restore crumbling public services on\nwhich we all rely.”\nOnly the Green Party has the political will to deliver a fairer and greener Britain\nIf you have any questions about this article or want to raise any issues with me as your Green Parliamentary Candidate for Cheltenham, you can contact me at directly at daniel.wilson@cheltenham.greenparty.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_street-crossings/content_46.html": "Green Party calls for action on speeding and street crossings 8th June 2023 / 8th June 2023 by Cheltenham Green Party Read more » 20 is plenty Cheltenham Green Party street crossings",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_steve-bell-lansdown/content_1.html": "Council Candidate for Lansdown\nSteve Bell\nI’m your local Green Party campaigner in Lansdown, where I have lived with my children for the past five years.\nThis is a great area of Cheltenham to live and work in, but there’s always room for improvement. People have told me they’re particularly concerned about traffic safety, crime and air quality in this area. As a father of two, these issues are a huge concern to me as well.\nMany different people live in Lansdown, ranging from the most comfortable to the most vulnerable, and I would love to work with you and other residents to make it cleaner and safer for everyone, regardless of age, background or economic status.\nAs a local Green campaigner, I am an independent Lansdown voice, standing up for local residents and holding the council to account, pushing for transparency and putting local Lansdown needs and the environment first. Over the next few months, I will be meeting with residents to ask about the issues which bother you most, and impact upon your quality of life as a Lansdown Resident.\nIf you want things to change, please talk to me when you see me out and about in Lansdown, or you can contact me by email:\nsteve.bell@cheltenham.greenparty.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_03_29_prestbury-residents-let-down-by-cheltenham-borough-councillors/content_53.html": "Why did the Lib-Dem led Borough Council sell off the Idsall Car Park?\nHaving spent the weekend campaigning in Prestbury with Green Candidates Jan Foster and Ian Cameron, I was overwhelmed by the strength of feeling within the parish against the selling off of the Idsall car park by the Lib Dem led Borough Council. The current Prestbury PAB councillors must also take some responsibility for the loss of the car park, as it has happened on their watch.\nPrestbury is a large area which already suffers from a limited bus service and car parking provision. Whether attending Church, popping to the butchers or buying groceries from the shop, Idsall car park has played a vital role supporting local residents and businesses. The loss will be felt.\nIt is time to nationalise the water companies\nThe amount of sewage dumped into England’s rivers and seas by water companies more than doubled in 2023. According to the Environment Agency, there were 3.6 million hours of sewage discharges into our rivers and seas, compared to 1.75 million hours in 2022.\nIt is a scandal.\nLocally there were the equivalent to 186 days worth of sewage discharges in the rivers around Cheltenham – the biggest being in Andoversford, which recorded an outrageous 87 days alone. This has to stop. The Green Party would end this failed experiment in privatisation, bringing the water companies back into public control so we can clean up this industry.\nThe Council needs to focus more support on the poorest areas of the town\nWith money already tight, the council needs to start focusing on those in the town who need the most support and not on loss making projects such as the Ice Rink. The Ice rink ran at a £74,000 loss last year.\nThe cost of living crisis on the back of 14 years of Tory austerity has left many Cheltonians needing the council’s support more than ever. Many simply cannot afford travelling into the town let alone the high prices to use the ice rink. They could however have benefited from a share of the £74,000 to fund additional support in the most deprived areas of the the town.\nThe town centre continues to receive a disproportional amount of council funds and I would urge the council to consider abandoning the Ice Rink this year and use the money for something which supports the areas most in need of the help.\nIf you have any questions about this article or want to raise any issues with me as your Green Parliamentary Candidate for Cheltenham, you can contact me at directly at daniel.wilson@cheltenham.greenparty.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2022_06_18_defection-to-greens-2022/content_111.html": "LONG serving Hesters Way Borough Councillor Wendy Flynn has quit the Liberal Democrat Party to join the Greens.\nThe former Mayor of Cheltenham has been a councillor for Hester’s Way for 20 years, and her defection has highlighted significant cultural problems in Cheltenham Lib Dems.\nSpeaking about her decision Councillor Flynn said: “For two years I have been fighting a culture within the Liberal Democrats that is unwelcoming to people of colour – as the Dennis Parsons debacle demonstrated all too well.”\n“In June 2020 the Council voted to take a zero-tolerance approach to racism in all its forms. Despite this, the Liberal Democrats have just voted in as mayor a councillor who had expressed views that were judged to be racist by a national Lib Dem Standards Committee. I must stay true to my principals, and this means I can no longer be a part of the Liberal Democrats. “\nCllr Flynn’s defection means Cheltenham Borough Council now has two Green Party councillors, following the election success of Cllr Tabi Joy in St Paul’s last month.\nLocal Green Party spokesperson Daniel Wilson said: “Councillor Flynn’s principled decision is good for the people of Hester’s Way. For over 20 years Wendy has made Hesters Way her number one priority, and we are delighted she has decided to join us to continue her great work.”\n“Wendy will continue to be an outstanding advocate for Hester’s Way as a Green Councillor, in an inclusive Party which represents and supports the whole community.”\nCllr Tabi Joy, the authority’s other Green Party councillor, said: “I have massive respect for Cllr Flynn’s principled move, and am delighted that there will now be a Green group – rather than just me as an individual – able to hold Cheltenham Borough Council to account for their actions.”\nYou can help change the course of local and British politics – join the Green Party today!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_nhs/content_85.html": "A Green take on health and wellbeing 24th August 2023 / 24th August 2023 by Cheltenham Green Party Read more » Cheltenham Green Party Climate Change NHS Strikes",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_cheltenham-press-releases_page_2/content_21.html": "The General Election – Cheltenham Has A Positive Choice!\n/ by Cheltenham Green Party\nIf Rishi Sunak has done one good deed this year, it is to finally announce the date for the General Election. The Tory administration has failed on nearly every measure it was elected upon – Brexit, levelling up, the economy, public health, schools, the health service, defence, prisons, immigration system, the pound, the reliance on […]\nRead more »",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_06_15_why-you-shouldnt-vote-tactically-at-this-election/content_17.html": "I am standing as your Parliamentary candidate for the Green Party.\nI am married with 4 daughters and have lived in the area for over 20 years. I am not a career politician, having worked in business all my life, building and leading successful companies across Europe. I am a trustee of the Cheltenham Trust where I chair the commercial Board and am also a director at Foodloose, the town’s community-owned refill and plastic-free shop.\nI am standing because the climate emergency, our public services and the most vulnerable in society cannot afford to suffer another 5 years with more of the same.\nCheltenham didn’t have food banks before 2010. We had a functioning A&E, waiting lists for treatment were weeks not years and there were enough GPs and dentists to meet the town’s needs. The outgoing government has failed on nearly every measure it was elected upon. Brexit, levelling up, the economy, schools, the health service, defence, prisons, the reliance on food banks, local government services, the country’s international standing – all worse now than when they took office in 2019. This has surely been the worst government in living memory.\nAnd let’s not forgot where all of this began. It started under the Lib Dem/Tory coalition in 2010 and their policy of austerity.\nFor too long residents in Cheltenham have felt let down and ignored by their politicians, forced to choose between two very similar parties who were recently in a coalition together. But now, as we feel the force of the rising cost of living and the climate crisis, it is time for real change.\nIf elected, I will face these challenges head on with bold policy ideas. This includes a nationwide home insulation programme to reduce energy bills, rejoining the EU as soon as possible, a wealth tax on the richest to pay for public services, nationalising utility companies and implementing rent controls and an end to no-fault evictions.\nThe Conservatives will probably lose this election, all political commentators agree on that. We now have no Conservative borough councillors in Cheltenham and the Green Party are the official opposition to the Lib Dems. We received 10,000 votes in May’s election!\nIf ever there was an election NOT to vote tactically in Cheltenham this is it.\nVote Green. Vote for Daniel Wilson on the 4th July.\nReal Hope. Real Change.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_cheltenham/content_137.html": "Greens finish strong second in Prestbury, look to 2024 15th October 2023 / 21st October 2023 by Cheltenham Green Party Read more » by-election cheltenham Cheltenham Green Party green party jan foster local elections prestbury",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_12_16_prestbury-ward-news-december-2024/content_7.html": "This month I’ve been working to get the message out to eligible pensioners to apply for Pension Credit. You have to have applied by 21st December in order to get the Winter Fuel Payment. Apply at https://www.gov.uk/pension-credit/how-to-claim. A cross party group of councillors has produced an information sheet which I’ve been distributing in the ward. A big thank you to the various Prestbury groups who have agreed to make it available, and to Cheltenham U3A for putting the information out in their newsletter.\nHighways and flooding continue to be areas of major concern in the ward. I recently had a meeting with County Councillor Stephan Fifield to make sure he is aware of these issues.\nThe Swindon Road Recycling Centre is going to close for an indefinite period on 10th January. There are concerns about the impact of this locally, so please report any fly-tipping to 01242 262626 or use the form at https://www.cheltenham.gov.uk/info/55/street_care_and_cleaning/365/fly-tipping_and_bins_on_the_highway.\nMembers of the public can now sponsor a native oak tree at the cemetery, to be planted near the new chapels, which will bring ecological and environmental benefits to the cemetery. If you are interested visit https://www.cheltenham.gov.uk/tree-sponsorship.\nDon’t forget that some refuse collection dates will change over the holiday period. You can check at\nhttps://www.cheltenham.gov.uk/info/5/bins_and_recycling/941/bank_holiday_waste_and_recycling_collections. The good news is that revised collections taking place on Wednesday 8, Thursday 9 and Friday 10 January will accept extra refuse and recycling. Refuse should be tied up in black bags beside your bin and extra\nrecycling should be sorted in the same way as in the boxes.\nMerry Christmas everyone!\nJan Foster, Green Party Councillor for Prestbury Ward, Cheltenham.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_fundraising/content_60.html": "Australia Is Burning – Strike a Light Fundraiser 4th February 2020 by Cheltenham Green Party Read more » australia wildfires environmentalism fundraising social causes",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2022_07_27_lets-make-cheltenham-a-unicef-child-friendly-city/content_55.html": "We call on Cheltenham Borough Council to commit Cheltenham to becoming a UNICEF Child Friendly City.\nBy adopting this UNICEF scheme, already being trialled in progressive councils in the UK, the council will work towards delivery of more play space, safer roads, cleaner and greener neighbourhoods, cycle infrastructure, better education, and child safety – all areas which will benefit families and communities in our town.\nThe Green Party’s Cheltenham councillors Wendy Flynn and Tabi Joy have proposed the Council adopt this measure but so far the Liberal Democrats have refused to back it.\nHelp us improve our town by making your voice heard! Please sign the petition here and help us pressure the council to act!\nUNICEF’s child rights-based approach to public services has consultation with children and young people at its core. We need young people involved and democratically engaged from start to finish. Specifically we call on the Council to: – Agree a timetable for signing up to the UNICEF programme and begin the process to become a recognised Child Friendly city/community. – To develop a consultation strategy which includes the principles of young people inclusion as stated above. – To implement/ improve the principles of the UNICEF status as soon as possiblePlease sign the petition here and help us pressure the council to act!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_local-action_page_2/content_75.html": "18th June 2022 / 31st August 2022 by Cheltenham Green Party\nRead more »\n18th June 2022 / 18th June 2022 by Cheltenham Green Party\n3rd May 2022 by tabijoy\n26th April 2022 by tabijoy\n19th November 2020 / 19th November 2020 by tabijoy\nGCC urgently needs a shot of imagination .\n14th February 2020 / 14th February 2020 by Cheltenham Green Party\n6th February 2020 by Cheltenham Green Party\n4th February 2020 by Cheltenham Green Party\n24th January 2020 / 24th January 2020 by Cheltenham Green Party\n18th August 2019 / 23rd August 2019 by Cheltenham Green Party\nAttending the first people's climate assembly for Cheltenham!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_02_02_safer-streets/content_73.html": "Daniel Wilson’s Cheltenham Blog\nOur streets should be saferTwo weeks ago, an 82-year-old died after being hit by a car in Cheltenham town centre.\nThis is not an isolated case. There have been several accidents on our roads in the past few years,\nwith some even happening near schools. Despite this and the public outcry that follows, nothing is\ndone. We have been promised countless much-needed pedestrian crossings – where are they?\nMany of Cheltenham’s routes around the town do not have a pedestrian crossing or have one in the\nwrong place. And where crossings do exist, such as by the Brewery, traffic jams are so long that cars\ncannot even see the green man.\nHow many more accidents will it take before the council introduces a 20mph speed limit and more\ncrossings in the town centre? Poverty in the UK\nAccording to this year’s poverty report from the Joeseph Rowntree Foundation, it is 20 years and six\nprime ministers since there was a sustained fall in poverty.\nIt makes for grim reading. More than one in five people were living in poverty in 2021/22. That’s\nalmost 14 and a half million people, with over eight million working-age adults and four million\nchildren. Successive governments have allowed poverty to become entrenched and for inequality to widen.\nThe super-rich have seen their incomes soar during a time of increased hardship for millions of\npeople.\nIt doesn’t have to be this way. Poverty is a political choice.\nThere are things that can be done to address it. We support Barnardo’s call for the chancellor in hisSpring Budget to extend the Household Support Fund (HSF) beyond the current end date which is set\nfor the 31st March. As Labour finalises its manifesto, there’s little indication they will make the right choices to help the\nmillions enduring grinding poverty. This is why we so desperately need a group of Green MPs in\nparliament to put pressure on Labour to do the right thing. The Green Party would increase Universal Credit by £40 per week and abolish the two-child benefit\ncap. A wealth tax on the super-rich, changes to Capital Gains Tax and abolishing “non-dom\nstatus” would pay for these measures to reduce poverty. Stop taking the p*ss Councillor Wilkinson\nI know Max loves his “war on wee” but painting some toxic paint on walls and posing for a photo is\nnot going to solve the many issues race week creates for the town. What about a war on misogyny, a\nwar on anti-social behaviour, a war on litter, a war on paying for sex? In your final 3 months as a\ncouncillor, we’d like a little less self-publicity please and a little more action.\nIf you have any questions about this article or want to raise any issues with me as your Green Parliamentary Candidate for Cheltenham, you can contact me at directly at daniel.wilson@cheltenham.greenparty.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_02_04_australia-is-burning-strike-a-light-fundraiser/content_138.html": "This week, Strike a Light Arts are putting on a massive fundraiser for climate action.\nTaking place at Gloucester Guildhall, GL1 1NS, on Thursday 6 February at 6pm, this is a chance to help make an impact.\nAs the Australian wildfire fires destroy lives and homes every day, the climate emergency has never been more evident.\nJoin Strike a Light for live music, performances and poetry as we present our creative response to the climate crisis. All proceeds will go towards the school strike for climate movement and the wildfire relief fund.\nStrike A Light are proud to be supporting young people from UKSCN Gloucester to produce this fundraiser.\nTickets are £5 or pay what you like for this vital cause. Purchase tickets here.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_local-action_page_3/content_78.html": "9th August 2019 / 24th August 2019 by Cheltenham Green Party\nLocal Greens attended Cheltenham Council's climate emergency summit on 6th August.\nRead more »",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_02_28_cheltenham-air-pollution-crisis/content_81.html": "Cheltenham Green Party described the recent decision by the borough council to revoke the town’s Air Quality Management Area as “incomprehensible”.\nGreen spokesperson Jessica West, who is standing in All Saints, said:\n“The Lib Dem cabinet decided on 21 January to replace the existing air quality management area, covering the whole town, with just a 250 metre stretch of Poole Way/Swindon Road in the town centre.\n“How can the council tackle this crisis if it doesn’t take air pollution measurements from all over Cheltenham? It’s exactly the same mistake as they made in the Boots Corner debacle.”\nAt the cabinet meeting, Lib Dem leader Steve Jordan said that he “was pleased that pollution levels have decreased”, and that “progress on air quality so far is good”.\nCheltenham Green Party submitted a detailed report after the cabinet meeting, pleading with the council to reconsider. The report shows that:\n– Using the council’s own Nitrogen Dioxide monitoring data, there has been no change in Cheltenham’s air quality over the last 10 years\n– The council’s Air Quality Action Plan has had no effect on traffic volumes in the centre of town\n– The decision to revoke the Air Quality Management Area (AQMA) contravenes DEFRA guidance on when an AQMA may be revoked\nThe council’s own Nitrogen Dioxide monitoring data shows nitrogen dioxide levels are generally higher or the same compared to previous years, across many monitoring sites, with no reduction at all in the last four years at two key town centre sites, and no reduction in traffic.\nPeter Frings, the local Green Party spokesperson on air quality, added:\n“Cheltenham council has had an Air Quality Action Plan in place since 2011 – but their own data shows it has had no effect on reducing nitrogen dioxide pollution in the town centre, and that traffic levels are unchanged. Oxford City Council has achieved a 37% fall in Nitrogen Dioxide over the period 2008 to 2018. Why has Cheltenham been unable to achieve this kind of improvement?”\nThe Green Party’s report also pointed out that the borough council was ignoring evidence that pollution from particulate matter was a serious issue across the whole of Cheltenham.\nPeter Frings commented:\n“We submitted evidence from particulate air pollution monitors in Leckhampton, which are run by the parish council there, that the average level of small 2.5 micronparticles (PM2.5) was higher than the World Health Organization annual thresholdlevel of 10 microgrammes/m3. And also that the WHO daily limit of 25microgrammes/m3 is breached regularly. The latest data shows that hourly peaks during rush hour and school drop off times, can exceed over 80 microgrammes/m3.”\n“If this is the level of air pollution in Leckhampton, how can the council pretend that there is only a problem on either side of a 250 yard stretch of road in the towncentre?”\n“DEFRA’s Clean Air Strategy, published in May 2019, commits the government to implementing the WHO guidelines on particulate air pollution. Very shortly, the council will have to tackle the fact that most of Cheltenham is likely to be in breach of the WHO guidelines on PM2.5 pollution – and the decision to revoke the Air Quality Management Area will look misguided at best, negligent at worst.”\nThe full report can be found here.Further information:\nJessica West (07837 828085, jessica.west@cheltenham.greenparty.org.uk)Peter Frings (07595 081516, peterfrings@macace.net)\nSources and Notes\nCheltenham Borough Council Cabinet papers/agenda for Cabinet meeting 21 January 2020\nCheltenham Borough Council Nitrogen Dioxide data\nTraffic data – Available from Department of Transport website\n– DfT Traffic Count Point 18552 (Tewkesbury Road): a manual count in 2008 showed an Average Annual Daily Flow (AADT) of 20,731 vehicles. A manualcount in 2018 showed an AADT of 20,632 vehicles.\n– Traffic Count Point 70125 (North St/Portland Street): the manual count figures for 2008 and 2018 are 11,965 and 12,201 respectively.\n– Traffic Count Point 38656 (Albion Street/Winchcombe Street): the manualcount figures for 2010 and 2018 are 11,441 and 12,201 respectively.\nParticulate pollution monitoring in Cheltenham\nPeter Frings can also provide downloads of data readings, either daily or hourly averages, for any period from mid July 2019 onwards.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_01_05_2024-can-be-the-year-for-change/content_100.html": "languishing at the wrong end of their respective tables, the days are short, we may have already\nabandoned dry January and the credit card bills from December’s overindulgence will shortly be with\nus.\nIn this first edition of the New Year, I want to provide some positivity and call on Cheltonians to seize\nthe upcoming political opportunities Our Town\nDespite its challenges, Cheltenham remains one of the best places to live in the country. We have\nthe Cotswold hills on our doorstep, some of the finest parks, many great schools and colleges and\noutstanding facilities be it restaurants, shops or leisure activities. Our Country\nWhile there is much wrong with UK, we must be thankful to live in a country which is not suffering\nfrom political repression, famine, severe flooding, earthquakes or war. In 2023 wars around the\nworld resulted in a 28-year high for deaths from conflict. We hear a lot about Ukraine and Gaza in\nthe news, but conflicts continue in Syria, Libya, Ethiopia, Sudan, Myanmar, Nagorno-Karabakh, the\nDRC, Kosovo and Haiti….to name just a few. We cannot imagine what these peoples are going\nthrough. Are we surprised so many people are having to flee their own country and taking so many\nrisks to their own lives to do so? Our Political System\nIt has come under attack from a wave of populism which began with Brexit in 2016 but appears to\nbe on the decline following the demise of Boris Johnson et al. Thankfully we can still vote out the\npoliticians we do not agree with and in 2024 that matters! We have elections in Cheltenham in May\nfor the borough council and at some point, for the Parliamentary seat in Westminster. This is the\nyear you need to ensure you are registered to vote. It can make a positive difference. This is the year your vote can end the two-party state Cheltenham has suffered for far too long. This\nis the year your vote can improve representation on the borough council, bringing an end to the\ndominance of the Lib Dems. This is the year your vote – for anyone but the Conservatives – will bring\nabout a change in government\nIf you have any questions about this article or want to raise any issues with me as your Green Parliamentary Candidate for Cheltenham, you can contact me at directly at daniel.wilson@cheltenham.greenparty.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2025-county-council-election-candidates/content_20.html": "We’re delighted to offer a full slate of candidates across all of Cheltenham’s wards for the 2025 County Council Elections on 1st May.\nPlease use this page to identify the Green Party candidate in your area!\nWe’re delighted to offer a full slate of candidates across all of Cheltenham’s wards for the 2025 County Council Elections on 1st May.\nPlease use this page to identify the Green Party candidate in your area!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_air-pollution/content_152.html": "It’s in the air we breathe: we need to address pollution now 16th December 2020 by tabijoy Read more » air pollution environmental health\nCheltenham Borough Council in denial on air pollution crisis in Cheltenham, say Cheltenham Greens 28th February 2020 / 28th February 2020 by Cheltenham Green Party Read more » air pollution air quality borough council liberal democrats",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_prestbury/content_29.html": "Greens finish strong second in Prestbury, look to 2024 15th October 2023 / 21st October 2023 by Cheltenham Green Party Read more » by-election cheltenham Cheltenham Green Party green party jan foster local elections prestbury\nGet your tickets for a special Green Forum with Jonathon Porritt now! 30th September 2023 by Cheltenham Green Party Read more » by-election event green party jonathon porritt prestbury\nPrestbury by-election announced 5th September 2023 by Cheltenham Green Party Read more » by-election green party jan foster prestbury",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_local-elections/content_119.html": "Greens finish strong second in Prestbury, look to 2024 15th October 2023 / 21st October 2023 by Cheltenham Green Party Read more » by-election cheltenham Cheltenham Green Party green party jan foster local elections prestbury",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_our-candidates_wendyflynn-hestersway/content_82.html": "Hesters Way\nWendy Flynn\nHello, I’m Wendy Flynn and I’m your Green canmpaigner for Hesters Way. If you are a Hesters Way resident please get in touch.\nI recently moved across from the Liberal Democrats and joined the Green Party here in Cheltenham. I have been increasingly impressed with the rapidly growing Green Party here – we recently won our first seat on Cheltenham Borough Council, and I stand by the ethical manner in which the party operates at local and national level.\nHesters Way residents come before any party politics. This stance is respected and shared by the Green Party who will support me in serving you.\nI will continue to be available for all residents and encourage you to contact me if you need help or just wish to express a view or opinion. I stand by my record of helping residents with many issues, including social housing, planning applications, refuse collection and anti-social behaviour. I’ve spent many hours working with the Hesters Way Forum on a Neighbourhood Plan for the area. I’ve litter-picked and planted trees, served as mayor, and challenged the negative views some in other parts of the town have about Hesters Way.\nI will always put your interests first and continue to do the right thing for Hesters Way.\nIf you have any questions, please get in touch with me at wendy.flynn@cheltenham.greenparty.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_transport/content_146.html": "Where Are Gloucestershire’s Great Ideas? 19th November 2020 / 19th November 2020 by tabijoy GCC urgently needs a shot of imagination . Read more » Gloucestershire County Council Transport",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_community/content_136.html": "Essential Support for Essential Workers 14th January 2021 / 14th January 2021 by tabijoy Read more » community coronavirus frontline workers health",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2019_08_09_cheltenham-council-climate-summit/content_48.html": "On 6th August, Cheltenham Greens attended the council’s public climate emergency meeting. This summit built on the declaration of a climate emergency in February.\nThe meeting was well-attended, with over 100 people taking the time to come to share their views. Access was restricted, with notice of attendance and questions requested in advance, but it represents a useful first step in engaging local people in discussions.\nGreen Party members Louise Folkes, Tabi Joy, and Ed Saul all contributed towards the discussions, advocating for greater traffic safety standards and decentralised local energy, as well as other demands for greener council housing, more localised economic models, and greater accountability for council actions.\nIt highlighted the importance on active collaboration between government, local businesses and services, and Cheltenham residents. Cheltenham Green Party will continue to ensure that everyone is fairly represented in this issue as it develops.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_students/content_129.html": "University of Gloucestershire – Student Rents 10th January 2021 by tabijoy Students cannot afford to pay for accommodation they cannot use - and universities must make sure rental conditions are fair. Read more » communities housing rent students university University of Gloucestershire\nUoG Hedgehog Society 14th February 2020 / 14th February 2020 by Cheltenham Green Party Read more » hedgehogs students University of Gloucestershire wildlife",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_08_26_have-your-say-on-the-cyber-park-plans/content_10.html": "The cyber park is going to be a big development within Cheltenham, and it’s important that we ensure that we push for this to be the best that it can be for the people of Cheltenham. With more than 1000 new houses, and the promise of 35% of those to be affordable, it’s also likely we’ll see a big influx of people within our town. The council are currently looking for consultation comments on the site masterplan, with submissions closing on August 28th. It’s important that everyone who wants to have their say does. You can do so by visiting the council website and clicking through to Public Access and entering the reference ’24/01268/OUT’.\nThe Government Needs to Pledge to Continue Nature-Friendly Farming Support\nA new Natural England report that found nature-friendly farming schemes have boosted biodiversity which is to be welcomed. The UK is one of the most nature-depleted countries in the world and we urgently need to address the enormous risk that habitat and biodiversity loss poses to our future.\nMost farmers want to do the right thing for nature and this report clearly shows that government support for nature-friendly farming pays off. Now we need to see more of it.\nFarmers need reassurance, certainty, and easier access to funding for nature-friendly farming, so it is very disappointing that the Labour Government has so far refused to commit to maintaining the level of support payments.\nThe Green Party is urging the government to show leadership and not only commit to maintaining the current level of funding, but to listen to the many calls, including from the RSPB, National Trust and The Wildlife Trusts, for a massive increase in nature-friendly farming support.\nWe do not have to have an ‘either or’ between nature restoration and food production. With more leadership from the Government, we can achieve both.\nIt’s Time Cross Country Trains Should Lose its Licence to Operate\nThe fact Cross Country Trains, which is the main train operator using Cheltenham Spa station, is having to implement a reduced timetable due to performance failures, should prompt the new government to look to remove its licence once and for all.\nCross Country has been one of the worst performing train operators in the country in recent years. It is another example of failed privatisation. And rather than fares which subsidise the dividends of its parent company, Deutsche Bahn, it is time we had a service which is reliable and owned and run for the good of the country.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_university-of-gloucestershire/content_117.html": "University of Gloucestershire – Student Rents 10th January 2021 by tabijoy Students cannot afford to pay for accommodation they cannot use - and universities must make sure rental conditions are fair. Read more » communities housing rent students university University of Gloucestershire\nUoG Hedgehog Society 14th February 2020 / 14th February 2020 by Cheltenham Green Party Read more » hedgehogs students University of Gloucestershire wildlife",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_daniel_ppc/content_62.html": "Prestbury Residents Let Down By Cheltenham Borough Councillors 29th March 2024 / 25th May 2024 by Cheltenham Green Party Read more » Daniel Wilson\nComic Relief – I Am No Longer Laughing 15th March 2024 / 25th May 2024 by Cheltenham Green Party Read more » Daniel Wilson\nBlood From A Stone: Council Budgets At Breaking Point 1st March 2024 / 25th May 2024 by Cheltenham Green Party Read more » Daniel Wilson\nLabour Abandons Their Green Plans 25th February 2024 / 25th February 2024 by Cheltenham Green Party Read more » Daniel Wilson\nOur Streets Should be Safer 2nd February 2024 / 18th February 2024 by Cheltenham Green Party Read more » Daniel Wilson\nThe Post Office Scandal 19th January 2024 / 25th February 2024 by Cheltenham Green Party Read more » Daniel Wilson\n2024 Can Be The Year For Change 5th January 2024 / 18th February 2024 by Cheltenham Green Party Read more » Daniel Wilson\nWe Need More Transparency from Lib Dems 15th December 2023 / 18th February 2024 by Cheltenham Green Party Read more » Daniel Wilson\nCheltenham Can Have a Green-led Council and a Green MP 1st December 2023 / 18th February 2024 by Cheltenham Green Party Read more » Daniel Wilson\nHomelessness is Not a Lifestyle Choice 17th November 2023 / 18th February 2024 by Cheltenham Green Party Read more » Daniel Wilson",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_01_27_water-is-life/content_113.html": "The UK’s utilities infrastructure – electricity, gas, water, sewage – is really out of date. Some of the major works date back to the 1970s or even the 1950s – and in the case of water and sewage, back to Victorian times.\nOf course it’s a bit tricky changing pipes, but we’ve been really procrastinating on it for decades. Now one person’s fighting to fix the system.\nSarah Poppy Jackson, author of ‘Reclaim Your Sh*t’, is campaigning to end the futile cycle of cleaning our water just to defecate into it. She’s speaking out because cleaning water uses up a lot of energy. Flooding our toilets with it just doesn’t make sense, especially when we could use grey-water or rainwater instead, or even different toilets.\nWe’re taking our clean water for granted, and we need to urgently have a conversation about it.\nFollow her on Twitter for updates, and sign her petition here.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_author_tabijoy/content_80.html": "3rd May 2022 by tabijoy\nRead more »\n26th April 2022 by tabijoy\n9th August 2021 by tabijoy\n12th April 2021 / 9th August 2021 by tabijoy\n14th January 2021 / 14th January 2021 by tabijoy\n10th January 2021 by tabijoy\nStudents cannot afford to pay for accommodation they cannot use - and universities must make sure rental conditions are fair.\n16th December 2020 by tabijoy\n19th November 2020 / 19th November 2020 by tabijoy\nGCC urgently needs a shot of imagination .",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_australia-wildfires/content_149.html": "Australia Is Burning – Strike a Light Fundraiser 4th February 2020 by Cheltenham Green Party Read more » australia wildfires environmentalism fundraising social causes",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_06_25_real-hope-real-change-for-a-fairer-greener-cheltenham/content_36.html": "It has been the same two-horse political race in Cheltenham for too long.\nYou can change that on July 4th.\nHistory has shown us this can happen. In 1997, the Green Party polled 2.7% of the vote in Brighton Pavilion. 13 years later Caroline Lucas was elected as the first Green MP to an area which had historically been a Labour-Conservative battleground.\nThe change has already started to happen in Cheltenham. The Greens last month won more councillors than the Conservatives in the local elections, polling a record 10,000 votes – or 16%. And we have been the only party to beat the Lib Dems in recent council ward elections in the town, making us the official opposition.\nYou do not need to vote tactically. If ever there was a time to go with your heart, this is it.\nThe Tories and the Lib Dems have failed Cheltenham.\nWe cannot forget it was the Lib Dems in coalition with the Tories who introduced the policy of austerity, devastating our public services. Before 2010, Cheltenham didn’t have food banks. We had a functioning A&E and a booming high street.\nThe town has also been let down on the environment. Last year there was the equivalent to 186 days’ worth of sewage discharges in the rivers around Cheltenham – the biggest being in Andoversford which recorded an outrageous 87 days alone. This cannot go on.\nOnly the Greens have the courage to be honest about the environment and the failings of Brexit, while the other parties simply bury their heads in the sand.\nWe have a plan for ambitious action on the issues you care about, such as the NHS, housing and education. To fund this change, we will ask the very richest in society to pay a little more. Britain is the fifth richest country in the world, it is time everyone felt the benefits of that.\nFor the first time in 14 years, you don’t need to choose the lesser of two evils. Vote for a party you actually believe in.\nVote Daniel Wilson on the 4th July.\nKey Pledges from The Green Party Manifesto\nThe NHS:\nWith an additional £30bn per year funding commitment, only the Green party is putting forward the levels of money required to ensure the NHS, its doctors and nurses and the building they work in can provide a world-class, free at the point of delivery service.\nSocial Care:\nWe are committing an additional £20bn funding per year to provide free personal care for all and to ensure care workers are paid fairly for their important work.\nHousing:\nWe would spend £12bn on social housing and provide an additional £17bn in grants to private homeowners to better insulate Britain’s homes, reducing energy use and bills. We would also commit to building 150,000 social homes per year, every year. We would ban no fault evictions and introduce rent price controls.\nSchools:\nWe would provide free school meals for all children because no one can learn when they are hungry. We would also fund breakfast clubs for all primary school children. We would correct the below-inflation pay awards for teachers by allocating £2bn of funding to stop the staff churn currently negatively affecting schools.\nUniversities:\nThe Green Party would abolish tuition fees and restore grants. Education should be free for all.\nThe Environment:\nWe want a net-zero society before 2040. We would invest in green energy, aiming for wind farms to provide 70% of our power by 2030, up from 20% in 2023. We would introduce Rights to Nature Act to protect the environment from being exploited for economic gain. We would nationalise the water companies.\nBrexit:\nStarting with the customs union, we would rejoin the EU as quickly as possible.\nTransport:\nWe would invest in the bus infrastructure and nationalise the train network to ensure our public transport is affordable and delivers the service needed to tempt people out of their cars.\nDefence:\nWe would stop Britain’s nuclear programme, saving £2bn per year.\nBenefits:\nWe would scrap the two-child benefit cap, which would help lift 250,000 children out of poverty.\nImmigration:\nWe would scrap the Rwanda scheme and re-establish safe routes for those fleeing persecution or environmental catastrophe.\nTaxation:\nWe would introduce taxes on the wealthiest in society, raising unprecedented levels of money to pay for all the above.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_air-quality/content_95.html": "Cheltenham Borough Council in denial on air pollution crisis in Cheltenham, say Cheltenham Greens 28th February 2020 / 28th February 2020 by Cheltenham Green Party Read more » air pollution air quality borough council liberal democrats",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_author_cheltenham-green-party_page_6/content_26.html": "14th January 2020 by Cheltenham Green Party\nRead more »\n11th January 2020 / 11th January 2020 by Cheltenham Green Party\nCome and meet us! Cheltenham’s local Green Party is setting up a monthly office surgery session. Today we had our first meeting and had a great time discussing Prevent and Extinction Rebellion, the ongoing refugee crisis, how to meet with local MPs to voice concerns, the roles of faith groups in green campaigning, and Cheltenham’s […]\n1st October 2019 / 1st October 2019 by Cheltenham Green Party\nWith an increase of interest in climate issues this year, we attended the University of Gloucestershire’s Freshers Fayre and the Cheltenham Climate Strike. Managing the Freshers stall through Wednesday, we tried to cut through some of the overwhelm students might have been feeling with flyers and invitations to the climate strike. We had some great […]\n18th August 2019 / 23rd August 2019 by Cheltenham Green Party\nAttending the first people's climate assembly for Cheltenham!\n9th August 2019 / 24th August 2019 by Cheltenham Green Party\nLocal Greens attended Cheltenham Council's climate emergency summit on 6th August.\n9th August 2019 / 23rd August 2019 by Cheltenham Green Party\nOur first councillor candidate - Jessica West for All Saints.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2021_01_14_essential-support-for-essential-workers/content_56.html": "Cheltenham Green Party are asking for frontline workers to be urgently given Covid-19 vaccinations. Rates in Cheltenham as of yesterday have increased by 51 people to 2,871, and we’ve now seen 100,00 people pass away from the virus.\nFrontline workers, including health and social workers, shop workers, teachers, delivery drivers, bus drivers, cleaners and waste disposal workers, firefighters and police officers, funeral staff and many other sectors, are continuing to work in public to help protect people, but are often lacking full protection themselves.\nWe’re all doing vital work wearing masks and socially distancing, but vaccinating key workers can also help to prevent the spread of the virus.\nThe Green Party have launched a petition to ask the Minister for COVID-19 Vaccine Deployment, Nadhim Zahawi, to prioritise frontline workers – if you agree, you can sign it here.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_09_01_cheltenham-doesnt-need-nor-want-a-visit-from-boris-johnson/content_12.html": "Boris Johnson is not welcome in this town. This is the man who allowed the Cheltenham Festival to go ahead despite the risk of covid. Cheltenham suffered as a result of that failure. The pandemic spread here much faster than in other areas with our hospital having the highest number of coronavirus hospital admissions in the county a few weeks after the festival.\nThis is a man without morals, who presided over a shambolic administration. The Conservatives have been voted out locally both at borough Council level, where they no longer have any councillors; and at Westminster, having lost their MP in July’s election.\nYou are not welcome here. Go and promote your book elsewhere Mr Johnson.\nProtect Hardwick Green\nThe University of Gloucestershire’s Hardwick campus, situated in Cheltenham’s St Paul’s area, has been put up for sale. The field on the campus, Hardwick Green, is publicly accessible for now, but will be lost if the sale goes ahead and the planning is approved for 12 houses to be built on the Green.\nWhilst we do not object to the sale of the site and the re-development of new housing on the space which is already built upon, we do object to any loss of the Green. It is the only green space within the boundaries of St Paul’s. It provides flood mitigation, urban cooling and an important recreational space for local residents.\nPlanners must also consider the impact the new housing will have on traffic and parking. Swindon Road is already one of the busiest cut-through roads in the town and the lack of parking in around Marsh Lane which borders the Green is already creating issues for locals. The St Paul’s Green Party councillors will be doing all they can to protect the area.\nWhere Are All The Insects?\nThe lack of insects this summer should be concern to us all. The UK ranks among the the bottom 10% of countries globally for biodiversity, with over 40% of all UK species experiencing significant population decline. One estimate puts insect numbers as being down 90-95% compared with a century ago. This matters. Insects support plant and crop pollination and are vital food source for many mammals. I have heard little on biodiversity from the Labour government so far. This must change.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_green-energy/content_118.html": "Supporting Positive Business Through Coronavirus 3rd May 2020 / 3rd May 2020 by Cheltenham Green Party Read more » banking green energy green new deal green society\nZero West Conference 2020 21st January 2020 / 21st January 2020 by Cheltenham Green Party Read more » future vision green energy green new deal",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_green-party/content_79.html": "Greens finish strong second in Prestbury, look to 2024 15th October 2023 / 21st October 2023 by Cheltenham Green Party Read more » by-election cheltenham Cheltenham Green Party green party jan foster local elections prestbury\nGet your tickets for a special Green Forum with Jonathon Porritt now! 30th September 2023 by Cheltenham Green Party Read more » by-election event green party jonathon porritt prestbury\nPrestbury by-election announced 5th September 2023 by Cheltenham Green Party Read more » by-election green party jan foster prestbury",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2024_03_15_comic-relief-i-am-no-longer-laughing/content_88.html": "Why does Comic Relief need to raise money for food banks?\nLast week I watched the Comic Relief programme where four female celebrities trek deep into the artic circle. The show was enjoyable until a segment mentioned some of the money raised would be going to support food banks.\nFood banks are a political failure. They hardly existed in this country before 2012 and yet now they are completely normalised. How is it acceptable that Comic Relief needs your donations to keep the food bank going? Surely the Government of the world’s fifth richest economy should look after its people with fair pay and a benefits system which doesn’t leave anyone behind.\nSadly, many charities only exist because of government failure. Other developed countries do not hold events like Comic Relief or Children In Need, not because their citizens do not care, rather their governments actually govern.\nCheltenham Race Week\nMany will be breathing a sigh of relief that race week has been and gone.\nI have long called for the council to commission an independent study which looks at the overall impact race week has on the town. The benefits and consequences should be regularly reviewed. The last report was carried out using 2015 numbers and was too narrow in its approach.\nWe know that over 250,000 visitors descend on Cheltenham and that roughly 6,000 people will be directly employed by the festival. Bars, restaurants and hotels see a huge rise in sales. Some reports claim the week generates over £100m to the local economy. We also know that the week generates a lot of publicity, with national broadcasters basing themselves here and Cheltenham dominating the front and back pages.\nBut we also know that the levels of litter, crime and misogynistic behaviour dramatically increase during race week. Many say the town becomes a place akin to a stag party town, where men can do as they please. The atmosphere certainly changes, and I would say not for the better.\nElsewhere shopkeepers claim they lose out as residents avoid coming into Cheltenham. This is in part due to the additional levels of congestion on our already creaking road infrastructure and not helped as the train station becomes a no parking zone.\nWhatever your view, it should be heard. I think a full and independent assessment is overdue to ensure future festivals are as positive an experience as they can be for the whole of the town.\nIf you have any questions about this article or want to raise any issues with me as your Green Parliamentary Candidate for Cheltenham, you can contact me at directly at daniel.wilson@cheltenham.greenparty.org.uk",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_daniel_ppc_page_3/content_22.html": "Posts by Daniel Wilson PPC\n17th November 2023 / 18th February 2024 by Cheltenham Green Party\nRead more »",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_gloucestershire-county-council/content_147.html": "Where Are Gloucestershire’s Great Ideas? 19th November 2020 / 19th November 2020 by tabijoy GCC urgently needs a shot of imagination . Read more » Gloucestershire County Council Transport",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_bike-week/content_131.html": "Skip to content\nSkip to footer\nCheltenham\nMenu\nNews\n2025 Candidates\nCouncillors\nGet Involved\nContact Us\nJoin\nDonate\nSearch\nSearch\nJoin\nDonate\nMenu\nSearch\nHome\nTag:\nbike week\nTag:\nbike week\nCycle Summit Event\n6th February 2020\nby\nCheltenham Green Party\nRead more »\nbike week\nCTCC\ncycling\nTo top",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_green-society/content_96.html": "Supporting Positive Business Through Coronavirus 3rd May 2020 / 3rd May 2020 by Cheltenham Green Party Read more » banking green energy green new deal green society",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2023_06_08_streetcrossings-speeding/content_90.html": "Cheltenham Green Party expands campaign on speeding and street crossings in St Paul’s and Cheltenham.\nAfter years of inaction and excuses by the Liberal Democrats in Cheltenham Borough Council and the Conservatives at Gloucestershire County Council , it is time to act.\nThe Green Party has a long running campaign to put in place pedestrian crossings in the busiest and most dangerous roads in St Paul’s (you can sign our petition here). We have now expanded this to include 20mph speed limits in built up areas.\nThese are simple common sense measures, residents in St Paul’s tell us their community is being used as a shortcut road for traffic passing through, and the roads are dangerous and noisy if you are on foot, bike, partially sighted or trying to get kids to school. We have spoken to residents who experience all of these situations, and they want change.\nDespite this, the County Council has resisted saying that the roads don’t have enough traffic or accidents, and the Lib Dem County Councillor for the area refuses to back the campaign, dismissing residents concerns saying there are other more dangerous places. Why must things get so bad that accidents are happening and traffic is unbearable before simple measures like crossings are installed? It is time we prioritise residents, who are sick of being ignored.\nEstablishing a 20mph zone is a particularly bad example of inaction from the Liberal Democrat council. Everyone knows speeding kills, and that areas where people live and work have the most need for reasonable and safe speed limits. Slower cars means safer streets, better air quality and quieter roads.\nThe Liberal Democrat’s themselves back a 20mph zone in Cheltenham, completed a consultation in 2017 on the measures and it is even in their local manifesto. Despite this, the Lib Dem’s have failed to act for the last 6 years. Many towns in Gloucestershire have put these 20mph zones in place, what makes Cheltenham unable to do so? Blaming the Conservatives won’t cut it, we must work with the county council to get this done. You can sign our petition on speeding here.\nThe Green Party will continue to push for local residents voices to heard on these issues but we need your help.\nIf you are fed up of the status-quo and want to see real change, you can join our campaigns here, and join the Green Party here.",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2023_05_07_greenparty_election_wins/content_122.html": "Greens make record gains in Gloucestershire\nThe Green Party has made record gains in the local elections. After Friday we now have 737 Green Councillors, 13 regions had breakthrough Greens elected (like we did in Cheltenham last year), and we’re now the largest party in 9 councils across the country! That includes Mid Suffolk where not only are we the largest party, we’re the first Green majority led council – not just in England, but anywhere outside of Australia.\nLocally we saw huge success as well. Our friends in Tewkesbury Greens defeated 3 sitting Conservative councillors going from from one councillor to 4, in the process and leading to the creation of the first ever Green Group on Tewkesbury Council – a fantastic result.\nCotswolds Greens gained a second councillor, laying the groundwork for big growth next time.\nAnd in the Forest of Dean, the Green group doubled in size to 15 Green Councillors, a stunning result, becoming the largest party and currently negotiating with other parties to be running the council. Surely a platform to contest the parliamentary seat at the next General Election and perhaps our first ever Gloucestershire Green MP?\nThese are all significant wins, made possible by local volunteers working together.\nIt’s our turn in 2024 here in Cheltenham, and the fight begins today to get more Greens elected to push for the greener, local politics we need. We’ve had almost 15 years of low ambition green washing from the Tories and Liberal Democrats alike here, it is time for change!\nReady to help turn Cheltenham green?\nJoin our local leafleting team in Cheltenham, and help us win big in 2024.\nSign up here!Testimonials\nGreen Party co-leader Adrian Ramsay:“This has been an historic night for the Greens and one which paves the way for success in the general election next year. I want to congratulate the hundreds of councillors and the countless volunteers who have worked tirelessly to achieve this incredible set of results.”Adrian Stringer, Mid-Suffolk Greens:“We’ve now got four years to prove to the world that Green can be the way forward and deliver for our communities.”",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_tag_coronavirus/content_47.html": "Essential Support for Essential Workers 14th January 2021 / 14th January 2021 by tabijoy Read more » community coronavirus frontline workers health",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2020_01_17_support-for-our-green-spaces/content_94.html": "Cheltenham Borough Council have just submitted the new and updated Cheltenham Local Plan to the Planning Inspectorate for approval.\nThis plan’s been developed to help protect important Local Green Spaces across the town and further afield, particularly the Village in a Park concept at Swindon Village, an area of vital green space to the West of Cheltenham, and the historic and Valued Landscape of the Leckhampton Central Fields.\nThe council’s being put under pressure to reduce the amount of anticipated green space in favour of development.\nHowever, this contradicts previous advice on the matter, which recommends keeping the green spaces as they are.\nBecause of this, Leckhampton with Warden Hill Parish Council have issued a petition to call together voices in favour of keeping these spaces green and pristine.\nIf you agree that they should be protected, please sign and share!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2025_03_24_prestbury-ward-news-march-25/content_8.html": "Finally, we have launched the Prestbury and Swindon Village Community Speedwatch Group! It’s taken a while, with training, meetings and far more paperwork than I ever imagined! I’ve suggested that Swindon Village come in with us, which will hopefully increase the pool of available volunteers. We found that the sight of people in hi-viz jackets with a speed gun has an immediate effect on speeding drivers, but also the data we send to the police will back up our campaign to have a longer slower approach to the village down Southam Road and to reduce speeding generally. This would result in safer cycling, walking and horse-riding, better air quality, fewer accidents and less noise.\nNoise is at the heart of another Prestbury problem, the volume of Wychwood festival. Last year many residents had their weekend spoiled by the noise and vibration from the festival so there is going to be a licence review and I have made a representation supporting the review. None of the complainants want to stop the festival happening, but they would like to be able to carry on with their usual activities while it is happening. Having attended a drop-in session with the organisers I am confident that there is goodwill on both sides and that a compromise will be reached.\nA reminder – surgeries at the library take place from 10.00 till 12.00 on the third Saturday of the month!\nUpcoming Prestbury People Planet Event!\nOn Saturday 5th April, Prestbury People Planet are putting on an event at Prestbury Parish Hall (opposite the school) called Waste Not Want Not. Apparently, I’ll be sharing a platform with Karen Watson from Ubico and Cate Cody (Green District Councillor and PPC for Tewkesbury) and speaking- (briefly! – on avoiding waste within the home. Any tips would be welcome.\nPUBLIC CONSULTATION!\nThere is currently a public review of taxi and private-hire licensing policy on the council website which closes on 13th April. Please have your say!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_category_cheltenham-press-releases/content_2.html": "24th March 2025 / 25th March 2025 by Cheltenham Green Party\nFinally, we have launched the Prestbury and Swindon Village Community Speedwatch Group! It’s taken a while, with training, meetings and far more paperwork than I ever imagined! I’ve suggested that Swindon Village come in with us, which will hopefully increase the pool of available volunteers. We found that the sight of people in hi-viz jackets […]\nRead more »\n1st February 2025 / 1st February 2025 by Cheltenham Green Party\nBelated New Year greetings and Good Wishes to everyone celebrating a festival this month! The last few weeks have brought foul weather and associated problems of mud. I reported mud around the mini roundabouts at the bottom of Blacksmiths Lane, which was subsequently cleaned up, but sadly not the cycleway and areas of the pavement. […]\n16th December 2024 / 16th December 2024 by Cheltenham Green Party\nThis month I’ve been working to get the message out to eligible pensioners to apply for Pension Credit. You have to have applied by 21st December in order to get the Winter Fuel Payment. Apply at https://www.gov.uk/pension-credit/how-to-claim. A cross party group of councillors has produced an information sheet which I’ve been distributing in the ward. […]\n17th November 2024 / 17th November 2024 by Cheltenham Green Party\nFirst of all, I must apologise for last month’s misinformation about Post Office facilities in Prestbury. I received an email from the Post Office on 12th September asking me to spread the word. Unfortunately I didn’t receive a follow up to say it wasn’t happening! I hope no-one was inconvenienced. Prestbury this month has been […]\n2nd October 2024 / 2nd October 2024 by Cheltenham Green Party\nCompared with towns of a similar size, Cheltenham has a good range of sports and recreation facilities. We have plenty of green spaces within the town and the Cotswold hills are on our doorstep. We also have several sports fields and tennis courts dotted across the town, as well as the amazing Lido. For over […]\n16th September 2024 / 16th September 2024 by Cheltenham Green Party\nPost Office:- Great news – Prestbury is to have a ‘light’ Post Office Service on Mondays, Fridays and Saturdays at ‘Dearly Pre-Loved’ on the High Street, for parcels, bill payments and phone top-ups. See here for more info: Consultation Hub – Prestbury High St Drop & Collect GL52 3AR. Spread the word! Idsall Drive and […]\nThe Budget at the end of October will set the course for the rest of this parliament. Green MPs do not accept the need for public spending cuts. On the 4th July, the public didn’t vote for things to get worse. We want a bold budget for investment in our broken public services and the […]\n1st September 2024 / 9th September 2024 by Cheltenham Green Party\nBoris Johnson is not welcome in this town. This is the man who allowed the Cheltenham Festival to go ahead despite the risk of covid. Cheltenham suffered as a result of that failure. The pandemic spread here much faster than in other areas with our hospital having the highest number of coronavirus hospital admissions in […]\n26th August 2024 / 26th August 2024 by Cheltenham Green Party\nThe cyber park is going to be a big development within Cheltenham, and it’s important that we ensure that we push for this to be the best that it can be for the people of Cheltenham. With more than 1000 new houses, and the promise of 35% of those to be affordable, it’s also likely […]\n13th August 2024 / 13th August 2024 by Cheltenham Green Party\nIt was lovely to chat to so many people last month at my first surgery at the library. Also, thanks to all the Prestbury residents who have contacted me over the last month, or stopped me on the footpath. It’s great that so many people care about the community and can be bothered to try […]",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_author_cheltenham-green-party_page_5/content_77.html": "28th February 2020 / 28th February 2020 by Cheltenham Green Party\nRead more »\n14th February 2020 / 14th February 2020 by Cheltenham Green Party\n6th February 2020 by Cheltenham Green Party\n4th February 2020 by Cheltenham Green Party\n1st February 2020 / 1st February 2020 by Cheltenham Green Party\n27th January 2020 by Cheltenham Green Party\n24th January 2020 / 24th January 2020 by Cheltenham Green Party\n21st January 2020 / 21st January 2020 by Cheltenham Green Party\n19th January 2020 by Cheltenham Green Party\n17th January 2020 by Cheltenham Green Party",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_author_cheltenham-green-party_page_2/content_108.html": "30th July 2024 / 13th August 2024 by Cheltenham Green Party\nMany of us have been watching the Olympics in Paris and cheering on team GB. Aside from the sporting excellence on show, the UK should look to replicate some of the amazing policies the French are adopting when it comes to the environment. All could and should be implemented here. Investment In Rivers The Triathlon […]\nRead more »\n9th July 2024 / 13th August 2024 by Cheltenham Green Party\nCongratulations to Keir Starmer and the Labour Party on their victory in last week’s General Election. A major factor for the result was the utter contempt the public had for the Conservatives. As such, the Labour government has a lot to prove in the coming months and years. The vote certainly shouldn’t be seen as […]\n25th June 2024 / 13th August 2024 by Cheltenham Green Party\nIt has been the same two-horse political race in Cheltenham for too long. You can change that on July 4th. History has shown us this can happen. In 1997, the Green Party polled 2.7% of the vote in Brighton Pavilion. 13 years later Caroline Lucas was elected as the first Green MP to an area […]\n15th June 2024 / 13th August 2024 by Cheltenham Green Party\nI am standing as your Parliamentary candidate for the Green Party. I am married with 4 daughters and have lived in the area for over 20 years. I am not a career politician, having worked in business all my life, building and leading successful companies across Europe. I am a trustee of the Cheltenham Trust where I […]\n24th May 2024 / 13th August 2024 by Cheltenham Green Party\nIf Rishi Sunak has done one good deed this year, it is to finally announce the date for the General Election. The Tory administration has failed on nearly every measure it was elected upon – Brexit, levelling up, the economy, public health, schools, the health service, defence, prisons, immigration system, the pound, the reliance on […]\n10th May 2024 / 13th August 2024 by Cheltenham Green Party\nI want to congratulate all 40 newly elected councillors. Cheltenham expects and needs you to put the town’s interests first and that you represent all the residents in the wards you were elected in, not just those who voted for you. The Green Party is delighted Tabi Joy was re-elected in St Paul’s. Ashleigh Davies […]\n26th April 2024 / 13th August 2024 by Cheltenham Green Party\nThe dumping of sewage into our rivers and seas by water companies more than doubled in 2023. According to the Environment Agency, there were 3.6 million hours of sewage discharges, compared with 1.75 million hours in 2022. The FT recently exposed the fact that two of Britain’s biggest water firms have failed to map large […]\n29th March 2024 / 25th May 2024 by Cheltenham Green Party\n15th March 2024 / 25th May 2024 by Cheltenham Green Party\n1st March 2024 / 25th May 2024 by Cheltenham Green Party",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_2023_09_05_prestbury_byelection2023/content_133.html": "Cheltenham Green Party has just announced that Jan Foster has been selected for the Prestbury by-election.\nThe election was called after the previous PAB councillor for the ward John Payne resigned, leading to a sudden election.\nJan said “Prestbury needs an independent and hard working councillor. I would like to pay tribute to John Payne’s many years of service as a local councillor. Green Party councillors are not told how to vote on local issues by their party. This means that, if elected, I would be truly able to represent Prestbury’s interests first and foremost.\n“I will work with Cheltenham’s two Green councillors, and indeed all council members whatever their party political persuasion, to solve local problems. The Green Party fights on its own merits. I ask you to elect me because I am a reliable and resourceful candidate, who will work hard to make Prestbury even better. I won’t take you or your vote for granted.”\nJan’s selection comes off the back of the Greens making a huge breakthrough by winning their first ever councillor in Cheltenham in last year’s local elections taking a seat off the Liberal Democrats, followed by the defection of Liberal Democrat Wendy Flynn (Hesters Way) to the Greens. Gloucestershire is experiencing a green surge, with over 37 Green councillors now working hard for local residents across the county.\nIf you want to contact Jan you can email her at jan.foster@cheltenham.greenparty.org.uk\nJoin our campaign in Prestbury here\nLive in Prestbury? For a Vote Green poster click here!",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk_steve-bell-lansdown_tabi-joy/content_159.html": "Councillor for St Pauls\nCouncillor Tabi Joy, St Paul’s\nHello! I’m really proud to be elected Borough Councillor in St Paul’s Ward!! Thank you so much for your support in making it happen. If you have a local issue you’d like me to address, please get in touch hereSt Pauls has been taken for granted by the Lib Dems for more than two decades now and deserved better representation on the council. There are particular concerns about traffic, safety and street maintenance, as well as a clear need for better public transport, better housing provision, and improved facilities for older people. There’s also the issue that, caught between the middle of town and the university campus, the needs of both students and long-term residents are often overlooked.\nNow I’m on the council and have a seat at the table to represent you, I want to push for the changes we need to see.\nSince moving to Cheltenham in 2017, I’ve worked in External Liaisons for Cheltenham Welcomes Refugees, and at the weekly hub with people seeking asylum. I’ve been a committee member with the Cheltenham and Tewkesbury Cycling Campaign to campaign for better road planning and active travel links across town. My background is in customer services, so I always want to try to tackle problems head-on and make positive progress.\nI’m also helping to develop the Young Greens group and carry out public outreach activities to local groups and schools. If you’d like me to come to speak about our work or local climate action, please shoot me a message!\nI look forward to seeing you out and about around St Pauls, but please feel free to reach out with comments or suggestions of ways I can help:\nCorrespondence address: c/o Municipal Offices, Promenade, Cheltenham GL50 9SA\nEmail: cllr.tabi.joy@cheltenham.gov.uk\nMobile: 07532 698 461",
  "https_cheltenham_greenparty_org_uk_steve-bell-lansdown_/https_cheltenham_greenparty_org_uk/content_4.html": "Four MPs in 2024: making history\nThe Green Party made history in the 2024 General Election by winning four seats, with almost 2 million people like you voting Green nationally. We also received the second highest vote share in 40 further constituencies! The party took Bristol Central off of Labour, plus two seats in the former Conservative leaning Waveney Valley and North Herefordshire, and retained Brighton Pavilion. That means Four Green MPs in Parliament, speaking up for all and holding the new government to account.\nHere in Cheltenham Green Parliamentary Candidate Daniel Wilson secured a record number of Green votes in the General Election, finishing 3rd and pushing Labour into 4th place! Thank you to everyone who trusted us with their vote and sent a clear message that they want to see a different type of politics in our town.\nThis is just the beginning, real hope and real change is coming and you can be part of it. Join us now to help make it happen.\nTHE ERA OF Tactical voting is over\nIf there was one thing that we heard over and over again in this campaign and in recent elections, it was that so many voters felt forced to vote Liberal Democrat, despite having no love for their policies or their candidates. Cheltenham Lib Dems have been sustained in this town by forcing all political debate into an “us vs them” zero sum game.\nWe are so grateful to the more than 3000 voters who placed their trust in us in the face of a targeted, relentless and well-funded Lib Dem messaging campaign that tried to convince people that there was no point voting for what you believe in. Politics is about ideas, not the dry “electoral management consultancy” style that has left us all feeling uninspired with turnout at record lows.\nTo those who felt they had no choice, who backed the Lib Dems despite being fed up of their now 16 years uninspiring rule over Cheltenham, we say this. The days of tactical voting are over – vote for what you believe in.\n- The Conservatives have been wiped out here – there are now zero Conservatives on the council, and we no longer have a Conservative MP.\n- The national government is now Labour – we need new ideas and to push them to be bolder on the reform we all know this country needs.\n- Greens are now the opposition on Cheltenham Borough Council – our 3 Green councillors are the only voice holding the Lib Dems to account. We need more Greens on the council to help this vital work and represent you.\n- Greens came 2nd in 40 constituencies – we are on the verge of a massive breakthrough in UK politics.\nSo if you voted tactically, make it the last time you do. Four constituencies across the UK woke up excited about their new Green MP’s. If you want to join them, sign up and get involved in our plan to turn Cheltenham Green!"
}