{
  "http_benali_org_uk_/http_benali_org_uk/content_1.html": "Green Party Councillor\nMy name is Benali Hamdache. I'm a Highbury Councillor elected to Islington Council in 2022. I'm leader of the official opposition group on Islington Council.\nI'm available for comment and interview via [email protected]\nIf you're an Islington resident and looking for help please contact me on my council email address via [email protected]",
  "http_benali_org_uk_/https_benali_org_uk_about/content_5.html": "I've been a Green Party member since 2012. I joined because only the Green Party was putting forward the bold and radical ideas needed.\nThroughout my time in the party I've worked to get our message out and help the party elect more Greens. I've served in a variety of different roles since being in the party\nAn elected Green\nI became a Councillor in May, elected to Highbury ward with over 1,900 votes. Islington Greens are now the official opposition.\nI'm one of two Greens of Colour Councillors elected in London.\nSpokesperson\nI'm have served as the Green Party's spokesperson for refugees and migrants.\nI also have served as the Equalities spokesperson and wrote our 2015 ethnic minority and LGBTIQA+ manifesto.\nA campaigner\nI've won campaigns on tackling workplace discrimination and homophobic PSHE guidance.\nI was the Campaign Manager at the last London Mayoral elections, our most successful in our history.\nMedia coverage\nDistorted reporting of the 2021 census echoes a racist conspiracy theory\n- Open Democracy, 30 Nov 2022\nSuella Braverman’s parents being immigrants doesn’t mean you can trust her policies\n- Metro, 26 Oct 2022\nWhy isn’t Labour standing up to Suella Braverman over refugee deportations?\n- The Independent, 5 Oct 2022\nAHMM wins planning approval for contentious Angel Square redevelopment\n- Architects' Journal, 7 Sep 2022\n‘Monkeypox patients continue to work for fear of losing their job’\n- Islington Tribune, 26 Aug 2022\nWater cut off during heatwave weekend\n- Islington Tribune, 19 Aug 2022\nI used to be transphobic – this is how I became an ally\n- Metro, 18 Jun 2022\nLondon local elections: Labour hold on to Islington Council but Greens triple their seats\n- My London, 10 May 2022\nYemen: Seven years of the forgotten war\n- Left Foot Forward, 26 March 2022\nWhy we need an amnesty for undocumented migrants\n- Politics.co.uk, 17 December 2021\nPriti Patel is spreading stories about refugees to suit her own agenda\n- Metro, 24 November 2021\nGovernment plot to strip people of British citizenship is chilling for LGBT+ people like me\n- Pink News, 21 November 2021\nWhy the UK government’s pledge to take 20,000 Afghan refugees is woefully inadequate\n- Left Foot Forward, 21 August 2021\nThe Borders Bill will replicate callous Australian policy\n- Huck, 19 July 2021\nPriti Patel’s ‘hostile environment’ for EU citizens will fuel racism and inflict misery on the vulnerable\n- Independent, 30 June 2021\nLGBT+ refugees desperately need our help. But Priti Patel’s cruel plans will send them back to danger\n- Pink News, 20 June 2021\nSenior MPs and LGBT+ activists brand BBC News ‘institutionally transphobic’ in scathing letter to its editorial director\n- Pink News, 22 June 2020\nGender Recognition Act: LGBT political group anger at trans law 'changes'\n- BBC News, 20 June 2020\nIf The British Government Truly Cares About Human Rights It Must Expel Brunei From The Commonwealth\n- Huffington Post, 9 April 2019\nBoycott Brunei Protests\n- Sky News, 6 April 2019\nSultan of Brunei’s London hotel target of pro-LGBTI protesters this weekend\n- Gay Star News, 2 April 2019\nPupils shouldn’t be denied LGBT lessons – whatever their parents say\n- Guardian, 5 March 2019\n£16m Islington council budget black hole sparks cuts fear\n- Islington Tribune, 10 November 2017\nLib Dem feels the heat over party’s education record at hustings event\n- Islington Tribune, 23 May 2017\n265 people pack St Mary’s Church at heated Islington South and Finsbury hustings\n- Islington Gazette, 21 May 2017\nGeneral Election 2017: Islington South candidates slam Theresa May’s plan to axe free school meals\n- Islington Gazette, 19 May 2017\nTheresa May Far More Dangerous Than Migrants\n- Huffington Post, 7 October 2015\nWe can’t allow the scapegoating of migrants in the political arena to go on.\n- Media Diversified, 27 March 2015\nStop and searches are ‘disproportionate’ in Islington\n- Islington Gazette, 4 December 2015\nOpponents agree over shechita\n- The Jewish Chronicle, 19 March 2015\nWe shouldn’t be priced out of Pride\n- Pink News, 16 September 2014\nSame sex marriage in the UK\n- Green European Journal, 24 September 2013\nSection 28 row: Schools tear up controversial homophobic policies\n- Independent, 20 August 2013",
  "http_benali_org_uk_/http_benali_org_uk_cdn-cgi_l_email-protection/content_3.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_benali_org_uk_/https_benali_org_uk_contact/content_4.html": "Contact me For any immediate inquiries please email me on [email protected]. Otherwise sign up to hear from my campaign below: Subscribe * indicates required Email Address * First Name * Last Name *",
  "http_benali_org_uk_/https_benali_org_uk/content_2.html": "Green Party Councillor\nMy name is Benali Hamdache. I'm a Highbury Councillor elected to Islington Council in 2022. I'm leader of the official opposition group on Islington Council.\nI'm available for comment and interview via [email protected]\nIf you're an Islington resident and looking for help please contact me on my council email address via [email protected]"
}