{
  "https_fawcettpolitico_co_uk_/https_fawcettpolitico_co_uk_reform-uk-our-pland-for-eastleigh/content_8.html": "Skip to content\nReformUK- Eastleigh\nFacebook-f\nTwitter\nYoutube\nHome\nAbout Clare\nBlog\nContact\nMenu\nHome\nAbout Clare\nBlog\nContact\nReform UK: Our pland for Eastleigh\nReform UK: Our plan for Eastleigh",
  "https_fawcettpolitico_co_uk_/https_fawcettpolitico_co_uk/content_1.html": "I am proud to have lived in Eastleigh Borough for 11 years and have worked at both Prysmian in Bishopstoke and the NHS in Omega House, Eastleigh Town Centre.\nMy strongly held personal values coupled with extensive business acumen afford me the qualities to effectively represent you as your Councillor and MP.\nIf you are disillusioned with the pantomime in the House of Commons or just feel politically homeless, why not consider voting for a party with a bold, fresh new approach to politics demonstrated by ambitious common-sense policies to benefit every person in the UK?\nWe must reform the way our country is run and managed, so it works properly for the people. In many areas, just the application of basic common sense would be a good start!\nLet’s reclaim our right to free speech and let’s celebrate our pride in being British: our amazing culture, our incredible heritage, and our wonderful values.\nLeaving the undemocratic EU was just the beginning. People’s eyes have been opened as to the benefits of being an independent sovereign UK. Reform is now possible and essential in three key areas:\nto succeed, we must become a low tax, smartly regulated, high growth economy. Faster growth is the only way to better wages and more tax revenues to invest in better healthcare and other public services. Our bold economic vision frees up over 6 million people from paying income tax and frees up over 1.2 million small businesses/self-employed from paying corporation tax. We would also remove a raft of stifling taxes. This will generate much faster growth.\nwe must be ambitious, seeking faster, more efficient public services that work better for us all, with better results. For example, in health, we should demand zero waiting lists. Our police need to focus on preventing crime and catching criminals, not woke nonsense.\nmajor change is needed to the bodies that impact our lives, the unelected cronyism of the House of Lords, the unaccountable civil service, the bloated BBC. Reform is essential to our voting system so it is fairer and more representative; the two-party system embeds the status quo and prevents real change.",
  "https_fawcettpolitico_co_uk_/https_fawcettpolitico_co_uk_reform-policy-booklet/content_7.html": "Skip to content\nReformUK- Eastleigh\nFacebook-f\nTwitter\nYoutube\nHome\nAbout Clare\nBlog\nContact\nMenu\nHome\nAbout Clare\nBlog\nContact\nReform Policy Booklet\nReform is Essential – Policy Booklet(pdf)\nDownload",
  "https_fawcettpolitico_co_uk_/https_fawcettpolitico_co_uk_five-candidates-to-contest-eastleigh-by-election/content_6.html": "Skip to content\nReformUK- Eastleigh\nFacebook-f\nTwitter\nYoutube\nHome\nAbout Clare\nBlog\nContact\nMenu\nHome\nAbout Clare\nBlog\nContact\nFive candidates to contest Eastleigh by-election\nFive candidates to contest Eastleigh by-election",
  "https_fawcettpolitico_co_uk_/https_fawcettpolitico_co_uk_about/content_3.html": "Hi, I’m Clare Fawcett\nI’m standing with Reform UK for election to Eastleigh Borough Council at the by-election on 10th February because I’m proud to call Eastleigh my home, having lived in the borough for 11 years and the town centre in particular for over two years. As a taxpayer, I have become increasingly disappointed and frustrated in the level of public services provided by the Council and its stakeholders. Once elected, I will work tirelessly to slash the unnecessary bureaucracy and red tape to improve the services we receive from the Council which, in my view, have been deteriorating year on year.\nWe all deserve value for money public services that deliver tangible results; be that something as basic as getting our bins emptied on time right through to revitalising the town centre which has, in my view, very sadly changed beyond all recognition over the last few years from a vibrant shopping hub to a wasteland of empty units. I believe taxpaying residents deserves more than the Council is currently delivering.\nA particular issue I am very troubled by is the rising level of violent crime, anti-social behaviour and drug dealing in the town which I believe has not been helped by the closure of our police station that not only provided a safe, open place to residents needing to use it, undoubtedly acted as a deterrent against crime in its vicinity. We have the right to feel safe in our town with a visible police presence to provide that comfort and assurance, not a remote office on the outskirts that you cannot walk into without making an appointment.\nAbout Me\nA bit more about me, I worked for the NHS at Omega House for almost five years, supporting a Clinical Commissioning Group Board which gave me a working insight into how public services are organised and delivered… there is a lot of work to do. I also worked for the Commissioning Support Unit at Omega House in the Freedom of Information Team dealing with requests from members of the public, Councillors and others as well as MPs for Wednesday’s Prime Minister’s Questions.\nFor a time in 2015, I worked at Prysmian in their centenary year, supporting the CEO and Senior Management Team and whilst there was involved in organising a UK Trade and Industry visit.\nIn my last job for a local, large financial services organisation, I was Chair of the UK Employee Forum, representing circa 2,000 employees in Southampton and a further 2,000 across the UK. I also lead a local Leaseholder Action Group fighting for much needed changes in Leasehold law via the National Leasehold Campaign to demand the same rights for Leaseholders that other homeowners enjoy.\nMy practical working experience, gained in both public sector organisations and professional services businesses, including law and financial services, has afforded me the knowledge, experience and skills to properly represent you as your Councillor.",
  "https_fawcettpolitico_co_uk_/https_fawcettpolitico_co_uk_blog/content_4.html": "4 In 10 Channel Migrants are from war-free Albania October 26, 2022 No Comments https://www.reformparty.uk/mail_on_sunday_exclusive Read More »",
  "https_fawcettpolitico_co_uk_/https_fawcettpolitico_co_uk_contact/content_2.html": "If you are hungry for meaningful change, are disillusioned with the shenanigans of the main parties or just feel politically homeless, why not consider voting for me…what have you got to lose?\nGet in touch with any questions, suggestions or to join my volunteer group and get involved.",
  "https_fawcettpolitico_co_uk_/https_fawcettpolitico_co_uk_4-in-10-channel-migrants-are-from-war-free-albania/content_5.html": "Skip to content\nReformUK- Eastleigh\nFacebook-f\nTwitter\nYoutube\nHome\nAbout Clare\nBlog\nContact\nMenu\nHome\nAbout Clare\nBlog\nContact\n4 In 10 Channel Migrants are from war-free Albania\nhttps://www.reformparty.uk/mail_on_sunday_exclusive",
  "https_fawcettpolitico_co_uk_/https_fawcettpolitico_co_uk_emergency-recovery-plan/content_10.html": "Skip to content\nReformUK- Eastleigh\nFacebook-f\nTwitter\nYoutube\nHome\nAbout Clare\nBlog\nContact\nMenu\nHome\nAbout Clare\nBlog\nContact\nEmergency Recovery Plan\nReform_UK_-_Emergency_Recovery_Plan_June_22\nDownload",
  "https_fawcettpolitico_co_uk_/https_fawcettpolitico_co_uk_reform-5-year-energy-plan/content_9.html": "Skip to content\nReformUK- Eastleigh\nFacebook-f\nTwitter\nYoutube\nHome\nAbout Clare\nBlog\nContact\nMenu\nHome\nAbout Clare\nBlog\nContact\nReform 5 year energy plan\nReform-5-Year-Energy-Plan\nDownload"
}