{
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_best-wishes-christmas-roger-hirst-your-pfcc/content_38.html": "Local, Visible and Accessible Policing Saturday, 6 April, 2024 Neighbourhood crime may be down, but it is not yet beaten. Burglary, car theft, drug dealing, shoplifting and anti-social behaviour (ASB) disrupt people’s lives.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk/content_1.html": "Roger Hirst\nfor Essex\nI am Roger Hirst, the Conservative candidate for Police Fire and Crime Commissioner for Essex. Here you can find my plan for the county, my latest news and more about me, including how to contact my office. I'm here to help, so please don't hesitate to get in touch.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_priti-patel-home-secretary-really-making-difference/content_37.html": "For those of us who are busy implementing the government’s plans to improve community safety and bolster law and order, the current spat around our outstanding Home Secretary comes as a distraction to the business in hand. From the outset, I should make one thing clear: Priti Patel is not hard to work with.\nHer messaging is clear, she has drive and energy, and she has imbued the law enforcement agencies with a sense of purpose and pace which is refreshing. And she delivers all that with a style which is open and engaging.\nWhat a difference she is making. Already we have had the largest increase in Police funding in ten years. The Police Uplift Programme, expanding the Police Service in England and Wales by 20,000 officers over three years, is ahead of schedule and already making a tangible impact on the levels of crime on our streets. Burglary, theft and anti-social behaviour were all falling in our county before the COVID-19 pandemic hit; crime as a whole is now down. The performance of law enforcement agencies through the lockdown has been effective. The Police approach of engagement, explanation and encouragement before needing to enforce was endorsed by over 80% of our residents in our local surveys. And of course, the first lockdown was completely effective in reducing the number of deaths from the virus – to zero over the summer here – and protecting the NHS.\nAt the same time, the government has not forgotten those who are suffering through this extraordinary period. We have had additional funding to help the victims of domestic and sexual abuse, and have been able to support charities who may otherwise have struggled to continue to offer the help these victims rely on. The work we do to protect vulnerable children from being preyed on by gangs has gone on. I have been out with Priti myself to see first-hand how summer holiday clubs have reached out and cared for kids who would otherwise have been isolated and at risk.\nEven during the pandemic, the Home Secretary has ensured we remain focused on dealing with major crime. Close working between the National Crime Agency and Policing delivered a successful operation which rolled up several drugs gangs in September and resulted in over 700 arrests. We have also been able to do more to prevent crime. The Home Office’s Safer Streets Fund launched in the spring has provided ways of making high crime areas more resilient and tougher for criminals.\nA particular challenge which faces the Home Secretary is how to get a grip on the national law enforcement programmes run out of Whitehall. As is so often the case, the centrally run technology programmes are largely currently over budget and behind schedule. Priti very much has the support of policing agencies across the country in her efforts to pick this up and deliver value for money, and the new national boards which she has set up are already improving transparency and enabling us to prioritise.\nThe Home Office is one of the great departments of state. One of the government’s core commitments in last year’s elections was to improve community safety, through investment in and new powers for law enforcement. Moving the system so as to deliver that, requires great focus and energy. I can see how moving with the necessary pace and purpose may not be comfortable for those who are not in sympathy with those goals. I am, and I personally really enjoy working with Priti Patel.\nRoger Hirst, Police, Fire & Crime Commissioner for Essex\nVice-Chair, Association of Police & Crime Commissioners",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_local-visible-and-accessible-policing/content_30.html": "Neighbourhood crime may be down, but it is not yet beaten. Burglary, car theft, drug dealing, shoplifting and anti-social behaviour (ASB) disrupt people’s lives. Essex Police have introduced Town Centre Teams, have boosted Community Policing Teams and built the Rural Engagement Team and Business Crime Teams. We must make sure these units are ringfenced and out on patrol in our communities.\nTargeted hotspot patrols are proven to reduce ASB and serious violent crime (SV), and reduce harm. In 2024 we will invest £1.6m in 15 ASB and 15 SV hotspots. These will receive frequent 15-30 minute foot patrols, from Police and from Council enforcement officers, delivering 30,000 more hours of visible policing a year. So far our hotspot interventions have helped reduce ASB by 70% and high harm crime by 38% from their peaks.\nDealing with known offenders prevents them from perpetrating more crime, and we will strengthen our targeted offender management.\nSafer Streets investment in CCTV, better lighting and landscaping, signposting and local community support groups make both our town centres and isolated and residential areas much safer and available for more people to use. So far we have invested £4m in these schemes, plus £1.7m match funding from local partners, and I have set aside a further £3m for new schemes next year. The work of voluntary groups such as the Street Pastors is invaluable in helping vulnerable people and reducing harm on our streets, and we will continue to support them.\nWorking with local councils and other agencies through our Community Safety Partnerships we must target our resources where they will make the most difference locally. And we must invest more in the force control room, especially the 101 non-emergency call system, to make sure victims get a better service, not only in the time taken to answer the call, but in the quality of the service they receive. We must also ensure that victims receive more and better feedback on how their crime is being handled, and with what success.\nModern policing knows how to deal with neighbourhood crime; I will make sure Essex Police have an unrelenting focus on getting it down. Neighbourhood Policing will be strengthened as more of our new officers complete their training and can be deployed in our communities. Now we have the resources, we must ringfence our Town Centre Teams and Community Policing Teams and make sure they are able to crack down on burglary, on car theft and on shoplifting, and keep our residents safe in each of our communities. Our Rural Engagement Team must be strengthened further to support our isolated communities and make sure our successes in reducing unlawful encampments, hare coursing and equipment theft are not eroded. I will ensure that Police and Fire & Rescue continue to protect those in rural areas and keep businesses safer and free from crime.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_emergency-service-collaboration/content_29.html": "As the first area of the country to bring Police and Fire & Rescue Service under joint governance, it was always my vision that closer working between the Police and the Fire & Rescue Service would unlock significant resources to deliver better emergency services in Essex. Under joint governance, I have profiled over £18m of efficiency improvements to date from collaboration, all of which will be reinvested into the frontline. This is ahead of our original target of £15.3m, when we brought both services under joint governance. As the joint governance model and ways of working continue to mature, the potential for even better joint working between Police and Fire & Rescue is substantial, whilst at the same time keeping them as distinct and separate and maintaining the unique identity and function of each service.\nI will continue to strive for joined-up prevention and community safety work to build on our successes to date, such as the Joint Education Team who reach nearly 150,000 children a year through visits to schools.\nI will utilise the significant estates of both services and I will seek to pool capital budgets to improve efficiency through partnership and to provide improved public safety.\nWe will bring together the Fleet Services of both Essex Police and Essex County Fire & Rescue Service in single workshops at Boreham, ensuring that our people have fit for purpose facilities and can keep critical assets on the road to keep Essex safe.\nWe will complete the investment in the co-location of a new-build police station in Harwich and Dovercourt alongside the fire station on the current site.\nI will continue with my programme of opening up fire stations as drop in facilities for policing colleagues.\nI will also pursue the delivery of a shared control facility to support both services to maximise capacity, capability and resilience.\nI will also roll out the Tri-Service Community Officer model to prevent harm and reduce vulnerability in our rural communities.\nI will continue to maximise the benefits of the collaboration between Essex and Kent Police through the shared service model. This works well, and I will build on this and explore other opportunities to develop a shared service model across the East of England with other willing partners in Police and Fire & Rescue, and possibly other agencies.\nI will continue to work at a national level to review the national funding formulas and get a fairer deal for Essex.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_feed/content_6.html": null,
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_roger-hirst-pledges-transparent-decision-making-over-policing-essex/content_26.html": "Giving people a full say in the future of Essex policing is critical to a sustainable force says Conservative Candidate for Essex Police and Crime Commissioner, Cllr. Roger Hirst.\nWith less than 50 days until residents go to the polls to elect the second PCC of the county, Roger Hirst has unveiled one of the key planks to his manifesto. He has also pledged to ensure that every public asset is used to its full potential in order to deliver a first class police service in Essex.\nBreaking down barriers between public institutions will be one of Roger's top aims. This will mean that public buildings such as libraries, fire stations and council premises that all have public access, and where there is no current police station, can be utilised to ensure people have the opportunity to speak to police officers and staff in confidence and confidentially.\nRoger Hirst said: “I want to ensure everyone in Essex has a say about the big decisions and I will ensure proper consultations on big ticket items are held right across this great county so all residents, including young people have a chance to make their views known on subjects such as the budget for the police force, local policing and services provided before any formal decision is taken. While the PCC is elected to make strategic decisions on the running of the force, it is important that when it comes to issues such as counter services that people have the chance to voice their views. The police force belongs to all of us, and I intend to make sure they are accountable.”\nThe announcement sets Hirst apart from his rivals and is the first to deliver a public pledge on how he would run Essex Police, if elected, along with the Chief Constable.\nHe continued: “We all hold the police in high regard and I want to ensure the people of Essex feel they have a real say on the shape of the force in the coming years. It is also important for all of our dedicated officers and staff that they know they are totally respected by the people and full, open and transparent consultations will be key to this happening.”\nRoger Hirst has been taking his case to the electorate and has so far travelled to all parts of Essex both door to door and in public meetings. So far the reaction has been very positive.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_category_Local-News/content_20.html": "£686,000 funding boost to tackle serious violence in Essex 8th March 2021 Essex receives an extra £686,000 to tackle serious violent crime , including knife crime and murder. This investment is part of the £130.5 million funding... Local News\nRoger Hirst pledges to safeguard the number of Police on Patrol 5th April 2016 ‘There will be no cuts to police numbers’ is a firm promise by the Conservative Candidate for the Police and Crime Commissioner, Roger Hirst. Local News\nTackling Knife Crime is one of the top priorities for Roger Hirst 29th March 2016 Ensuring public safety and reducing the threat of knife crime are among the top issues that Roger Hirst, Conservative Candidate for the Essex Police and Crime... Local News\nRoger Hirst and Immigration Minister discuss better controls on people smuggling 21st March 2016 Roger Hirst met with Immigration Minister James Brokenshire MP on a private visit to Essex to help support Roger's campaign and met with local residents in the... Local News\nRoger Hirst pledges transparent decision making over policing in Essex 14th March 2016 Giving people a full say in the future of Essex policing is critical to a sustainable force says Conservative Candidate for Essex Police and Crime Commissioner... Local News",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news/content_12.html": "Local, Visible and Accessible Policing Saturday, 6 April, 2024 Neighbourhood crime may be down, but it is not yet beaten. Burglary, car theft, drug dealing, shoplifting and anti-social behaviour (ASB) disrupt people’s lives. Essex Police have introduced Town Centre Teams, have boosted Community Policing Teams and built the Rural Engagement Team and Business Crime Teams. We must make sure these units are ringfenced and out on patrol in our communities... Opinions\nReducing Drug Driven Violence 5th April 2024 Our three-pronged approach to dealing with drug violence is succeeding in bringing harm down: working with the National Crime Agency to bust international drug... Opinions\nReducing Violence Against Women and Girls 4th April 2024 Reducing Violence Against Women and Girls is a key priority for me as Police, Fire & Crime Commissioner and for Essex Police. We are having some success, with... Opinions\nImproving Safety on Our Roads 3rd April 2024 There is more we can do to reduce the number of people killed and injured on our roads. Over the last few years we have worked together with the Safer Essex... Opinions\nProtecting Rural and Isolated Areas 2nd April 2024 The establishment of the Rural Engagement and Business Crime Teams, working closely with our rural and business communities in Essex, have created greater... Opinions\nFirearms Licensing 1st April 2024 Firearms, Shotgun and Explosives Licencing (FSEL) is an important police function which ensures public safety while allowing legitimate users to go about their... Opinions\nFire & Rescue Service Reform 30th March 2024 His Majesty’s Inspectorate of the Police and Fire and Rescue Services has lifted the Causes for Concern on Essex County Fire & Rescue Service’s culture and on... Opinions\nEncouraging Volunteers and Community Support 29th March 2024 Encouraging Volunteers and Community Support Our support for the Special Constabulary has meant that a large number of residents have come forward as volunteers... Opinions\nCyber Crime, Business Crime and Fraud 28th March 2024 The growth of the internet has seen a surge in crimes against businesses and individuals. Fraud is now the largest single crime type in the country. At the same... Opinions\nEmergency Service Collaboration 26th March 2024 As the first area of the country to bring Police and Fire & Rescue Service under joint governance, it was always my vision that closer working between the... Opinions",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_cdn-cgi_l_email-protection/content_9.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_cyber-crime-business-crime-and-fraud/content_31.html": "The growth of the internet has seen a surge in crimes against businesses and individuals. Fraud is now the largest single crime type in the country. At the same time, the internet has also seen growth in Child Sexual Exploitation and Abuse and grooming. We need to implement the tighter legislation around online platforms and publishers, and to invest in cutting edge technology to track and eradicate on-line and cyber-crime.\nI support the establishment of the new national cyber-crime force and want to see a robust ethical framework for safe use of Artificial Intelligence and biometrics in the pursuit of crime.\nI welcome Essex Police’s Business Crime Strategy, and the establishment of the Eastern Region Cyber Resilience Centre, and will support them in helping keep businesses safe.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_improving-safety-our-roads/content_36.html": "There is more we can do to reduce the number of people killed and injured on our roads. Over the last few years we have worked together with the Safer Essex Roads Partnership (SERP) to educate drivers better, and enforce more effectively against bad and criminal driving. The number of people killed or seriously injured on the roads in Essex has been brought down by 40%.\nBut criminal and dangerous driving still kills more people in this county than all other crimes put together.\nTogether with SERP we have committed to Vision Zero, with the aim to stop people dying on our roads. That will mean more Roads Policing and investment in better speed cameras and upgrading Automatic Number Plate Recognition tracking, to improve enforcement. It will also involve an increase in driver awareness programmes, to make our drivers safer, and a revision to the county’s Speed Management Strategy to make our roads safer. The SERP agencies will be co-located so they can operate more effectively. I will lobby the vehicle manufacturers to roll out active safety technology to reduce driver error.\nI will work with Community and Voluntary Sector providers to invest in behaviour change and support programmes for drivers caught driving under the influence of drugs, as this offence continues to increase and now exceeds those caught for the offence of drink-driving.\nMore police patrols and working with Fire & Rescue and other agencies will educate and protect all road users, such as through expanding the Fire Bike scheme and continued road safety awareness for children and young people through the Joint Education Team.\nI will continue to support Community Speed Watch, which reduces risk around key areas in our local communities and does so much to educate drivers.\nDash-cam evidence from other road users can help us identify drivers who need remedial education. I will invest further in technology to enable the police to process the increasing volume of video evidence, through such programmes as Extra Eyes.\nI welcome the move by the government in the Police, Crime, Sentencing and Courts Act to increase the maximum sentence for death by dangerous driving to life imprisonment.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_events_feed/content_7.html": null,
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_firearms-licensing/content_35.html": "Firearms, Shotgun and Explosives Licencing (FSEL) is an important police function which ensures public safety while allowing legitimate users to go about their business and sport in the knowledge that their activity is well-regulated.\nIt has been important to me to ensure that legitimate users have a good quality service here in Essex. Legitimately held firearms are only extremely rarely used in crime.\nWhen first elected to this role in 2016, I met with a situation where FSEL certificate grants were taking an average of 44 weeks and there were over 5,000 shooters on temporary certificates. This was clearly a risk to the legitimate ownership of firearms and shotguns. I am pleased to say that, at my request, the Chief Constable instigated a review of the situation and rapidly implemented a plan to resource the unit properly and improve the situation. We made that investment, and since then the average time required for a grant has been around eight weeks. For historical reasons, there was a bulge in the number of renewals every fifth year. This would have happened in 2022/23. Through good planning and engagement with users, Essex Police instituted a voluntary scheme which brought 1,500 renewals forward into 2021/22, and avoided a recurrence of significant delays.\nI am pleased that, as of my latest review of the performance of Essex Police FSEL this January, the average time taken to grant both firearms and shotgun certificates in Essex is one month. This is the third best performance in the country, after Warwickshire Constabulary and the City of London Police. We have only 3 temporary licences outstanding, and only 168 people waiting for their certificate to be granted.\nEssex Police published service level standard is to grant or renew a certificate within 90 days. This is well within the current national Authorised Professional Practice guidance of 17 weeks. The team currently has sufficient resources to deal with the volumes anticipated during 2024 within the force’s published service level standard, which ensures that each applicant is thoroughly assessed but in a timely fashion.\nWe also have a well-established Firearms Licencing Advisory Group (FLAG), which meets several times a year and is attended by representatives of users and registered dealers, including BASC. I attend myself when I can, normally at least once a year, to hear the concerns being expressed and monitor progress. It last met in January 2024.\nLicensing fees have not kept pace with inflation or pay rates in recent years, and the government is reviewing the statutory charges to ensure that FSEL is properly funded. In the meantime, I will ensure that the necessary funding continues to be subsidised from the police budget.\nReading through the guidance the British Association for Shooting and Conservation (BASC) have provided on their website, they are well aligned with my published plans and actions. I have met personally with BASC several times over the course of my incumbency, and look forward to doing so again if I am successful in seeking re-election. I commit to continuing to provide Essex Police with the resources and check they have the structures in place to ensure public safety and support legitimate firearms and shotgun users.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_encouraging-volunteers-and-community-support/content_23.html": "Encouraging Volunteers and Community Support\nOur support for the Special Constabulary has meant that a large number of residents have come forward as volunteers, and we now have the second largest Special Constabulary in the country after the Met. A large number of parish and town councils are keen to use our Community Specials programme, and there are also a growing number of Employer Supported Specials. I aim to see our Special Constabulary growth success continue, with a Special Constable in every Town and Parish, growing the Community Specials programme, and one in every major business.\nVolunteers are not only welcome in the Special Constabulary. There are important roles filled by our Active Citizens programme. I will also continue to support Neighbourhood Watch, who are a vital component in driving out crime; and look to develop Farm Watch and Pub Watch further. Both Police and Fire Cadets help our young people find positive and exciting roles in our community; we need to get the groups back up and running properly following the disruption from the Covid lockdown.\nWe will work with young people to understand the particular risks and challenges they face, working with youth councils and voluntary groups. I will also focus on helping young people understand how they can support the communities that they live in, through engaging in positive activity such as the Fire Breaks sessions on what it means to be a firefighter, and through Police and Fire Cadets. The government has pledged £500m investment into youth services, and I will work to make sure that delivers for young people in Essex.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_contact/content_8.html": "Skip to main content\nRoger Hirst for Essex\nConservative Police Fire and Crime Commissioner\nMain navigation\nHome\nAbout Roger Hirst\nNews\nMy Plan\nGetting Crime Down\nMy 2024 Manifesto\nKey Pledges\nTrack Record of Success\nRole of PFCC\nContact\nContact\nLeave this field blank\nCampaign Office\n799 London Road, West Thurrock, Essex RM20 3LH\n[email protected]\nRoger on Facebook\nRoger on Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by Roger Hirst for Essex on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_protecting-rural-and-isolated-areas/content_15.html": "The establishment of the Rural Engagement and Business Crime Teams, working closely with our rural and business communities in Essex, have created greater resilience within those communities, preventing crime and protecting and safeguarding the vulnerable across the county. They have helped keep rural businesses safer and more free from crime.\nI will look to make further investment in fighting rural crimes, including hare coursing, unlawful incursions, and fly-tipping, as well as theft of major plant and equipment. The government’s new legislation to make aggravated trespass a criminal offence has reduced damage and disruption to rural lives and businesses. Unlawful incursions have been reduced by three quarters relative to where they were eight years ago, and hare coursing and plant theft have been halved. We must ensure that these gains are built on, and not eroded.\nVulnerability and isolation are significant issues in rural communities, and I will ensure Police and Fire & Rescue work more closely together to protect those in rural and isolated settings through joint advice and support. The Tri-Service Community Officer pilot in Maldon and Uttlesford has brought clear benefits. We need to refine the model and develop it so as to prevent crime and reduce vulnerability in rural communities. We must invest time and energy better to understand the specific nature and impact of domestic abuse in rural communities and identify and implement initiatives that will prevent and tackle it.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_getting-crime-down/content_18.html": "As Police, Fire & Crime Commissioner (PFCC) for Essex I will ensure that Essex Police sees more investment in its capability to prevent crime and get crime down, and that Essex County Fire & Rescue is supported to protect people and prevent fires, flood hazards and road traffic collisions.\nEssex Police is now bigger and stronger than ever before in its 185 year history. Over the last eight years as your PFCC I have funded the expansion of Essex Police by 905 officers, to 3,755, with the backing of the government’s Police Uplift Programme and your support. As a result, crime is now falling. Last year, total crime was reduced by 6%, and anti-social behaviour (ASB) by 38%. ASB is now 70% lower than it was in 2016, and murder and burglary are both down by over 40%.\nBut this is just a start. The additional officers will enable the force to make a strategic shift to prevention, in line with our long-term vision. Through targeted hotspot programmes, through early intervention, identifying and protecting vulnerable people, and firm action to deal with known offenders and tackle drug gangs and County Lines, my aim is to see crime reduced by a further 40% over the next few years. Safer streets investments in CCTV, lighting and support groups will make our public spaces be and feel safer for women and girls.\nEssex Police has become an innovative police service. Our police were the first in the country to pilot the ASB and serious violence hotspot tactics which have been so successful. We were the first to roll out a Violence and Vulnerability Partnership to divert young people from the risk of being preyed on by drug gangs. Under new legislation we had the first successful prosecution for dealing in nitrous oxide and the first one for cyber flashing.\nThe next phase will see further investment in technology. We will roll out live facial recognition equipment to take known offenders off our streets, and use Artificial Intelligence to take more offenders successfully through the courts.\nTo help allocate resources most effectively, I will encourage Essex Police to use crime harm scores, looking at concentrations and prevalence of crime as well as the level of harm from each offence. It is not enough simply to reduce the number of crimes in the county: we must also bring down the harm it causes.\nNeighbourhood Policing will be strengthened as more of our new officers complete their training and can be deployed in our communities. Now we have the resources, we must ringfence our Town Centre Teams and Community Policing Teams and make sure they are able to crack down on burglary, on car theft and on shoplifting, and keep our residents safe in each of our communities. This means more visible policing, with more police on the streets. Our Rural Engagement Team must be strengthened further to support our isolated communities and make sure our successes in reducing unlawful encampments, hare coursing and equipment theft are not eroded. I will ensure that Police and Fire & Rescue continue to protect those in rural areas and keep businesses safer and free from crime.\nMaking our roads safer is important to all of our residents. Working through the Safer Essex Roads partnership, both Police and Fire & Rescue must act to implement Vision Zero, our programme to reduce road deaths in Essex to zero by 2040. Driver education will improve skills on the road, and new technology will ensure enforcement against those who will not learn.\nCommunity involvement matters so much in keeping our county safe and making sure the emergency services are plugged in to what makes a difference to residents’ lives. Volunteers play a vital role. We now have the second largest Special Constabulary in the country, but we can do more to bolster our Community Specials, and I will.\nThe positive impact of crime prevention and solving more crimes is increasing levels of public confidence in the local police. In the latest quarter, our independently run public perception survey found that confidence among local communities in Essex Police is running at 77%, only slightly lower than the highs seen during the Covid-19 pandemic.\nTo make our county safer we must make a strategic commitment to prevention, a shift in main effort from rapid response into a model of targeted prevention and early intervention, in both Policing and in the Fire & Rescue Service. We need to help and protect those who are vulnerable and at risk, deliver effective interventions based on evidence, and work in partnership with our communities to identify where people are most exposed and keep them safe. Safe communities are the bedrock on which we build prosperity and wellbeing for everyone. Please give me your support, and together we can get crime down.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_about-rss/content_3.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_reducing-violence-against-women-and-girls-0/content_25.html": "Reducing Violence Against Women and Girls is a key priority for me as Police, Fire & Crime Commissioner and for Essex Police. We are having some success, with sexual violence down by 12% last year and domestic abuse by 15%. The number of successful rape prosecutions has increased threefold. But there is much more to do. We are investing in making our streets safer, with more CCTV, better lighting, and awareness campaigns. Our Minerva system for mapping where women are particularly vulnerable and at risk has received national recognition. We share the information with local community safety partnerships and make joint local interventions. And in the night time economy, we support the SOS / Night Bus, Ask for Angela (which allows women to ask for support in bars and clubs) and Purple Flag and All Bar None schemes. Longer term measures involve work in schools, helping young people reflect and understand the effects of harassment and abuse.\nNo woman should feel unsafe in her own community. I will spend time listening directly to women affected by violence against them to discuss and understand what we can do differently, and I will act on this. I will continue to work hard with other agencies to encourage survivors of abuse and violence to come forward and will invest in specialist support services to offer the support that they need and to help them move on, while at the same time robustly targeting offenders to break the cycle of violence against women. I will increase investment in support services such as counselling, advocacy and therapeutic support and Independent Sexual Violence Advisors and Independent Domestic Violence Advisors as this has proved invaluable in providing support when needed and in preventing these crimes happening. We have established a steering group for Violence against Women and Girls under the Safer Essex Partnership. We all need to work together to help women to be safe and feel safe, to be respected and to live their lives free of fear. I will speak up to condemn male violence against women.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_roger-hirst-manifesto-march-2024/content_5.html": "My Plan for a Safer Essex\n- More local, visible & accessible policing\n- Ensure the police are there when you need them. Deliver effective response and follow up all reasonable lines of enquiry.\n- Drive down anti-social behaviour & crime\n- More hotspot policing and monitoring known offenders to prevent crime, including in our rural areas.\n- Beat knife crime and drug gangs and protect young people\n- Take drugs and weapons off our streets and help young people get out of gangs.\n- Protect women and girls from violence and domestic abuse\n- Invest in safer streets and bring more perpetrators to justice.\n- Ensure vulnerable people are protected\n- More Safe & Well visits, and Community Safety Officers to identify risks and help people stay safe.\n- Improve road safety and reduce road death in Essex to Zero\n- Tackle speeding and drink and drug driving. Better tech, better education, and better enforcement.\n- Fire & Rescue Service Reform\n- Modernising the Fire & Rescue Service to reduce risk and keep more people safe.\nFor me, safe and secure communities are the bedrock on which we build prosperity and wellbeing for everyone.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_about-roger-hirst/content_4.html": "Roger Hirst is the current Police, Fire & Crime Commissioner for Essex. Under his guidance Essex Police has expanded by over 900 officers, and focused increasingly on preventing crime and supporting victims. Crime is now being reduced. The Fire & Rescue Service has completed its cultural change programme and is investing in fire protection and On-Call recruitment so that it can do more to keep our county safe.\nRoger was a Cabinet Member for Essex County Council, and Deputy Leader of Brentwood Borough Council, until he stood down to take on the role of Police, Fire & Crime Commissioner. He has over thirty years experience as a leading financial analyst in the City, having run the European investment research divisions of major UK, European and US international financial institutions.\nRoger says:\n\"In the last eight years we have increased the number of police in Essex, established new rural and town centre teams and are back working with children in schools. Murder and burglary have been halved, and anti-social behaviour is down by two-thirds. We have started to reduce the level of domestic abuse, and our programme to reduce drug-related violence is working, with the number of knife injuries down by a quarter. Police and Fire & Rescue are working together to prevent harm and keep people safe. I believe my knowledge and experience has enabled me to help them prioritise and manage the demands on their resources, and led to more effective and efficient services in Essex.\nFor me, safe and secure communities are the bedrock on which we build success and prosperity.\nGood policing and a strong fire & rescue service means our residents feel secure and safe in their homes and on Essex streets.\"",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_roger-hirst-and-immigration-minister-discuss-better-controls-people-smuggling/content_32.html": "Essex's ports are a target for people trafficking, and ensuring tighter controls are enforced to prevent illegal immigration to the UK and stamping out people smuggling were high on the agenda when Conservative Candidate for Essex Police and Crime Commissioner, Roger Hirst, met with Immigration Minister, James Brokenshire MP. The Minister was on a private visit to Essex to help support Roger's campaign and met with local residents in the south of the county as well as discussing Conservative immigration enforcement.\nRoger passionately believes in stamping out the appalling trade of people trafficking and has made this one of the main planks of his campaign. Conservative measures to police those exploiting illegal migrants through controlling their access to housing, work and cash will have a big impact in restricting this crime.\nSpeaking after meeting the Immigration Minister, Roger said: \"I am delighted that James came to support my campaign and I was also heartened to hear just how much we are doing in Government to tighten up Border controls. I hope UK residents who return from overseas whether by air, rail or plane see just how stringent we are at checking people back into the country. Quite rightly through overseas aid work from the UK we are supporting the victims of war and conflict in their own countries, and we must also accommodate legitimate asylum seekers here. It is heart-breaking to see so many people living in such terrible conditions. But those who come here illegally also often end up living in poverty and misery, and we need to tighten up on those who exploit their desperation.\n\"I believe that by these tighter controls we will start to stamp out the sickening trade of people trafficking, particularly young people who are virtually enslaved. This is a crime against our own humanity and as the PCC for Essex I would ensure this will be kept high on the Government agenda.\"",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_ps686000-funding-boost-tackle-serious-violence-essex/content_21.html": "- Essex receives an extra £686,000 to tackle serious violent crime, including knife crime and murder.\n- This investment is part of the £130.5 million funding package announced to tackle serious violent crime across England and Wales.\n- The funding package will help to prevent some of the most serious types of crime and deliver safer communities for the British public.\nRoger Hirst has welcomed the announcement that the Conservative Government is making available over £130 million to tackle serious violent crime – including murder and knife crime – in the coming year.\nEssex will receive £686,000 of part of this extra funding, as one of the 18 areas across England and Wales selected for targeted police action.\nThe total £130.5 million funding package includes £30 million to support the police to take targeted action in parts of England and Wales most affected by serious violence, as well as up to £23 million for a new early intervention programme that will help stop young people from being drawn into the cycle of violence.\nIn addition to this funding, today’s announcement also provides: £10 million to expand domestic abuse perpetrator programmes – working with offenders to help them change and prevent abuse happening in the first place, over £3 million to expand investigations into gang related material on social media, £1.6 million towards piloting the Creating Opportunities Forum which helps provide access to employment opportunities for young people at risk of serious violence, and £1 million to set up and pilot new homicide reviews – helping to prevent future deaths.\nThe funding package comes ahead of the introduction of a major criminal justice Bill, which will give police new stop and search powers to tackle known knife and weapons carriers, place a duty on public sector bodies – including police, education and health agencies – to take a joined-up approach to addressing serious violence, and require local agencies to review the circumstances when a homicide takes place involving offensive weapons, such as knives.\nThis funding builds on the unprecedented work that this government is doing to tackle serious violence in our communities. With £105 million already invested in Violence Reduction Units – supporting over 100,000 young people, increasing police recruitment and our work to get dangerous weapons off the streets via Serious Violence Reduction Orders, we are delivering on our promise to keep the public safe by making our communities safer for the British public.\nCommenting, Roger Hirst said:\n“I am delighted that Essex will receive an extra £686,000 to tackle the violent crime that has been robbing too many young people of their futures. This funding ensures our police have all of the tools and resources they need to tackle violent crime and address its underlying causes in our community, whilst also funding vital early intervention programmes that do positive preventative work with children and young people. By backing our police with the funding, powers and resources they need, we are keeping the public and our communities safe, so that people everywhere can live their lives free from the fear of crime.”\nCommenting, Home Secretary Priti Patel said:\n\"I am determined to cut crime and make our streets safer, which is why we are recruiting 20,000 more police officers, introducing new stop and search powers and giving the police the resources they need to go after the serious violent criminals causing misery in communities. But when it comes to gangs and serious violence, we must also tackle underlying causes. That is why we are investing in a new early intervention programme to stop young people committing these crimes in the first place.”\nWe are taking to significant steps to tackle serious violence:\n- Delivering over £130 million to tackle serious violence and turn our young people away from crime. The funding package includes £30 million to support the police to take targeted action in parts of England and Wales most affected by serious violence, as well as up to £23 million for a new early intervention programme that will help stop young people from being drawn into the cycle of violence (Home Office, Press Release, 8 March 2021, link).\n- Boosting police funding by £636 million this year, ensuring our frontline officers have everything need to keep us safe. This brings total police funding up to £15.8 billion for 2021-2022, including £400 million to recruit 20,000 new officers by 2023, £914 million for counter-terrorism policing, and £1.1 billion to target national priorities such as reducing serious violence and clamping down on county lines (Home Office, News Story, 17 December 2020, link).\n- Recruiting 20,000 new police officers, helping to keep our streets safe. We have already recruited 6,620 new officers, and we are on track to recruit 20,000 extra officers by 2023. As part of this year’s £636 million police funding settlement, more than £400 million will go towards recruiting additional officers. (Home Office, News Story, 28 January 2021, link).\n- Introducing personalised stop and search powers, helping officers to target persistent offenders. SVRO’s are court-imposed orders which will apply to individuals previously convicted of carrying a knife or an offensive weapon. Police will be able to stop and search those who are subject to an SVRO to check if they are carrying a knife or offensive weapon again (Home Office, News Story, 14 September 2020, link).\n- Enshrining a new police covenant into law, enhancing support and protection for our frontline police officers. The initial focus of the covenant will be on physical protection, health and wellbeing, as well as support for families. It will also create a statutory duty for the Government to do more to support the police, both those currently serving and retired (Home Office, News Story, 8 September 2020, link).\n- Equipping over 8,000 more officers with Taser devices, ensuring they have the resources they need to keep themselves safe. We have delivered £6.7 million for 41 forces to purchase 8,155 Taser devices, and allocated £150,000 to train up Taser instructors. We have also approved a new Taser 7 model for use, which is more accurate, faster and compact (Home Office, News Story, 24 August 2020, link).\n- Dismantling county lines gangs through a £40 million funding boost, keeping our towns and children safe from drug gangs. The £40 million of new money to tackle county lines and drugs supply brings the total invested to £65 million since November 2019. The funding has already seen more than 3,400 people arrested, more than 550 lines closed, more than £9 million street value of drugs and £1.5 million cash seized and more than 770 vulnerable people safeguarded (Home Office, Press Release, 20 January 2021, link).\n- Delivering a £45 million Safer Streets Fund to tackle theft, robberies and burglaries in our towns. The money will go towards measures proven to cut crime including locked gates around alleyways, increased street-lighting and the installation of CCTV. This will stop offences that blight communities and cause misery to victims from happening in the first place (Home Office, News Story, 28 January 2021, link).",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_fighting-modern-slavery-and-human-trafficking/content_34.html": "Modern slavery and human trafficking are despicable and wide-ranging crimes that violate a person’s fundamental human rights. Perpetrated by organised criminals who prey on the vulnerable, it is a crime that is not always easy to identify and tackle as it is often hidden. With its significant coastline, airports, fast road networks and proximity to London, Essex is at the front line of fighting organised immigration crime and modern slavery.\nVictims of trafficking are among the most vulnerable people in our communities, and it is one of my key priorities to help protect vulnerable people from harm. The more we can raise awareness of modern slavery among people at risk, and indeed the wider public, the less likely they will be to fall prey to those who try to manipulate them. If potential victims are alert to the dangers posed by gangs and organised crime, it will be more difficult for them to operate in our communities.\nEssex and Kent Police have an established Modern Slavery and Human Trafficking Team. The Team works to gather intelligence, raises awareness by working with partners, supports victims, and prosecutes perpetrators of modern slavery and human trafficking.\nDuring my tenure, I have funded the charity Justice & Care to work with this Team and together, they developed the role of Victim Navigators to support victims of Modern Slavery and Human Trafficking. The Victim Navigator acts as a bridge between victims of modern slavery and the Essex Police, and they manage the day-to-day necessary contact with victims; whilst providing strategic advice on victim care and safety. Success of this Essex initiative subsequently saw the development of this Team to become a regional resource. I also fund anti-slavery partnerships in Southend (SAMS), Chelmsford (CASP) and Colchester to ensure issues of modern slavery and human trafficking are being tackled at a local level. In addition, victims of these crimes have access to the range of victim support services that I also commission.\nOn the 23rd of October 2019, tragically 39 Vietnamese people, victims of a terrible crime, were discovered dead in the back of a refrigerated transporter in Grays. Following a highly publicised criminal investigation and convictions of those responsible, I hosted an Exploited into Essex Conference in 2022. Together with Essex Chambers of Commerce, Essex Police, and Justice and Care we brought together agencies, businesses, and law enforcement from across the country to highlight the work already being undertaken, the challenges the county faces and what can be done together to build resilience against these forms of crime and stop exploitation in Essex.\nMy focus remains, and exploitation will not be tolerated in Essex. Together, we must all continue to do everything we can to eradicate modern slavery and human trafficking wherever it exists.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_category_Articles/content_24.html": "Right Care, Right Person 21st March 2024 What is Right Care, Right Person? Right Care, Right Person (RCRP) is an approach designed to ensure that people of all ages, who have health and/or social care... Articles\nHow We Can Stop Vehicle Theft 18th March 2024 Car theft and motorbike theft have been rising sharply in our county in recent months. This has been fuelled by international supply shortages, the rise in... Articles\nFighting Modern Slavery and Human Trafficking 12th March 2024 Modern slavery and human trafficking are despicable and wide-ranging crimes that violate a person’s fundamental human rights. Perpetrated by organised criminals... Articles\nPriti Patel is a Home Secretary really making a difference 22nd November 2020 For those of us who are busy implementing the government’s plans to improve community safety and bolster law and order, the current spat around our outstanding... Articles",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_cookies/content_14.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_right-care-right-person/content_40.html": "What is Right Care, Right Person?\nRight Care, Right Person (RCRP) is an approach designed to ensure that people of all ages, who have health and/or social care needs, are responded to by the right person, with the right skills, training, and experience to best meet their needs.\nAt the centre of the RCRP approach is a threshold to assist police in making decisions about when it is appropriate for them to respond to incidents, including those which relate to people with mental health needs. The threshold for a police response to a mental health-related incident is:\n- to investigate a crime that has occurred or is occurring; or\n- to protect people, when there is a real and immediate risk to the life of a person, or of a person being subject to or at risk of serious harm.\nThe approach involves consistent use of the RCRP threshold to determine whether the police are the appropriate agency to respond at the point at which the public or other professionals report a mental health-related incident. It is important to distinguish this from the police’s powers under the Mental Health Act 1983 (MHA); for example, the application of section 136. While the decision to attend an incident is determined by assessing that the incident meets the RCRP threshold, the decision to use powers under the Mental Health Act, is made by an officer at the scene of an incident. Partnership arrangements governing police involvement at pre-planned interventions will continue to be managed at a local Essex level; for example, police attendance at section 135 Mental Health Warrants. The police will always have the discretion to deploy to incidents and this approach does not impede the operational independence of the Chief Constable.\nEssex Police have been clear that the delivery of RCRP is very much a partnership piece. To support this further, memorandum of understandings (MOUs) has been developed which set out the roles of each agency. This is underpinned by both national guidance and legal advice.\nIn Essex, the RCRP threshold will be used in a way that is responsive to dynamic and changeable situations. For example, there may be occasions where a call handler initially judges that there is no clear and immediate risk of serious harm, but the situation escalates. As with all other types of incidents, the police will apply a continuous risk assessment approach, and respond as required to any change in risk, taking into consideration any information provided by local partners. Likewise, when the police have responded to an incident, but the threshold is no longer reached, there should be a timely transfer of support to mental health or other suitable services, with local areas working towards handovers taking place within one hour as specified in local plans, unless mutually agreed in relation to a particular incident on a case-by-case basis.\nThe adoption of RCRP, and its compatibility with Policing’s responsibilities and statutory duties towards children, continues to be carefully considered and discussed with the Department of Education (DfE) and the Association of Directors of Childrens Services (ADCS) to make sure it addresses the needs of children and young people. Agreement has been made with colleagues in DfE and ADCS to produce a jointly agreed set of principles-based guidance to support police forces and partners in implementing RCRP in respect of children and young people. This will also ensure greater support and confidence for Police forces in their role as a lead safeguarding partner regarding compatibility between RCRP, Working Together and The Childrens Act. Locally, the importance of implementing RCRP to ensure the right and best possible outcomes for children and young people is paramount and Essex Police and Executive Directors of Children, Families and Education Services are working in partnership to ensure this.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_my-plan-safer-essex/content_17.html": "-\nMore local, visible & accessible policing\n-\nEnsure the police are there when you need them. Deliver effective response and follow up all reasonable lines of enquiry.\n-\n-\nDrive down anti-social behaviour & crime\n-\nMore hotspot policing and monitoring known offenders to prevent crime, including in our rural areas.\n-\n-\nBeat knife crime and drug gangs and protect young people\n-\nTake drugs and weapons off our streets and help young people get out of gangs.\n-\n-\nProtect women and girls from violence and domestic abuse\n-\nInvest in safer streets and bring more perpetrators to justice.\n-\n-\nEnsure vulnerable people are protected\n-\nMore Safe & Well visits, and Community Safety Officers to identify risks and help people stay safe.\n-\n-\nImprove road safety and reduce road death in Essex to Zero\n-\nTackle speeding and drink and drug driving. Better tech, better education, and better enforcement.\n-\n-\nFire & Rescue Service Reform\n-\nModernising the Fire & Rescue Service to reduce risk and keep more people safe.\n-\nFor me, safe and secure communities are the bedrock on which we build prosperity and wellbeing for everyone.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_privacy/content_10.html": "This document outlines how Roger Hirst for Essex processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Roger Hirst for Essex\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Roger Hirst for Essex.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Roger Hirst for Essex, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Roger Hirst for Essex via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_reducing-drug-driven-violence/content_22.html": "Our three-pronged approach to dealing with drug violence is succeeding in bringing harm down: working with the National Crime Agency to bust international drug gangs, using stop & search and local intelligence to take drugs and weapons off our streets, and through the Violence and Vulnerability Partnership protecting young and vulnerable people from gangs while we deal with the hardened criminals who prey on them. We take a public health approach to crime, focusing on keeping young people free from crime and early intervention to help steer them to a successful life course. The activity funded by the partnership works with people vulnerable to being groomed into gangs, County Lines and drug driven violence. The projects also target gang members and help them step away from a criminal lifestyle. I support the use of Serious Violence Reduction Orders and the implementation of Homicide Reviews for death by offensive weapon. The introduction of Rapid Homicide Reviews in Essex has led to a significant improvement in how Essex Police prevent murder.\nHospital knife-wound admissions are down 25% since 2018, and drug-crime related knife homicide is down 70%. In 2023 Essex Police rolled up 453 Organised Crime Groups, up from 99 in 2019. But we can and must do a lot more. The evidence is that the programme we started in 2018 will take ten years to really make a difference, and change our society. We must see it through. At the same time, we can tighten our laws and toughen enforcement. I am pleased that our lobbying together with Anna Firth MP and her colleagues has had machetes banned. And Essex Police was the first force in the country to successfully prosecute under the new legislation against dealing in nitrous oxide. We must find ways of dealing with new threats, such as the one presented by powerful and deadly synthetic opioids such as fentanyl. In the meantime, the Firebreaks courses delivered by Essex County Fire & Rescue Service will continue to keep young people out of harm, and we must develop our youth interventions further.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_accessibility/content_11.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_key-pledges/content_2.html": "More local, visible & accessible policing\nEnsure the police are there when you need them. Deliver effective response and follow up all reasonable lines of enquiry.\n- Essex Police is the biggest and strongest it has ever been and we must use that to ensure that visible policing is delivered in local communities.\n- We must ringfence our Town Centre Teams, Community Policing Teams and the Rural Engagement Team and Business Crime Team, and make sure these units are out on patrol and solving problems in our communities.\n- Increase our targeted hotspot patrols to deal with anti-social behaviour and serious violence.\n- Allocate resources to deal with Neighbourhood Crime, with a focus on burglary, car theft, drug dealing and shoplifting.\n- Significantly improve all routes of access to policing, with a particular focus on the 101 non-emergency call line and digital public access. A better response will encourage reporting and allow more effective planned interventions.\n- Provide better feedback to victims, boosting confidence and improving police legitimacy.\n- Grow all forms of volunteering and community engagement, from cadet programmes to becoming a Special Constable or an On-Call Firefighter.\n- Continue to work with rural communities and farmers to understand their challenges and to increase their policing presence to tackle all forms of rural crime including hare coursing, unlawful incursions, equipment theft and fly-tipping.\nDrive down anti-social behaviour & crime\nMore hotspot policing and monitoring known offenders to prevent crime, including in our rural areas.\n- Drive down all crime types through prevention and early intervention, targeted on people and places through the better use of data and intelligence and a clear evidence base.\n- Ensure anti-social behaviour and serious violence is dealt with more swiftly by increasing targeted hotspot policing, with 15 ASB and 15 SV hotspots in 2024.\n- Crack down on illegal drugs that blight communities, dealing with drug-dealing on our streets and expanding the use of drug-testing on arrest.\n- Strengthen our Community Safety Partnership hubs to encourage local ownership and leadership of community-led solutions and provide public reassurance, reduce harm and protect the vulnerable.\n- Identify and protect vulnerable individuals and groups from the exploitation and harm caused by drug supply and use, and misuse of alcohol.\n- Roll out live facial recognition equipment to take known offenders off our streets, and use Artificial Intelligence to take more offenders successfully through the courts.\n- To help allocate resources most effectively, I will encourage Essex Police to use crime harm scores, looking at concentrations and prevalence of crime, and reduce the total level of harm in the county.\n- Work with the Levelling-Up Town Boards in Clacton, Canvey Island and Harlow to make communities safe in those areas and help them thrive.\nBeat knife crime and drug gangs and protect young people\nTake drugs and weapons off our streets and help young people get out of gangs.\n- Build on the success of the Violence & Vulnerability Partnership, taking a public health approach to addressing serious violence, investing in activity proven to work and focussing on keeping young people free from crime and intervening early to help steer them to a successful life. This will include:\n- A programme of education to inform groups within communities on risks, support and guidance relating to issues around serious violence.\n- An early help offer, in partnership with schools, social care and a range of organisations – to identify and respond earlier when a young person is at risk of gang involvement.\n- Target knife crime, with the aim of reducing emergency hospital admissions for assault with a sharp object by over half and non-domestic homicides by over a third by 2031.\n- Deliver activity which keeps young people away from areas of criminality where serious violence or its threat is inherent, such as in County Lines drug dealing. Commission programmes in schools and youth groups, provide mentoring and behavioural change interventions, and have youth workers in A&E.\n- Ensure relentless enforcement and pursuit against knife crime offenders operating in Essex. Work with the National Crime Agency and use local intelligence and stop & search to take drugs and weapons off our streets.\nProtect women and girls from violence and domestic abuse\nInvest in safer streets and bring more perpetrators to justice.\n- Put victims at the heart of all we do, ensuring support services such as Independent Sexual and Domestic Violence Advisors are tailored to meet their different needs and enable people to build resilience and live safely.\n- Work with schools to educate young people on healthy relationships and risky behaviours.\n- Use our Safer Streets Fund to invest in public space initiatives that women and girls tell me would make them feel safer. Improve lighting, CCTV and safety in our town centres and key hotspots where women and girls feel at risk.\n- Support initiatives such as the SOS/Night Bus, Ask for Angela, Purple Flag and All Bar None, to help women and girls be safer in the night time economy.\n- Build on our successful Reflect and Change Programmes that seek to break the cycle of domestic abuse by working with perpetrators to change their behaviours.\n- Work with the Criminal Justice System to ensure it is effective in holding domestic abuse perpetrators to account and delivering positive outcomes for victims.\n- Raise victim confidence in reporting by working across the criminal justice system to increase successful conviction rates, particularly for rape and sexual assault, using a victim-centred approach to gather evidence and build the case.\n- Continue to increase confidence in policing by ensuring Essex Police deal robustly with inappropriate behaviours.\n- Monitor the use and effectiveness of legislation and processes in managing offenders, such as Domestic Violence Protection Orders, Domestic Abuse Protection Orders and Stalking Protection Orders.\n- Ensure Essex Police support Clare’s Law and respond promptly to requests for disclosure of previous domestic violence offending.\nEnsure vulnerable people are protected\nMore Safe & Well visits, and Community Safety Officers to identify risks and help people stay safe.\n- Make a shift in main effort toward prevention in both Police and Fire & Rescue Services.\n- Invest in more Community Safety Officers to identify risks and help people stay safe.\n- Increase Safe & Well visits undertaken by the Fire & Rescue Service to ensure the more vulnerable and isolated in our communities remain safe and supported.\n- Work in partnership and share data to identify and safeguard those most vulnerable to fraud and to being repeat victims.\n- Work with partners and wider law enforcement to identify those targeting the vulnerable through fraud and seek to bring them to justice.\n- Work across the criminal justice system to reduce delays in court hearings to ensure that more perpetrators of crime are brought to justice.\n- Champion the rights of victims, including their right to be referred to services that are tailored to support their needs, for example Restorative Justice and Mediation Services.\n- Ensure our services adhere to the Victims Code, that sets out the minimum level of services that victims can expect from criminal justice agencies.\n- Push for more powers to commission criminal justice services and bring together agencies to improve Offender Management.\n- Support victims of human trafficking and modern slavery including sexual exploitation and continue to promote close working with the UK Border Agency, the National Crime Agency and national and regional partners to support victims and bring perpetrators to justice in a timely way for victims.\nImprove road safety and reduce road death in Essex to Zero\nTackle speeding and drink and drug driving. Better tech, better education, and better enforcement.\n- Working through the Safer Essex Roads Partnership (SERP), both Police and Fire & Rescue must act to implement Vision Zero, our programme to reduce road deaths in Essex to zero by 2040.\n- With partners in SERP, invest in prevention programmes to deliver driver education to support behavioural change, such as the Fire Bike scheme and Community Speed Watch, and improve skills on the road.\n- Work with the motor industry to improve vehicle safety.\n- Invest in new technology, including Artificial Intelligence, to ensure enforcement against those who will not learn.\nFire & Rescue Service Reform\nModernising the Fire & Rescue Service to reduce risk and keep more people safe.\n- Continue to invest in our workforce by extending programmes of training and development, helping them to take on more activities around prevention and protection.\n- Extend skills-based pay progression to reward those taking on additional responsibilities.\n- Modernise the Retained Duty System, allowing more flexibility so hours available match the times of greater risk, and invest in recruiting and supporting our On-Call crews.\n- Ensure pay and progression make the service an employer of choice to people of all characteristics and backgrounds.\n- Make sure that our internal resilience model will support the service through times of disruption.\n- Expand Fire Protection and Enforcement activities making buildings across Essex safer and implement the Risk-Based Inspection Programme Plan.\n- Increase further the number of Home Safety visits carried out by fire crews and do more joint Safe & Well visits with other agencies.\n- Drive forward the ambition for every home to have a working smoke alarm.\n- Do more to educate drivers and improve driver behaviour across the county, working through SERP, to reduce harm on our roads and implement Vision Zero.\n- Enhance the multi-agency approach to responding to incidents of flooding and preventing it from happening in the first place.\n- Renew technology to make the service more efficient, effective and fit for purpose.\n- Invest in environmental technology and electric vehicles.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_roger-hirst-pledges-safeguard-number-police-patrol/content_27.html": "‘There will be no cuts to police numbers’ is a firm promise by the Conservative Candidate for the Police and Crime Commissioner, Roger Hirst.\nRoger has pledged that the number of Police on Patrol will not be reduced during his term of office and he will produce a Police and Crime Plan for 2017/18 that guarantees that the number of fully warranted police officers, who protect public safety across Essex will be maintained and not fall. He is also pledged to double the size of the Special Constabulary and to have a ‘Special’ in every village cross the county.\nRoger Hirst said: “It is vital that the public feel safe and the ability to contact police and their visibility is critical to my campaign. By ensuring that there is adequate neighbourhood policing, and boosting the Special Constabulary I will strike a balance between increased detective capacity to investigate some of the most serious crimes with the need to keep local communities safe and effectively tackle the causes of crime.”\nThe Essex Police and Crime Commissioner is responsible for setting the budgets for the Force in Essex and while the role does not have operational responsibilities it is critical that the PCC ensures the Chief Constable has the right resources to prevent and tackle crime.\nRoger continued: “As your Police and Crime Commissioner I promise to make sure that Essex is safe and the prevention of crime becomes a key part of my tenure. By engaging with residents and recruiting more special constables who are seen as pillars of their communities we will have a Force in Essex that will be envied by the rest of the country.”",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_role-police-fire-crime-commissioner/content_13.html": "The Police, Fire & Crime Commissioner is the bridge between Essex Police and Essex County Fire & Rescue Service and the Public. Key responsibilities are:\nAppointing, and if need be dismissing, the Chief Constable and the Chief Fire Officer.\nSetting the strategy for the Police and Fire & Rescue Services in consultation with the chief officers and the public.\nSetting the budget for the services, currently £480m combined, and setting the council tax precept to fund them.\nHolding the services to account, via the chief officers, for their performance of their duties to the public.\nBoth the Chief Constable and the Chief Fire Officer in Essex have complete operational independence as enshrined in statute and in our constitution.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_fire-rescue-service-reform/content_33.html": "His Majesty’s Inspectorate of the Police and Fire and Rescue Services has lifted the Causes for Concern on Essex County Fire & Rescue Service’s culture and on its Protection Service. We have embedded significant cultural change in the Fire & Rescue Service, building on values defined with our workforce which have changed behaviours. Working with the Fire & Rescue Service, I have overseen the introduction of better and targeted training programmes, a new recruitment programme, a fresh approach to identifying and developing talent and skills, and new policies for discipline and complaints.\nWe have invested in expanding our fire protection and enforcement activities, promoting best practice and regulation, increasing building safety audits and inspections to make buildings across the county safer.\nThe service has been able to prevent more fires, and the number of people killed or seriously injured across the county by fire or road traffic collision has continued to reduce. This is very good for the people of Essex, but there is still more to do.\nWe must continue to build on the achievements to date whilst also driving for greater productivity in the service. The introduction of the Dynamic Deployment model has increased response fire cover to nearly 98% in the last year; now we need to refine how to deliver it cost-effectively. Recently ECFRS has won the iese Gold Award for Fire & Rescue Service of the Year 2024, and reached the Silver level of the Inclusive Employers Standard.\nOverall I will support the government’s initiatives to improve the professionalism of the Fire & Rescue Service, invest in its people and refine its governance so as to keep our residents safer and reduce the number of people killed or seriously injured. We look forward to the establishment of the national College of Fire & Rescue.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_how-we-can-stop-vehicle-theft/content_39.html": "Car theft and motorbike theft have been rising sharply in our county in recent months. This has been fuelled by international supply shortages, the rise in scrap values and in new vehicle costs and delivery times, and in the vulnerability of passive keyless entry. It is happening across the country, and it is bad here in Essex. We must make dealing with this surge a priority.\nTo prevent vehicle crime (theft of and theft from motor vehicles), Essex Police teams identify hot spot areas for these crimes and complete patrols of these areas. The force has recently created ‘Operation Dance’ for vehicle crime, which is based on recent crime pattern analysis. This operation focuses officers’ activity within all identified hotspot areas and repeat locations/streets identified, especially during any associated peak days and times. They have also set up ‘Operation Ignition’ to focus on intervention, disruption, prevention and detection of the organised crime gangs behind this. They work alongside the National Vehicle Crime Investigation Service.\nThe Stolen Vehicle Intelligence Unit (SVIU) at Essex Police has last year recovered or identified more than a record 626 stolen vehicles or parts of stolen vehicles, a 30% increase on 2021, with an estimated value of £14m. The team frequently seize stolen cars within hours of them being taken, examine them, and use this intelligence to hunt down other missing vehicles. Last year two officers from the team were presented with awards by the International Association of Auto Theft Investigators for their ‘outstanding contribution in the fight against vehicle crime’.\nThe team also work on many investigations into chop shops – the places where stolen cars are stripped of their parts – and are supported by analysts who study the thefts to look for patterns of offending. They investigated 34 chop shops last year. One example of their achievements was when they searched a shipping container that was heading to Dubai from the London Gateway Port in Thurrock and found a Rolls Royce Dawn inside that had been stolen. The missing car had recently cost its owner £350,000 and had been stashed alongside parts of eight stolen Range Rovers.\nThe team can be followed on their dedicated Twitter page (@EP_SVIU) which features appeals and crime prevention advice.\nI recently met with Jaguar LandRover at their Coventry plant to discuss how they can better protect their vehicles. They are spending £15m on retrofitting improved security to their older models, as well as ensuring their new cars are protected from theft.\nEssex Police is having success in tackling vehicle crime and below are just three examples of recent successes that demonstrate the organised nature of this crime and the effectiveness of the tactics being used to address the activity.\n· An example of work targeting the export of stolen vehicles: https://www.itv.com/news/anglia/2023-12-31/jeep-slung-from-container-roof-is-latest-top-end-stolen-car-recovered\n· An example of work Essex Police do around the handling / movement of stolen vehicle parts: https://www.essex.police.uk/news/essex/news/news/2023/december/epping-f…;\n· An example of the work done around identifying / intercepting stolen vehicles placed onto false identities and sold on to innocent purchasers: https://www.echo-news.co.uk/news/23947927.stolen-lexus-car-among-eight-others-recovered-grays-theft/\nYou can find crime prevention advice, helping protect your home from crime, on the Essex Police website Protecting your home from crime | Crime prevention | Essex Police. I would also urge you to keep reporting and if you see something suspicious to report it.\nThere are other security improvements available, beyond standard steering and wheel locks and drop bollards to physically prevent your vehicle being taken. Fitting a ‘sleeping battery’ to your remote locking key means it turns itself off when left for a few minutes, and cannot be read. A ‘ghost immobiliser’ can render a cloned key useless – but do check and get one which is compatible with your vehicle’s software.\nStaying vigilant, reporting suspicious activity and sharing information is one of the best ways to protect you and your community from criminal activity including burglary and car theft. We have a very strong countywide Neighbourhood Watch group which link in closely with the local police, provide crime prevention advice and share data on recently crime trends.\nI can commit to making sure that Essex Police treat car and motorbike theft as priority crimes and that we beat this crime surge.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_track-record-success/content_16.html": "- Roger has funded the expansion of Essex Police by 905 additional officers since 2016. Essex Police is now bigger and stronger than at any time in its 185 year history.\n- Getting Crime Down: in the last year crime in Essex has been brought down by 6%, and Anti-Social Behaviour (ASB) by 38%. Since 2016, ASB is down 70%, Murder by 43% and Burglary by 43%.\n- There is more to do, particularly around Rape, Drug Crime and Vehicle Theft. But even here our new investment and tactics are starting to work, with Domestic Abuse, Sexual Offences and Violent Crime all down in the last year.\n- Essex County Fire & Rescue has been changed. It is now a better place to work and is providing a better service to the public, with more house fires prevented, and businesses and vulnerable people protected.\nHow we have done against My Plan 2021\n- Investing in an extra 400 Police in three years: we have expanded by 537 officers.\n- Get Crime Down: Crime is down by 6% in the last year, and by 7.5% from pre-Covid levels.\n- Keeping roads safe: the number of people killed or seriously injured is down, and we have committed to Vision Zero.\n- Supporting the Specials: we now have the second largest Special Constabulary in the country.\n- Protect rural and isolated areas: hare coursing and equipment theft have been halved, and unlawful encampments reduced by three quarters.\n- Crack down on violence and drugs: hospital knife admissions have been reduced by 25%, and drug-related murder by 70%.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_tackling-knife-crime-one-top-priorities-roger-hirst/content_28.html": "Ensuring public safety and reducing the threat of knife crime are among the top issues that Roger Hirst, Conservative Candidate for the Essex Police and Crime Commissioner, is pledging to the public as part of his action plan to reducing the fear of crime.\nKnife crime and anti-social behaviour are major concerns of many residents and the growing gang culture in some parts of the country is a real fear. Roger has already backed regular knife amnesties to ensure people can give up potential weapons and remove them from the streets.\nHe also backs youth education on the issue and to let people know that by carrying a knife can be life threatening to them as well as others. It is part of a cycle of crime that Roger is determined to stamp out.\nRoger Hirst said: “I know that knife crime is a growing fear of local people and while Essex remains a very safe county we do hear of isolated incidents on a more frequent basis. I want to stop this and I will be tough on ensuring we remove knives and other weapons from the streets. Such dangerous crimes can find their origins in Anti-Social Behaviour and I will focus resources and energy on working with communities to tackle this worrying aspect of many people’s lives.”\nRoger regularly meets with the public as he travels around Essex and he also consults widely with Councillor colleagues to hear what is happening on the streets in each of their patches. Roger intends to build on this network which keeps him well connected with what people are thinking and act on their concerns.",
  "https_www_hirst4essex_uk_/https_www_hirst4essex_uk_news_category_Opinions/content_19.html": "Local, Visible and Accessible Policing 6th April 2024 Neighbourhood crime may be down, but it is not yet beaten. Burglary, car theft, drug dealing, shoplifting and anti-social behaviour (ASB) disrupt people’s lives... Opinions\nReducing Drug Driven Violence 5th April 2024 Our three-pronged approach to dealing with drug violence is succeeding in bringing harm down: working with the National Crime Agency to bust international drug... Opinions\nReducing Violence Against Women and Girls 4th April 2024 Reducing Violence Against Women and Girls is a key priority for me as Police, Fire & Crime Commissioner and for Essex Police. We are having some success, with... Opinions\nImproving Safety on Our Roads 3rd April 2024 There is more we can do to reduce the number of people killed and injured on our roads. Over the last few years we have worked together with the Safer Essex... Opinions\nProtecting Rural and Isolated Areas 2nd April 2024 The establishment of the Rural Engagement and Business Crime Teams, working closely with our rural and business communities in Essex, have created greater... Opinions\nFirearms Licensing 1st April 2024 Firearms, Shotgun and Explosives Licencing (FSEL) is an important police function which ensures public safety while allowing legitimate users to go about their... Opinions\nFire & Rescue Service Reform 30th March 2024 His Majesty’s Inspectorate of the Police and Fire and Rescue Services has lifted the Causes for Concern on Essex County Fire & Rescue Service’s culture and on... Opinions\nEncouraging Volunteers and Community Support 29th March 2024 Encouraging Volunteers and Community Support Our support for the Special Constabulary has meant that a large number of residents have come forward as volunteers... Opinions\nCyber Crime, Business Crime and Fraud 28th March 2024 The growth of the internet has seen a surge in crimes against businesses and individuals. Fraud is now the largest single crime type in the country. At the same... Opinions"
}