{
  "https_www_garethbacon_com_/https_www_garethbacon_com_privacy-notice/content_5.html": "Privacy Notice\nPrivacy and Cookies\nThis privacy notice relates to the personal data processed by the Office of Gareth Bacon MP in relation to casework and policy queries.\nWho is the Data Controller?\nThe Data Controller is Gareth Bacon.\nWhat does the office do?\nWe conduct casework and respond to policy queries, for which we must process people's personal data. We also manage a small mailing list for the purpose of sending Gareth's newsletter and information about upcoming advice surgeries. In addition, we also create surveys to hear constituents views and inform Gareth's work in Westminster.\nHow do we process data?\nThis office processes constituents’ data under the lawful basis of public task. In instances where this lawful basis is not sufficient and explicit consent is required, a member of the office will contact you to establish your consent. We are committed to ensuring that the information we collect and use is appropriate for this purpose, and does not constitute an invasion of your privacy.\nWill we share your data with anyone else?\nIf you have contacted Gareth about a personal or policy issue, we may pass your personal data on to a third-party in the course of dealing with you such as local authorities, government agencies, public bodies, health trusts, regulators and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended. When they no longer need your data to fulfil this service, they will dispose of the details in line with our procedures. We will not share the personal information of members of Gareth’s mailing list or those in receipt of our newsletters. In any case, we will not use your data in a way that goes beyond your reasonable expectations in contacting us.\nFor how long will you keep my personal data?\nCasework and policy queries are often revisited to provide the best service and representation for constituents, from whom we may continue to receive correspondence. Unless specifically requested by you, we feel it is reasonable that our office will hold your personal data for the duration of Gareth’s time as representative for the Orpington Constituency. Following an election, if unsuccessful, all records will be destroyed within one calendar month of the election.\nWhat rights do I have to my personal data?\nAt any point while we are in possession of or processing your personal data, you, the data subject, have the following rights:\n• Right of access – you have the right to request a copy of the information that we hold about you.\n• Right of rectification – you have a right to correct data that we hold about you that is inaccurate or incomplete\n• Right to be forgotten – in certain circumstances you can ask for the data we hold about you to be erased from our records.\n• Right to restriction of processing – where certain conditions apply to have a right to restrict the processing.\n• Right of portability – you have the right to have the data we hold about you transferred to another organisation.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\nHow can I contact somebody about my privacy?\nYou can get in touch with our office by letter, email or telephone using the details at the foot of this page. Please note that we will ask for identification (passport, driving license, utility bill from the last 3 months) should you choose to exercise any of the above rights in relation to personal data we hold. Complaints In the event that you wish to make a complaint about how your personal data is being processed by this office, or how your complaint has been handled, you have the right to lodge a complaint directly with the Information Commissioner’s Office www.ico.org.uk\nEmail me at:",
  "https_www_garethbacon_com_/https_www_garethbacon_com_greenbeltsurvey/content_13.html": "PROPOSED GREEN BELT DEVELOPMENT IN ST MARY CRAY\nLand Improvement Holdings have begun a publication exercise with local people, showcasing a housing development they would like to undertake in St Mary Cray.\nIf they achieve planning permission, they aim to build approximately 350 units on farming land south of Crockenhill Road.\nTo be clear, the site on which they wish to build is green belt land.\nA development of this nature will fundamentally change the look and feel of the area. Furthermore, if such a development is allowed to proceed, it may lead to more and more development in the green belt.\nEveryone is in agreement that we need more homes, but they must be built in the right places.\nUnfortunately, the government wants to make it easier to build on green belt land. But our green belt is precious, it is what makes Orpington such a beautiful and sustainable place to live, and if we allow it to be concreted over, it will be gone forever.\nNo planning application has yet been submitted for this proposal, but one is expected in the near future, possibly as soon as Spring 2025.\nPlease spare a few minutes to let me know your thoughts on this site by responding to the survey below.\nThank you.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_orpington-1st-column-delivering-for-orpington/content_18.html": "Orpington 1st column: Delivering for Orpington\n- Gareth Bacon\n- Feb 14, 2023\n- 3 min read\nThere's one issue on everyone's minds: the cost of living. We have faced a turbulent time as a nation, from a pandemic to an energy crisis, but we are not alone. Many people feel the squeeze on our household budgets and income - and many other countries face the same challenges as us.\nThere's no quick fix to the economic shock of a once-in-a-century pandemic or an energy crisis fuelled by the war in Ukraine. But there's a lot we can do to get our economy back on track to create better-paid work and lower inflation, so that your income goes further. In this column, I want to update you on what I am doing as your Member of Parliament to support families and businesses in Orpington.\nFirst, I'm fighting the Mayor of London's plans to expand the Ultra Low Emission Zone (ULEZ) across Greater London from August this year. If the Mayor imposes this road tax on Orpington, it will cost you £12.50 a day to drive if you own an older car - and a £180 fine if you fail to pay.\nThe Mayor doesn't understand that places like Orpington rely on cars because we do not have the same public transport connections as central London. Nor do we have the same pollution problem. Transport for London's own analysis reveals that ULEZ expansion will have little to no impact on air quality in outer London.\nOver 80 per cent of Orpington households own a car, which includes over 50 per cent of households earning as little as £10,000 a year. The Mayor's road tax could cost people up to £4,500 a year if they use their car every day to get to work, the shops, or visit family and friends.\nFew can afford the Mayor's road tax. That's why I am doing all I can to stop it, including organising a letter signed by 28 Members of Parliament demanding that he cancels ULEZ expansion, discussing the issue with government ministers, and speaking out against the charge in Parliament and on the media.\nSecond, I've met with Orpington businesses to hear their views on the challenges facing local enterprises in our town centre. I want to help them thrive so they can create more, better-paid jobs and invest in our community. They raised several issues, which I will take back to Parliament.\nThird, one issue businesses raised was policing in Orpington. I am delighted to report that the government is on track to recruit 20,000 additional police officers, taking police numbers to a record level in Greater London. Due to this recruitment drive, we now have more police on the beat in Orpington's town centre, with a Sergeant, five officers, and one police community support officer.\nFinally, ahead of the upcoming budget, I met with the Chancellor of the Exchequer to discuss pressures facing Orpington families and businesses and how we can grow the capital's economy. I welcome the laser focus he and the Prime Minister have brought to ensuring economic stability and driving down inflation. I made the point that we need to unleash businesses and make the UK more competitive to grow our economy, so we can lower taxes and invest in our public services.\nOrpington is a brilliant place to live, work and do business, and I'm confident it will continue to thrive. I'm proud that the government protected people's livelihoods during the pandemic and is now shielding families and businesses from Vladimir Putin's energy warfare through the energy price guarantee.\nThere's a lot more to do. But as your MP, I am doing all I can to: stop the Mayor's ULEZ expansion from taking a sledgehammer to household budgets and businesses; support local enterprises and secure more police officers; and raise Orpington's concerns directly with senior government ministers to ensure your voice is heard in Westminster.\nArticle by Gareth Bacon MP first published by Orpington 1st.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_stop-ulez-expansion/content_12.html": "Stop Sadiq Khan's Greater London ULEZ expansion plan\nOn 29 August 2023, Sadiq Khan plans to expand the Ultra Low Emission Zone (ULEZ) across Greater London, including the Orpington constituency.\nIf you drive an older vehicle, you may have to pay £12.50 a day to drive within Greater London under the Mayor's plans. You can check whether your vehicle is compliant by entering your number plate in Transport for London's vehicle check service. If you fail to pay the ULEZ charge, the Mayor plans to fine you £180 each time.\nCurrently, the ULEZ charge is only imposed in the Congestion Charge zone and up to the North and South Circular roads. If the Mayor's plan goes ahead, it will cover the whole of Greater London, including the London Borough of Bromley.\nWhen household bills are rising due to inflation and global supply problems, the Mayor's plan will hit the poorest in our community hardest. It will punish people, small businesses, and charities who cannot afford a new vehicle to raise money for Sadiq Khan's failing administration.\nAs your Member of Parliament, I will do everything I can to stop Khan's plan. However, it is within the Mayor's power to impose such a charge. That's why I need your help.\nYou can help stop Sadiq Khan's ULEZ expansion by signing my petition below, demonstrating the level of opposition to the expansion of ULEZ. Sign the petition. Stop Sadiq Khan's new tax.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_unfair-a20-fines-must-be-cancelled/content_17.html": "UNFAIR A20 FINES MUST BE CANCELLED\n- garethbaconmp\n- Jan 31\n- 1 min read\nYou may remember that TfL introduced temporary speed restrictions on the A20 eastbound near Sidcup last year, while they were undertaking roadworks.\nSadly, hundreds of local people were wrongly fined as a result of inadequate and confusing signage, much of it at odds with sat nav systems. In one case, TfL admitted that an erroneous sign had been erected by a third party.\nIn some cases, people have lost their driving licenses for unknowingly accruing multiple fines on the same stretch of road during their daily commute. This is deeply unfair.\nI along with my neighbouring MPs, Laura Trott (Sevenoaks) and Louie French (Old Bexley and Sidcup), have been urging the Mayor of London to reverse these fines, so far to no avail.\nWe need an investigation into the botched roadworks and Sadiq Khan should do the right thing and cancel these fines immediately. You can read our full letter to him below.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_the-chancellor-s-economic-mess/content_10.html": "THE CHANCELLOR'S ECONOMIC MESS\n- garethbaconmp\n- Jan 31\n- 1 min read\nThe Chancellor appears to be losing her grip on the public finances fast. In just the past few days, we have seen long term government borrowing reach a 27-year high, the pound fall to its lowest value in 14 months, a shock drop in pre-Christmas retail sales, and major employers such as Sainsbury’s announcing mass job losses. Meanwhile inflation is back up above target to 2.5% and the economy is stagnating at best. The government urgently needs to change course from its high tax, high borrow, high spend agenda.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_we-need-a-sensible-aviation-strategy-to-grow-the-economy/content_8.html": "WE NEED A SENSIBLE AVIATION STRATEGY TO GROW THE ECONOMY\n- garethbaconmp\n- Mar 14\n- 1 min read\nWe have the third largest aviation industry in the world. It is vital to our economy, connecting us as an island nation to the rest of the world, boosting trade, and creating jobs. Sadly, the government’s recent announcements over Heathrow and Gatwick expansion show that their aviation strategy seems to be all over the place. As Shadow Transport Secretary, I will work on a sensible strategy that will help deliver the jobs and investment that the sector, and our country, needs.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_the-outrageous-charade-behind-sadiq-khan-s-ulez-plan/content_21.html": "The outrageous charade behind Sadiq Khan’s ULEZ plan\n- Gareth Bacon\n- Feb 13, 2023\n- 3 min read\nOuter Londoners aren’t buying Sadiq Khan’s lazy and misleading attempt to justify the expansion of the Ultra Low Emission Zone (ULEZ) in London. No one living in one of the capital’s outer suburbs or rural villages seriously thinks air pollution in their green patch is as bad as it is in central London, or that it needs the same solutions. The Mayor’s attempts to persuade them otherwise are embarrassing him.\nMayor Khan fails to understand that the four boroughs leading the charge against ULEZ expansion — Bromley, Bexley, Harrow and Hillingdon — are nothing like Zone 1. Take my constituency of Orpington within the London Borough of Bromley. It is a collection of Kentish towns and villages with farmers’ fields and country lanes. It’s where people rely on their cars and don’t have access to London’s Tube network. Another world to Labour’s Islington or Camden.\nYet the Mayor is attempting to shame these boroughs into believing they face worse problems with air pollution than the capital’s centre. He points to figures of premature deaths allegedly linked to air pollution in an Imperial College London report. But he ignores the fact that Bromley tops the table because it has an older population, not because air pollution in the leafy borough is worse. In peddling this nonsense, the Mayor is also turning a blind eye to the findings within his own impact assessment ahead of ULEZ expansion. It found that the road tax would have little or negligible impact on air quality, but drag in hundreds of thousands of new payers. Mayor Khan is eager to link his road tax to air pollution because he doesn’t want to admit the real reason for ULEZ expansion: it’s a cash grab. Sadiq Khan’s mayoral administration is broke. He lost Transport for London at least £640 million through an unaffordable fares freeze, failed to deliver Crossrail on time, costing billions of pounds in bailouts, and nearly doubled the size of bureaucracy at City Hall. Expanding a £12.50 daily charge on boroughs with poor access to public transport, where people rely on their cars, will rake in £300 million in its first year. The coffers also stand to gain from fining unaware Londoners £180 every time they fail to pay — potentially raising millions more. Advertisement A one-size fits all solution like ULEZ expansion is a sledgehammer that will hurt working people and businesses when few can afford it. Over 80 per cent of the households within my constituency have cars. Across outer London, more than half of households earning as little as £10,000 own a car. Without access to the Tube, fewer buses, and poor orbital public transport routes, the majority of people rely on their cars to get to work and the shops, or to visit family and friends.\nFaced with such a huge driving bill when other bills are going up, it’s no surprise that Khan’s air quality excuses aren’t convincing my constituents. Sat in a rural village like Pratt’s Bottom or Biggin Hill, looking out on green fields, the idea that you should pay a road charge designed for central London is ludicrous. Make no mistake — the local authorities fighting against ULEZ expansion are facing an uphill struggle. They don’t have the Mayor’s resources or press team. But they do have the support of many residents and should keep going regarding Labour’s mudslinging. People want cleaner air — but they’re not fools. Outer Londoners can see highway robbery for what it is, no matter how the Mayor attempts to spin it.\nArticle by Gareth Bacon MP first published by The Daily Telegraph.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_meet-gareth/content_6.html": "Meet Gareth Bacon MP\nMy name is Gareth Bacon, and I am proud to be the Member of Parliament for Orpington.\nI was born in Hong Kong but was raised, went to school and still live in Sidcup with my wife and daughter, close to the boundary of the Orpington constituency.\nI took my Bachelors Degree at the University of Kent in 1996, before studying for a Masters Degree in European Politics at the same university the following year. The subject of my Master’s Degree dissertation was an examination of the democratic deficit in the European Union – I concluded that this was a problem that could not be resolved and that Britain would be better served by leaving the European Union. This forms much of the foundation for my support for Brexit.\nAfter university, I worked in financial services before moving into financial recruitment, latterly as a Director of a large financial recruitment business.\nI was a London Assembly Member from 2008 until 2019, initially as a London-wide Member. I then represented the constituency of Bromley and Bexley, which includes Orpington, holding the Mayor to account and delivering for outer London.\nOn the Assembly, I led the GLA Conservatives and worked tirelessly to protect our green spaces, keep our communities safe, and ensure that every penny of taxpayers' money is spent well.\nIn the final 18 months of Boris Johnson's mayoralty, I served as Chairman of the London Fire & Emergency Planning Authority. This body oversaw the London Fire Brigade and co-ordinated the emergency planning work for London.\nIn 1998, I was elected to serve as a local councillor in the London Borough of Bexley. For a total of nine years, I served as a Cabinet Member in a number of positions including as Deputy Leader of the Council, Cabinet Member for Finance and Corporate Services, and Cabinet Member for Environment and Public Realm.\nI was elected as the Member of Parliament for Orpington on 12 December 2019, and re-elected on 4 July 2024. I am proud to have been a strong voice for Orpington in Parliament and I have worked tirelessly to deliver for this beautiful part of historic Kent.\nYours, Gareth Bacon",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_the-unfair-fines-on-the-a20-must-be-cancelled/content_9.html": "THE UNFAIR FINES ON THE A20 MUST BE CANCELLED\n- garethbaconmp\n- Feb 18\n- 1 min read\nIt has now been over a year since I along with neighbouring MPs Laura Trott and Louie French first wrote to the Mayor of London about hundreds of drivers being fined on the A20 because of botched roadworks. These fines were deeply unfair as the change in speed limits were not properly communicated to people. TfL have even admitted that in one case, a rogue sign was put up by a so-called third party. Some are now worried about losing their licence, and their job, after receiving multiple fines on the same stretch of road unknowingly. We have written to the Mayor again — he should do the right thing, cancel these fines and hold an investigation into how the roadworks went so wrong.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_sadiq-khan-s-ulez-nightmare-could-be-about-to-end-his-terrible-reign/content_20.html": "Sadiq Khan’s Ulez nightmare could be about to end his terrible reign\n- Gareth Bacon\n- Apr 14, 2023\n- 3 min read\nThe High Court’s decision to hear the full case against Sadiq Khan’s Ulez expansion is a major blow to the mayor. He arrogantly dismissed the legal challenge launched by a coalition of five Conservative councils (Bromley, Bexley, Harrow, Hillingdon and Surrey) urging the Court to throw the case out. But once again, his judgement was flawed.\nNow the Court’s ruling means we’re a step closer to preventing Khan’s highway robbery. It will come down to whether the Court finds that his decision was unlawful, having failed to follow statutory procedures or to consider the impact of his cash-grabbing policies on motorists living in neighbouring counties.\nShould the Court find against Khan, he should resign. Any honourable man in his position would do so. He would acknowledge that such a heavy blow against a plan so fundamental to his agenda was a fatal one. The crazy saga over Ulez expansion could then, at last, come to an end, and the capital would once again be able to focus on its post-Covid economic recovery.\nIt would be fitting, moreover, for the mayor to have been defeated by councillors, injecting a much-needed dose of local democracy into an administration which has functioned by arrogant dictation. I wish them every success. But alas, the Sadiq Khan we know is unlikely to do the honourable thing. He may instead try to pass the buck for any legal defeat, cling on to office and continue to wage all-out war on motorists.\nThus, whatever the outcome in the High Court, the Conservative Party needs to launch a serious and determined campaign to oust him in next year’s mayoral election. The opposition to Ulez in outer London is already so vast that we now have the best opportunity in over a decade to take back control.\nAfter eight years of Sadiq Khan, there is not a single positive thing the Labour Party can claim to have delivered in London. The city isn’t safer. In fact, the London Fire Brigade and the Metropolitan Police are in special measures. The latter is in crisis, with Baroness Casey’s report unveiling how low the force has fallen.\nTransport for London is virtually broke, with little money to invest on improving services. That’s not to mention Khan’s infamous promise of zero days of strikes; we have seen more than 130 strike days on his watch, triple the number under Ken Livingstone and Boris Johnson.\nKhan has utterly failed to make London more affordable. Despite the government giving him nearly £9 billion to build affordable homes, his housebuilding record is sluggish. And if ever he got his way on rent controls, the situation would only deteriorate.\nElsewhere, he has compounded the cost of living crisis. He hiked his share of council tax by 57 per cent to record levels, raised the congestion charge to £15, and increased road traffic fines to an eye-watering £160.\nA positive, serious, determined Conservative mayoral campaign with a plan to restore trust in the police, drive down violent and neighbourhood crime, cut the cost of City Hall, build more homes and end the war on motorists by stopping Ulez expansion can win in London.\nUltimately, history could show that this initial victory in the High Court was also the first step toward the end of Sadiq Khan’s mayoralty, either by enforced resignation or ejection by Londoners at the ballot box.\nArticle by Gareth Bacon MP first published by The Daily Telegraph.",
  "https_www_garethbacon_com_/https_www_garethbacon_com/content_1.html": "top of page\nHome\nMeet Gareth\nElection 2024\nNews\nMore\nUse tab to navigate through the menu items.\nSign up to Gareth Bacon MP's newsletter\nI want to subscribe to your mailing list.\nSubmit\nThanks for submitting!\nSurvey:\nProposed green belt development in St Mary Cray\nPetition:\nStop ULEZ expansion\nHave your say\nSign the petition\nLatest news\nUpdate on the Walnuts Centre redevelopment\nEmployer's NI hike will hurt care homes\nEmployer's NI hike will hurt local small businesses\nEMPLOYER'S NI HIKE WILL HURT BUSINESSES\nWE NEED A SENSIBLE AVIATION STRATEGY TO GROW THE ECONOMY\nSTOP THE FAMILY FARM TAX\nbottom of page",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_employer-s-ni-hike-will-hurt-businesses/content_2.html": "EMPLOYER'S NI HIKE WILL HURT BUSINESSES\n- garethbaconmp\n- Mar 20\n- 1 min read\nThe rise in Employer’s National Insurance takes effect from April and many local businesses in Orpington will be forced to either raise their prices or sack their staff in order to pay for it. It does not have to be this way, the government can still reverse their tax on jobs.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_blog_categories_articles/content_16.html": "top of page\nSadiq Khan’s Ulez nightmare could be about to end his terrible reign\nThe High Court’s decision to hear the full case against Sadiq Khan’s Ulez expansion is a major blow to the mayor. He arrogantly dismissed...\nGareth Bacon\nApr 14, 20233 min read\n359 views\nThe hypocrisy of ULEZ-backing Hounslow council is appalling\nThe consequences of Sadiq Khan’s disastrous ULEZ expansion are slowly dawning on out-of-touch Labour politicians. Whilst some outer...\nGareth Bacon\nMar 7, 20233 min read\n93 views\nOrpington 1st column: Delivering for Orpington\nThere's one issue on everyone's minds: the cost of living. We have faced a turbulent time as a nation, from a pandemic to an energy...\nGareth Bacon\nFeb 14, 20233 min read\n46 views\nThe outrageous charade behind Sadiq Khan’s ULEZ plan\nOuter Londoners aren’t buying Sadiq Khan’s lazy and misleading attempt to justify the expansion of the Ultra Low Emission Zone (ULEZ) in...\nGareth Bacon\nFeb 13, 20233 min read\n91 views\nbottom of page",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_employer-s-ni-hike-will-hurt-care-homes/content_11.html": "Employer's NI hike will hurt care homes\n- garethbaconmp\n- Mar 31\n- 1 min read\nThis week, the government’s rise in Employer’s National Insurance comes into effect. It will hurt care homes like my constituent Ash’s. Staffing costs make up about 70% of his outgoings, and he says this is a make or break moment for his livelihood. The Chancellor should do the right thing and change course.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_employer-s-ni-hike-will-hurt-local-small-businesses/content_4.html": "Employer's NI hike will hurt local small businesses\n- garethbaconmp\n- Mar 31\n- 1 min read\nLast week, the Chancellor had an opportunity to do the right thing and reverse her jobs tax in her emergency Budget. Regrettably, she did not.\nIt means that the rise in Employer’s National Insurance takes effect from next week and it will punish the hard workers, the risk takers, and the job creators. It will hit our economy as businesses think twice before investing and hiring.\nI heard first hand from small businesses in Petts Wood about how they are feeling numerous pressures at the moment including high rents and cuts in business rates relief. The hike in NI will only make things worse for them.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_blog/content_3.html": "top of page\nUpdate on the Walnuts Centre redevelopment\nProperty Developer Redcliff have published their latest indicative plans to redevelop the Walnuts Centre. From my understanding, these...\ngarethbaconmp\nApr 21 min read\n23\nEmployer's NI hike will hurt care homes\nThis week, the government’s rise in Employer’s National Insurance comes into effect. It will hurt care homes like my constituent Ash’s....\ngarethbaconmp\nMar 311 min read\n4\nEmployer's NI hike will hurt local small businesses\nLast week, the Chancellor had an opportunity to do the right thing and reverse her jobs tax in her emergency Budget. Regrettably, she did...\ngarethbaconmp\nMar 311 min read\n4\nEMPLOYER'S NI HIKE WILL HURT BUSINESSES\nThe rise in Employer’s National Insurance takes effect from April and many local businesses in Orpington will be forced to either raise...\ngarethbaconmp\nMar 201 min read\n3\nWE NEED A SENSIBLE AVIATION STRATEGY TO GROW THE ECONOMY\nWe have the third largest aviation industry in the world. It is vital to our economy, connecting us as an island nation to the rest of...\ngarethbaconmp\nMar 141 min read\n13\nSTOP THE FAMILY FARM TAX\nI visited a family run farm at Kevington Hall in Orpington — and spoke to farmers Jonathan and Tim about the impact that the government’s...\ngarethbaconmp\nFeb 211 min read\n5\nTHE UNFAIR FINES ON THE A20 MUST BE CANCELLED\nIt has now been over a year since I along with neighbouring MPs Laura Trott and Louie French first wrote to the Mayor of London about...\ngarethbaconmp\nFeb 181 min read\n316\nUNFAIR A20 FINES MUST BE CANCELLED\nYou may remember that TfL introduced temporary speed restrictions on the A20 eastbound near Sidcup last year, while they were undertaking...\ngarethbaconmp\nJan 311 min read\n46\nTHE CHANCELLOR'S ECONOMIC MESS\nThe Chancellor appears to be losing her grip on the public finances fast. In just the past few days, we have seen long term government...\ngarethbaconmp\nJan 311 min read\n10\nbottom of page",
  "https_www_garethbacon_com_/https_www_garethbacon_com_election2024/content_15.html": "Election 2024: Campaign updates\nThank you to everyone who voted to re-elect me as the MP for Orpington. It's an honour to represent you, and I will continue to fight tirelessly for you in Parliament.\nAn update on the cost of living\nGood news — inflation has fallen back to the official 2% target and we should soon see interest rates beginning to fall. Taken with another expected fall in our energy bills next month, the cut in National Insurance, the rollout of government-funded childcare for 2 year olds; and the triple lock protecting state pensions — people in Orpington will start to feel tangible benefits whatever their stage of life.\nWe have turned a corner after a tough few years, don’t let Labour ruin it.\nVote for me, Gareth Bacon, on Thursday 4th July.\nReversing the ULEZ extension\nOn July 4th, we have an opportunity to reverse the ULEZ extension and go much further to end Labour’s war on the motorist.\nWhy couldn’t we have done this while in government? The government does not have the legal power to just overrule the Mayor of London; government legal advice was that attempts to block the expansion would have failed in the courts; Conservative MP Gareth Johnson introduced a Bill to overturn the ULEZ expansion (which the government supported), but it was talked out by Labour MPs; Conservative Mayoral Candidate Susan Hall campaigned to abolish the expansion but was defeated.\nNow the government has worked up substantial laws which will finally get rid of ULEZ from outer London and give local people the power to block 20mph zones and LTNs.\nVote for me, Gareth Bacon, on 4th July — and let's end this madness together.\nSupporting pensioners\nIf you’re a pensioner, the Conservatives have committed to raise your tax-free pension allowance.\nWe are on the side of pensioners, and our record speaks for itself. We introduced the triple lock which has seen the state pension go up by 8.5% this year. And if we are re-elected back into government, we will go further.\nLabour have point blank refused to match our pledge. (And if you are tempted to vote for Reform, you will most likely get a Labour MP and a Labour government.)\nPensioners have paid taxes their whole lives and they now deserve security and peace of mind in their retirement. Vote for me, Gareth Bacon, on 4th July.\nBetter NHS services\nWe've recruited more doctors, nurses, and GPs locally and have delivered hospital upgrades in Orpington. If you re-elect me as your Conservative MP, I'll keep campaigning for better NHS services.\nVote for me, Gareth Bacon, on 4th July.\nOrpington is a great place to live, work and raise a family because it's green. But Labour wants to weaken green belt protections. As your MP, I'll protect our local environment and the area's unique character.\nVote for me, Gareth Bacon, on 4th July.\nTogether, we've recruited 3,468 additional police officers across Greater London. But they're too often moved to central London. As your MP, I'll fight for more neighbourhood police officers across Orpington.\nVote for me, Gareth Bacon, on 4th July.\nIn London, we know what Labour politicians do when they get power: hike taxes, hit motorists and waste money. Our economic plan is working, and Britain is turning a corner. Don't let Labour ruin it.\nVote for me, Gareth Bacon, on 4th July.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_stop-the-family-farm-tax/content_7.html": "STOP THE FAMILY FARM TAX\n- garethbaconmp\n- Feb 21\n- 1 min read\nI visited a family run farm at Kevington Hall in Orpington — and spoke to farmers Jonathan and Tim about the impact that the government’s family farm tax will have on them.\nThis tax is going to hurt the farming industry and damage local food production. It must be stopped and I will keep opposing it.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_the-hypocrisy-of-ulez-backing-hounslow-council-is-appalling/content_19.html": "The hypocrisy of ULEZ-backing Hounslow council is appalling\n- Gareth Bacon\n- Mar 7, 2023\n- 3 min read\nUpdated: Mar 22, 2023\nThe consequences of Sadiq Khan’s disastrous ULEZ expansion are slowly dawning on out-of-touch Labour politicians. Whilst some outer London councils, like Bromley, Bexley, Harrow and Hillingdon, are standing up for their residents by launching a Judicial Review to challenge the unfair scheme in the courts, other, Labour-run councils are looking out for themselves.\nIn an act of almost unparalleled hypocrisy, ULEZ supporting Hounslow has asked for its fleet of vehicles to be exempted from paying the charge. This request was made on the basis that the council couldn’t possibly afford to replace its vehicles with compliant models in time.\nAnd yet they still expect their residents and businesses to fork out up to £4,500 a year in charges, or thousands more on new vehicles. With bills and costs rising and only a few months notice, it’s an utterly tone-deaf move for the council to call in a favour from the Mayor while wishing their voters nothing more than the best of luck. How are hard working tradespeople – already facing severe cost pressures – supposed to make their books add up when a London council can’t? How are people in outer London, poorly served by public transport, and living in areas with no real air pollution problem, supposed to adjust?\nBut rather than answer these genuine concerns about the ULEZ expansion, Sadiq Khan has turned to smear tactics. He used a People’s Question Time event last week to accuse outer Londoners opposed to his plans of being in bed with the far right, covid deniers, and vaccine deniers. In a revealing addition, the Mayor also included the “Tories” in this list of extreme groups.\nBecause that’s what this charge is about - targeting Conservative-voting outer London boroughs that he thinks he can ignore with a road tax to bankroll his failing administration. With little democratic accountability – no MP or councillor in London can vote the charge down – the Mayor is acting like a little Caesar. He's targeting outer London with taxes to pay for his mismanagement of Transport for London and fund his programmes in Labour areas.\nA 2019 report from the London Assembly revealed the sheer disparity in mayoral capital spending across the city in Khan’s first years in office. Conservative-voting Bromley and Bexley were the second and third lowest, receiving less than £100 million. In comparison, Labour-voting Newham received £2.1 billion, Tower Hamlets – then Labour controlled – £865 million, and Southwark more than £700 million.\nAnd while the Mayor spent freely on Labour areas, he lost London vast sums through an unwise fares freeze, Crossrail delays, and City Hall waste. It’s no wonder he’s planning a cash grab to pay for it all. The city coffers are already raking in millions of pounds from his previous ULEZ expansion to the North and South Circular roads. Now he’s planning to raise over £300 million by expanding it to places like my constituency of Orpington, where there’s relatively little public transport provision, and people have little choice but to drive.\nKhan’s advisors have reportedly realised that there’s a problem here. But they’re offering little to address the issue. While my constituents would welcome improved bus services, it is naive to think it will end car reliance in suburbs and rural villages. Nor will it persuade people living amongst the greenery of outer London that this charge is really about air quality, not cash.\nWhat the Labour Party needs to wake up to in places like Hounslow is how this charge will hurt the working people they claim to represent. The ULEZ expansion will hurt ordinary Londoners who can’t afford to buy a new vehicle or pay £12.50 a day to get around. If only more London Labour MPs and councils had the guts to stand up for their poorest residents who will be caught in the Mayor's highway robbery.\nArticle by Gareth Bacon MP first published by The Daily Telegraph.",
  "https_www_garethbacon_com_/https_www_garethbacon_com_post_update-on-the-walnuts-centre-redevelopment/content_14.html": "Update on the Walnuts Centre redevelopment\n- garethbaconmp\n- Apr 2\n- 1 min read\nProperty Developer Redcliff have published their latest indicative plans to redevelop the Walnuts Centre. From my understanding, these proposals would see 450 new homes within seven tower blocks in our town centre.\nThe developer has begun showing these plans to residents — but as things stand, no official planning application has been submitted to the council.\nIf and when the developer makes an application, I will once again be asking you for your views, (as I did with the previous planning application). I will fully consider them before writing my official response."
}