{
  "http_www_keithprince_london_/http_www_keithprince_london_contact/content_2.html": "I will try and help any way I can. I am always happy to hear from you on any issue you may have.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "http_www_keithprince_london_/http_www_keithprince_london_news_councillor-keith-prince-am-quizzes-assistant-commissioner-police-powers/content_22.html": "Councillor Keith Prince A.M., London Assembly Member for Havering & Redbridge, quizzed the Assistant Commissioner on police powers after arrests during the King's Coronation.\nCouncillor Keith Prince A.M., London Assembly Member for Havering & Redbridge, quizzed the Assistant Commissioner on police powers after arrests during the King's Coronation.",
  "http_www_keithprince_london_/http_www_keithprince_london_news_keith-prince-has-been-re-elected-assembly-member-havering-and-redbridge/content_16.html": "Keith Prince has been re-elected as the Assembly Member for Havering and Redbridge, increasing his majority for the third election in a row.\nKeith has been the Assembly Member for Havering and Redbridge since 2016. Previously Keith had served as the Leader of Redbridge Council and also a Councillor in the London Borough of Havering.\nKeith Prince said:\nA huge Thank You to the people of Havering and Redbridge who re-elected me as your Assembly Member.\nI was born in Elm Park, grew up in Hornchurch, went to school in Upminster, raised my children in Redbridge and now I live in Romford. Havering and Redbridge is my home, it always will be and I will continue to work hard for you and our community.\nI would also like to thank my fellow candidates who ran clean and positive campaigns.\nIt is unfortunate that Susan Hall didn’t make it across the line, but I will work hard to ensure that Havering and Redbridge gets it fair share of attention from Sadiq Khan, as our area is overlooked far too often.\nI will honour the trust you have put in me.\nKeith Prince AM\nLondon Assembly Member for\nHavering and Redbridge",
  "http_www_keithprince_london_/http_www_keithprince_london_news_haveringcarparks/content_14.html": "Plans for Havering Council to sell off car parks and pursue new housing projects have stalled after councillors criticised their lack of certainty.\nThe authority had put forward a complicated-sounding plan to sell six parcels of land in the borough to its sister holding company, Mercury Land Holdings Ltd, with a view to building homes.\nWhile it is expected to turn a profit for the council in the long-term, it would begin with Havering loaning Mercury £8.6million in equity to purchase its car parks, spread across Hornchurch and Romford.\nHavering would profit from the interest accrued on the loan, it has not disclosed the exact amount it expects to make, nor the value of the land – owing to “commercial sensitivities” – or the number of homes it would build across the six bits of land.\nThe council is keen to bring in as much money as it can, as quickly as it can, after taking on a £54m loan to cover its £32.5m budget gap.\nSo far, plans have only been put forward for six homes on the Keswick Avenue car park.\nOther car parks, such as Como Street in Romford, were described as “unpopular” and bringing in “nominal” amounts of revenue. The multi-storey car park in nearby Angel Way operates at an annual loss, the council says.\nHavering will retain other car parks in Hornchurch, such as Billet Lane and Appleton Way, which it expects will absorb the displaced demand from Keswick and Dorrington Way.\nThe decision to “dispose of” the land to Mercury – which is fully owned by the council – was tentatively approved in April, but a coalition of Conservative and Labour councillors challenged it at last night’s overview and scrutiny meeting (7 May).\nThough the scheme had already been approved at a previous cabinet meeting, scrutiny members attacked the lack of hard data and said a wider discussion was needed on the scheme’s logistics.\nConservative councillor David Taylor said the documents offered “no understanding” on its financial viability and he disapproved of the six sites being “lumped together,” rather than being approached individually.\nHe said: “We’re not just approving just one plan, but a multitude. Some might be loss-making but we don’t have enough information to know.\n“All we know is we’ll borrow £8m from the Public Works Loan Board, taking on £500,000 a year to service the debt.\n“We’ll only get repayments if and when Mercury gets planning permission, which is a self-admitted slow process. We’ll be carrying excess debt to loan money to a company that can’t tell us what they’re going to build.”\nThe debate soon reached a stalemate: councillors said they could not support the plan without seeing a clear breakdown of housing and costs, while housing officers argued they could not provide those figures before the land had been sold.\nTory councillor Keith Prince attacked the housing team’s assumptions the skeletal plan would yield a profit, asking:\n“What if it all goes pear-shaped?\nWhat if something like Thurrock happens? Who sucks up all the loss? None of the returns will come to fruition.\nLast June, Essex County Council published a report on Thurrock Council’s “serious” financial issues, which had been exacerbated by excessive borrowing.\nA housing official reassured Cllr Prince that Mercury was a “prudent” company and prioritised the minimisation of risk, but it was not enough to win the committee over.\nCouncillor Gerry O’Sullivan, chairing the committee, said: “We’re not in a position where we can guarantee return on council’s investment\n“Is this a sound investment today? There’s not enough information to see if this is going to be viable and I don’t want us to be another Thurrock.\n“I can’t see what we’re likely to achieve, and that worries me considerably.”\nThough a frustrated council housing executive said he could not see why the committee “struggled to understand something that is quite straightforward,” the scheme was put on hold by nine votes to zero (with one abstention).\nThough the process sounds convoluted, it is not uncommon. The decision to lend Mercury the funds to purchase land in Harold Hill to build nine homes was similarly challenged, but ultimately approved.\nMembers of the scrutiny committee said last night they had been able to approve such a scheme because an in-depth business case had been provided, which they were “yet to see” for the six sites.\nThe scheme will next be discussed at a council cabinet meeting and has been tentatively pencilled in for the upcoming session on Wednesday, 15 May.\nCouncillors made several recommendations for the housing team, requesting a detailed business plan for each individual site and to investigate why the council could not seek planning permission itself.\nThe full list of sites includes Como Street car park in Romford, Keswick Avenue in Hornchurch, Dorrington Gardens in Hornchurch, Angel Way in Romford, Century Youth House in Albert Road, Romford and land off Priory Road in Romford.\nThey would remain in operation until work began on each individual project, the council has said. In the meantime, the council would rent the land back from Mercury at a very low, or “peppercorn,” rate.\nAs reported in the Romford Recorder on May 9th 2024: www.romfordrecorder.co.uk/news/24308895.plan-sell-off-havering-car-park…",
  "http_www_keithprince_london_/http_www_keithprince_london_news_havering-council-ps54m-government-loan-should-be-grant/content_30.html": "Conservative councillors have urged the government to provide the £54million loan it gave Havering as a grant.\nIt has put forward a motion that will be debated at the full council meeting on Wednesday (March 27).\nIt says: \"The chamber calls on the Government to provide the funding as a grant instead of a loan.\"\nThe loan, also known as a capitalisation direction, of £54million was approved by Levelling Up Secretary Michael Gove last month to help Havering balance its budgets and prevent it from issuing a Section 114 notice, which would have effectively declared it bankrupt.\nThe authority had been facing a £32.5m budget gap for 2024/25, rising to £82.2m over four years.\nRead More: Havering Council saved from declaring bankruptcy this year\nThe Local Democracy Reporting Service previously reported it is understood that the council has borrowed the money at a normal interest rate plus one per cent repayable over a 20-year term period.#\nCalculations suggest that will equate to an interest of £2.13m that will need to be paid by the council over the next two decades.\nHavering Conservative leader, Councillor Keith Prince, said they feel that Havering has been “railroaded into taking this loan”.\nThe Department for Levelling Up has been contacted for comment.\nAs reported in the Romford Recorder on March 23 2024: https://www.romfordrecorder.co.uk/news/24201808.havering-council-54m-go…",
  "http_www_keithprince_london_/http_www_keithprince_london_about-rss/content_8.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_www_keithprince_london_/http_www_keithprince_london_news_category_Assembly-News/content_33.html": "Save Oakfield Playing Fields 10th October 2023 Keith Prince, London Assembly Member for Havering and Redbridge, has launched a petition regarding the proposed leasing of the of the Oakfield Playing Fields to... Assembly News\nKeith Prince A.M. questions the Met Police Commissioner on the Met Police's relationship with MOPAC 27th March 2023 In light of Baroness Casey's damning report on the Metropolitan Police, Keith Prince A.M. challenges Metropolitan Police Commissioner, Sir Mark Rowley, on the... Assembly News\nKeith Prince A.M. asks Sadiq Khan to look into Bus Cuts in Havering 26th March 2023 After the proposal by TFL that the 346 Bus Service would be cut and the 347 Bus Service would be removed, Keith Prince A.M. asks the Mayor of London, Sadiq Khan... Assembly News\nStanding with Ukraine 24th February 2023 Yesterday, the London Assembly welcomed representatives from Kyiv City Council to City Hall. Councillor Keith Prince A.M., London Assembly Member for Havering... Assembly News\nCllr Keith Prince A.M. asks Sir Tom Winsor if it's possible to impeach a 'rogue mayor' 13th December 2022 Councillor Keith Prince A.M., London Assembly Member for Havering and Redbridge asks Sir Tom Winsor whether there is the possibility to impeach a 'rogue mayor'. Assembly News\nCllr Keith Prince A.M. warns Sadiq Khan that struggling Londoners can't afford ULEZ charge 24th June 2022 Sadiq Khan is challenged by Councillor Keith Prince A.M. on his damaging ULEZ extension. The ULEZ extension will impact the people can least afford it the worst... Assembly News\nMeet Keith Prince A.M. 19th May 2021 Meet Keith Prince, London Assembly Member for Havering and Redbridge. Assembly News\nKeith Prince A.M. calls for motorbikes to be excluded from Khan's ULEZ charge | Mayor's Question Time 16th July 2020 Keith Prince A.M., London Assembly Member for Havering & Redbridge, calls for Sadiq Khan to excluded from Sadiq Khan's ULEZ charge. And he doesn't answer the... Assembly News\nSadiq Khan Has Given Black Cabs A Bad Deal | Keith Prince A.M. 5th September 2019 GLA Conservatives Transport Spokesman Keith Prince A.M., London Assembly Member for Havering & Redbridge, explains why Sadiq Khan has given black cabs a bad... Assembly News",
  "http_www_keithprince_london_/http_www_keithprince_london_news_eleventh-hour-sadiq-khan-found-ps30m-pay-rmt-what-cost-keith-prince-am/content_13.html": "Havering and Redbridge Assembly Member Keith Prince who is also City Hall Conservatives Transport spokesperson, commented of the London Mayor’s eleventh hour deal with the RMT to stave off this week’s tube strikes.\n“Sadiq Khan has been missing in action during this crisis. By refusing to use the Strikes (Minimum Service Level) Act 2023 to ensure 40% of Tubes run during industrial action, he enabled trade unions to effectively hold Londoners to ransom.\n“With the Mayoral election just four months away, he finally woke up to the devastating impact these strikes would have on Londoners and his re-election campaign.\n“At the eleventh hour, Sadiq Khan found an additional £30m to pay off the RMT but at what cost. This is a band aid solution designed to save Sadiq Khan’s skin that will come back to bite Londoners. It will embolden other unions to play hardball and demand higher pay.\n“Sadiq Khan has shown himself to be the Mayor for Trade Unions, not London or Business. It’s his union paymasters who are calling the shots not him. Londoners deserve better than this.”\nAs reported in The Havering Daily on January 9th 2024: www.thehaveringdaily.co.uk/2024/01/09/at-the-eleventh-hour-sadiq-khan-f…",
  "http_www_keithprince_london_/http_www_keithprince_london_cdn-cgi_l_email-protection/content_18.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_keithprince_london_/http_www_keithprince_london_privacy/content_6.html": "This document outlines how Keith Prince AM processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Keith Prince AM\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Keith Prince AM.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Keith Prince AM, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Keith Prince AM via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_keithprince_london_/http_www_keithprince_london_news_category_Media/content_7.html": "Romford and Hornchurch car park sales are 'madness', meeting told by Councillor Keith Prince AM 17th May 2024 Havering cabinet members have greenlit plans to eventually convert car parks despite the opposition leader calling it \"madness\". The cash-strapped council will... Local NewsMedia\nKeith Prince - Meet the AM 12th October 2023 Meet Keith Prince AM - London Assembly Member for Havering and Redbridge. Media",
  "http_www_keithprince_london_/http_www_keithprince_london_news_keith-prince-am-and-prospective-mp-sam-holland-launch-stop-rainham-quarry-survey/content_23.html": "Keith Prince, London Assembly Member for Havering and Redbridge, and Sam Holland the Conservative Prospective Parliamentary Candidate for Dagenham and Rainham, have launched the ‘Stop Rainham Quarry’ survey to gather views on the proposals for a new quarry in Rainham.\nIf approved, this new 50-acre site will be quarrying 2 million tonnes of sand and gravel for up to 20 years, with 114 two-way Heavy Goods Vehicle (HGV) movements per day.\nSpeaking of the proposals, Sam Holland told the Havering Daily: “People in Rainham are tired of not being listened to, what with the ongoing issues at Launders Lane, and the legacy impact of the Wennington fires. Rainham cannot cope with yet more heavy industry blighting local peoples lives. Its vital as many people speak up so Havering council get the message”.\nPlease complete the survey below expressing your views on these plans. The more completed surveys we have, the more that can be passed to Havering Council.",
  "http_www_keithprince_london_/http_www_keithprince_london_news_keith-prince-am-calls-london-mayor-ensure-londoners-can-get-and-work-next-week-after-planned/content_28.html": "Keith Prince, Assembly Member for Havering and Redbridge and Transport spokesman for City Hall Conservatives is calling on Sadiq Khan to use new minimum service laws to ensure Londoners can get to and from work during next week’s Tube strikes.\nTransport for London (TfL) has warned commuters of severe disruption on the London Underground network from the evening of Sunday 7 January through to the morning of Friday 12 January because of industrial action.\nMr Prince told the Havering Daily: “Sadiq Khan needs to decide if he is the Mayor for Londoners or the Mayor for trade unions. The Strikes (Minimum Service Level) Act gives Sadiq Khan the power to intervene in next week’s strikes to ensure minimum service levels on the Underground network.\n“In 2016, Sadiq Khan promised zero strikes on the Underground network. Next week’s industrial action will be the 140th strike under his watch – four times as many as the previous mayor. Sadiq Khan is both Mayor and Chairman of TfL. Londoners will know who to blame when the Tube network grinds to a halt once again next.”\nAs reported in The Havering Daily on January 4th 2024: https://thehaveringdaily.co.uk/2024/01/04/keith-prince-am-calls-on-lond…",
  "http_www_keithprince_london_/http_www_keithprince_london_about-keith-prince/content_3.html": "As someone who has spent most of their life in Havering and Redbridge, I have had the honour of representing constituents across both areas and working with our local communities and other organisations over the past 30 years.\nBeing A Councillor in Both Havering and Redbridge\nI was a councillor in Havering for many years but moved to Redbridge when I started a family. All three of my children were raised and educated in Redbridge, and I served as a councillor in Redbridge for 15 years until I stood down in advance of the 2018 local elections. In 2022 I re-entered life as a local Councillor after being elected to serve the residents of Squirrels Heath ward in Havering. My time living, and helping constituents, across both boroughs, has allowed me to understand, and work to deal with, the issues we all have.\nMy Time on The London Assembly\nMy work in City Hall itself, involves holding the Mayor of London to account, and serving on committees such as the Policing & Crime, and Transport Committees. The most rewarding parts of my role on the London Assembly have included:\n- Working with local and London-wide youth groups, charities, sporting and other organisations, to tackle antisocial behaviour and knife crime.\n- Working with local and London-wide homelessness charities, to find practical solutions for homelessness across our area and London.\n- Working with local and regional employers, to provide job and training opportunities for residents and especially our young people.\nI use my position by giving my time, publicity, making connections, securing assets and funding. If you are involved with or know a group that may benefit from our work, please do contact me and I’m always happy to see what can be done.\nLet’s Make Further Progress, Together\nIt has been a real privilege for me to be in a position where I can make a difference to my local community and the City I love, but I have only been able to make that difference because of your support.\nMy Responsibilities\nHavering and Redbridge Constituency Responsibilities:\n- Represent residents and Londoners views at City Hall\n- Hold the Mayor to Account\n- Ensure the Mayor puts Havering and Redbridge residents FIRST.\n- Work with local Councils, Local MP's and Councillors to improve services\nLondon Assembly Responsibilities:\n- Member of the Transport Committee.\n- Member of the Police and Crime Committee.\n- Member of the GLA Oversight Committee.",
  "http_www_keithprince_london_/http_www_keithprince_london_news_keith-prince-meet-am/content_31.html": "Redbridge Conservatives are working with local residents to oppose TfL’s plans to reinstate the unpopular and unneeded bus lane in Woodford Avenue.Residents are clear that before the bus lanes were ‘temporarily suspended’ they caused a huge amount of unnecessary traffic.",
  "http_www_keithprince_london_/http_www_keithprince_london_news_category_Articles/content_10.html": "\"What if it all goes pear-shaped?\" asks Keith Prince regarding the sale of Havering Council car parks for development 9th May 2024 Plans for Havering Council to sell off car parks and pursue new housing projects have stalled after councillors criticised their lack of certainty. The... Articles\nKeith Prince re-elected as Havering and Redbridge GLA Member vowing to tackle knife crime as a priority 8th May 2024 Mr Prince said the current London Mayor has not dealt with knife crime, stating \" I’m sorry but I don’t think the mayor has a handle on it or the right approach... Articles\nHavering Council £54m government loan 'should be grant' 23rd March 2024 Conservative councillors have urged the government to provide the £54million loan it gave Havering as a grant. It has put forward a motion that will be debated... Articles\n‘Londoners are more concerned about the daily chaos across the Tube network’-Keith Prince hits out at Mayor’s new overground line names. 16th February 2024 ‘ Sadiq Khan’s priorities as Chairman of TfL are all wrong.’ Yesterday, London Mayor Sadiq Khan announced London Overground Lines will be given new names. The... Articles\n‘With the Met halfway through an essential reform programme Sadiq Khan now refuses to give the Met the funding it needs to finish the job’-Keith Prince AM 11th January 2024 City Hall Conservatives have uncovered a £70m blackhole in the Met Police budget for 2024/25 which threatens the Met’s reform programme. Commenting on the Mayor... Articles\n‘At the eleventh hour Sadiq Khan found £30m to pay off the RMT but at what cost?’- Keith Prince AM 9th January 2024 Havering and Redbridge Assembly Member Keith Prince who is also City Hall Conservatives Transport spokesperson, commented of the London Mayor’s eleventh hour... Articles\nKeith Prince AM calls on London Mayor to ensure Londoners can get to and from work next week after planned strikes 4th January 2024 Keith Prince, Assembly Member for Havering and Redbridge and Transport spokesman for City Hall Conservatives is calling on Sadiq Khan to use new minimum service... Articles",
  "http_www_keithprince_london_/http_www_keithprince_london_news_romford-and-hornchurch-car-park-sales-are-madness-meeting-told-councillor-keith-prince-am/content_12.html": "Havering cabinet members have greenlit plans to eventually convert car parks despite the opposition leader calling it \"madness\".\nThe cash-strapped council will sell six bits of land - including four car parks - to its own holding company, Mercury Land Holdings Ltd, which would then seek planning permission for the sites. In the meantime, Mercury Land Holdings would lease the land back to the council at a very low, or “peppercorn,” rate.\nDespite protests from councillors that it was “absolute madness,” Havering’s cabinet agreed to push ahead with converting the car parks, in Hornchurch and Romford, at a meeting on Wednesday, May 15.\nIt is expected to bring in almost £9million for the authority, which is keen to make money as quickly as possible after accepting a £54m loan from central government in February.\nThe scheme had been initially approved on April 22 – in line with the council’s agreed ‘capital strategy’ – but a coalition of Conservative and Labour councillors called the decision in for scrutiny on Tuesday, May 7.\nPlans were put forward to build six three-bedroom homes on the Keswick Avenue car park in Hornchurch last month, shortly after the scheme was first agreed, but councillors criticised the lack of a wider business plan.\nAt the meeting, Tory leader Keith Prince said it made the scheme “difficult to understand,” with fellow Conservative David Taylor having previously argued the council should not transfer funds without knowing how much it stands to profit.\nKathy Freeman, Havering’s chief financial officer, maintained it cannot produce a breakdown for each site until planning permission has been secured, which some councillors said was “putting the cart before the horse”.\nAlongside Keswick Avenue, the council has also earmarked Como Street car park in Romford, Dorrington Gardens in Hornchurch, Angel Way in Romford, Century Youth House in Albert Road, Romford and land off Priory Road in Romford for housing.\nComo Street has been selected for a “significant” project.\nCouncil leader Ray Morgon said that plans for each site would be subject to scrutiny in the future.\nFinancially sensitive breakdowns have been produced for each site, but they are exempt from the public.\nCllr Morgon added that anything more in-depth was “impractical at this stage”.\nCouncillors had also attacked the nature of the scheme, which would involve transferring the sites to Mercury Land Holdings in exchange for equity in the company.\nDuring a lengthy debate, Cllr Prince said he “cannot understand the madness of what we’re doing”.\nHe called it “farcical,” saying the council was simply moving its assets around “to look like something’s happening,” but Ms Freeman argued the authority could stand to profit.\nThe council would be given a capital receipt of around £8.69m, valuable for companies or enterprises saddled with debt. It aims to raise £20m in receipts by March 31 2025 – or as close to then as possible – and has so far raised £8.75m.\nOnce the council has a capital receipt, reflecting the value of the land, it may later profit from an overage clause. An overage clause, or ‘clawback,’ can allow a seller to benefit if the value of the land increases after a sale.\nAfter Cllr Prince suggested the council could also profit now by creating a public bidding war, she said the revenue would be greater further down the line.\nDespite the loss of £190,000 in annual revenue from the car parks, council officials are confident a housing scheme would balance out.\nThe call-in was dismissed by the majority of cabinet members. Had it been approved, the scheme would not go ahead.\nAs reported in the Romford Recorder on Friday 17 May 2024 - www.romfordrecorder.co.uk/news/24328265.romford-hornchurch-car-park-sal…",
  "http_www_keithprince_london_/https_www_keithprince_london_support-campaign-help-our-area/content_26.html": "The last year has been hugely difficult for everyone and the decisions that Sadiq Khan has taken has not helped local people in Havering and Redbridge. We need a new Mayor who will stand up for outer London, and listen to our priorities.\nAs I continue to get my message out, and show people across our Boroughs how I am working for them, I need your help.\nPlease consider making a donation to my campaign, or get involved to help get my message out.\n-\n£10 donation would buy 100 envelopes\n-\n£20 donation would buy 50 leaflets\n-\n£50 donation would buy 1000 leaflets\n-\n£100 donation would buy approx. 150 stamps\nTo donate please click on the button below, where you can pay by card. Alternatively, please send a cheque payable to Havering and Redbridge Conservatives and please send to Margaret Thatcher House, 85 Western Rd, Romford RM1 3LS.\nIf you would like to volunteer some of your time to the campaign, please send me an email to let me know how you can help. There's a range of roles, including:\n- Contacting voters by telephone\n- Entering data\n- Delivering leaflets every now and again\nIf you would like to apply for a postal vote, please visit, www.gov.uk/government/publications/apply-for-a-postal-vote or email me so that I can post you a form.\nThank you for your support. Together we can stand up for Havering and Redbridge in City Hall.\nAs always if you have any issues, I can assist with please do get in touch.\nVery best wishes,\nKeith Prince AM",
  "http_www_keithprince_london_/http_www_keithprince_london/content_1.html": "Keep up to date on Facebook\nKeep up to date on Twitter\nContact Keith Prince\nKeith Prince AM\nRedbridge Conservatives\n9 Seven Ways Parade, Woodford Ave, Ilford IG2 6XH\n020 8551 4333\nRomford Conservatives\nMargaret Thatcher House, 85 Western Road, Romford, Essex, RM1 3LS\n01708 761583\nHornchurch & Upminster Conservatives\n23 Butts Green Road, Hornchurch, RM11\n01708443321",
  "http_www_keithprince_london_/http_www_keithprince_london_news/content_9.html": "PETITION: Stop the reintroduction of the Woodford Bus Lane Tuesday, 25 February, 2025 Redbridge Conservatives are working with local residents to oppose TfL’s plans to reinstate the unpopular and unneeded bus lane in Woodford Avenue. Residents are clear that before the bus lanes were ‘temporarily suspended’ they caused a huge amount of unnecessary traffic. Although TfL has claimed they consulted with residents at the time, many of those living on Woodford Avenue or nearby have... Local News\nRomford and Hornchurch car park sales are 'madness', meeting told by Councillor Keith Prince AM 17th May 2024 Havering cabinet members have greenlit plans to eventually convert car parks despite the opposition leader calling it \"madness\". The cash-strapped council will... Local NewsMedia\nSave Havering's Libraries 14th May 2024 Havering Council has proposed in its 'Havering Library Strategy 2024-29' that it will CLOSE FOUR libraries across Havering, this will deprive local communities... Local News\n\"What if it all goes pear-shaped?\" asks Keith Prince regarding the sale of Havering Council car parks for development 9th May 2024 Plans for Havering Council to sell off car parks and pursue new housing projects have stalled after councillors criticised their lack of certainty. The... Articles\nKeith Prince re-elected as Havering and Redbridge GLA Member vowing to tackle knife crime as a priority 8th May 2024 Mr Prince said the current London Mayor has not dealt with knife crime, stating \" I’m sorry but I don’t think the mayor has a handle on it or the right approach... Articles\nKeith Prince has been re-elected as Assembly Member for Havering and Redbridge 5th May 2024 Keith Prince has been re-elected as the Assembly Member for Havering and Redbridge, increasing his majority for the third election in a row. Keith has been the... Local News\nHavering Council £54m government loan 'should be grant' 23rd March 2024 Conservative councillors have urged the government to provide the £54million loan it gave Havering as a grant. It has put forward a motion that will be debated... Articles\n‘Londoners are more concerned about the daily chaos across the Tube network’-Keith Prince hits out at Mayor’s new overground line names. 16th February 2024 ‘ Sadiq Khan’s priorities as Chairman of TfL are all wrong.’ Yesterday, London Mayor Sadiq Khan announced London Overground Lines will be given new names. The... Articles\n‘With the Met halfway through an essential reform programme Sadiq Khan now refuses to give the Met the funding it needs to finish the job’-Keith Prince AM 11th January 2024 City Hall Conservatives have uncovered a £70m blackhole in the Met Police budget for 2024/25 which threatens the Met’s reform programme. Commenting on the Mayor... Articles\n‘At the eleventh hour Sadiq Khan found £30m to pay off the RMT but at what cost?’- Keith Prince AM 9th January 2024 Havering and Redbridge Assembly Member Keith Prince who is also City Hall Conservatives Transport spokesperson, commented of the London Mayor’s eleventh hour... Articles",
  "http_www_keithprince_london_/http_www_keithprince_london_havering-redbridge/content_25.html": "Havering & Redbridge Constituency\nHavering & Redbridge is one of 14 constituencies in the Greater London Authority, which sends one representative to the London Assembly. Keith Prince has been the local Assembly Member since 2016.\nAt local government level, the constituency is split into the two London Boroughs of Havering and Redbridge and split into 7 Parliamentary Constituencies.\nRomford (Havering):\n- Havering-atte-Bower\n- Hylands & Harrow Lodge\n- Marshalls & Rise Park\n- Mawneys\n- Rush Green & Crowlands\n- Squirrels Heath\n- St. Alban's\n- St. Edward's\nHornchurch & Upminster (Havering):\n- Cranham\n- Emerson Park\n- Gooshays\n- Hacton\n- Harold Wood\n- Heaton\n- St. Andrew's\n- Upminster\nDagenham & Rainham (Part Havering):\n- Beam Park\n- Elm Park\n- Rainham & Wennington\n- South Hornchurch\nChingford & Woodford Green (Part Redbridge):\n- Churchfields (Part)\n- Monkhams\n- South Woodford (Part)\nIlford North (Redbridge):\n- Aldborough\n- Barkingside\n- Bridge\n- Churchfields (Part)\n- Clayhall\n- Fairlop\n- Fullwell\n- Hainault\n- South Woodford (Part)\nIlford South (Redbridge):\n- Chadwell\n- Clementswood\n- Cranbrook\n- Goodmayes\n- Ilford Town\n- Loxford\n- Mayfield\n- Newbury\n- Seven Kings\n- Valentines\n- Wanstead Park (Part)\nLeyton & Wanstead (Part Redbridge):\n- South Woodford (Part)\n- Wanstead Park (Part)\n- Wanstead Village\nIf you live in Havering and want to find out who your local Councillors are and get in touch with them, click here.\nIf you live in Redbridge and want to find out who you local Councillors are and get in touch with them, click here.",
  "http_www_keithprince_london_/http_www_keithprince_london_accessibility/content_5.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_keithprince_london_/http_www_keithprince_london_news_met-halfway-through-essential-reform-programme-sadiq-khan-now-refuses-give-met-funding-it/content_20.html": "City Hall Conservatives have uncovered a £70m blackhole in the Met Police budget for 2024/25 which threatens the Met’s reform programme.\nCommenting on the Mayor’s refusal to continue to fund the Met reform programme, City Hall Conservatives spokesman Keith Prince AM told the Havering Daily: “I’m astonished Sadiq Khan is refusing to provide £70m to fund essential reforms to London’s Met Police.\n“The Met’s reforms – the New Met for London Plan – is a two-year programme to deliver community policing and stamp out racism, misogyny and homophobia in the force.\n“With the Met now halfway through this essential reform programme, Sadiq Khan is refusing to give the Met the funding it needs to finish the job. In case he hasn’t noticed, crime in London is out of control and trust in the Met is at a record low. These reforms are essential. They’re not a nice to have.\n“This week Sadiq Khan found £30m to pay off the RMT to stop Tube strikes and announced £130m to provide free school meals for another year. Yet he refuses to fund essential police reforms. Sadiq Khan is putting his own self-interest ahead of the needs of our great city and Londoners.”\nAs reported in The Havering Daily on January 11th 2024: www.thehaveringdaily.co.uk/2024/01/11/with-the-met-halfway-through-an-e…",
  "http_www_keithprince_london_/http_www_keithprince_london_news_category_Opinions/content_24.html": "All people like Tony Blair do is talk us down all the time\" - Keith Prince AM 1st July 2022 Keith Prince AM on Nana Akua's show on GB News discussing the Brexit Referendum and how people like Tony Blair talk us down all the time. Opinions",
  "http_www_keithprince_london_/http_www_keithprince_london_welcome-my-website/content_29.html": "I'm Cllr Keith Prince your local Havering & Redbridge Conservative London Assembly Member.\nHere you can find my latest news, campaigns, and more about me - if you have an issue or idea you would like to share then please get in touch.\nI'm Cllr Keith Prince your local Havering & Redbridge Conservative London Assembly Member.\nHere you can find my latest news, campaigns, and more about me - if you have an issue or idea you would like to share then please get in touch.\nI'm Cllr Keith Prince your local Havering & Redbridge Conservative London Assembly Member.\nHere you can find my latest news, campaigns, and more about me - if you have an issue or idea you would like to share then please get in touch.",
  "http_www_keithprince_london_/http_www_keithprince_london_events_feed/content_21.html": null,
  "http_www_keithprince_london_/http_www_keithprince_london_news_feed/content_15.html": null,
  "http_www_keithprince_london_/http_www_keithprince_london_survey/content_17.html": "Redbridge Conservatives are working with local residents to oppose TfL’s plans to reinstate the unpopular and unneeded bus lane in Woodford Avenue.Residents are clear that before the bus lanes were ‘temporarily suspended’ they caused a huge amount of unnecessary traffic.",
  "http_www_keithprince_london_/http_www_keithprince_london_SaveOurLibraries/content_4.html": "Havering Council has proposed in its 'Havering Library Strategy 2024-29' that it will CLOSE FOUR libraries across Havering, this will deprive local communities of much needed services which they may not have at home e.g. printing services and internet access.\nIn Havering Council's own strategy they say that:\n\"Our libraries aren’t just buildings that have books in them. They are places where people find inspiration, education and enjoyment. They are places that improve physical and mental health, help people become less lonely, provide free internet access and the help to use it and encourage participation in all facets of life in the borough. Trained library staff aren’t people whose job it is to put books on shelves – they are people with empathy and knowledge who are there to help people achieve their aspirations.\"\nSo why on earth are they proposing to close four of our libraries down when they do so much good in our local communities?\nLabour and the Havering Residents Association are proposing to close 4 of the following libraries:\n- Collier Row\n- Elm Park\n- Harold Wood\n- Gidea Park\n- South Hornchurch\nThe Conservatives, at the last budget meeting, found savings of £448,000 this would have meant we could have kept these libraries open. But, the Havering Residents Association and Labour-run Havering Council voted down our proposals and opted to not take these savings.\nThey also, failed to mention their intentions to close our libraries during the budget process and it wasn't in their election manifesto.\nLabour and the Havering Residents Association have no mandate for these closures, the Conservatives are fighting to keep our libraries open for the benefit of our local communities across Havering.\nSign our petition below to SAVE OUR LIBRARIES:\nPetition Close Date: 02/08/2024\nThis petition will be presented to the Council on September 4th, the first Full Council Meeting after the consultation closes.\nConsultation proposed by Havering Council which includes the closure of the aforementioned libraries: https://consultation.havering.gov.uk/libraries/havering-council-librari…",
  "http_www_keithprince_london_/http_www_keithprince_london_cookies/content_19.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "http_www_keithprince_london_/http_www_keithprince_london_news_londoners-are-more-concerned-about-daily-chaos-across-tube-network-keith-prince-hits-out/content_27.html": "‘Sadiq Khan’s priorities as Chairman of TfL are all wrong.’\nYesterday, London Mayor Sadiq Khan announced London Overground Lines will be given new names. The Emerson Park line known locally as the ‘push and pull’, will now be known as The Liberty Line.\nResponding to this announcement, City Hall Conservatives Transport Spokesman Keith Prince said:\n“This is a wasted opportunity. Sadiq Khan and TfL could have earned tens of millions of pounds by offering naming rights to Overground train lines. This money could have been invested in much needed upgrades to Central Line trains and other infrastructure.\n“Sadiq Khan’s priorities as Chairman of TfL are all wrong. Londoners are more concerned about the daily chaos across the Tube network including long delays on the Central Line and disruption on the Elizabeth Line. They are very concerned about how they will get to and from work next week when the RMT strikes for four days – a record 140th TfL strike under Sadiq Khan’s watch.\n“This Mayor prefers to make shiny announcements rather than do the hard yards. Londoners must vote Sadiq Khan out on 2 May and elect Susan Hall as Mayor.”\nAs reported in The Havering Daily on February 16th 2024: https://thehaveringdaily.co.uk/2024/02/16/londoners-are-more-concerned-…",
  "http_www_keithprince_london_/http_www_keithprince_london_news_category_Local-News/content_11.html": "PETITION: Stop the reintroduction of the Woodford Bus Lane 25th February 2025 Redbridge Conservatives are working with local residents to oppose TfL’s plans to reinstate the unpopular and unneeded bus lane in Woodford Avenue. Residents... Local News\nRomford and Hornchurch car park sales are 'madness', meeting told by Councillor Keith Prince AM 17th May 2024 Havering cabinet members have greenlit plans to eventually convert car parks despite the opposition leader calling it \"madness\". The cash-strapped council will... Local NewsMedia\nSave Havering's Libraries 14th May 2024 Havering Council has proposed in its 'Havering Library Strategy 2024-29' that it will CLOSE FOUR libraries across Havering, this will deprive local communities... Local News\nKeith Prince has been re-elected as Assembly Member for Havering and Redbridge 5th May 2024 Keith Prince has been re-elected as the Assembly Member for Havering and Redbridge, increasing his majority for the third election in a row. Keith has been the... Local News\nKeith Prince AM and Prospective MP Sam Holland launch ‘Stop Rainham Quarry’ survey 19th December 2023 Keith Prince, London Assembly Member for Havering and Redbridge, and Sam Holland the Conservative Prospective Parliamentary Candidate for Dagenham and Rainham... Local News\nLet Keith know what you think 13th June 2023 This is Cllr. Keith Prince A.M.'s survey for Havering & Redbridge, let Keith know what you think. Local News\nCouncillor Keith Prince A.M. quizzes Assistant Commissioner on Police Powers 8th June 2023 Councillor Keith Prince A.M., London Assembly Member for Havering & Redbridge, quizzed the Assistant Commissioner on police powers after arrests during the King... Local News\nCllr. Keith Prince A.M. supports TfL's latest bid for funding to refurbish Gallows Corner 26th May 2023 Havering’s Leader of the Opposition and GLA Member for Havering & Redbridge Councillor Keith Prince A.M., has added further support to the bid to refurbish... Local News\nCllr. Keith Prince A.M. elected as Leader of the Havering Conservatives 23rd May 2023 Cllr. Keith Prince A.M., London Assembly Member for Havering & Redbridge was elected as Leader of the Havering Conservative group on Tuesday. In a statement... Local News",
  "http_www_keithprince_london_/http_www_keithprince_london_news_cllr-keith-prince-am-elected-leader-havering-conservatives/content_34.html": "Cllr. Keith Prince A.M., London Assembly Member for Havering & Redbridge was elected as Leader of the Havering Conservative group on Tuesday.\nIn a statement, Keith said \"It's a great honour and privilege to take up such an important role on the Council which enables me to serve the people of this great borough.\"\nYou can find Keith's statement in full at the bottom of this page.",
  "http_www_keithprince_london_/http_www_keithprince_london_WABusLane/content_32.html": "Redbridge Conservatives are working with local residents to oppose TfL’s plans to reinstate the unpopular and unneeded bus lane in Woodford Avenue.\nResidents are clear that before the bus lanes were ‘temporarily suspended’ they caused a huge amount of unnecessary traffic. Although TfL has claimed they consulted with residents at the time, many of those living on Woodford Avenue or nearby have confirmed to us that they were not consulted. We have struggled to find anyone who received a consultation letter at the time.\nLocal people have told us that they do not think there’s any case for Woodford Avenue bus lanes and that the previous lanes actually increased traffic.\nThere is now a new consultation with TfL seeking to re-introduce the Woodford Avenue Bus Lanes with reduced timings. So if you oppose TfL trying to push these bus lanes through against the wishes of local people then please respond to the consultation and make your opposition known:"
}