{
  "https_www_rosindell_com_/https_www_rosindell_com_contact/content_2.html": "If you contact Andrew via e-mail it is essential that you include your full name, address, telephone number and details of the issue that you would like help with, or Andrew and his team may be unable to help you. For all general or press enquiries, please contact Andrew's Advice & Information Centre: 01708 766 700.\nI would like to be kept up-to-date by Andrew Rosindell M.P. on future issues that matter to me:",
  "https_www_rosindell_com_/https_www_rosindell_com_campaigns_fixing-gallows-corner/content_10.html": "Gallows Corner Shortlisted for £50m Government Funding\nAndrew Rosindell said \"Gallows Corner is one of the most dangerous road junctions in Greater London, after having made representations for its improvement over many years, I am happy to see it shortlisted as one of first five improvement schemes in Government's Major Road Network.\"\n\"Transport secretary Chris Grayling announced on Monday 1st October that Gallows Corner has been shortlisted as one of the first five potential local road schemes in the government’s major road network programme.\nThe programme allows councils to bid for improvements to local A-roads and it’s part of the biggest road investment since the 1970s as each of the shortlisted schemes will be eligible for up to £50m of funding.\"\nhttp://www.romfordrecorder.co.uk/news/gallows-corner-shortlisted-for-go…\nhttps://www.facebook.com/AndrewRosindellofficial/videos/443572442713896…\nSaturday 11 May 2024:\nStatement from Andrew Rosindell M.P. following the announcement that there will be a revamp sponsored by central government:\nThe news just announced that at last, a new plan to revamp the Gallows Corner flyover junction, is welcome.\nFor over thirty years, as both a Havering Councillor and M.P. for Romford, I have been a tireless advocate for the improvement of Gallows Corner, fighting to secure funding and action by the Government, Mayor of London and Transport for London.\nOnly recently, I raised the issue again in House of Commons during Questions to the Secretary of State for Transport.\nWhilst the plans that are now being proposed do not represent the far-reaching change that I had argued for, where the whole layout of the Gallows Corner junction would be , reconstructed, with a new under pass similar to that which has been built on the A406 North Circular, this proposal will be an improvement, albiet many years overdue.\nI would like to thank all elected representatives that has worked so hard and campaigned for the improvements that are now going ahead, including previous local Members of Parliament for Romford, Hornchurch and Upminster of all political parties, as well as our two Greater London Assembly Members since 2000, Roger Evans and Keith Prince, various Leaders of Havering Council and also some local councillors, most especially Cllr. Ray Best, who made this his personal mission to achieve a new and better layout for the Gallows Corner junction.\nDespite our collective efforts, lobbying every Secretary of State for Transport and every London Mayor, it is very disappointing that the recent announcement falls short of the comprehensive restructuring I have long campaigned for. The proposed refurbishment of the flyover is a step forward, but it doesn't address the fundamental issues of congestion and safety that have plagued this dangerous junction for decades. It is a sticking plaster solution, not a long-term plan for something permanent and better.\nThe lack of far-reaching investment in the A12/A127 junction contrasts starkly with the attention given to other major roads like the North Circular. Our community deserves equitable treatment when it comes to infrastructure investment, yet it seems we've been left wanting once again. Our situation in being caught between the Greater London Authority one side and Essex County Council on the other, never serves us well!\nAs Member of Parliament for Romford, I will continue to push for the comprehensive overhaul that Gallows Corner desperately needs. We cannot afford to settle for half-measures when the safety and well-being of local people and those passing through our borough to and from Essex and London, are at stake .\nWednesday 20 March 2024:\nSpeaking in the House at Transport Questions earlier today, Andrew Rosindell M.P., Member of Parliament for Romford, demanded the Secretary of State for Transport that a refurbishment for Gallows Corner - a project which is half-a-century overdue - takes place.\nThis is the latest in a long campaign with the aim of providing road safety for all those who travel across the A12 / A127 intersection.\nFor nearly half a century the people of Romford, and those of wider Essex and east London, have been waiting for the Gallows Corner A12/A127 junction to be reconstructed. Is it not time we had some investment for the people of Romford? It seems to go everywhere else; let us have some in the London borough of Havering, please.\nAndrew Rosindell M.P.\nAs my hon. Friend knows, the Government are passionately committed to improving the A12. Only recently it was the subject of litigation brought by one individual. I will happily sit down with my hon. Friend, who for many a year has been a doughty campaigner for Romford. I entirely agree with him that this needs to be addressed.\nGuy Opperman M.P., Parliamentary Under-Secretary of State for Roads and Local Transport\nTuesday 7 March 2024:\nThe Government announced a revamp of Gallows Corner, which includes the strengthening and refurbishing of the existing Gallows Corner flyover. The Department for Transport earmarked a maximum of £57.3 million for this project.\nAndrew's statement on this was as follows:\nThe news just announced that at last, a new plan to revamp the Gallows Corner flyover junction, is welcome.\nFor over thirty years, as both a Havering Councillor and M.P. for Romford, I have been a tireless advocate for the improvement of Gallows Corner, fighting to secure funding and action by the Government, Mayor of London and Transport for London.\nOnly recently, I raised the issue again in House of Commons during Questions to the Secretary of State for Transport.\nWhilst the plans that are now being proposed do not represent the far-reaching change that I had argued for, where the whole layout of the Gallows Corner junction would be , reconstructed, with a new under pass similar to that which has been built on the A406 North Circular, this proposal will be an improvement, albiet many years overdue.\nI would like to thank all elected representatives that has worked so hard and campaigned for the improvements that are now going ahead, including previous local Members of Parliament for Romford, Hornchurch and Upminster of all political parties, as well as our two Greater London Assembly Members since 2000, Roger Evans and Keith Prince, various Leaders of Havering Council and also some local councillors, most especially Cllr. Ray Best, who made this his personal mission to achieve a new and better layout for the Gallows Corner junction.\nDespite our collective efforts, lobbying every Secretary of State for Transport and every London Mayor, it is very disappointing that the recent announcement falls short of the comprehensive restructuring I have long campaigned for. The proposed refurbishment of the flyover is a step forward, but it doesn't address the fundamental issues of congestion and safety that have plagued this dangerous junction for decades. It is a sticking plaster solution, not a long-term plan for something permanent and better.\nThe lack of far-reaching investment in the A12/A127 junction contrasts starkly with the attention given to other major roads like the North Circular. Our community deserves equitable treatment when it comes to infrastructure investment, yet it seems we've been left wanting once again. Our situation in being caught between the Greater London Authority one side and Essex County Council on the other, never serves us well!\nAs Member of Parliament for Romford, I will continue to push for the comprehensive overhaul that Gallows Corner desperately needs. We cannot afford to settle for half-measures when the safety and well-being of local people and those passing through our borough to and from Essex and London, are at stake .\nMonday 23 October 2024: Andrew reached out to the Rt Hon. Mark Harper MP, the Secretary of State for Transport, urging the government to provide financial support for the enhancement of the Gallows Corner junction and flyover in Romford, Essex. The current infrastructure, which has been in use for more than half a century, is considered one of the riskiest road sections in the South-East, plagued by significant traffic congestion and safety issues.\nIn his letter, Mr. Rosindell stressed that this area is notorious for its high-risk status in the South-East due to substantial congestion and safety problems. He also pointed out that Transport for London (TfL) has previously cautioned that there may be a need to close the existing structure by 2025. Such a decision, without a replacement structure already in the planning stages, would have devastating consequences for his constituents and those living in neighboring Essex areas.\nAdditionally, Mr. Rosindell drew attention to TfL's bid for £50 million in government funding to revamp Gallows Corner. However, he cautioned that this might not be sufficient to fully replace the structure and thus urged the government to allocate a portion of the £1 billion of available funding for road projects specifically for the replacement of Gallows Corner.\nIn conclusion, Mr. Rosindell appealed for an allocation of resources from the £1 billion funding pool for road projects to be directed towards the replacement of Gallows Corner, emphasizing the substantial benefits such an investment would bring to the Havering and Essex communities, both in economic terms and in enhancing the safety of local residents.\nNews reports indicate that TfL is considering scrapping the planned upgrades to Gallows Corner. TfL has been suffering from a funding crisis in recent months and according to the Romford Recorder \"City Hall is having to consider the feasibility of the most expensive options, after the covid-19 pandemic wreaked havoc on Transport for London’s (TfL) finances.\"\nIn the 2nd of October 2020 edition of the Romford Recorder, Andrew's column focused on Gallows Corner, and his frustration at the reports. Writing, he said:\nFighting for a Gallows Corner Upgrade\nOn Thursday 10th of September yet another person tragically lost their life at the Gallows Corner junction. Stories of serious injuries and fatalities at Gallows Corner are far too common. With the “temporary” flyover marking its 50th birthday this year, I for one will not be wishing it many happy returns!\nInstead I want to reassure the people of Romford that I am doing everything in my power to end this intolerable situation. For too long this flyover has been allowed to stand, despite the traffic, the accidents and the continuous maintenance it requires. A member of my staff recently went on street view on Google Maps and was stunned when he saw its appearance, shuddering at the thought of driving over it.\nOur government is understandably focused on other pressing issues – defeating the coronavirus and the great national project of BREXIT, both of which I know my constituents care deeply about. However, the government has also committed to levelling up the country, including making improvements to our national infrastructure.\nUnfortunately, TfL and the Mayor of London, Mr Khan do not seem to agree! Although Gallows Corner was shortlisted for potential improvements in the government’s ‘Major Road Network’, reports indicate that TfL are considering scrapping the upgrades. TfL’s funding crisis is not just an indictment of its own failings, it’s a reminder that we have a Mayor more interested in his image and in the central part of London, than in improving our infrastructure in the Essex end of Greater London!\nAs Romford’s M.P., I dismayed by this! Abandoning vital infrastructure projects will only further compound the economic damage caused by this pandemic and working with our London Assembly Member, Keith Prince A.M., I will do everything I can to prevent the project from being abandoned and continue the fight for a new junction layout at Gallows Corner.",
  "https_www_rosindell_com_/https_www_rosindell_com_cdn-cgi_l_email-protection/content_4.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_rosindell_com_/https_www_rosindell_com_news_category_Speeches-in-Parliament/content_6.html": "Romford MP calls for local money to be spent on local people 7th April 2025 In parliamentary debates on road maintenance and East Midlands local authorities last night, Andrew Rosindell M.P., Member of Parliament for Romford, made some... Local NewsSpeeches in ParliamentWestminster News\nRomford MP: The Commonwealth should embrace the Republic of Ireland - St. Patrick's Day Debate 2025 28th March 2025 Yesterday, Andrew Rosindell M.P., Member of Parliament for Romford, during a debate on St. Patrick's Day, made his admirations clear of Irish, Anglo-Irish and... Speeches in Parliament\nShadow Minister urges a tough stance on China 26th March 2025 On Wednesday, responding on behalf of His Majesty's Loyal Opposition, Andrew Rosindell M.P., Shadow Minsiter for Foreign Affairs, questioned the Government on... Speeches in Parliament\nAndrew Rosindell MP demands a fundamental overhaul to the funding arrangements for Greater London 26th March 2025 Earlier today, in a Westminster Hall debate on Local Government funding in Greater London, Andrew Rosindell M.P. demanded a total reform and rehaul of Greater... Local NewsSpeeches in ParliamentWestminster News\nAndrew Rosindell M.P. draws attention to carbon monoxide deaths abroad 12th February 2025 Yesterday, i n a Westminster Hall debate, Andrew Rosindell M.P., Shadow Foreign Affairs Minister, made a statement on behalf of His Majesty's Loyal Opposition... Speeches in ParliamentWestminster News\nAndrew Rosindell condemns Labour's economically incoherent budget! 31st October 2024 Following on from the Chancellor's budget yesterday, Andrew Rosindell M.P. denounced what he argues to be an economically incohrerent budget which will do... Speeches in Parliament\nAndrew Rosindell's Defence of Britain's Constitution 15th October 2024 In this passionate and stirring speech, Andrew Rosindell MP delivers a heartfelt defence of the British Constitution with emphasis on the role of hereditary... Speeches in Parliament\nAndrew Rosindell Defends Britain's Christian Heritage 23rd March 2024 On Thursday at a Westminster Hall debate on Easter and Christian Culture, Andrew spoke up on behalf of Christians and all those who value our Christian heritage... Speeches in Parliament\nAndrew Rises for Leaseholders! 27th February 2024 Earlier today, Andrew Rosindell M.P. made a contribution in the House of Commons, during the report stage of the Leasehold and Freehold Reform Bill. He made... Local NewsSpeechesSpeeches in ParliamentWestminster News",
  "https_www_rosindell_com_/https_www_rosindell_com_andrews-parliamentary-questions/content_8.html": "\"Written questions allow MPs and Members of the House of Lords to ask for information on the work, policy and activities of Government departments, related bodies, and the administration of Parliament. Oral or written statements to Parliament are also made by the Government and others to inform both Houses of their work. Written statements are normally used to put the day-to-day business of Government on the official record and in the public domain.\nAn Oral Question is a parliamentary question that is put to a government minister in person by an MP or member of the House of Lords in the Chamber of each House. Oral question times to ministers normally take place at the beginning of each sitting day in both Houses on Mondays to Thursdays.\"\n- U.K. Parliament website\nYou can read Andrew's latest written parliamentary questions below:",
  "https_www_rosindell_com_/https_www_rosindell_com_news_andrew-rosindells-e-bulletin/content_5.html": "SIGN UP TO ANDREW'S E-BULLETIN\nA very warm welcome to my M.P.'s e-Bulletin!\nI will be sending this newsletter out on the 1st day of every month to all subscribers. You can sign up here.\nThis will provide a useful update for my constituents and others who take an interest in my work as an M.P. and want to hear about what’s going on in Romford and Westminster.\nI love Romford and the people who live here in my home town. So, I am always seeking new ways to stay in touch with local people, although you can still get in touch with me using the traditional methods, of course.\nI will use this e-Bulletin to explain my views on key policy areas, as well as to address any concerns that my constituents have.\nAs always, I am happy to speak to my constituents directly on whatever local or national issue is important to them.\nIf you want to get in touch, please e-mail me at [email protected] and further contact details are available below.\nRemember to always include your address, postcode and telephone number when e-mailing me, so that I can get back in touch with you easily.\nRomford M.P.'s e-Bulletin - April 2025\nRomford M.P.'s e-Bulletin - March 2025\nRomford M.P.'s e-Bulletin - February 2025\nRomford M.P.'s e-Bulletin - January 2025\n2025\nRomford M.P.'s e-Bulletin - December 2024\nRomford M.P.'s e-Bulletin - November 2024\nRomford M.P.'s e-Bulletin - October 2024\nRomford M.P.'s e-Bulletin - September 2024\nRomford M.P.'s e-Bulletin - August 2024\nRomford M.P.'s e-Bulletin - General Election Special / June 2024\nRomford M.P.'s e-Bulletin - May 2024\nRomford M.P.'s e-Bulletin - April 2024\nRomford M.P.'s e-Bulletin - March 2024\nRomford M.P.'s e-Bulletin - February 2024\nRomford M.P.'s e-Bulletin - January 2024\n2024\nRomford M.P.'s e-Bulletin - December 2023\nRomford M.P.'s e-Bulletin - November 2023\nRomford M.P.'s e-Bulletin - October 2023\nRomford M.P.'s e-Bulletin - September 2023\nRomford M.P.'s e-Bulletin - August 2023\nRomford M.P.'s e-Bulletin - July 2023\nRomford M.P.'s e-Bulletin - June 2023\nRomford M.P.'s e-Bulletin - May 2023\nRomford M.P.'s e-Bulletin - April 2023\nRomford M.P.'s e-Bulletin - March 2023\nRomford M.P.'s e-Bulletin - February 2023\nRomford M.P.'s e-Bulletin - January 2023\n2023\nRomford M.P.'s e-Bulletin - December 2022\nRomford M.P.'s e-Bulletin - November 2022\nRomford M.P.'s e-Bulletin - October 2022\nRomford M.P.'s e-Bulletin - September 2022\nRomford M.P.'s e-Bulletin - August 2022\nRomford M.P.'s e-Bulletin - July 2022\nRomford M.P.'s e-Bulletin - June 2022\nRomford M.P.'s e-Bulletin - May 2022\nRomford M.P.'s e-Bulletin - April 2022\nRomford M.P.'s e-Bulletin - March 2022\nRomford M.P.'s e-Bulletin - Feburary 2022\nRomford M.P.'s e-Bulletin - January 2022\n2022\nRomford M.P.'s e-Bulletin - December 2021\nRomford M.P.'s e-Bulletin - November 2021\nRomford M.P.'s e-Bulletin - October 2021\nRomford M.P.'s e-Bulletin - September 2021\nRomford M.P.'s e-Bulletin - August 2021\nRomford M.P.'s e-Bulletin - July 2021\nRomford M.P.'s e-Bulletin - June 2021\nRomford M.P.'s e-Bulletin - May 2021\nRomford M.P.'s e-Bulletin - April 2021\nRomford M.P.'s e-Bulletin - March 2021\n2021",
  "https_www_rosindell_com_/https_www_rosindell_com_news_transport-london-must-not-abandon-gallows-corner/content_11.html": "On Thursday 10th of September yet another person tragically lost their life at the Gallows Corner junction. Stories of serious injuries and fatalities at Gallows Corner are far too common. With the “temporary” flyover marking its 50th birthday this year, I for one will not be wishing it many happy returns!\nInstead I want to reassure the people of Romford that I am doing everything in my power to end this intolerable situation. For too long this flyover has been allowed to stand, despite the traffic, the accidents and the continuous maintenance it requires. A member of my staff recently went on street view on Google Maps and was stunned when he saw its appearance, shuddering at the thought of driving over it.\nOur government is understandably focused on other pressing issues – defeating the coronavirus and the great national project of BREXIT, both of which I know my constituents care deeply about. However, the government has also committed to levelling up the country, including making improvements to our national infrastructure.\nUnfortunately, TfL and the Mayor of London, Mr Khan do not seem to agree! Although Gallows Corner was shortlisted for potential improvements in the government’s ‘Major Road Network’, reports indicate that TfL are considering scrapping the upgrades. TfL’s funding crisis is not just an indictment of its own failings, it’s a reminder that we have a Mayor more interested in his image and in the central part of London, than in improving our infrastructure in the Essex end of Greater London!\nAs Romford’s M.P., I dismayed by this! Abandoning vital infrastructure projects will only further compound the economic damage caused by this pandemic and working with our London Assembly Member, Keith Prince A.M., I will do everything I can to prevent the project from being abandoned and continue the fight for a new junction layout at Gallows Corner.",
  "https_www_rosindell_com_/https_www_rosindell_com_campaigns_keep-our-libraries-open/content_7.html": "Andrew Rosindell M.P. Opposes the Closure of Gidea Park and Collier Row Libraries!\nThe HRA-Labour administration have announced that they are intending on closing the Gidea Park and Collier Row Libraries. This is an action which was opposed by Andrew back in 2000 when the Labour administration sought to do the very same thing.\nIn response, Andrew Rosindell M.P. started a petition which were delivered to residents in Gidea Park and Collier Row and were made available at shops in Collier Row and Gidea Park to sign.\n23 years ago, I led the successful campaign to ‘Save Gidea Park Library’ which the then Labour administration in Havering Town Hall wanted to shut down. Today, Labour are back in the administration, so once again, Gidea Park and also Collier Libraries are under threat of closure! Gidea Park and Collier Row are major communities within Havering and local people deserve to retain their local libraries. Havering Council must re-think their plans and look at inovative ideas to keep our vital Library services open! If you want to join the campaign to Save Gidea Park and Collier Row Libraries, please e-mail me to [email protected] and tell Havering Council what you think, by taking part in the consultation now taking place. Here is the link: https://consultation.havering.gov.uk/libraries/havering-council-libraries-consultation/\nOn the 16th May, Andrew wrote to Cllr. Paul Middleton, Cabinet Member for libraries in Havering, emphasising his objections to these plans which he believes show a lack of foresight for what could be superb community hubs for a range of local organisations. You can read Andrew's letter in the files section at the bottom of this article.\nToday I have formally objected to Havering Council’s proposals to close Gidea Park and Collier Row Libraries. As Romford’s MP, I will fight to save our local libraries, just as I did when Labour were last running our Town Hall and tried to shut them down before! Here in my letter to Cllr. Paul Middleton, HRA Cabinet Member responsible for libraries in Havering. The council need to re-think this short sighted policy and come up with a better plan that keeps local services open to continue serving our local communities in Romford!\nAhead of the end of the consultation, Andrew once again wrote to Cllr. Paul Middleton to formally register the outcome of the petition. Again, a copy of this letter can be found below.\nSince the last time I wrote to you objecting to the proposed closures, over 600 local people have taken time to make their opposition to these plans known to me. They deserve to have their views listened to by Havering Council.",
  "https_www_rosindell_com_/https_www_rosindell_com_news_category_Articles/content_3.html": "Havering Daily: ‘Romford Deserves better’-Andrew Rosindell MP Calls For Urgent Action Over Town Centre Neglect. 1st May 2025 Read the article in full here. “The photographs speak for themselves,” said Mr. Rosindell. “What we are witnessing is a shameful and unacceptable descent into... ArticlesLocal News\nDaily Mail: More than half of Brits fear vulnerable people will be pressured into assited dying as Commons showdown looms 30th April 2025 Andrew has been featured in the Daily Mail today for his comments on the Assited Dying Bill. Their comments were as follows: Tory MP Andrew Rosindell, an... ArticlesWestminster News\nRomford Recorder: A Better Future for Havering 25th April 2025 A better future for Havering \"With a disastrous Labour government running our country into the ground; a Labour Mayor of Greater London bleeding boroughs like... ArticlesLocal News\nThe Critic: We should dissent from our allies on assisted suicide 15th April 2025 We should dissent from our allies on assisted suicide Their examples show the dangers of legalisation BY Andrew Rosindell MP From The Critic and can be read in... ArticlesMedia\nExpress: Britain must perform one key pivot to boost UK's security and prosperity 25th March 2025 \"Last month we recognised Commonwealth Day, and Conservative Party MPs have joined the relaunch of the Conservative Commonwealth Group as patrons, offering... ArticlesMedia\nRomford Recorder: Havering is not London 21st March 2025 Romford Recorder: Havering is not London \"Havering is at a turning point. We, the local people of this borough must now discuss and argue freely about options... ArticlesLocal News\nThe Standard: MP calls for ‘self-determination’ for Chagos on eve of ‘Margaret Thatcher Day’ 10th January 2025 From the Standard: MP calls for ‘self-determination’ for Chagos on eve of ‘Margaret Thatcher Day’ Friday 10th January 2025 Andrew Rosindell, Conservative MP for... Articles\nConservative Home: The CPTPP is Global Britain’s next step towards CANZUK 12th December 2024 Andrew Rosindell is the MP for Romford and the Vice-President of the Conservative Friends of CANZUK), Peter Bedford is the MP for Mid Leicestershire and a... Articles\nRomford Recorder: Cherishing Life this Christmas 6th December 2024 Cherishing Life This Christmas \" I celebrate the magnificent community spirt that exists throughout Romford, with churches, schools, voluntary groups and... ArticlesLocal News",
  "https_www_rosindell_com_/https_www_rosindell_com_news_shadow-minister-urges-tough-stance-china/content_9.html": "On Wednesday, responding on behalf of His Majesty's Loyal Opposition, Andrew Rosindell M.P., Shadow Minsiter for Foreign Affairs, questioned the Government on China's human rights abuses, Hong Kong, Taiwan, their proposed new 'super embassy', and the Chancellor's visit this year.\nI thank my hon. Friend the Member for Farnham and Bordon (Gregory Stafford) for securing this important debate. UK-China relations will be increasingly important as we progress, and as the threat of China becomes more evident. I thank all hon. Members for their contributions. It seems there is a consensus about the threat that China poses, although it is not entirely unanimous; the hon. and learned Member for Folkestone and Hythe (Tony Vaughan) seems to have a slightly different approach. I believe that China is one of the greatest threats—if not the greatest threat—to our freedom and security, which is why it is vital to address this issue.\nChina is a nation with a proud history and a rich civilisation, deserving of respect—but that respect cannot come at the expense of turning a blind eye to aggression, human rights abuses and attempts to undermine the international order. The Government have announced that they are conducting a China audit, but we are yet to hear what that actually entails. It is not enough for Ministers to review our policy towards China behind closed doors; the British people deserve transparency and Parliament deserves answers.\nI will make some progress, then come to the hon. Member if there is time.\nI begin with the issue of Taiwan-Republic of China. Beijing’s increasingly assertive behaviour towards Taiwan—including military activity around the island, airspace incursions and naval operations—is a cause of growing concern. I ask the Minister: does the UK remain committed to the One China policy? If so, how do the Government intend to balance that position with our strong interest in supporting Taiwan’s democracy and the principle that the future of Taiwan should be determined peacefully and without coercion? The people of Taiwan should have the freedom to shape their own future without the threat of force. What steps are the Government taking, alongside the United States, Japan and Australia, to reduce tensions and deter any escalation in the Taiwan strait? Taiwan is a proud democracy and deserves to have its freedom. It should not be coerced—and, as an ally of Taiwan, we should certainly be standing shoulder to shoulder with it.\nNext, I would like to say a few words about the belt and road initiative. Beijing claims that that programme is about infrastructure and development, but in reality it serves as a tool for strategic dominance and debt entrapment across Africa, Asia, and even parts of Europe. We have seen the consequences of that so-called investment: developing nations find themselves shackled by unsustainable debt, forced to hand over key infrastructure and strategic assets when they cannot meet Beijing’s demands. What is the Government’s strategy to counter that growing influence? How are we supporting our Commonwealth partners and other vulnerable nations to resist that economic model, and will the Minister tell us what alternative we are offering to the developing world, to avoid those nations being trapped in Beijing’s orbit?\nTurning to Hong Kong, the Chinese Communist party’s flagrant violation of the Sino-British joint declaration is seriously jeopardising the “one nation, two systems” framework. Beijing has crushed political opposition, tried to silence the free press, and criminalised dissent. In light of that, I ask the Minister what our long-term strategy is for holding Beijing accountable for breaking its treaty obligations. How are we supporting British nationals overseas who have made the courageous decision to leave Hong Kong and settle in the United Kingdom, and who may be at risk of transitional repression?\nThe case of Jimmy Lai stands as a stark symbol of Beijing’s assault on press freedom and political dissent in Hong Kong. Lai, a British citizen and a founder of Apple Daily, has been targeted under Hong Kong’s draconian national security law for the so-called crime of defending democracy. His prosecution is not just an attack on an individual, but an attempt to silence independent journalism and intimidate anyone who dares to criticise the CCP’s actions in Hong Kong. What steps are the Government taking to protect the rights of British citizens such as Jimmy Lai who are facing politically motivated prosecutions in Hong Kong? Does the Minister agree that this politically motivated trial must end and that Jimmy Lai must be released, and what is the Government’s strategy for making the case that the national security law should be replaced?\nThe CCP’s human rights abuses in Xinjiang are well documented, with forced labour, mass internment, and systematic persecution of the Uyghur population. It is therefore deeply concerning that the Government appear to be resisting efforts to block the procurement of Chinese solar panels linked to forced labour through the Great British Energy Bill. I ask the Government directly: what assurances can Ministers provide that the UK’s transition to net zero will not come at the cost of complicity in modern slavery? How will the Government ensure that supply chains for renewable energy infrastructure are free from forced labour and other human rights abuses?\nAs the Leader of the Opposition rightly pointed out in her recent speech, the idea of achieving net zero by 2050 while relying heavily on Chinese technology and supply chains is “fantasy politics”. We cannot afford an over-reliance on China, as should have become clear following the pandemic. What steps are the Government taking to reduce strategic dependence on China, particularly in critical industries such as energy, telecommunications and rare earth minerals?\nThe proposed Chinese super-embassy in London raises concerns about Beijing’s growing influence in the UK. The unprecedented size and scope of that facility has prompted worries about potential security risks and pressure on Chinese dissidents. Reports of covert Chinese police stations in the UK add to those fears. Have the Government assessed the national security risks involved, and will they consider restricting or scaling down that proposal? More broadly, what steps are the Government taking to prevent foreign powers from using British soil for covert operations or political intimidation? I want to make the case again—as my party has said before—that China should be on the enhanced tier of the foreign influence registration scheme.\nFinally, I must raise the Chancellor of the Exchequer’s recent visit to China. What, if any, assurances did the Chancellor seek on human rights during her visit on Hong Kong, the Uyghurs or Taiwan and how do the Government intend to ensure that any future economic engagement with China does not compromise our strategic interests? China presents one of the big geopolitical challenges of our age, not just to Britain, but to the entire free world; we cannot afford to be naive. Engagement must be grounded in realism, not wishful thinking. We must work with our allies to check aggression and defend our democratic values. The British people deserve to know where their Government stand, and the Government must be prepared to act and not just talk.\nAndrew Rosindell M.P., Member of Parliament for Romford, Shadow Minister for Foreign Affairs",
  "https_www_rosindell_com_/https_www_rosindell_com/content_1.html": "Latest News from Romford!\nGet in touch with Andrew\nIs Andrew your MP?\nEnter your postcode to confirm that Andrew Rosindell M.P. is your candidate.\nLooking After Romford - Fighting for England - Putting Britain First!\nIt is an honour and a privilege to represent my hometown of Romford, which I have done since 2001. I am happy to speak to any resident directly on whatever local or national issue is important to them, so please don't hesitate to get in touch with me. If you want to get in touch, please e-mail me [email protected]\nEnter your postcode to confirm that Andrew Rosindell M.P. is your candidate.\nFollow Andrew's speeches and appearances in the House of Commons via theyworkforyou\nRead Andrew's contributions in Westminster in the official Parliamentary records via Hansard\nTo view Andrew's latest appearances in Parliament visit his YouTube Channel\nSee Andrew's written questions to ministers on the House of Commons website"
}