{
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk/content_1.html": "The official Green party website for North Northants & West Northants\nIf you’re a resident of Kettering, please visit the Kettering Green Party website.\nFor all other areas, please use the find your local party tool.\nWe’re working hard to improve Northamptonshire, such as…\n🚮\nRegularly holding litter picks to make the area clean and safe for local residents.\n📃\nSurveying residents in ongoing basis to find out what local issues are important, to identify problems in the area.\n🌳\nProtecting local trees and encouraging more to be planted. Cleaning up the air, and help with soil health\n🌻\nPlanting wildflowers to increase biodiversity to help the bees and other pollinators.\n🚍\nHelping improve active travel and public transport to reduce air pollution and congestion.\n👇Our latest litter picks 👇\n👆Cleaning up local areas👆\n👇Being active in your area👆\nNews\nFind out what we’ve been up to, about issues in your area, and see the work we’ve done in the past.\n- Greens unveil portable Pedestrian Crossings\n- Celebrating Success in Northamptonshire: Green Party Achieves Milestone\n- West Northants has the most warehouses in the country\n- Will Morris selected as Parliamentary Candidate for Wellingborough By-Election\n- Elections 2021 – Your Green Candidates\nFeeling inspired? Join Us\nThe Green Party is the political party of the climate and environmental movement, and we need you to join the party of the future.\nWe would love for you to join us. 👇\nGet involved to help get Greens elected. ☝️\nA Green Councillor can make a world of difference to your local area.",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_feed/content_21.html": null,
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_2025_04_01_portable-pedestrian-crossings/content_13.html": "Today on 1st of April 2025, the Northamptonshire Green Party unveiled their innovative plans to introduce portable pedestrian crossings, aiming to enhance pedestrian safety and navigation across Northampton’s bustling streets. This initiative addresses growing concerns among residents about increased traffic and the lack of action by the current council to prioritise walking, cycling, and public transport.\nThe portable pedestrian crossings, originally designed by William Heath Robinson in the 1970s, offer a modern solution to contemporary urban challenges. These crossings work by unfurling a black and white zebra pattern where pedestrians need to cross. According to the Highway Code, drivers must stop and give way to pedestrians using these crossings. Once the pedestrian has safely crossed, the portable crossing can be easily rolled back up and carried away.\nThis innovative approach not only empowers pedestrians to create safe crossing points as needed, but also encourages more sustainable transportation methods. By providing a flexible and visible solution, the Northamptonshire Greens hope to install confidence in pedestrians and promote a shift away from car-dominated streets. This initiative aligns with broader efforts to invest in sustainable transport infrastructure, fostering a healthier and more environmentally friendly urban environment.\nThe Northamptonshire Green Party’s plan reflects a commitment to addressing modern urban challenges with innovative solutions. As the demand for safer and more sustainable transport options grows, these portable crossings offer a practical and adaptable tool for enhancing pedestrian safety and promoting active travel.",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_tag_april-fools/content_10.html": "Greens unveil portable Pedestrian Crossings 2025-04-01 / 2025-03-31 by jackgold Today on 1st of April 2025, the Northamptonshire Green Party unveiled their innovative plans to introduce portable pedestrian crossings, aiming to enhance pedestrian safety and navigation across Northampton’s bustling streets. This initiative addresses growing concerns among residents about increased traffic and the lack of action by the current council to prioritise walking, cycling, and public […] Read more » April-Fools",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_2024_01_22_will-morris-selected-as-parliamentary-candidate-for-wellingborough-by-election/content_2.html": "Will Morris has been selected to stand as Green Party candidate for the Wellingborough Parliamentary Constituency in the next election. This will be as the result of the by-election triggered by the recent recall petition in respect of Peter Bone MP.\nWill Morris, 55, and his wife have lived in the constituency for 23 years, spending the first ten years in Wellingborough and now living in Bozeat. He works as an insurance underwriter – a job he’s been doing for almost 30 years. He has two children, aged 21 and 17, who were raised and educated in the constituency. Will is a long-time season ticket-holder at Northampton Saints.\nWill has been a member of the Green Party for five years and takes an active interest in local politics. He previously stood as Green Party candidate for North Northants Council in Irchester and Rushden South.\nHe says, “What Wellingborough needs is a representative who knows and cares about local issues, rather than someone concerned with furthering their personal agenda in the national political arena. Local matters will always come first for me.”\nWill has served on Bozeat Parish Council for three years. He is the Chair of BEES, its Environment and Ecology Working Group.\nWill is proud to have been selected as the Green Party candidate for the Wellingborough constituency and is looking forward to giving residents the opportunity to vote for a fairer, greener, Wellingborough. He hopes to build on the success the party has had in local elections throughout Northamptonshire. The Green Party already has a strong presence in the county, with three councillors serving on North Northamptonshire Council and holding 15 seats on town and parish councils.",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_category_general-election-2024/content_22.html": "2024-07-05 / 2024-07-09 by jackgold\nAfter months of dedicated campaigning, leafleting, and canvassing in Northampton, Kettering, and Corby, we are thrilled to announce a significant achievement. For the first time in the county, all Green Party candidates have scored at least 5% of the vote, allowing them to retain their deposits. This milestone reflects the growing support for a positive, […]\nRead more »",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_author_jackgold/content_5.html": "2025-04-01 / 2025-03-31 by jackgold\nToday on 1st of April 2025, the Northamptonshire Green Party unveiled their innovative plans to introduce portable pedestrian crossings, aiming to enhance pedestrian safety and navigation across Northampton’s bustling streets. This initiative addresses growing concerns among residents about increased traffic and the lack of action by the current council to prioritise walking, cycling, and public […]\nRead more »\n2024-07-05 / 2024-07-09 by jackgold\nAfter months of dedicated campaigning, leafleting, and canvassing in Northampton, Kettering, and Corby, we are thrilled to announce a significant achievement. For the first time in the county, all Green Party candidates have scored at least 5% of the vote, allowing them to retain their deposits. This milestone reflects the growing support for a positive, […]\n2024-02-06 / 2024-03-18 by jackgold\nRecently, the Office for National Statistics revealed that Northampton has the most warehouses in the UK. This is primarily attributed to its proximity to London, extensive green areas for building and well-established rail networks. However, the unrestrained construction of warehouses for short term profit on greenfield sites, instead of brownfield sites (land previously developed on), […]\n2024-01-22 / 2024-07-05 by jackgold\nWill Morris has been selected to stand as Green Party candidate for the Wellingborough Parliamentary Constituency in the next election. This will be as the result of the by-election triggered by the recent recall petition in respect of Peter Bone MP. Will Morris, 55, and his wife have lived in the constituency for 23 years, […]\n2021-04-10 / 2024-07-05 by jackgold\nThe first elections for West Northamptonshire Council will take place on May 2021. This council has been formed because of the effective collapse of the Conservative controlled Northamptonshire County Council following the 2017 elections. The West Northamptonshire Green Party is fielding more candidates across the area than ever before, so more residents will have the […]\n2020-05-13 / 2024-05-14 by jackgold\nThe Northants Green Party has this week written to Council Leaders across Northamptonshire, asking them to take simple steps to support pedestrians and cyclists as restrictions on movement are eased in the next few weeks. Last weekend the government created a £250 million emergency fund to support councils to deliver pop-up cycle lanes with protected […]",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_category_uncategorised/content_7.html": "2025-04-01 / 2025-03-31 by jackgold\nToday on 1st of April 2025, the Northamptonshire Green Party unveiled their innovative plans to introduce portable pedestrian crossings, aiming to enhance pedestrian safety and navigation across Northampton’s bustling streets. This initiative addresses growing concerns among residents about increased traffic and the lack of action by the current council to prioritise walking, cycling, and public […]\nRead more »\n2024-02-06 / 2024-03-18 by jackgold\nRecently, the Office for National Statistics revealed that Northampton has the most warehouses in the UK. This is primarily attributed to its proximity to London, extensive green areas for building and well-established rail networks. However, the unrestrained construction of warehouses for short term profit on greenfield sites, instead of brownfield sites (land previously developed on), […]\n2020-05-13 / 2024-05-14 by jackgold\nThe Northants Green Party has this week written to Council Leaders across Northamptonshire, asking them to take simple steps to support pedestrians and cyclists as restrictions on movement are eased in the next few weeks. Last weekend the government created a £250 million emergency fund to support councils to deliver pop-up cycle lanes with protected […]",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_follow/content_8.html": "You can read our blog and social media posts via RSS. Simply click to follow our feeds in your RSS reader.\nBlog / Bluesky / Mastodon\nYou can read our blog and social media posts via RSS. Simply click to follow our feeds in your RSS reader.\nBlog / Bluesky / Mastodon",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_news/content_9.html": "Greens unveil portable Pedestrian Crossings 2025-04-01 / 2025-03-31 by jackgold Today on 1st of April 2025, the Northamptonshire Green Party unveiled their innovative plans to introduce portable pedestrian crossings, aiming to enhance pedestrian safety and navigation across Northampton’s bustling streets. This initiative addresses growing concerns among residents about increased traffic and the lack of action by the current council to prioritise walking, cycling, and public […] Read more » April-Fools\nCelebrating Success in Northamptonshire: Green Party Achieves Milestone 2024-07-05 / 2024-07-09 by jackgold After months of dedicated campaigning, leafleting, and canvassing in Northampton, Kettering, and Corby, we are thrilled to announce a significant achievement. For the first time in the county, all Green Party candidates have scored at least 5% of the vote, allowing them to retain their deposits. This milestone reflects the growing support for a positive, […] Read more »\nWest Northants has the most warehouses in the country 2024-02-06 / 2024-03-18 by jackgold Recently, the Office for National Statistics revealed that Northampton has the most warehouses in the UK. This is primarily attributed to its proximity to London, extensive green areas for building and well-established rail networks. However, the unrestrained construction of warehouses for short term profit on greenfield sites, instead of brownfield sites (land previously developed on), […] Read more » Legacy\nWill Morris selected as Parliamentary Candidate for Wellingborough By-Election 2024-01-22 / 2024-07-05 by jackgold Will Morris has been selected to stand as Green Party candidate for the Wellingborough Parliamentary Constituency in the next election. This will be as the result of the by-election triggered by the recent recall petition in respect of Peter Bone MP. Will Morris, 55, and his wife have lived in the constituency for 23 years, […] Read more » Legacy\nElections 2021 – Your Green Candidates 2021-04-10 / 2024-07-05 by jackgold The first elections for West Northamptonshire Council will take place on May 2021. This council has been formed because of the effective collapse of the Conservative controlled Northamptonshire County Council following the 2017 elections. The West Northamptonshire Green Party is fielding more candidates across the area than ever before, so more residents will have the […] Read more » Legacy\nNorthants Green Party demands support for cyclists and pedestrians. 2020-05-13 / 2024-05-14 by jackgold The Northants Green Party has this week written to Council Leaders across Northamptonshire, asking them to take simple steps to support pedestrians and cyclists as restrictions on movement are eased in the next few weeks. Last weekend the government created a £250 million emergency fund to support councils to deliver pop-up cycle lanes with protected […] Read more » Legacy",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_contact/content_12.html": "Skip to content\nSkip to footer\nNorthamptonshire\nMenu\nAir quality\nContact\nJargon Buster\nNews\nRSS\nTeam\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nYour name\nSubject\nYour email\nSuitable phone number (optional)\nMessage\nTo top",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_2020_05_13_northants-green-party-demands-support-for-cyclists-and-pedestrians/content_19.html": "The Northants Green Party has this week written to Council Leaders across Northamptonshire, asking them to take simple steps to support pedestrians and cyclists as restrictions on movement are eased in the next few weeks.\nLast weekend the government created a £250 million emergency fund to support councils to deliver pop-up cycle lanes with protected space for cycling, wider pavements, safer junctions, and temporary infrastructure that enables people to walk or cycle whilst maintaining social distancing.\nNew statutory guidance has also been published on reallocating road space, making it clear that the Government “expects local authorities to make significant changes to their road layouts to give more space to cyclists and pedestrians”.\nAs part of this, we would like to see “School Streets” implemented outside Primary Schools across the town, and 20 mph zones widened in residential areas to enable parents and children to travel to schools safely without relying on motor vehicles.\nWe would also like the Council to consider how they can make our Town Centres more safe for people to cycle in, and look at closing some routes to motor vehicles to enable more active travel, and consider where they can widen pavements to make the town centres safer for pedestrians.\nGreen Party campaigner Steve Miller said, “We’ve been saying for years that the Council has to make our roads safe for pedestrians and cyclists. Now that the government is on board with this idea, we’d love to see Northamptonshire County Council, Northampton Borough Council and Kettering Borough Council grasp this opportunity. It just needs political will and some imagination, and we are keen to support our Councils to take measures that help ensure social distancing can be maintained across the town as people go back to work and schools are asked to reopen.”",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_jargon-buster/content_3.html": "Look, we 100% get the fact that not everyone has time to research or dissect political jargon. This page explains political terms that one may commonly come across in simple terms.\nBy-Election\nAn election that happens unexpectedly outside a term. This could be due to the passing of a councillor or MP, or they decide to step down or are forced to resin.\nCouncillor\nAn elected representative who serves on a local council, such as West Northants council. They represent the people living in their ward and make decisions on local matters like schools, roads, public services, and housing. Councillors (should) work to improve their community and act as a voice for the residents in local government decisions.\nConstituencies\nA constituency is the specific geographical area that is represented by each MP in the House of Commons. People (you) who live in an MP’s constituency are known as their constituents.\nGeneral Election\nA country-wide election where people vote for MPs in all constituencies. The party with the most MPs usually forms the government, and it happens every 5 years (unless called earlier or due to a by-election).\nHouse of Commons\nLower chamber of Parliament, where elected MPs sit. This is where most debates and decisions on laws take place, and it’s the primary legislative body in the UK.\nHouse of Lords\nUpper chamber of the UK Parliament. Its members are not elected, but are appointed or inherit their position. They review and suggest changes to laws passed by the House of Commons.\nLocal Election\nLocal elections are held to choose representatives, like councillors, for local councils (e.g., parish, district, or city councils). These elections focus on issues specific to local areas, not national issues.\nMP\nSomeone elected by the people in a certain area (constituency) to represent them in the House of Commons, which is part of the UK Parliament. MPs debate and vote on laws and decisions affecting the whole country.\nNorth Northants\nOtherwise, known as North Northamptonshire, is a unitary authority that formed in 2021, covering the northern part of Northamptonshire. It includes towns such as Kettering, Corby, Wellingborough, and Rushden. Like West Northants, it is responsible for local services in its region.\nNorthamptonshire\nNorthamptonshire, is otherwise known as Northants in the East Midlands of England. Before 2021, it had a two-tier system of local government, with a county council (Northamptonshire County Council) and several district and borough councils. In 2021, the governance structure changed, and Northamptonshire was split into two unitary authorities: West Northamptonshire and North Northamptonshire. While Northamptonshire remains a geographic term, the two unitary authorities now manage all the local services.\nParish Council\nA parish council is the most local level of government in the UK, covering small villages or rural areas. It deals with local matters like parks, community events, and sometimes local planning.\nWard\nA local area or district within a town or city, such as Northampton. It is used for electing councillors in local elections. A councillor represents the people living in a ward at the local council.\nWest Northants\nOtherwise, known as West Northamptonshire, is a unitary authority in England, which means it operates as a single local government responsible for all local services. It was created in 2021 and covers the western part of the historic county of Northamptonshire. It includes areas like Northampton, Daventry, and Towcester. This authority manages things like education, roads, and housing for these areas.",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_category_by-election-2024/content_4.html": "2024-01-22 / 2024-07-05 by jackgold\nWill Morris has been selected to stand as Green Party candidate for the Wellingborough Parliamentary Constituency in the next election. This will be as the result of the by-election triggered by the recent recall petition in respect of Peter Bone MP. Will Morris, 55, and his wife have lived in the constituency for 23 years, […]\nRead more »",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_tag_legacy/content_20.html": "West Northants has the most warehouses in the country 2024-02-06 / 2024-03-18 by jackgold Recently, the Office for National Statistics revealed that Northampton has the most warehouses in the UK. This is primarily attributed to its proximity to London, extensive green areas for building and well-established rail networks. However, the unrestrained construction of warehouses for short term profit on greenfield sites, instead of brownfield sites (land previously developed on), […] Read more » Legacy\nWill Morris selected as Parliamentary Candidate for Wellingborough By-Election 2024-01-22 / 2024-07-05 by jackgold Will Morris has been selected to stand as Green Party candidate for the Wellingborough Parliamentary Constituency in the next election. This will be as the result of the by-election triggered by the recent recall petition in respect of Peter Bone MP. Will Morris, 55, and his wife have lived in the constituency for 23 years, […] Read more » Legacy\nElections 2021 – Your Green Candidates 2021-04-10 / 2024-07-05 by jackgold The first elections for West Northamptonshire Council will take place on May 2021. This council has been formed because of the effective collapse of the Conservative controlled Northamptonshire County Council following the 2017 elections. The West Northamptonshire Green Party is fielding more candidates across the area than ever before, so more residents will have the […] Read more » Legacy\nNorthants Green Party demands support for cyclists and pedestrians. 2020-05-13 / 2024-05-14 by jackgold The Northants Green Party has this week written to Council Leaders across Northamptonshire, asking them to take simple steps to support pedestrians and cyclists as restrictions on movement are eased in the next few weeks. Last weekend the government created a £250 million emergency fund to support councils to deliver pop-up cycle lanes with protected […] Read more » Legacy",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_team/content_16.html": "Your Local North Northants Officers\nDez Dell, North Northants Treasurer\nDez is the treasurer of the Northamptonshire Green Party. He is also a councillor on North Northants and Kettering Town Council.\nJames Towns, North Northants Coordinator\nElected to Kettering Town Council in 2021, James is an active member of the Northamptonshire Green Party and was elected early in 2024 to be the North Northants GP co-ordinator.\nYour Local West Northants Officers\nClare Slater, West Northants Newsletter Editor\nClare is committed to fighting for a fairer, greener future. She is a Parish Councillor in Bugbrooke, where she co-established the Environmental Working Group, organising regular litter picks, re-use days and promoting sustainability throughout the village. Clare is also a founding member of Climate Action West Northamptonshire, where she writes for the online forum and hosts climate cafés.\nEd Jaspers, West Northants Policy Spokesperson\ninfo coming soon\nEllie Wingfield, Social Media\ninfo coming soon\nEmmie Williamson, West Northants Coordinator\nEmmie was until recently a clinical psychologist working in the NHS. She runs a climate group in her village and works with her parish council on biodiversity projects locally. Emmie also studies and does talks on Climate Psychology.\nJack Gold, Webmaster\nJack has lived in Northampton since 1999 and from a young age, has been into IT & technology having completed a degree in Digital Media from Sheffield Hallam University in 2021.\nSteve Kent, West Northants Membership Secretary\ninfo soon\nYOU!\nWant to see yourself here? The greens already have a record number of elected councillors, and show no signs of stopping. Join us.",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_2024_02_06_west-northants-has-the-most-warehouses-in-the-country/content_6.html": "Recently, the Office for National Statistics revealed that Northampton has the most warehouses in the UK.\nThis is primarily attributed to its proximity to London, extensive green areas for building and well-established rail networks.\nHowever, the unrestrained construction of warehouses for short term profit on greenfield sites, instead of brownfield sites (land previously developed on), has raised concerns regarding noise, light pollution, and the exacerbation of climate-related issues. Such as flooding for local residents. Additionally, there are growing concerns about the impact on wildlife and bird migration patterns.\nNorthants greens have continued to support Northampton air pollution protests and that it’s a disgrace that the town has the worst air in the country due to lack of intervention by the council.\nThe Green Party in Northampton is pushing for increased scrutiny of planning permissions for warehouse construction and exploring alternative methods to conserve valuable countryside and biodiversity. Many hearings and committees, often scheduled at inconvenient times for residents, feel pressured to make decisions under the misconception that their rulings cannot be appealed. Despite resident opposition to warehouses, as evident in Kislingbury, councillors frequently approve their construction, citing job creation benefits. However, many of these jobs are seasonal, and the warehouses often remain empty for the majority of the year. This discrepancy arises because these decisions do not directly impact councillors residing near the proposed warehouse sites.\nFortunately, when many residents band together, such warehouse planning can be fort off. As was the case with Weekly Hall Wood in Kettering. The more residents that turn up at such hearings, the likelihood such planning can be overturned.\nA good deal of built warehouses fail to incorporate solar panels, which could mitigate energy costs. Considering the substantial energy consumption and physical size (most are larger than the whole six fields football ground) associated with warehouses, especially as automation and AI technologies continue to advance, the Green Party widely advocates that warehouses should be mandated to install solar panels on their rooftops.\nSource:\nhttps://www.bbc.co.uk/news/uk-england-northamptonshire-61082171",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_air-quality/content_11.html": "This page is dedicated to monitoring and publishing air quality info in Northamptonshire. A new embedded map will be added in the future. A changelog below shows updates on the work taken in improving and monitoring the air quality.\nChangelog\n2025-03-30\nAfter two decades of inaction on air quality West Northants Council finally published an Air\nQuality Action Plan in September 2024. It lists 23 measures:\n- Continue monitoring air quality\n- Revoke Air quality Management Areas (AQMAs) on MI and A45\n- Declare new AQMA on Bradshaw Street\n- Add an Air Quality chapter to the Joint Strategic Needs Assessment\n- Government grant to pay for the installation of electric charging infrastructure in Northampton\nbus depot. Stagecoach will buy 51 electric buses only to be used in Northampton. - Raise awareness in schools\n- Active travel management in AQMAs\n- Control and public information on domestic burning\n- Develop new Local Transport Plan\n- Reduce congestion through road improvement\n- Active Quarter cycling and walking network\n- Cycling and walking corridors in Brackley, Daventry & Towcester\n- E scooters from Voi\n- Taxi licensing policy to promote low-emissions taxis\n- EV infrastructure strategy (including gas fuel recharging)\n- Inspections and enforcement to reduce industrial emissions\n- Enforcing dust and smoke control\n- Reduce emissions from WNCs fleet of vehicles.\n- Planning conditions to reduce dust from demolition and construction\n- Planning guidance to mitigate impact of all development on air quality\n- Sustainable Heat Network Feasibility Study\n- Replace gas boilers at leisure centres in Daventry, Moulton, Brackley & Towcester\n- Implement the Tree Strategy\nThere are several measures which the plan failed to include\n- Create a Clean Air Zone\n- Expand Smoke Control Areas to include Northampton town centre\n- Stop building roads and start building safe cycle lanes\n- 20 mph limit in residential areas\n- 60 mph limit on MI and A45\n- Car club\n- Lift sharing scheme\n2019-01-16\nTowards the end of 2018, Northampton Borough Council launched a public consultation regarding the proposed changes to the Air Quality Management Areas in Northampton. We have already fed back into this consultation.\n2017-01-30\nWe made contact with a Residents Group in Wellingborough who were concerned about the Air Quality at the Broad Green area of the town, and who wondered if we could help them to get some measurements. On the 29th January 2017, we put up 2 diffusion tubes to start the process.\n2016-06-27\nIn Northampton, the Low Emissions Strategy is going through the Scrutiny process at Council. Following on from our work on air quality, the Northamptonshire Green Party has been invited to provide evidence to the Scrutiny Panel, and will be preparing a report in mid-February before our appearance in March.\nNorthampton has an Air Quality problem.\nThere are 7 Air Quality Management Areas (AQMAs) in the town, where the levels of Nitrogen Dioxide is above the legal level. The Borough Council, in conjunction with partner organisations across the County has published a Draft Low Emission Strategy, detailing how they are going to try and reduce the levels of pollution.\nThis strategy is going out to a public consultation, which will run from 8-12 weeks across the Summer.\nThe Northamptonshire Green Party, over the last couple of months, has been starting to run a targeted campaign to look at the air quality ourselves – both inside and outside the AQMAs, so that we can get a better idea as to how this is affecting health across the town.\nWe want to step this up during the period of the public consultation – let’s take this opportunity to start a debate about the air quality in the town, and to back it up with solid data that is open to everybody as soon as the lab returns the results.\nWe place a small measuring device called a diffusion tube on a lamppost next to the road. Over a period of 4 weeks, this measures the amount of Nitrogen Dioxide in the air. The tube is then sent off to a lab for testing and the figures are sent back to us around ten days later.\nThe more tubes we can place, the more complete our data will be. And that’s where you can help.\nCan you pledge enough money to our campaign to help us place more tubes?\nEvery donation will help us to measure in more locations, and we have set reward levels where we will place the tube in an area of your choice.\nThis really is a big deal. Mortality rates due to respiratory illness in Northampton are above the national average, and they are higher than anywhere else in the County. It’s affecting the health of our citizens, and its affecting the life outcomes of our children.\nLet’s start trying to fix this.",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_2024_07_05_celebrating-success-in-northampton-green-party-achieves-milestone/content_14.html": "After months of dedicated campaigning, leafleting, and canvassing in Northampton, Kettering, and Corby, we are thrilled to announce a significant achievement. For the first time in the county, all Green Party candidates have scored at least 5% of the vote, allowing them to retain their deposits. This milestone reflects the growing support for a positive, optimistic future in our community.\nIt’s been a long road, getting from there to here\nOur journey has been long and challenging, involving extensive website work, leaflet design, social media engagement, and continuous feedback and testing. This effort has paid off, demonstrating that the people of Northamptonshire are looking for something better.\nWe extend our heartfelt thanks to everyone who has supported us, whether by contributing to our crowdfunding efforts or volunteering their time. The fact that all our candidates retained their deposits empowers us to build on this success and stand again in future elections. It would also show Green Party HQ, that greens in Northamptonshire can (and will) win and who knows. We may even be a target area in the future!\nLooking Ahead: Building on Success\nOur recent success proves that there is no such thing as a wasted vote. If Greens are a wasted vote, how come we have just over 800 councillors and now four MPs? People are seeking something different, and the Green Party offers a comprehensive vision for a better future. It’s because people want something different, and it shows that the Greens are not some “environmental” “hippie” group with just a single mp; we are committed to creating a “solarpunk” future—one in which there is accountability on climate issues, where the accusation of wealth is no longer the driving force of our lives, brings railways back into public ownership to lower journey costs and emissions, and ensures the NHS serves the people and not for profit.\nJoin Us in Shaping the Future\nOur achievements are only possible with your help. As we plan our next steps, we aim to learn from our experiences, refine our strategies, and develop a new action plan. If you want to be part of the next generation of changemakers and futurologists, consider joining the Green Party for just £6 a year. Membership offers access to exclusive events, opportunities to participate in policymaking, and much more.\nThank you\nJack Gold\nWebmaster & Social Media",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_donate/content_15.html": "We’re powered by people like you, not big businesses, billionaires or vested interests\nYour donation will help us get Greens elected in Northamptonshire\nThe Green Party is funded through donations by individuals like you. We don’t take donations from businesses that are trying to sway our politics. Politics is about people, and delivering a society that puts them first. This means we are your partner and can act better in your interests rather than what big businesses want. Can you donate to help us get Greens elected?\nBACS\nYou can donate directly into our bank account via bank transfer or by setting up a regular standing order. Our bank details are:\nAccount name: Northampton Green Party\nAccount number 20017879\nSort code: 60-83-01\nCheque\nSend a cheque made payable to ‘Northampton Green Party’ to:\nNorthamptonshire Green Party\n38 Waverley Road, Kettering, NN15 6NT\nDonate Online\nSet up a regular donation using the below secure form:",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_category_general-election-2021/content_18.html": "2021-04-10 / 2024-07-05 by jackgold\nThe first elections for West Northamptonshire Council will take place on May 2021. This council has been formed because of the effective collapse of the Conservative controlled Northamptonshire County Council following the 2017 elections. The West Northamptonshire Green Party is fielding more candidates across the area than ever before, so more residents will have the […]\nRead more »",
  "https_northants_greenparty_org_uk_/https_northants_greenparty_org_uk_2021_04_10_elections-2021-your-green-candidates/content_17.html": "The first elections for West Northamptonshire Council will take place on May 2021. This council has been formed because of the effective collapse of the Conservative controlled Northamptonshire County Council following the 2017 elections.\nThe West Northamptonshire Green Party is fielding more candidates across the area than ever before, so more residents will have the opportunity to vote for a genuine change. Your local candidates are as follows\n| Place | 2021 Candidate(s) |\n|---|---|\n| Braunston & Crick | Sarah Stokes |\n| Castle | Julie Hawkins |\n| Daventry West | Gordon Smallman |\n| Deanshanger | Rob Bray |\n| Delapre & Rushmere | Paul Slater |\n| Duston West & St Crispin | Scott Mabbutt |\n| Hackleton & Grange Park | Kat Chapanionek |\n| Headlands | Steve Kent & Mark Allenby |\n| Kingsthorpe North | Steve Miller, Paul Powerville & Chris Willis |\n| Kingsthorpe South | Elaine Miller |\n| Long Buckby | Simon Sneddon |\n| Moulton | Simon Hall |\n| Nene Valley | Hilary Wilson |\n| Silverstone | Jane Hamel |\n| Towcester & Roade | Mike Matthews |\n| Woodford & Weedon | Clare Slater |"
}