{
  "https_www_kevinbonavia_co_uk_/https_www_kevinbonavia_co_uk_privacy-policy/content_2.html": "Skip to content\nMy Vision\nMy Story\nMy Promise\nContact\nGet Involved\nMy Vision\nMy Story\nMy Promise\nContact\nGet Involved\nJoin Labour\nDonate\nPrivacy Policy\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_kevinbonavia_co_uk_/https_www_kevinbonavia_co_uk_get-involved/content_3.html": "Skip to content\nMy Vision\nMy Story\nMy Promise\nContact\nGet Involved\nMy Vision\nMy Story\nMy Promise\nContact\nGet Involved\nJoin Labour\nDonate\nHelp me deliver\nchange\nin Stevenage\nLet's spread the word and win Stevenage for Labour.\nHow can you help?\nJoin My Team\nSpread The Word\nDonate\nJoin the whatsapp group\nStay in touch with all the latest news and discussion\nName\nMobile Number\nJoin the group\nHow do you want to get\ninvolved with Labour?\nHow do you want to get involved with Labour?\nIf you have a skill that you think could be useful, please select 'other' in the form below\nVote Labour at next local election\nPromote on social media\nPhone voters from home\nDeliver Labour leaflets\nCanvass door-to-door\nMake a donation\nDo you have a skill you think could be helpful to us?\nI.e. are you a graphic designer, photographer, copy writer? Let us know by adding your skill below.\nI give Labour permission to contact me using data I've supplied. Opt-out at any time, see our\nPrivacy Policy\n.\nSubmit\nHow to spread the word\nSave\nany of the images below to your device\nShare across your chosen platforms like\ntwitter, facebook and whatsapp\nI would also appreciate it if you could add a\nlink back to this website\nto help promote my campaign.\nAll\nStevenage\nNational\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_kevinbonavia_co_uk_/https_www_kevinbonavia_co_uk/content_1.html": "From Aston End, to Codicote and Knebworth together we can secure a brighter future for Stevenage.\nSource: Survation x Best for Britain Voting Intention MRP March 2024\nFieldwork 8th – 22nd March 2024\nI’m Kevin Bonavia, and I’m standing to be your Labour MP for Stevenage, Knebworth, Codicote, Datchworth & Aston. I’m proud to call Stevenage my home.\nOur Town is aspirational, but we’ve been held back by 14 years of an out of touch Conservative government and a won’t get in touch Tory MP. I want to be the hardworking, full-time MP you truly deserve.\nI’ve made a career getting justice for victims of hacking and fraud as a solicitor. I know what it takes to support people who are most in need of help.\nI want to use this experience to represent you. Public service is in my DNA. I’ve spent 14 years as a councillor – serving as an armed forces champion.\nAs your MP, I’d be local, accessible and always on your side.\nOnly Labour’s Kevin Bonavia can beat the Conservatives in Stevenage. Every donation to my campaign will help our fight for change here in Stevenage.\nI’m proud to call Stevenage my home. As your MP, I’ll always live locally, so I can continue to live, sleep and breathe day-to-day life in the town I love.\nI’m making a ‘no second jobs guarantee’, so you know that all of my time will be spent being a full-time, hardworking MP for our town and villages.\nI’ll always put the needs of the local community first, and promise to visit to every small and large business, shop and school in my first term.\nI’ll use my time in parliament to give Stevenage and our villages a voice, and set up a ‘school trips to parliament scheme’ in my first year as your MP.\nI’ll use my budget to open a local constituency office and hire a dedicated team of caseworkers that are accessible to Stevenage and our villages.\nPromoted by Tom Plater on behalf of Kevin Bonavia both at 13a Town Square, SG11BP, Stevenage"
}