{
  "https_miketapp_co_uk/https_miketapp_co_uk_2024_10_15_i-have-raised-the-lack-of-blood-testing-at-victoria-hospital-in-deal-in-the-house-of-commons/content_18.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2024_10_09_upcoming-advice-surgeries/content_19.html": "Our next surgeries are in Dover, Deal and Whitfield on the 27th and 28th of October.\nOpen Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nOur next surgeries are in Dover, Deal and Whitfield on the 27th and 28th of October.\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2024_11_12_remembering-those-who-served-and-sacrificed/content_10.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2025_01_21_tapp-into-reading/content_3.html": "I’m proud to announce the launch of ‘Tapp Into Reading’, a new project with local schools to make reading, accessible, enjoyable and fun!\nOpen Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI’m proud to announce the launch of ‘Tapp Into Reading’, a new project with local schools to make reading, accessible, enjoyable and fun!\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2025_01_21_mike-tapp-calls-the-southport-attacker-a-terrorist/content_13.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk/content_1.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nToday in The Chamber I\nasked a question to the Home Secretary where I called the Southport attacker a terrorist and asked for a change to the legal framework to recognise the severity of acts intended to terrorise.\nMike Tapp has been the Member of Parliament for Dover and Deal since 2024.\nThe son of a policeman, his background is in the military having served in the Intelligence Corps, with three operational tours in Iraq and Afghanistan, before working at the National Crime Agency and later in a counter terrorism role at the Ministry of Defence.\nAs one of the most historic towns and areas in the country with an iconic status and identity, Dover has been neglected for far too long.\nMike will work tirelessly to ensure Dover, Deal and the Villages receives the respect and investment it deserves. Mike promises every constituent, whether they voted for him or not, to stand up for them and their rights – for Dover and Deal to fulfil its true potential.\nDover being on the frontline for many of the nation’s most pressing challenges he is at the forefront of working with the government and others in continuing his service to the UK.\nMike will fight for his country and continue serving the nation.\nMike served with the army since he was 20 years old and was deployed on three Operational Tours, to Iraq and Afghanistan, before becoming the most junior soldier to pass the demanding selection process to become an Operator with the Unit as an analyst.\nAt the NCA, Mike worked in an Intelligence role where he helped combat serious and organised crime.\nAt the Ministry of Defence, Mike worked in a Counter Terror role, helping to keep our streets safe from terrorists.\nMike is determined to continue his service for the people of Dover & Deal.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2025_02_05_open-letter-to-the-ceo-of-southern-water/content_15.html": "I have written an open letter to the CEO of Southern Water Demanding answers and action about the disgraceful contamination of our waters.\nMike Tapp MP: An open letter to the CEO of Southern Waters\nI have written an open letter to the CEO of Southern Water Demanding answers and action about the disgraceful contamination of our waters.\nMike Tapp MP: An open letter to the CEO of Southern Waters\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2024_10_31_this-week-i-had-the-honour-of-making-my-maiden-speech-and-i-focused-on-the-often-ignored-positives-of-dover/content_12.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2025_02_05_open-letter-to-the-ceo-of-southern-water-2/content_9.html": "The contamination of our waters is a disgrace. I have written to the CEO of Southern Waters to demand answers and what actions are being taken to make sure this will never happen again.\nMike Tapp MP: An open letter to the CEO of Southern Waters\nThe contamination of our waters is a disgrace. I have written to the CEO of Southern Waters to demand answers and what actions are being taken to make sure this will never happen again.\nMike Tapp MP: An open letter to the CEO of Southern Waters\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_home/content_7.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nToday in The Chamber I\nasked a question to the Home Secretary where I called the Southport attacker a terrorist and asked for a change to the legal framework to recognise the severity of acts intended to terrorise.\nMike Tapp has been the Member of Parliament for Dover and Deal since 2024.\nThe son of a policeman, his background is in the military having served in the Intelligence Corps, with three operational tours in Iraq and Afghanistan, before working at the National Crime Agency and later in a counter terrorism role at the Ministry of Defence.\nAs one of the most historic towns and areas in the country with an iconic status and identity, Dover has been neglected for far too long.\nMike will work tirelessly to ensure Dover, Deal and the Villages receives the respect and investment it deserves. Mike promises every constituent, whether they voted for him or not, to stand up for them and their rights – for Dover and Deal to fulfil its true potential.\nDover being on the frontline for many of the nation’s most pressing challenges he is at the forefront of working with the government and others in continuing his service to the UK.\nMike will fight for his country and continue serving the nation.\nMike served with the army since he was 20 years old and was deployed on three Operational Tours, to Iraq and Afghanistan, before becoming the most junior soldier to pass the demanding selection process to become an Operator with the Unit as an analyst.\nAt the NCA, Mike worked in an Intelligence role where he helped combat serious and organised crime.\nAt the Ministry of Defence, Mike worked in a Counter Terror role, helping to keep our streets safe from terrorists.\nMike is determined to continue his service for the people of Dover & Deal.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2024_11_05_my-monthly-update/content_14.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2024_11_26_securing-our-borders/content_11.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2025_02_05_new-advice-surgery-dates/content_8.html": "Face-face meetings are vital for our local democracy. Please book an appointment to meet with me and my team.\nOpen Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nFace-face meetings are vital for our local democracy. Please book an appointment to meet with me and my team.\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_elementor-3450/content_5.html": "What personal data do we collect?\nWhen you visit our website, we will collect the following information about you:\nWe collect data about you from your device and via third-party website analytics services such as Google Analytics and cookies (see below) when you visit our website. We do not make, and do not allow our Google Analytics settings to make, any attempt to find out the identities of those visiting our website.\nThis website includes embedded content (e.g., videos, images, articles, etc.) from other websites and links to external websites, plug-ins, and applications. Clicking on those links or enabling those connections may allow other parties to collect or share data about you. Embedded content from other websites behaves in the exact same way as if the visitor has visited the other website. We do not control these external websites and are not responsible for their privacy statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\nCookies\nAs you interact with our website, we automatically collect Technical Data about your equipment, browsing actions and patterns. We collect this personal data by using cookies and other similar technologies to enhance your experience of our website.\nOur website uses cookies for collecting user information which may include IP address, operating system, and browser information. We use persistent cookies to track returning visitors. They expire after 12 months and enable us to compare website traffic from month to month.\nCookies are text files, which identify a user’s computer to our servers. Cookies in themselves do not identify the individual user, just the computer used.\nYou can manage and delete cookies through your web browser. Each browser manages cookies differently, but you can learn more about cookie settings in the most common browsers using the links below:\nYou can also prevent your data from being used by Google Analytics by using the Google Opt-out Browser Add-on, available at this link.\nWhat do we use your personal data for and what is our lawful basis for using it?\nThe table below is relevant to everyone who visits this website.\n| Purpose for using personal data | Lawful basis for using |\n| Monitor the website and keep it secure, it helps us understand how we might improve the website through numbers of visits, visitor patterns and behaviour. | The lawful basis we shall be relying on is the legitimate interest of the Data Controller in accordance with UK GDPR Article 6.1(f). |\n| Run our organisation, provide administration and IT services, ensure network security, and prevent fraud. | |\n| Collect information to understand more about our stakeholders’ interests and preferences and to inform our marketing strategy. | |\n| To keep our website updated and relevant, to develop our organisation, and to inform our marketing strategies. | |\n| Answer any enquiries you submit to us via the website inclusive of information submitted via any webform, survey, poll or information capture on any part of the website. | |\n| There are a number of reasons for Labour’s use of cookies which can be found on our Cookie Policy and you can access by clicking here. | The consent you have provided us for this use of your personal data in accordance with UK GDPR Article 6.1(a). |\n| To add you to digital communications activities lists and send you content where you have indicated your consent for us to do so. | |\n| To identify personal data and take relevant action upon submission of a data subject rights request. | Compliance with a legal obligation under UK GDPR Article 6.1(c). The legal obligation is the UK General Data Protection Regulation to uphold your data protection rights. Special categories of personal data used for the purpose of Substantial Public Interest (Preventing or detecting unlawful acts; Protecting the public; Regulatory requirements) under UK GDPR Article 9.2(g). |\n| To be able to assess any impact on individuals of a data breach involving personal data held on Labour Party systems or on third party systems. | |\n| To help protect an individual from neglect or physical, mental or emotional harm, or protect the physical, mental or emotional well-being of an individual. | Use of the personal data is necessary to protect the vital interests of an individual or individuals in accordance with UK GDPR Article 6.1(d). Special categories of personal data used for the purpose of Substantial Public Interest (Preventing or detecting unlawful acts; Protecting the public; Regulatory requirements) under UK GDPR Article 9.2(g). |\n| To deal with legal claims and ongoing litigation cases. | Compliance with a legal obligation under UK GDPR Article 6.1(c). The legal obligation is the UK General Data Protection Regulation to uphold your data protection rights. Special categories of personal data used for the establishment, exercise or defence of legal claims or whenever courts are acting in their judicial capacity under UK GDPR Article 9.2(f). |\nNOTE: This notice is specific to the use of the website you are currently on and not relevant to any other Labour platforms which may be accessible via this website or any other website of a similar name.\nIf you have interacted with Labour in a different way and if you expected to see something different to the list above, you can access all of our privacy notices by clicking here. If it is still not there, feel free to get in touch as mentioned below.\nWho do we share your personal data with?\nAny data shared with the below categories of recipients is the minimum necessary for the task they have been instructed to carry out on our behalf or in conjunction with us. Each category of recipient is subject to review by the Data Protection Team to make sure they have the right methods in place for keeping your personal data secure.\nWhere the sharing of personal data is within the context of a product or service being supplied under contract to Labour, a Data Processing Agreement, in accordance with GDPR Article 28 is put in place. This makes sure the supplier cannot use your personal data outside of the list of uses above.\nWithin the purposes of using your personal data, as listed above, we will share your personal data with the following:\nThere may be scenarios where we are subject to a legal obligation to disclose or share your personal data, such as with law enforcement agencies, regulatory bodies or public authorities in order to prevent or detect crime, or prove we have adhered to their request. We will only ever disclose your personal data to these third parties to the extent we are required to do so by law.\nHow long will we keep your personal data?\nWe will only keep personal information for as long as it is needed to fulfil the purpose for which it was collected.\nDepending on your reason for visiting the website and how you decide to interact with our website will determine the amount of time we retain your personal information outlined above.\nWhat are your rights and how can you express them?\nTo understand your data privacy rights and to submit a rights request, the best way to do so is by visiting the ‘YOUR RIGHTS’ page on our website which you can get to by clicking here.\nHow can you complain about our use your personal data?\nThe best way to make a complaint is by visiting our page on ‘HOW TO MAKE A DATA PROTECTION COMPLAINT’ which you can access by clicking here.\nHow can you contact us about this privacy notice?\nIf you have any questions about the information in this privacy notice, then you can contact the Data Protection Team via email using dataprotection@labour.org.uk or by post within a letter to:\nLabour Statutory Data Protection Officer\nThe Labour Party, Southworks, 20 Rushworth Street, United Kingdom, SE1 0SS\nWhen was this privacy notice last updated?\nWe may update this notice (and any supplemental privacy notice), from time to time as shown below. We will notify you of the changes where required by applicable law to do so. Last modified: 05 March 2024.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2024_10_18_i-was-proud-to-join-the-blue-cross-in-handing-the-petition-to-ban-greyhound-racing-to-no-10/content_17.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2024_12_17_new-year-advice-surgery/content_4.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2024_11_18_upcoming-advice-surgery/content_6.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_2024_10_28_what-a-pleasure-and-honour-it-was-this-weekend-to-meet-with-constituents-in-person-and-listen-to-their-issues/content_16.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nSubscribe now to keep reading and get access to the full archive.",
  "https_miketapp_co_uk/https_miketapp_co_uk_category_blog/content_2.html": "Open Letter to the CEO of Southern Water\nI will not rest until our waters are made safe again.\nI will not rest until our waters are made safe again.\nToday in The Chamber I\nasked a question to the Home Secretary where I called the Southport attacker a\nMeeting you face-to-face is invaluable. If you would like to meet up, then please email to make an appointment. mike.tapp.mp@parliament.uk\nAttending the Remembrance Sunday service in Deal was a profound privilege, honouring the bravery and sacrifice of those who served\nIt has been a busy month! You can find-out what I have been up to in the community and at\nThere is so much more to our constituency than the national press and commentators focus on. I am forever proud"
}