{
  "http_www_rob4london_com": "Rob Blackie: London Lib Dem Campaigner Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Win With Blackie Rob Blackie: 2024 Liberal Democrat Candidate for Mayor of London achieved the best Lib Dem result in 16 years. A lifelong Londoner, he is standing up for the capital’s liberal values. Read about Rob As featured in … For all media enquiries, please contact [email protected] Rob’s Priorities Reset The Met Get the police to focus on serious crimes and earn the respect of Londoners. A Green Recovery Proper public transport access for all Londoners and clean up our rivers. Fighting Reform We need to stop Reform’s extreme and un-British plans to expel hundreds of thousands of Londoners Read More My CV In The Media Around London Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com": "Rob Blackie: London Lib Dem Campaigner Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Win With Blackie Rob Blackie: 2024 Liberal Democrat Candidate for Mayor of London achieved the best Lib Dem result in 16 years. A lifelong Londoner, he is standing up for the capital’s liberal values. Read about Rob As featured in … For all media enquiries, please contact [email protected] Rob’s Priorities Reset The Met Get the police to focus on serious crimes and earn the respect of Londoners. A Green Recovery Proper public transport access for all Londoners and clean up our rivers. Fighting Reform We need to stop Reform’s extreme and un-British plans to expel hundreds of thousands of Londoners Read More My CV In The Media Around London Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_story": "My Story - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities This is Rob’s Story Rob has dedicated his life to fighting for liberal values. For over twenty years, Rob has led campaigns on the biggest issues – ensuring our liberal voice is heard with bold media coverage. From the local to the global stage, Rob has the track record to stand up for our great city. Rob advised Charles Kennedy during the Iraq war protests Rob has campaigned in every borough and is regularly at local by-elections Rob has a track record of doing fun stunts to help us get noticed Rob campaigning to retain free travel for children Rob speaking to LBC about his campaign against Russian fake news on Ukraine Rob worked on conservation projects in Africa Rob has been campaigning for clean air for decades Rob has advised some of the world’s biggest campaigns in his work Rob is a lifelong campaigner in his home borough of Lambeth Rob was on the frontline of fighting Brexit in 2018 Rob protesting the polluting Silvertown Tunnel Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_my_cv": "Rob Blackie's CV: Vote Lib Dem Rob Number 1 for GLA Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob has won tough liberal battles his whole life. From advising Charles Kennedy when he bravely opposed the Iraq war, to a successful campaign for London Mayor. Read on to find out more… Experience Liberal Democrat candidate for Mayor of London 2023-4 Most successful Liberal Democrat result for 16 years. Founder Breaking Putin’s Censorship campaign 2022 Founded the Breaking Putin’s Censorship campaign – which helps Russians to find independent news about the war in Ukraine using digital advertising. Over 400,000,000 ads shown so far. The campaign has featured in The Guardian, The New York Times and 30 major media outlets. Professional campaigner, fighting Brexit and fake news (2016 – present) Expert in fighting fake news, and has pioneered techniques to get real news past Russian censors in support of democracy. Adviser to anti-Brexit campaign Best for Britain, developing polling, campaigns and strategies to inform the public and persuade politicians to think again. Campaigning on climate change and to save bees, butterflies and ladybirds. Advised a leading biotech firm on their plan to create enough Covid vaccine capacity for the whole world. Lib Dem grassroots campaigning (2000 – ongoing) Knocking on doors, delivering leaflets, fundraising and campaigning in every borough of London, including every local, London, European and General Election and numerous by-elections. London Assembly candidate for Lambeth & Southwark 2012, Lib Dem Assembly London wide list candidate 2016. Achieved the best Labour-facing result in London. Missed out on being elected to the London Assembly by just a few thousand votes in 2021. Selected by London Lib Dem members to be No. 2 on the 2024 London Assembly List. Ogilvy / Blue Rubicon / Blue State Digital Head of Social / Head of Digital / Managing Director Europe (2005 – 2016) Created more than 20 jobs, built and ran several businesses of over £1m per year. Headed the European arm of the digital team that helped elect Obama. Supported the spread of smart campaigning practice as London Lib Dem Executive Digital Ambassador from 2012. Advised the then-Secretary-General of the United Nations Framework Convention, Christiana Figueres, on how to win the arguments leading up to the Paris Climate Change Agreement. Liberal Democrats, Economic policy / Director of Research (1999-2005) Led team of 15 Lib Dem policy and media advisers to support our MPs and Leader Charles Kennedy through the Iraq war campaign. Advised on all major policies including the 2005 General Election manifesto, contributing to our best ever result with 62 MPs elected, including a record eight MPs across London. Trusted advisor to Charles Kennedy & Vince Cable. Ministry of Environment & Tourism, Namibia (1996 – 1999) Environmental economist working to halt desertification and on conservation of wildlife such as rhinos, lions and elephants – contributing to 12,000 more Namibian elephants . Interests I am proud to be bringing up my daughters in the greatest city in the world. I love watching the deer with my family in Richmond Park, cycling along the canal in Camden and shopping in Brixton market near our home. I keep fit with Joe Wicks and by cycling when I can. Delivering Lib Dem leaflets (especially to tower blocks) also helps with my fitness regime! References [I’m] impressed by the Lib-Dem candidate Rob Blackie The Evening Standard “[A]n effective campaign” Tim Donovan, BBC London “I thought Rob an impressive candidate for London Lib Dems” Dave Hill, OnLondon Can you get any more Lib Dem than this? Guido Fawkes Rob Blackie and his team…bring correct messages about the war… it’s very important for us as Ukraine to have such supporting teams all over the world. Anastasiya Badyachenko , CEO IAB Ukraine He combines the rare twin qualities of deep data analysis and ability to communicate with flair. Naomi Smith , CEO, Best for Britain Several senior New Labour figures have told me they think that Liberal Democrat Charles Kennedy, not David Cameron, was the most effective opposition leader they faced. That was not because of his opposition to the Iraq war but because of his team of arch-scrutinisers and campaigners he appointed to his front bench: ‘hard bastards who were always finding campaigns and ways to criticise us’ in the words of one Labour peer. Stephen Bush, FT columnist, describing work done by Rob’s Research team in 2003-2005 “[He has] an ideology and an axe to grind. But the grinding is so gentle, it is easily disregarded and the underlying points adopted as one’s own.” Evan Davis, Radio 4 presenter Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_campaigning_across_london": "Campaigning Across London - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Campaigning Around London Rob has a strong record of campaigning right across London. He has worked in every single borough in the capital. That’s why members chose Rob as London Mayoral candidate Can you find your local area? Barking & Dagenham With the team in March 2023 Barnet With Gabriel Rozenberg in Finchley in April 2022 Bexley With Bexley Campaign Team in April 2021 Brent With local team in May 2022 Bromley With Cllr Julie Ireland and team in November 2018 Camden Campaigning in West Hampstead 2025 Croydon With Cllr Claire Bonham in April 2021 Ealing Campaigning with Councillor Connie Hersch in 2025 Enfield With Enfield campaign team in October 2020 Greenwich Campaigning against the Silvertown Tunnel in April 2021 Hackney With Hackney by-election campaign in September 2018 Hammersmith & Fulham With Nicola Horlick and the Chelsea & Fulham campaign in November 2019 Haringey With Muswell Hill team in November 2018 Harrow Campaigning in Harrow Town centre in January 2020 Havering Campaigning with Thomas Clarke and Caroline Pidgeon Hillingdon Campaigning in Eastcote in 2021 Hounslow With Kuldev in 2023 Islington With Islington Campaign Team in March 2022 Kensington & Chelsea On polling day in 2022 Kingston-Upon-Thames Campaigning in Green Lane & St James by election in November 2022 Lambeth With Lord Brian Paddick in Brixton in October 2018 Lewisham With Margot Wilson in Forest Hill in April 2016 Merton With Cllr Paul Kohler in Wimbledon in May 2019 Newham Campaigning in 2021 Redbridge Campaigning in Churchfields in April 2021 Richmond-Upon-Thames With Sarah Olney MP in Richmond in 2018 Southwark In London Bridge & West Bermondsey, in May 2022 Sutton With Bobby Dean in Carshalton in May 2022 Tower Hamlets With Wapping campaign team in April 2022 Waltham Forest With the team in 2021 Wandsworth With Nine Elms Campaign Team in April 2022 Westminster With Caroline in November 2019 London Elections Being interviewed by ITV London 2024 Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_in_the_media": "In The Media - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob has an excellent track record of getting liberal issues into the media. From his successful Mayoral campaign to his digital campaign to beat Putin’s censorship on Ukraine, Rob combines his traditional media and social media expertise to get heard. Read Media Coverage As featured in … For media enquiries, please contact [email protected] Is this the most neglected problem in Britain? Rob’s research on sexual offences, and what we can do to cut these terrible crimes was published in Comment is Freed. Read More REVEALED: Met Police Will Fail to Fairly Represent London’s Diversity for Decades at Current Rate of Progress Rob Blackie’s research reveals it could take nearly fifty years for the Metropolitan Police to reflect London’s ethnic diversity at the current pace of progress. Read More Who is Rob Blackie? Campaigner fighting Russian propaganda in bid to become London mayor Rob Blackie wants to see police focus on investigating sexual assaults rather than crack down on laughing gas. Read More London mayoral election 2024: Who are the candidates taking on Sadiq Khan? Rob Blackie is described as “an anti-Brexit campaigner and adviser to startup technology companies” in the Evening Standard. Read More How to communicate the benefits of scientific innovation Rob Blackie and Thomas Crampton team up in an article explaining how the science of communication can significantly increase support for new technologies. Read More If we want to cut violent crime, we need to cut stop and search Rob Blackie writes an opinion piece on the ineffectiveness of stop and search in preventing serious and violent crimes in London. Read More Listen to Ep.62: Sabotage Attacks Rob Blackie joins Saul and Patrick to discuss his work on disinformation campaigns by Russian on Ukraine. Read More How are we beating Putin’s censorship? Rob Blackie speaks with BBC World Service’s TechTent on his campaign to beat Putin’s censorship. Read More The boring journey of Matt Yglesias Digital strategist Rob Blackie’s research reveals Yglesias’ Substack was tied for most-followed newsletter by members of the Biden transition team. Read More Rob Blackie appears on Lewis Goodal’s show on LBC Digital strategist Rob Blackie explains how his campaign ‘Free Russia’ is able to bypass Russia’s press oppression. You can listen to the whole show back here or watch shorter video clips here and here . Read More Rob Blackie’s Free Russia campaign wins industry award We won “Best Digital Campaign” at The Drum Awards for Social Purpose, the industry’s leading awards for socially responsible marketing. Thanks very much to all the volunteers who have made this campaign work. Read More Lambeth residents working to overthrow Vladimir Putin A group of Lambeth residents have been involved in an advertising campaign that aims to end Russian president Vladimir Putin’s reign over Ukraine. Read More Taking on Putin through porn: how Russians are finding out the truth about Ukraine Little moderation, huge audiences and biddable owners make porn and gambling sites a safe haven from censors. Read More Anti-Putin campaigners ‘using porn sites to show Russians the truth about Ukraine war’ Russia recently introduced federal laws prohibiting the dissemination of information considered “unreliable” by authorities, which are used to control the Ukraine war narrative Read More Programmatic Tech Is A Front For Psychological Warfare Following Russia’s invasion of Ukraine, the ad tech industry took steps to freeze Russian-owned media companies out of the advertising ecosystem. Read More Mick Lynch’s PR war is key to determining if rail strikes will succeed Robert Blackie, a digital strategist and former adviser to the late former Liberal Democrat leader Charles Kennedy, said Lynch by contrast was good at saying “things that translate well to a social media clip”. Read More 🇷🇺 What is being done to thwart Russian disinformation on Ukraine? Russia has been churning out disinformation and propaganda related to its war in Ukraine since before the invasion began. And while much of those efforts have been thwarted outside Russia, inside the country is a different story. Read More The Drum Show relaunches with Ukraine information war specials Rob Blackie, former Liberal Democrat candidate for the London mayoralty and digital consultant, takes us through his crowdfunded campaign to use those complex adtech channels to disseminate legitimate information. Read More How to get real Ukraine news to Russians: This group is starting with programmatic ad tech A group of marketers is using ad tech’s biggest weaknesses—imprecision and unpredictability—as a strategic strength to get factual war news to Russians. Read More Advertising Acts as Another Vehicle of Protest to Ukraine War Criticism of Russia has become a common feature of advertisements and the marketing industry. Read More Activists are using ads to sneak real news to Russians about Ukraine From pop-up notifications to Facebook ads, campaigners in Ukraine and beyond are using any means necessary to beat Russia’s information firewall. Read More How the Advertising Industry Can Really Help Ukraine Thanks to the many layers of obfuscation and complexity that can sit between an advertiser and the website their ad eventually appears on, an anonymous group of volunteers—led by industry veteran Rob Blackie—is using programmatic ad buying to bypass Russian and Belarusian censorship protocols. Read More Ukrainians have united in an effort to fight misinformation and spread facts about the war with ads on websites in Russia and Belarus Ukrainian ad experts have formed a volunteer group targeting ads to Russia and Belarus, their aim is to counter misinformation about Russia’s attack on Ukraine. Participating businesses have donated over $300,000 to one of the efforts, according to IAB Ukraine Read More Microsoft, SpaceX, Airbnb and Others Offer Ukraine Assistance Some Western businesses are providing tech, internet and housing support during Russia’s assault. Read More Marketers subvert fake news ad tactics to feed Russia real news reports If fake news helped erode western democracy, could factual, independent journalism be the final nail in the coffin of the Vladimir Putin regime? It’s a theory being tested by digital advertising expert Rob Blackie, who is raising the funds to inform Russians of the horrors in Ukraine and the budding protests at home. Read More ‘Independent news’: initiative uses programmatic ads to bypass Russian censors A team of more than 20 digital marketing experts have created the ads, which lead locals to responsible news outlets. Read More Agencies ramp up support for Ukrainian staff Publicis Groupe has pledged a guaranteed salary for the rest of 2022. Read More Global PR Industry Pledges Communications Support For Ukraine The Ukrainian Ministry of Foreign Affairs has been “overwhelmed” by offers of communications support to combat Russian misinformation. Read More Fundraising appeals launched for Ukraine Rob Blackie is raising funds on Crowdfunder to show independent news about the war in Ukraine to Russians using digital ads to get around Putin’s censorship . He says £10 buys about 1,000 ad views. Read More Technology Quarterly: Acknowledgments and further reading This Technology Quarterly was written by Geoffrey Carr, Slavea Chankova, Hal Hodson, Alok Jha and Oliver Morton. In addition to the people mentioned in the text, the authors would like to thank the following people: John Bamforth, Cheryl Bennet, Rob Blackie, James Bradner, Rob Carlson … Read More Biden ‘is planning to run again’ in 2024 TOP BIDEN TWITTER INFLUENCERS — Biden transition officials heading into the administration today are fans of NATE SILVER, EZRA KLEIN, The New York Times, Vox and Pod Save America. That’s according to a new analysis of 150 public facing Twitter accounts of Biden transition officials by U.K.-based digital strategist ROB BLACKIE. Read More Winner of Peston’s Geek of The Week When will the whole UK be vaccinated? My projections featured on Peston’s Geek of the Week feature, including commentary from Anushka Asthana and Paul Brand Read More Use emotion, not just science, to change behaviour over coronavirus The way to get people to heed warnings is to inoculate them with good ideas, an expert on behaviour change says. Read More European elections: ‘600,000’ EU citizens could have lost their vote in London The results were obtained by Freedom of Information requests submitted by the London Liberal Democrats and seen by Sky News. Read More The digital election: How social media is reshaping UK democracy US political media expert Travis Ridout assesses efforts to influence UK voters. Read More Flurry of Boris Johnson adverts tested on Facebook Hundreds of subtly different adverts featuring Boris Johnson have been run on Facebook since he became the UK’s new prime minister. Read More Want to read more media coverage by Rob Blackie? Read more media coverage Takes you to RobBlackie.com Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_my_priorities": "Lib Dem Rob Blackie's London Campaign Priorities Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob runs bold and liberal campaigns. Rob’s priorities for a liberal London. Reset The Met Get the police to focus on serious crimes and earn the respect of Londoners. Stop the police from wasting time on low level drug offences, like laughing gas Use freed up police time to investigate rapes and serious sexual offences properly Focus on reforming the Met so that it represents all Londoners and works efficiently Focus the Met on London’s priorities by restructuring it to get rid of national responsibilities. You can read more details in OnLondon at: https://www.onlondon.co.uk/rob-blackie-panorama-showed-that-the-met-needs-a-london-re-set/ A Green Recovery Proper public transport access for all Londoners and clean up our rivers. A new Transport Plan for Outer London – to speed up our transition to lower carbon transport Clean up our rivers and protect bees and other pollinators – by phasing out pesticides and herbicides, and promoting biodiversity Green Roofs by accelerating solar power Fighting Reform Campaigning for liberal values Fighting Reform We must stop Reform’s extreme plan to deport 100,000s of Londoners. Reform want to tear our city apart, we want to bring people together to enjoy the best city in the world. You can find out more about my work to expose Reform’s extremist plans on my Substack blog: https://substack.com/@robblackielondon/posts Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2018_09_privacy": "Privacy - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Privacy Leave a Comment / Uncategorized / By Rob Blackie This website collects a variety of data about you when you visit. None of it can, generally, easily personally identify you, unless you opt into my email newsletter. Though if you tell me you’re going on a weekend to Iceland and I see an Icelandic IP address in my analytics, I can take a guess. The main tool for this is Google Analytics though a few partner services (e.g. to stop people putting spam comments in or to increase security) may use cookies.This website operates under UK data law . It’s worth noting though that my entire business and campaign runs on cloud based services which include  servers based in the USA. As a general principle I’d never sell or abuse your data. And I’m fairly cautious about security. However no system is perfect. So I generally collect relatively little data.If you want a completely up to date list of the tracking code on my website then it’s worth looking at services like Ghostery . At the time of writing it consisted of: Doubleclick (allows me to advertise to you on Google). Share this (enables social sharing, allows the provider to advertise at you ). Google analytics (website statistics) WordPress stats (website statistics) Gravatar (puts a picture of you next to your comment if you like). If you have any questions please do not hesitate to drop me an email. Post navigation ← Previous Post Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2018_09_how_liberalism_meant_12000_more_namibian_elephants": "How liberalism meant 12,000 more Namibian elephants - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities How liberalism meant 12,000 more Namibian elephants Leave a Comment / Uncategorized / By Rob Blackie Elephants are in a dramatic decline across Africa. So how do you save them? Should you simply shoot poachers on sight, as Kenya does? Or try and work with the communities where they live? Working as an environmental economist in the Namibian government, I got to test this at first hand. When we went out and listened to local people they told us that they, too, wanted to save the elephants. But it was hard for them to persuade their friends and neighbours to actively fight poaching, because they suffered all of the costs of living with elephants (like their houses being trampled regularly) without getting the benefits of tourism. So we worked to put in place Africa’s best Community Based Wildlife Conservation programme. The wildlife was effectively given to the communities in which it lived, who could then make money by selling tourism concessions. It was a truly liberal programme, that a great liberal Namibian, Ben Ulenga, somehow managed to get past both his largely Marxist colleagues, and civil service that was still dominated by people put there under colonialism [Edited to add: Thanks to David Nolan for pointing out the longer history of conservation in Namibia that led up to this point – see at the bottom for more details] . Liberalism here was decentralisation – the people who lived with the wildlife were the best people to make decisions about it. And like decentralisation everywhere this meant a leap of faith for the technocrats that people could be trusted to make the ‘right’ decisions. At first this meant that communities were given relatively limited powers to sell tourism concessions, and manage the wildlife day to day, but gradually over time these powers were extended. Liberalism here was also pro-environment. We knew that without big changes in how wildlife was looked after, the future prospects were bleak. And the communities we worked with were passionate about their children and grandchildren having the opportunity to see wildlife as they went about their day to day lives. My role was partly to advise the communities on how to negotiate a good deal with tourism operators. Rural African communities knew that their wildlife was valuable, but not how to write contracts that created a mutual interest between themselves and the tour operator. Both had a very strong interest in these businesses being a success, as many of them have been. My job was also to persuade people in the rest of the government that rural African communities could be trusted with wildlife. Rob keeping an eye on African wildlife I spent day after day in meetings under trees in the desert, and in the capital’s civil service, painstakingly answering people’s questions, reassuring them and helping fix all the small problems that came up along the way. Over two and a half years we gradually got the first villages to benefit from the programme. As the programme got going it became a major source of jobs and income in these communities, and made wildlife as crucial to their economic success as their cows and goats. The results, fifteen years later, have been dramatic, with over 80 communities taking up this right, and the rights being extended to water, fisheries, rangeland and forests: The World Wildlife Fund has given two Gift of the Earth awards to the programme for its exceptional benefits to conservation Over 6,000 jobs in a small country, making community based tourism a major employer An increase in the elephant population from 7,500 to over 20,000, and very low levels of poaching The programme has now been copied across the world, with visitors coming to learn from Mongolia and Cambodia to  the United States. By contrast Kenya and the other countries have continued to struggle with poaching because they’ve done much less to involve people in decision making. Namibia’s community based conservation programmes are now a symbol to the world that the liberal ideology of trusting people works, as well as being right. Thanks to David Nolan for pointing out that this programme built on the successful community conservation programmes of the 1980s by Garth Owen-Smith and others. If you’d like to read more of this history then have a look at this brief history . Post navigation ← Previous Post Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_category_uncategorized": "Uncategorized Archives - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Uncategorized Questions about the Lib Dems? Leave a Comment / Uncategorized / By Rob Blackie If you have questions about the Lib Dems, then have a look at my friend Mark Pack’s website here. I also recommend my Twitter feed: www.twitter.com/robblackie The Lib Dem plan for a Brighter Future can be found on the official party website here: https://www.libdems.org.uk/brighter-future-plan Mark has also answered some common questions about the Manifesto here: … Questions about the Lib Dems? Read More » Don’t feed the wind up merchants! Leave a Comment / Uncategorized / By Rob Blackie Do you remember your class wind-up merchant? He says that you fancy the class teacher. You turn to him and shout ‘I don’t fancy the teacher!’ Everyone else overhears. At best they think it’s funny that you are angry. At worst they think that you fancy the teacher. Politics can be very like this. Labour’s … Don’t feed the wind up merchants! Read More » September 2019 update Leave a Comment / Uncategorized / By Rob Blackie I’m busy with four things at the moment: 1. Helping local Lib Dem parties around London fight against Brexit. If you’d like me to come and speak to your local party then email me on [email protected] 2. Campaigning with local Lib Dem parties – you can find photos of some of the places I’ve been … September 2019 update Read More » What is Rob doing now? Leave a Comment / Uncategorized / By Rob Blackie I’m very busy with my campaign for the London Assembly. But I’m only updating this website very occasionally at the moment. I’m concentrating on the Lib Dem campaign to stop Brexit. This includes: Visiting Lib Dem local parties around London to help them campaign more effectively against Brexit. Get in contact with me if you’d … What is Rob doing now? Read More » London Mayoral & Assembly results Leave a Comment / Uncategorized / By Rob Blackie Thanks very much to everybody who supported my campaign, including the almost 100 volunteers who helped me. I’m proud of our campaign. We stood up for liberal values – and showed that it’s possible to talk about Brexit in a way that’s relevant to everyone’s lives.   I’m going to go have a Nando’s with … London Mayoral & Assembly results Read More » How to cut crime in London Leave a Comment / Uncategorized / By Rob Blackie I’ve campaigned to cut crime in London since the early 2000s. Back then I first saw the damage that the crack epidemic was doing to my community in Vauxhall.  So I got involved with a campaign to get a drugs treatment centre near my then-home in central Brixton. Local Labour councillors tried to stop us. … How to cut crime in London Read More » London voters want the Lib Dems to fight Brexit Leave a Comment / Uncategorized / By Rob Blackie How important is Brexit to London voters? Polling from the Centre for London shows that Brexit is the biggest issue for Londoners. Could it win votes for the Lib Dems? Hope Not Hate and Best for Britain polled this a few months ago across Britain, with a sample of 472 people in London. They asked … London voters want the Lib Dems to fight Brexit Read More » Improving London’s environment Leave a Comment / Uncategorized / By Rob Blackie My record of action Caring for the environment has always been an important part of my life. As an aid worker on Namibia I worked on a world-leading community conservation programme, that contributed to 12,000 more Namibian elephants. This programme was based on liberal principle that involving people in conservation is right. It was also … Improving London’s environment Read More » How we can reduce air pollution quickly Leave a Comment / Uncategorized / By Rob Blackie Air pollution in London is appalling, sometimes at the level of Delhi.   Speed up taking dirty taxis off the road Taxis, both black cabs and others, are major contributors to air pollution in London. A combination of changing the licensing rules and incentives can cut pollution in just a few years.   Get dirty … How we can reduce air pollution quickly Read More » Five things we can do to improve London transport Leave a Comment / Uncategorized / By Rob Blackie 1. Encourage people to travel off-peak Our early bird fares policy, which cuts fares for people travelling before 7:30am rewards people for travelling earlier, and reduces overcrowding straight away.   2. Increase cycling  I’ve campaigned for better cycling facilities in London for 25 years, and am a keen cyclist. I’d encourage London boroughs to copy … Five things we can do to improve London transport Read More » Posts navigation 1 2 Next Page → Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_author_toqxo6": "Rob Blackie, Author at Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Author name: Rob Blackie Thank you for letting me know! Thank You / By Rob Blackie If you know other Lib Dem members, then you might want to forward my email to them. As usual, if you need to get in contact, you can email me on [email protected] Questions about the Lib Dems? Leave a Comment / Uncategorized / By Rob Blackie If you have questions about the Lib Dems, then have a look at my friend Mark Pack’s website here. I also recommend my Twitter feed: www.twitter.com/robblackie The Lib Dem plan for a Brighter Future can be found on the official party website here: https://www.libdems.org.uk/brighter-future-plan Mark has also answered some common questions about the Manifesto here: … Questions about the Lib Dems? Read More » Don’t feed the wind up merchants! Leave a Comment / Uncategorized / By Rob Blackie Do you remember your class wind-up merchant? He says that you fancy the class teacher. You turn to him and shout ‘I don’t fancy the teacher!’ Everyone else overhears. At best they think it’s funny that you are angry. At worst they think that you fancy the teacher. Politics can be very like this. Labour’s … Don’t feed the wind up merchants! Read More » September 2019 update Leave a Comment / Uncategorized / By Rob Blackie I’m busy with four things at the moment: 1. Helping local Lib Dem parties around London fight against Brexit. If you’d like me to come and speak to your local party then email me on [email protected] 2. Campaigning with local Lib Dem parties – you can find photos of some of the places I’ve been … September 2019 update Read More » What is Rob doing now? Leave a Comment / Uncategorized / By Rob Blackie I’m very busy with my campaign for the London Assembly. But I’m only updating this website very occasionally at the moment. I’m concentrating on the Lib Dem campaign to stop Brexit. This includes: Visiting Lib Dem local parties around London to help them campaign more effectively against Brexit. Get in contact with me if you’d … What is Rob doing now? Read More » London Mayoral & Assembly results Leave a Comment / Uncategorized / By Rob Blackie Thanks very much to everybody who supported my campaign, including the almost 100 volunteers who helped me. I’m proud of our campaign. We stood up for liberal values – and showed that it’s possible to talk about Brexit in a way that’s relevant to everyone’s lives.   I’m going to go have a Nando’s with … London Mayoral & Assembly results Read More » How to cut crime in London Leave a Comment / Uncategorized / By Rob Blackie I’ve campaigned to cut crime in London since the early 2000s. Back then I first saw the damage that the crack epidemic was doing to my community in Vauxhall.  So I got involved with a campaign to get a drugs treatment centre near my then-home in central Brixton. Local Labour councillors tried to stop us. … How to cut crime in London Read More » London voters want the Lib Dems to fight Brexit Leave a Comment / Uncategorized / By Rob Blackie How important is Brexit to London voters? Polling from the Centre for London shows that Brexit is the biggest issue for Londoners. Could it win votes for the Lib Dems? Hope Not Hate and Best for Britain polled this a few months ago across Britain, with a sample of 472 people in London. They asked … London voters want the Lib Dems to fight Brexit Read More » Improving London’s environment Leave a Comment / Uncategorized / By Rob Blackie My record of action Caring for the environment has always been an important part of my life. As an aid worker on Namibia I worked on a world-leading community conservation programme, that contributed to 12,000 more Namibian elephants. This programme was based on liberal principle that involving people in conservation is right. It was also … Improving London’s environment Read More » How we can reduce air pollution quickly Leave a Comment / Uncategorized / By Rob Blackie Air pollution in London is appalling, sometimes at the level of Delhi.   Speed up taking dirty taxis off the road Taxis, both black cabs and others, are major contributors to air pollution in London. A combination of changing the licensing rules and incentives can cut pollution in just a few years.   Get dirty … How we can reduce air pollution quickly Read More » Posts navigation 1 2 Next Page → Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2018_11_five_things_we_can_do_to_improve_london_transport": "Five things we can do to improve London transport - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Five things we can do to improve London transport Leave a Comment / Uncategorized / By Rob Blackie 1. Encourage people to travel off-peak Our early bird fares policy, which cuts fares for people travelling before 7:30am rewards people for travelling earlier, and reduces overcrowding straight away. 2. Increase cycling I’ve campaigned for better cycling facilities in London for 25 years, and am a keen cyclist. I’d encourage London boroughs to copy Liberal Democrat Sutton’s successful Smarter Travel Sutton plan, which increased cycling by 75%. 3. More focus on maintenance and reliability Train, bus and tube delays are incredibly stressful for people who have to get to work or childcare in time. 4. Stop Brexit Brexit means falling Transport for London passenger revenues, and so less money for investment in public transport. It also means fewer skilled workers on Crossrail, one of the reasons it is delayed. 5. Regulate taxis properly Uber is a fantastic service. But it’s run by a company who have shown themselves to be completely untrustworthy. We need tough enforcement to make sure they play by the rules. Campaigning for safer cycling Post navigation ← Previous Post Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2018_09_how_namibian_women_got_equal_land_rights": "How Namibian women got equal land rights - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities How Namibian women got equal land rights Leave a Comment / Uncategorized / By Rob Blackie While I was working in Namibia as a young aid worker, in the 1990s, the ordinary farmers of Namibia faced a problem. After having half of their land stolen under colonialism, the other half was rapidly being stolen by the post independence elite. Despite the fact that this government presented itself at the Marxist end of Socialism, many of them, and their allies, spent the first years after independence in 1990 stealing land from the farmers of the country. The problem was that colonialism had left an extremely ambiguous law governing the ‘communal areas’ that accounted for almost half the country. Namibia is a semi-desert country, so these areas were largely open land, where traditionally you could graze your cows wherever you liked. Namibian farmers would often migrate a hundred miles with their cows to get better grazing for at least part of the year. The new elite who ran the country realised that they could get away with stealing this land by putting up ‘illegal fences’ and defending them, sometimes with armed men. Rob preparing for future Lib Dem campaigning photos by pointing at something in the desert The government publicly disapproved of this, even while many Ministers were stealing land themselves, sometimes areas of over 10 square kilometres at a time. One Minister managed to divert money intended to help poor farmers during a drought to drill a well on the land he had stolen. As an aid worker, I worked closely with these farmers on environmental programmes. I would travel round the rural areas, to places in the back of beyond, to seek out their opinions on the conservation programmes we worked on. While the farmers uniformly wanted to save their local wildlife, they were also furious that their grazing land was being stolen. Back at my base in the Ministry of Environment we lobbied for action on illegal fencing, while documenting it as we travelled around the country on work, often mapping fences that were miles long. Things moved very slowly. While there were allies in the government, there were plenty of Ministers who were happy to see the law drafted very slowly. In the end it took 8 years from Independence to have a White Paper. By that point my contract with the Namibian government was coming to an end. I had spent several years working with the farmers of Namibia, and had become deeply committed to them. So I started to work as a volunteer advocate for the union that represented Namibia’s poor farmers. They, of course, had no money, as well as no ability to get me a visa. So I found work with the United Nations Development Programme, working to tackle poverty in rural Namibia. They paid me, and sorted out a visa for me, so that in my spare time I could help the farmers lobby more effectively, get media coverage, and put pressure on the government. By 1999 draft legislation appeared. To my surprise, while in some forms it improved women’s rights to land, it contained an extraordinary clause. It said that while widows could inherit their husband’s land, they would lose it if they remarried. There was, of course, no mirroring provision saying that widowers would lose land they had inherited if they remarried. I quickly got together with a liberal lawyer (a veteran of Namibia’s anti apartheid struggle) and we got a message to a sympathetic Minister, together with our explanation of what was going on. We successfully got the government to change the clause and, after a long gap, the law eventually passed giving Namibian women equal land rights for the first time ever. By that point I’d lost my visa, and had to return to the UK. Eventually the legislation was passed and women got equal land rights. Recent research shows that this has made life much better for widows , even though there are still some significant problems. The legislation also made it harder to illegally fence, but even now, almost 15 years later, huge areas of Namibian land have been stolen, and there is only very slow progress in reversing it. My two and a half years working in Namibia were central to why I got actively involved in Liberal Democrat politics. I saw that decentralisation worked, and had transformed lives as well as saving the environment. Working on land issues like widow’s rights and illegal fencing I saw how determined action, over years, by my friends and colleagues, made huge changes in people’s lives, and the incredible satisfaction I got from this. A lot of this work was meetings under trees, unglamorous writing of policy arguments, phone calls to Ministers and civil servants, and constantly working to find where we could make progress. And finally I saw, just like in London, how fairness, economic success and the environment are inextricably linked. In Namibia it was wildlife, pollution, water and illegal fencing. In London it’s Brexit, bees and the cost of living crisis. Different places, different issues, but a common theme. Working in Namibia is also why, if I am elected, I would like to be judged on the success of our campaigns, not just the fact of campaigning.   We can, for instance, significantly reduce carbon emissions in London – with smart campaigning and a tight focus on what works. Post navigation Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2019_11_questions_about_the_lib_dems": "Questions about the Lib Dems? - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Questions about the Lib Dems? Leave a Comment / Uncategorized / By Rob Blackie If you have questions about the Lib Dems, then have a look at my friend Mark Pack’s website here. I also recommend my Twitter feed: www.twitter.com/robblackie The Lib Dem plan for a Brighter Future can be found on the official party website here: https://www.libdems.org.uk/brighter-future-plan Mark has also answered some common questions about the Manifesto here: https://libdemfaqs.markpack.org.uk/manifesto/ Post navigation ← Previous Post Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2019_10_dont_feed_the_wind_up_merchants": "Don't feed the wind up merchants! - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Don’t feed the wind up merchants! Leave a Comment / Uncategorized / By Rob Blackie Do you remember your class wind-up merchant? He says that you fancy the class teacher. You turn to him and shout ‘I don’t fancy the teacher!’ Everyone else overhears. At best they think it’s funny that you are angry. At worst they think that you fancy the teacher. Politics can be very like this. Labour’s plan to nationalise travel agents* One day Labour will say this in Parliament: ‘We are against hitting children. That’s why we must nationalise travel agents’. They ask the SNP to vote for it. The SNP refuse because it makes no sense. Labour spend the next 48 hours attacking the SNP for wanting to hit children. So the SNP hit back – loudly explaining that this is rubbish, and that they never hit children. Why is this bad for the SNP? Firstly many people just hear ‘SNP… hit… children’. And at some level the idea that the SNP are anti children sinks in. There’s vast psychological evidence of this. Secondly most of those attacks were in a Twitter bubble. People in that bubble were either Labour activists, or activists of other parties. Not many swing voters. But every SNP rebuttal meant that a few more normal people heard the attack. Why? Because social networks see this argument, and give it more reach. It’s really easy to assume that what we hear on social media is what everybody hears. But in reality very little of it gets to normal people – and you can see this for yourself if you look at polling changes or simply the conversations that happen when we are canvassing. Thirdly this distracts attention. Labour are in a mess on Brexit, and have a terrible leader. So if everybody spends the next 2 days talking about whether the SNP want to hit children, that’s a win for them. This is, of course, exactly what the Leave campaign did in 2016. It’s trolling by another name. So what can we do to fight trolls? Just as with the wind-up merchant, the key thing is to avoid a fight. Don’t feed the troll. You can do two more things: 1. Stick to saying things that help us politically. For instance that Brexit is a disaster for the NHS, cutting £40bn from public spending. And that Labour is in favour of Brexit. In school context this is making yourself more popular so that the wind-up merchant’s attacks aren’t listened to. 2. Innoculate us against attacks by saying positive things about our policies. For instance the Lib Dems have been campaignin g for years for fair mental health funding . Something that Labour chose to leave out of the NHS constitution. Find out more about troll fighting You can find out more about this in various things I’ve written – including two articles on how to stop Brexit ( part 1 , part 2 ), various media comments , and a speech I recently gave on Trump’s communications techniques . * Labour really did have a plan recently that implied they might want to nationalise travel agents. Post navigation ← Previous Post Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2019_09_september_2019_update": "September 2019 update - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities September 2019 update Leave a Comment / Uncategorized / By Rob Blackie I’m busy with four things at the moment: 1. Helping local Lib Dem parties around London fight against Brexit. If you’d like me to come and speak to your local party then email me on [email protected] 2.  Campaigning with local Lib Dem parties – you can find photos of some of the places I’ve been recently on my ‘Around London’ page on this website. 3. Digital training for Lib Dem activists – again email me if you’d like to attend any sessions. 4. Keeping up the pressure for the government and media to ensure fair digital campaigning in future elections and referendums. You can find my recent media coverage here: Sky: Is the government wasting money using Snapchat for their Brexit ads? Wired: How are the Conservatives using Facebook ads to gather data and test messages? BBC: How are the Conservatives testing messages on Facebook? OpenDemocracy / The Depolarisation Project: Can facts alone change people’s minds? The Daily Telegraph: Why are the Conservatives doing attack ads on Sarah Wolaston? Post navigation ← Previous Post Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2019_06_what_is_rob_doing_now": "What is Rob doing now? - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities What is Rob doing now? Leave a Comment / Uncategorized / By Rob Blackie I’m very busy with my campaign for the London Assembly. But I’m only updating this website very occasionally at the moment. I’m concentrating on the Lib Dem campaign to stop Brexit. This includes: Visiting Lib Dem local parties around London to help them campaign more effectively against Brexit. Get in contact with me if you’d like me to visit your local party. If you are a Lib Dem member in London you can join our special Facebook Group . Working on a campaign to help EU citizens in London – more soon on this. Using my technology knowledge to make sure Lib Dem campaigning in London is as effective as possible. I update the following feeds regularly: My political Twitter feed My technology Twitter feed My Facebook Page My LinkedIn profile Post navigation ← Previous Post Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2018_11_london_mayoral_assembly_results": "London Mayoral & Assembly results - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities London Mayoral & Assembly results Leave a Comment / Uncategorized / By Rob Blackie Thanks very much to everybody who supported my campaign, including the almost 100 volunteers who helped me. I’m proud of our campaign. We stood up for liberal values – and showed that it’s possible to talk about Brexit in a way that’s relevant to everyone’s lives. I’m going to go have a Nando’s with my kids tonight. Then tomorrow it’s onto the campaign trail to make sure we stop Brexit. Once that’s done, we can get more Liberal Democrats elected in 2020. See you all soon, Rob. The results are below. Mayor Siobhan Benita Rob Blackie Dinesh Dhamija Lucy Salek I’m delighted to see Siobhan as our Mayoral candidate. I’ve got to know her on the campaign trail and she will be fantastic. I look forward to working with her. Assembly I was placed 6th on the London Assembly list. To explain what might look like a big gap, I got the 2nd highest number of 1st preference votes for the London Assembly, but after transfers (ie people’s second preferences) and adjustments to make sure we have a list that reflects London’s diversity, I was placed sixth. I’ve campaigned for a more diverse political system for 20 years – so I’m delighted that these rules apply (even to me!) and that we have our most diverse list of candidates ever. Post navigation ← Previous Post Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2018_11_how_to_cut_crime_in_london": "How to cut crime in London - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities How to cut crime in London Leave a Comment / Uncategorized / By Rob Blackie I’ve campaigned to cut crime in London since the early 2000s. Back then I first saw the damage that the crack epidemic was doing to my community in Vauxhall.  So I got involved with a campaign to get a drugs treatment centre near my then-home in central Brixton. Local Labour councillors tried to stop us. But we successfully mobilised hundreds of people, including recovering addicts, to get it through. Tackling crime is complex but here are some policies that can reduce crime in London. Better mental health and addiction treatment. Within a month of the Lib Dems leaving government in 2015, the Conservatives cut £200m from public health budgets. Some of this was used for treating people with drug and alcohol problems. If we treat these problems better, we divert many people from crime. We also save many children from being taken into care, which is often a fast track to dropping out of school and getting involved in crime. Community policing Former Lib Dem candidate for London Mayor, Brian Paddick, often talks of the crucial role of soft intelligence in stopping crime. Recent police cuts have weakened the link between the police and our communities. This makes it harder for them to prevent crimes in the first place. This is also why our campaigns to save police stations are so important. This isn’t about the precise size and location of buildings. The police need to be based in the community, accessible, visible and connected to the people they serve. One simple policy we have championed in London is to make sure that Accident & Emergency departments have youth workers. They can work to divert injured young people from crime, at a time when they are often ready to listen. Better use of data to stop crime Lib Dems have championed the ‘Cardiff Model’ for over 10 years. In Cardiff hospitals shared anonymised data about victims of violence with the police. Two thirds of violent crime is never reported to the police, especially crimes involving gangs or domestic violence. This data allows the police to understand hotspots of crime and has dramatically cut violent crime in Cardiff. When I was a London Assembly candidate seven years ago in 2011, I campaigned for full implementation of the Cardiff model in South London. I discovered local hospitals had not implemented the Cardiff model. Focusing on the most prolific criminals 4,000 prolific criminals in London are responsible for £2.2bn of costs in London. They average 57 arrests over their lives. Focusing on diverting these criminals from crime could hugely cut crime. Post navigation ← Previous Post Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2018_11_fighting_brexit_is_our_biggest_opportunity_in_london": "London voters want the Lib Dems to fight Brexit - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities London voters want the Lib Dems to fight Brexit Leave a Comment / Uncategorized / By Rob Blackie How important is Brexit to London voters? Polling from the Centre for London shows that Brexit is the biggest issue for Londoners. Could it win votes for the Lib Dems? Hope Not Hate and Best for Britain polled this a few months ago across Britain, with a sample of 472 people in London. They asked how people would vote in a general election where the Liberal Democrats opposed Brexit and Labour voted in favour of Brexit. People responded: Liberal Democrats 36% Labour 22% Conservatives 33% Others 10% The lesson is simple: London voters are ready to vote Liberal Democrat if Labour continue to support Brexit, and if people know that the Liberal Democrats oppose Brexit. We won’t necessarily get results this dramatic, but there’s a huge opportunity for our party. Technical note YouGov poll 26th to 31st July 2018. London sample 472 people (unweighted). Figures are presented excluding ‘Don’t knows’, ‘Refused’ and ‘Would not vote’. Figures add to 101% because of rounding. Full question: How would you vote if there was another general election before the UK leaves the EU and the Conservative and Labour Parties both support going ahead with Brexit, and the Liberal Democrats are opposed to Brexit? If Labour were to oppose Brexit then the voting intention figures in this poll are Liberal Democrats 13%, Conservatives 35%, Labour 46%, Others 6%. Post navigation ← Previous Post Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2018_11_improving_londons_environment": "Improving London's environment - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Improving London’s environment Leave a Comment / Uncategorized / By Rob Blackie My record of action Caring for the environment has always been an important part of my life. As an aid worker on Namibia I worked on a world-leading community conservation programme, that contributed to 12,000 more Namibian elephants. This programme was based on liberal principle that involving people in conservation is right. It was also effective because it created local jobs, meaning that everyone had an interest in the programme succeeding. I’ve also worked closely with the UN Climate Change Convention, Christiana Figueres, and her leadership team. There I helped them create consensus that tackling climate change wasn’t just a good thing, but could solve many other social problems like air pollution and job creation. Recently I’ve helped them improve their digital campaigning. Closer to home, inspired by my own kid’s experience, I’m helping develop a new app, launching this autumn. If it works well, it will hugely increase re-use of children’s toys, clothes and equipment. A promise of more… I will fully integrate the environment into my broader policies. I will: Fight Brexit. It is crucial to tackling climate change. Tackle air pollution, pushing the Mayor to accelerate taking dirty buses and taxis off the road and pedestrianise Oxford street. Expand the environmental accounting approach used by the Lib Dems in Sutton, which gets developers to reduce and offset the full emissions of the housing, as well as increase biodiversity. Help private renters get better insulated housing, by pushing for more work to encourage landlords to improve insulation in rented housing. Private renters are the fastest growing group in London, but have the worst insulated housing, costing them a lot of money, with very little they can do about it. Post navigation ← Previous Post Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2018_11_how_we_can_reduce_air_pollution_quickly": "How we can reduce air pollution quickly - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities How we can reduce air pollution quickly Leave a Comment / Uncategorized / By Rob Blackie Air pollution in London is appalling, sometimes at the level of Delhi. Speed up taking dirty taxis off the road Taxis, both black cabs and others, are major contributors to air pollution in London. A combination of changing the licensing rules and incentives can cut pollution in just a few years. Get dirty buses off the road Dirty buses are being retired from central London and the worst polluted areas. But they are still planned for use in the rest of London for years. Encourage cycling I’ve campaigned for better cycling facilities in London for 25 years, and am a keen cyclist. I’d encourage London boroughs to copy Liberal Democrat Sutton’s successful Smarter Travel Sutton plan, which increased cycling by 75% and cut driving by 6%. Increase charges for dirty cars, coaches and delivery vehicles Tourist and other coaches and delivery vehicles, are a large source of pollution. Increasing the surcharge they face if they are dirty would give them strong incentives to avoid London or switch to cleaner vehicles. Divert parcel deliveries Internet shopping is fantastically convenient for many people. But it also means many more delivery vehicles driving around. We should pilot more pickup locations at places like train stations, so that we can cut pollution from delivery vehicles. Done right this will often be a more convenient delivery solution for many busy Londoners. Post navigation ← Previous Post Next Post → Leave a Comment Cancel Reply Your email address will not be published. Required fields are marked * Type here.. Name* Email* Website Δ Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_category_uncategorized_page_2": "Uncategorized Archives - Page 2 of 2 - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Uncategorized Privacy Leave a Comment / Uncategorized / By Rob Blackie This website collects a variety of data about you when you visit. None of it can, generally, easily personally identify you, unless you opt into my email newsletter. Though if you tell me you’re going on a weekend to Iceland and I see an Icelandic IP address in my analytics, I can take a guess. … Privacy Read More » How liberalism meant 12,000 more Namibian elephants Leave a Comment / Uncategorized / By Rob Blackie Elephants are in a dramatic decline across Africa. So how do you save them? Should you simply shoot poachers on sight, as Kenya does? Or try and work with the communities where they live? Working as an environmental economist in the Namibian government, I got to test this at first hand. When we went out … How liberalism meant 12,000 more Namibian elephants Read More » How Namibian women got equal land rights Leave a Comment / Uncategorized / By Rob Blackie While I was working in Namibia as a young aid worker, in the 1990s, the ordinary farmers of Namibia faced a problem. After having half of their land stolen under colonialism, the other half was rapidly being stolen by the post independence elite. Despite the fact that this government presented itself at the Marxist end … How Namibian women got equal land rights Read More » Posts navigation ← Previous Page 1 2 Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_2023_03_thank_you": "Thank you for letting me know! - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Thank you for letting me know! / Thank You / By Rob Blackie If you know other Lib Dem members, then you might want to forward my email to them. As usual, if you need to get in contact, you can email me on [email protected] Post navigation ← Previous Post Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_category_thank_you": "Thank You Archives - Rob Blackie Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Thank You Thank you for letting me know! Thank You / By Rob Blackie If you know other Lib Dem members, then you might want to forward my email to them. As usual, if you need to get in contact, you can email me on [email protected] Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "https_www_rob4london_com_author_toqxo6_page_2": "Rob Blackie, Author at Rob Blackie - Page 2 of 2 Skip to content Rob Blackie Lib Dem Candidate for Mayor of London About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Rob Blackie Lib Dem Candidate for Mayor of London Main Menu About Rob Menu Toggle My CV My Story Around London In The Media My Priorities Author name: Rob Blackie Five things we can do to improve London transport Leave a Comment / Uncategorized / By Rob Blackie 1. Encourage people to travel off-peak Our early bird fares policy, which cuts fares for people travelling before 7:30am rewards people for travelling earlier, and reduces overcrowding straight away.   2. Increase cycling  I’ve campaigned for better cycling facilities in London for 25 years, and am a keen cyclist. I’d encourage London boroughs to copy … Five things we can do to improve London transport Read More » Privacy Leave a Comment / Uncategorized / By Rob Blackie This website collects a variety of data about you when you visit. None of it can, generally, easily personally identify you, unless you opt into my email newsletter. Though if you tell me you’re going on a weekend to Iceland and I see an Icelandic IP address in my analytics, I can take a guess. … Privacy Read More » How liberalism meant 12,000 more Namibian elephants Leave a Comment / Uncategorized / By Rob Blackie Elephants are in a dramatic decline across Africa. So how do you save them? Should you simply shoot poachers on sight, as Kenya does? Or try and work with the communities where they live? Working as an environmental economist in the Namibian government, I got to test this at first hand. When we went out … How liberalism meant 12,000 more Namibian elephants Read More » How Namibian women got equal land rights Leave a Comment / Uncategorized / By Rob Blackie While I was working in Namibia as a young aid worker, in the 1990s, the ordinary farmers of Namibia faced a problem. After having half of their land stolen under colonialism, the other half was rapidly being stolen by the post independence elite. Despite the fact that this government presented itself at the Marxist end … How Namibian women got equal land rights Read More » Posts navigation ← Previous Page 1 2 Sign Up For Updates! First Name Last Name Email I agree to receive emails from Rob Blackie Leave this field empty if you're human: Read More About Rob My CV My Story Around London In The Media My Priorities Copyright © 2026 Rob Blackie | Powered by Astra WordPress Theme This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
}