{
  "https_davidwhitereform_uk/https_davidwhitereform_uk_about-me/content_2.html": "I live in the Borough of Barnsley with my Fiancee and our mad cocker spaniel Wesley. I have lived here for over ten years\nI live in the Borough of Barnsley with my Fiancee and our mad cocker spaniel Wesley. I have lived here for over ten years.\nMy political CV includes being a member of the Conservative Party for as long as I can remember. I have held various roles, including Deputy Chairman of two Associations, Chairman of one Conservative Association and Chairman of South Yorkshire Conservatives.\nI stood to be elected 3 years ago in Barnsley (Hoyland Milton), missing out by just over 100 votes. The following year (after a determined and prolonged campaign)I was elected as a Conservative Councillor in Barnsley Rockingham Ward (some feat).\nBecoming rapidly disillusioned with Conservative policies, along with PartyGate, lockdowns, leadership changes, and much more, I contacted Reform UK and liked what I saw and heard. Almost 2 years ago I defected to Reform UK and haven’t looked back.\nIn my minimal spare time, I enjoy gardening, cooking, traveling, and reading (mainly political biographies and autobiographies).\nI aim to balance my reading, and one of the most compelling books that I have read in recent years was a biography of Jeremy Corbyn. Whilst I tend to agree with most of the UK that his politics are bonkers, his belief, consistency and self determination I found admirable.\nThe political will and determination of Mrs Thatcher has shaped so many politicians views from many parties, most famously perhaps Tony Blair. Her autobiographies were insightful, especially her views and stance on Europe as we now look back over the last 25 years or so.\nOn a local level, I feel that the miners were politicised and that the area is still recovering. Im delighted to say that Reform UK supports in full the findings of the BEIS report into miners pensions.\nSince being elected in 2022 I feel that I have helped many residents to the best of my abilities. Small wins include\n- Major Road Resurfacing\n- Resident fencing where EVRi has been invasive\n- Countless neighbourly dispute interventions and amicable solutions\n- Setting up the initial EVRi liaison meetings with Councillors and residents\n- Dangerous trees felled in many areas\n- Initiating emergency bin collections\n- Opposing further green belt development\n- Working closely with SYP across many issues\n- Opposing and now observing Primrose Way change of use planning.\n- Hoyland Market Place (Say no more)\n- Warehouse and factory noise management\n- Achieving additional waste bins for Rockingham\n- Countless pot-hole and fly-tipping reports and rectifications\n- Signposted many residents to professional services for help and advice.",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_2024_07_18_wokeism/content_17.html": "SYP Observer Shifts\n13 May 2024How Will Labour Handle Woke?\nFirstly, a definition of “woke’, this new buzzword, may be appropriate.\nThe Cambridge Dictionary, somewhat vaguely describes ‘Woke’ as the following: ‘aware, especially of social problems such as racism and inequality’.\nHowever, many people have a different view. Many people see a minority of leftie labour activists who are simply stirring up the woke agenda for a variety of personal reasons.\nTraditionally, the Labour Party consisted of mainly working-class people, in agreement with most things societal. Family, a strong work ethic, community, and care of these beliefs that transcended personal wealth or materialism.\nWith the shift to London-centric Labour members and activists since Blair came to power, many of them privileged graduates and ‘rich kids’, some in the Labour Party looked for a new voice of dissent, and ‘wokeism’ was born. Social media gave them an easy voice, and collectively, new ‘issues’ became apparent that historically were never considered.\nSame-sex marriage was made legal by David Cameron, with minimal debate or opposition. Fine, even though our Christian-based democratic country had lived for centuries accepting the statute of marriage, both religiously and legally.\nOne issue that constantly hits the headlines (even though fuelled by a tiny percentage of the UK population) is gender identity. In most circles where this may be discussed, some very strong opinions are voiced. Labour and Conservatives have simply skirted around the penis / vagina debate for fear of upsetting the woke minority.\nHowever, many women, who have strived for equal rights in their workplaces for many years are now seeing fully mature men, identifying as women, using female changing rooms and toilets. This has to be a backwards step for women and women’s rights.\nA huge issue with ‘wokeism’ is the inability to respond or debate someone’s views without them resorting to ‘offence’ or even hate crime allegations. Surely everyone has a right to speak out in debate without being closed down with these cheap jibes. Even the Police have jumped on board with this, investigating social media posts that may offend some people.\nThe Racial and Religious Hatred Act 2006 and the Equality Act 2010 have placed huge power in the hands of the police and courts. Much of the legislation is valid, but elements such as ‘making it a criminal offence to use words which, in certain circumstances may be deemed ‘insulting’ or ‘abusive’, or to send a communication that may be deemed ‘grossly offensive’ have the potential to be misapplied.\nIn 2018 South Yorkshire Police tweeted ‘In addition to reporting hate crime, please report non-crime hate incidents, which can include things like offensive or insulting comments, online, in person or in writing. Hate will not be tolerated in South Yorkshire”\nIs it the job of the police to decide what offends some people and not others? Policing the streets is one thing. It is a dangerous step to allow ‘policing of the mind’.\nFreedom of speech is a fundamental part of our democracy and heritage. Indeed, if people hadn’t spoken out over centuries, our country would be much poorer. Debate is almost impossible now, and this is dangerous territory and a step toward Totalitarianism when a minority controls the voice of most of the population.\nSo it will be interesting to see how Labour handles ‘woke’. If they dare even acknowledge its’ very existence.",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_2024_04_13_electric-cars/content_8.html": "On a more serious note though, there is much speculaton that these ‘pioneering’ vehicles, fuelled (pardon the pun) by political will over retail desire in many cases, will be archaic and worthless in the next 10 years, as technology and hydrogen take over.\nMany similarities I feel with the original mobile phones. Technology rampaged and rendered them worthless. But a huge difference here is the outlay of a few hundred pounds for early phones to the many thousands of pounds ‘invested’ in EV’s.\nAll this, just as the internal combustion engine reaches close to perfection.\nCharging\nEV aficionados will tell us how the charging network is fit for purpose, and charging times are acceptable. More honest EV drivers tell me that if they can find a charger that works, you can bet your life someone else has just plugged in for 20 mins in front of them, doubling the time spent buying unwanted coffee and lounging around counting down the minutes left until the next meeting 20KWH away.\nIn my view, not only buyers but also manufacturers should be given the choice of which vehicle to manufacture and people to buy. The UK’s insignificant net contribution to Co2 emissions renders EVs pretty much irrelevant in the Net Zero crusade that the BRIC economies flaunt in our faces.\nChina\nThe cheap influx of Chinese vehicles has the motor manufacturing industry quaking across the globe. Subsidised factories and tax breaks ensure that their cheaper cars are achieving a foothold in many Western markets, the UK included.\nBiden’s response – to simply add a 100% tariff, doubling the price of imported Chinese cars. And that won’t receive a robust response Joe?\nGovernment Responsibility\nJust like encouraging everyone to buy diesel cars not so many years ago, then U-turning, phasing our internal combustion engines (then extending the period), I see this as an ill-conceived and politically driven strategy that takes away freedom of choice for the consumer and manufacturers, where many thousands of jobs are at risk.\nHeat pumps, additional mathematics, and age restrictions on buying cigarettes, are we experiencing 1984, albeit 40 years late.",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_2024_05_13_local-overdevelopment/content_14.html": "Its not just happening in Barnsley, it is happening across the UK. Over-development of areas with housing and industry but seemingly without the consideration of local infrastructure and highways.\nI drive around new housing estates and see the brand new waste disposal sewer pipes being put in place, knowing that they are all feeding into existing sewers, some of which are hundreds of years old and certainly not designed to carry the expected capacity.\nThe housing crisis is well known. However, many say that simply building more houses is not the answer? That sounds fairly contradictory, supply and demand. But this may well be the crux of the issue.\nOur net immigration in this country is beyond critical. The Cameron Government pledged to achieve net-migration around 10,000, but here we are around 500,000 p/a. So do we simply build more houses for immigrants, legal or illegal?\nLets be very clear about this, house builders certainly don’t want to flood the market with new, affordable housing. What’s that going to do for their profits? And who can blame them, they are in business to make money.\nHouse prices are too high, something immediately obvious when comparing prices with Europe. And the Government (along with Labour before) have not addressed basic planning law that allows developers to secure land for building then gradually drip-feed properties and housing estates into the market to achieve maximum yield per acre.\nAdd into the mix the high number of foreign investors buying property in the UK for rental, and the housing crisis looks set to continue.\nJust like the NHS, defence, the economy, policing, the court system and most other public services here, radical reform is needed, as the last 20 years have shown no progress, only regression.",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_2024_03_14_evri/content_15.html": "It’s no secret that the EVRi deal was not an overnight decision by EVRi or BMBC.\nTiming is everything, and in many residents views, the Covid lockdowns presented an opportunity to announce the plans for the largest parcel distribution hub in Europe on Hoylands once greenspace’.\nThe ink had hardly dried on the planning department’s approval (whilst residents were locked down, shielding) as the first steel structures sprouted up in proud defiance of residents’ views and vehement opposition.\nI received a fair amount of ‘flak’ for opposing the EVRI development (and look what else has sprung up since), but I have also spoken to literally countless residents whose lives (let alone property values) have been affected forever.\nOlympus Way may have relieved traffic on Sheffield Road, at the considerable cost of light pollution, increased HGV traffic around the entire area, the destruction of wildlife habitats and the once beautiful views gone forever.\nI argued against the economic ‘benefits’ that warehousing brings to communities, and have been proved to be right. Low-paid labour is shipped in and out at each shift, contributing next to nothing to our town’s economy other than a bottle of pop at the CO-OP.\nLow-paid staff are often receiving top-up benefits, so there is no wealth creation. They can not aspire to buy a house here, raise a family, or dare I say, contribute to the community.\nYet ”we’ continue to attract rate-paying sheds to the once lovely area, with only one winner – the business owners.",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_my-politics/content_10.html": "My Politics:\nI have had a lifelong interest in politics. Until a couple of years ago I was a member of the Conservative Party (after a brief dalliance with The Brexit Party.\nHaving seen the Conservatives self destruction over the last decade, I switched to Reform UK.\nI believe in mildly right-of-centre politics, much as was the state of the UK in the 1980’s and early 1990’s Conservatives.\nPretty much most of Reform UK’s Contract with the People I agree. with. Controlled Immigration, an immediate halt to illegal immigration, fixing the NHS (fully costed solution), increased defence spending, care for our valued veterans and much more, please take a read.\nI believe in minimal state intervention (the opposite of what is happening right now), and in a welfare state that is a safety net for those that genuinely need it.\nI believe that we have been influenced too strongly by a liberal woke agenda that criticises free speech.\n“We have a new national religion – liberal wokedom – and anyone who blasphemes against it can expect to be vilified by its high priests and followers”.\nThose who hold positions of prominence or influence had better be careful, for they risk seeing their reputations or livelihoods destroyed if they dare express dissent.\nReal debate is very difficult now, as one party may claim to have been offended’ at what has been said. Healthy debate generates balanced outcomes, but not when parties or individuals become obsessed with labels and agendas that stifle even considered commentary.\nOur democracy is built on the virtues of freedom of speech, I believe that this should be fought for in order to return to common sense debate.",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_disclaimer/content_3.html": "We go to every effort to always make sure that all the information and content on our website davidwhitereform.uk is accurate.\nThe website is however provided to you without any endorsement or representation made, and without any warranty of any type or kind, whether expressed or implied, including but in no way limited to the implied warranties of satisfactory quality, any fitness for due purpose, non-infringement, compatibility with any other system of equipment, security and accuracy in any way.\nUnder no circumstances will we become liable for any damage or loss including, without limitation, indirect or consequential loss or damage or any loss or damages arising from use, or the loss of or use of data, or profits arising out of or in connection with the use of the davidwhitereform.uk website.\nWe do not warrant that the functions contained within this site will be uninterrupted or error free, that defects will be corrected, or that this website or the server on which it is hosted are free from computer viruses or indeed represent the functionality, accuracy or reliability of any of the materials.\nAlthough we from time to time monitor and review discussions, postings, transmissions, bulletin boards, blogs and suchlike on this site, we are under no obligation to do so and assume no responsibility or liability arising from the content of any such locations, nor for any error, omission, defamation, obscenity or inaccuracies that might be contained in information on any of the locations on davidwhitereform.uk",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_author_david/content_13.html": "How Will Labour Handle Woke? Firstly, a definition of “woke’, this new buzzword, may be appropriate. The Cambridge Dictionary, somewhat vaguely describes ‘Woke’ as the […]\nLocal Over-Development Its not just happening in Barnsley, it is happening across the UK. Over-development of areas with housing and industry but seemingly without the consideration […]\nWhat happened to the miners pension fund? In 1994, a privatisation agreement was signed meaning the government would get half of any surplus cash from a […]",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_privacy-policy/content_9.html": "Privacy Policy\n==============\nLast updated: May 14, 2024\nThis Privacy Policy describes Our policies and procedures on the collection,\nuse and disclosure of Your information when You use the Service and tells You\nabout Your privacy rights and how the law protects You.\nWe use Your Personal data to provide and improve the Service. By using the\nService, You agree to the collection and use of information in accordance with\nthis Privacy Policy.\nInterpretation and Definitions\n——————————\nInterpretation\n~~~~~~~~~~~~~~\nThe words of which the initial letter is capitalized have meanings defined\nunder the following conditions. The following definitions shall have the same\nmeaning regardless of whether they appear in singular or in plural.\nDefinitions\n~~~~~~~~~~~\nFor the purposes of this Privacy Policy:\n* Account means a unique account created for You to access our Service or\nparts of our Service.\n* Affiliate means an entity that controls, is controlled by or is under\ncommon control with a party, where “control” means ownership of 50% or\nmore of the shares, equity interest or other securities entitled to vote\nfor election of directors or other managing authority.\n* Company (referred to as either “the Company”, “We”, “Us” or “Our” in this\nAgreement) refers to David White Reform UK.\n* Cookies are small files that are placed on Your computer, mobile device or\nany other device by a website, containing the details of Your browsing\nhistory on that website among its many uses.\n* Country refers to: United Kingdom\n* Device means any device that can access the Service such as a computer, a cellphone or a digital tablet.\n* Personal Data is any information that relates to an identified or\nidentifiable individual.\n* Service refers to the Website.\n* Service Provider means any natural or legal person who processes the data\non behalf of the Company. It refers to third-party companies or\nindividuals employed by the Company to facilitate the Service, to provide\nthe Service on behalf of the Company, to perform services related to the\nService or to assist the Company in analyzing how the Service is used.\n* Usage Data refers to data collected automatically, either generated by the\nuse of the Service or from the Service infrastructure itself (for example,\nthe duration of a page visit).\n* Website refers to David White Reform UK, accessible from\n[davidwhitereform.uk](davidwhitereform.uk)\n* You means the individual accessing or using the Service, or the company,\nor other legal entity on behalf of which such individual is accessing or\nusing the Service, as applicable.\nCollecting and Using Your Personal Data\n—————————————\nTypes of Data Collected\n~~~~~~~~~~~~~~~~~~~~~~~\nPersonal Data\n*************\nWhile using Our Service, We may ask You to provide Us with certain personally\nidentifiable information that can be used to contact or identify You.\nPersonally identifiable information may include, but is not limited to:\n* Email address\n* First name and last name\n* Usage Data\nUsage Data\n**********\nUsage Data is collected automatically when using the Service.\nUsage Data may include information such as Your Device’s Internet Protocol\naddress (e.g. IP address), browser type, browser version, the pages of our\nService that You visit, the time and date of Your visit, the time spent on\nthose pages, unique device identifiers and other diagnostic data.\nWhen You access the Service by or through a mobile device, We may collect\ncertain information automatically, including, but not limited to, the type of\nmobile device You use, Your mobile device unique ID, the IP address of Your\nmobile device, Your mobile operating system, the type of mobile Internet\nbrowser You use, unique device identifiers and other diagnostic data.\nWe may also collect information that Your browser sends whenever You visit our\nService or when You access the Service by or through a mobile device.\nTracking Technologies and Cookies\n*********************************\nWe use Cookies and similar tracking technologies to track the activity on Our\nService and store certain information. Tracking technologies used are beacons,\ntags, and scripts to collect and track information and to improve and analyze\nOur Service. The technologies We use may include:\n* Cookies or Browser Cookies. A cookie is a small file placed on Your\nDevice. You can instruct Your browser to refuse all Cookies or to indicate\nwhen a Cookie is being sent. However, if You do not accept Cookies, You\nmay not be able to use some parts of our Service. Unless you have adjusted\nYour browser setting so that it will refuse Cookies, our Service may use\nCookies.\n* Web Beacons. Certain sections of our Service and our emails may contain\nsmall electronic files known as web beacons (also referred to as clear\ngifs, pixel tags, and single-pixel gifs) that permit the Company, for\nexample, to count users who have visited those pages or opened an email\nand for other related website statistics (for example, recording the\npopularity of a certain section and verifying system and server\nintegrity).\nCookies can be “Persistent” or “Session” Cookies. Persistent Cookies remain on\nYour personal computer or mobile device when You go offline, while Session\nCookies are deleted as soon as You close Your web browser. You can learn more\nabout cookies on [TermsFeed\nwebsite](https://www.termsfeed.com/blog/cookies/#What_Are_Cookies) article.\nWe use both Session and Persistent Cookies for the purposes set out below:\n* Necessary / Essential Cookies\nType: Session Cookies\nAdministered by: Us\nPurpose: These Cookies are essential to provide You with services\navailable through the Website and to enable You to use some of its\nfeatures. They help to authenticate users and prevent fraudulent use of\nuser accounts. Without these Cookies, the services that You have asked for\ncannot be provided, and We only use these Cookies to provide You with\nthose services.\n* Cookies Policy / Notice Acceptance Cookies\nType: Persistent Cookies\nAdministered by: Us\nPurpose: These Cookies identify if users have accepted the use of cookies\non the Website.\n* Functionality Cookies\nType: Persistent Cookies\nAdministered by: Us\nPurpose: These Cookies allow us to remember choices You make when You use\nthe Website, such as remembering your login details or language\npreference. The purpose of these Cookies is to provide You with a more\npersonal experience and to avoid You having to re-enter your preferences\nevery time You use the Website.\nFor more information about the cookies we use and your choices regarding\ncookies, please visit our Cookies Policy or the Cookies section of our Privacy\nPolicy.\nUse of Your Personal Data\n~~~~~~~~~~~~~~~~~~~~~~~~~\nThe Company may use Personal Data for the following purposes:\n* To provide and maintain our Service , including to monitor the usage of\nour Service.\n* To manage Your Account: to manage Your registration as a user of the\nService. The Personal Data You provide can give You access to different\nfunctionalities of the Service that are available to You as a registered\nuser.\n* For the performance of a contract: the development, compliance and\nundertaking of the purchase contract for the products, items or services\nYou have purchased or of any other contract with Us through the Service.\n* To contact You: To contact You by email, telephone calls, SMS, or other\nequivalent forms of electronic communication, such as a mobile\napplication’s push notifications regarding updates or informative\ncommunications related to the functionalities, products or contracted\nservices, including the security updates, when necessary or reasonable for\ntheir implementation.\n* To provide You with news, special offers and general information about\nother goods, services and events which we offer that are similar to those\nthat you have already purchased or enquired about unless You have opted\nnot to receive such information.\n* To manage Your requests: To attend and manage Your requests to Us.\n* For business transfers: We may use Your information to evaluate or conduct\na merger, divestiture, restructuring, reorganization, dissolution, or\nother sale or transfer of some or all of Our assets, whether as a going\nconcern or as part of bankruptcy, liquidation, or similar proceeding, in\nwhich Personal Data held by Us about our Service users is among the assets\ntransferred.\n* For other purposes : We may use Your information for other purposes, such\nas data analysis, identifying usage trends, determining the effectiveness\nof our promotional campaigns and to evaluate and improve our Service,\nproducts, services, marketing and your experience.\nWe may share Your personal information in the following situations:\n* With Service Providers: We may share Your personal information with\nService Providers to monitor and analyze the use of our Service, to\ncontact You.\n* For business transfers: We may share or transfer Your personal information\nin connection with, or during negotiations of, any merger, sale of Company\nassets, financing, or acquisition of all or a portion of Our business to\nanother company.\n* With Affiliates: We may share Your information with Our affiliates, in\nwhich case we will require those affiliates to honor this Privacy Policy.\nAffiliates include Our parent company and any other subsidiaries, joint\nventure partners or other companies that We control or that are under\ncommon control with Us.\n* With business partners: We may share Your information with Our business\npartners to offer You certain products, services or promotions.\n* With other users: when You share personal information or otherwise\ninteract in the public areas with other users, such information may be\nviewed by all users and may be publicly distributed outside.\n* With Your consent : We may disclose Your personal information for any\nother purpose with Your consent.\nRetention of Your Personal Data\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nThe Company will retain Your Personal Data only for as long as is necessary\nfor the purposes set out in this Privacy Policy. We will retain and use Your\nPersonal Data to the extent necessary to comply with our legal obligations\n(for example, if we are required to retain your data to comply with applicable\nlaws), resolve disputes, and enforce our legal agreements and policies.\nThe Company will also retain Usage Data for internal analysis purposes. Usage\nData is generally retained for a shorter period of time, except when this data\nis used to strengthen the security or to improve the functionality of Our\nService, or We are legally obligated to retain this data for longer time\nperiods.\nTransfer of Your Personal Data\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nYour information, including Personal Data, is processed at the Company’s\noperating offices and in any other places where the parties involved in the\nprocessing are located. It means that this information may be transferred to —\nand maintained on — computers located outside of Your state, province, country\nor other governmental jurisdiction where the data protection laws may differ\nthan those from Your jurisdiction.\nYour consent to this Privacy Policy followed by Your submission of such\ninformation represents Your agreement to that transfer.\nThe Company will take all steps reasonably necessary to ensure that Your data\nis treated securely and in accordance with this Privacy Policy and no transfer\nof Your Personal Data will take place to an organization or a country unless\nthere are adequate controls in place including the security of Your data and\nother personal information.\nDelete Your Personal Data\n~~~~~~~~~~~~~~~~~~~~~~~~~\nYou have the right to delete or request that We assist in deleting the\nPersonal Data that We have collected about You.\nOur Service may give You the ability to delete certain information about You\nfrom within the Service.\nYou may update, amend, or delete Your information at any time by signing in to\nYour Account, if you have one, and visiting the account settings section that\nallows you to manage Your personal information. You may also contact Us to\nrequest access to, correct, or delete any personal information that You have\nprovided to Us.\nPlease note, however, that We may need to retain certain information when we\nhave a legal obligation or lawful basis to do so.\nDisclosure of Your Personal Data\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nBusiness Transactions\n*********************\nIf the Company is involved in a merger, acquisition or asset sale, Your\nPersonal Data may be transferred. We will provide notice before Your Personal\nData is transferred and becomes subject to a different Privacy Policy.\nLaw enforcement\n***************\nUnder certain circumstances, the Company may be required to disclose Your\nPersonal Data if required to do so by law or in response to valid requests by\npublic authorities (e.g. a court or a government agency).\nOther legal requirements\n************************\nThe Company may disclose Your Personal Data in the good faith belief that such\naction is necessary to:\n* Comply with a legal obligation\n* Protect and defend the rights or property of the Company\n* Prevent or investigate possible wrongdoing in connection with the Service\n* Protect the personal safety of Users of the Service or the public\n* Protect against legal liability\nSecurity of Your Personal Data\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nThe security of Your Personal Data is important to Us, but remember that no\nmethod of transmission over the Internet, or method of electronic storage is\n100% secure. While We strive to use commercially acceptable means to protect\nYour Personal Data, We cannot guarantee its absolute security.\nChildren’s Privacy\n——————\nOur Service does not address anyone under the age of 13. We do not knowingly\ncollect personally identifiable information from anyone under the age of 13.\nIf You are a parent or guardian and You are aware that Your child has provided\nUs with Personal Data, please contact Us. If We become aware that We have\ncollected Personal Data from anyone under the age of 13 without verification\nof parental consent, We take steps to remove that information from Our\nservers.\nIf We need to rely on consent as a legal basis for processing Your information\nand Your country requires consent from a parent, We may require Your parent’s\nconsent before We collect and use that information.\nLinks to Other Websites\n———————–\nOur Service may contain links to other websites that are not operated by Us.\nIf You click on a third party link, You will be directed to that third party’s\nsite. We strongly advise You to review the Privacy Policy of every site You\nvisit.\nWe have no control over and assume no responsibility for the content, privacy\npolicies or practices of any third party sites or services.\nChanges to this Privacy Policy\n——————————\nWe may update Our Privacy Policy from time to time. We will notify You of any\nchanges by posting the new Privacy Policy on this page.\nWe will let You know via email and/or a prominent notice on Our Service, prior\nto the change becoming effective and update the “Last updated” date at the top\nof this Privacy Policy.\nYou are advised to review this Privacy Policy periodically for any changes.\nChanges to this Privacy Policy are effective when they are posted on this\npage.\nContact Us\n———-\nIf you have any questions about this Privacy Policy, You can contact us:\n* By email: info@davidwhitereform.uk",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_2024_05_13_syp-observer-shifts/content_18.html": "It is most kids’ dream (or used to be anyway) to spend a couple of hours with the local police on a shift in a police car, so when I approached SYP Hoyland Sgt. Jenkins about the possibility, he welcomed it.\nSYP appreciated the exposure that my time with them generated, enough to be asked back late last year.\nWhat did I learn? The ‘insider’ knowledge is incredible. Recognising people that may require some ‘attention’, cruising past properties that are known areas for crime, but also knowing the people that need help. Countless times we stopped to ask about the welfare of people in the street.\nIts not all about chasing motorists with our blue lights & sirens, although I did have a taste of that, which was both nervy and enthralling. The result – needless to say I can’t mention it!\nI also experienced an ‘incident’ that was most serious, involving imminent threats to life. I recognised the severity of the situation when I was told simply “David, maybe stay in the car for this one”. I did. And I’m pleased to report that it was a hoax call.\nIn summary, both nights were relatively ‘quiet’ which wasn’t a bad thing for me, but I did see plenty of ‘action’.\nIll stress again if I may, the local knowledge and awareness demonstrated by the officers was incredible. As was their commitment.",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_contact/content_5.html": "David White – Reform UK Barnsley South Spokesperson.South Yorkshire Co-Ordinator\nTo Email Me Please Fill Out the Form\n+44 7562 550257",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_constituency-info/content_11.html": "Barnsley South Constituency\n1 Dearne North\n2 Dearne South\n3 Darfield\n4 Hoyland Milton\n5 Rockingham\n6 Stairfoot\n7 Wombwell\n8 Worsbrough\n9 Kingstone\nDo you want to help?\nJoin Us\n[contact-form-7 id=\"54\" title=\"Contact Form\"]\n1 Dearne North\n2 Dearne South\n3 Darfield\n4 Hoyland Milton\n5 Rockingham\n6 Stairfoot\n7 Wombwell\n8 Worsbrough\n9 Kingstone",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_2024_03_14_miners-pensions/content_7.html": "What happened to the miners pension fund?\nIn 1994, a privatisation agreement was signed meaning the government would get half of any surplus cash from a miners’ pension scheme, in return for guaranteeing that pensions would increase. The government confirmed it had received £4.8bn from the scheme over the last 30 years.\nThe investments have generally been successful in generating excellent returns which has resulted in surpluses at some of the actuarial valuations. These surpluses have allowed the Trustees to award extra benefits to members, usually in the form of bonus pensions.\nIn April 2021 a cross-party committee of MPs said the government should stop taking money from the scheme and pay back some of what it had already received.\nMinisters rejected those recommendations and data released to the BBC under Freedom of Information laws shows the government has received three annual payments of £142.4m since then.\nWhile many schemes are overseen by the Pensions Regulator, the piece of law that led to this agreement means the government has sole responsibility.\nLabour’s shadow energy security and net zero secretary Ed Miliband told the BBC there has been “deep unfairness and injustice” in the Conservative Party’s approach to the arrangement.\nHe said a Labour government would carry out a “comprehensive revision of the arrangements to make sure that miners get the fair share of the money to which they are entitled”.\nInterestingly, this was never addresses at he time that Labour were in Government.\nReform UK supports the recommendations in the BEIS Miners Pension Report in full.",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_news_page_2/content_16.html": "My news from across Barnsley South along with my thoughts on politically related issues. Please note that these are my views and not necessarily the views of The Reform Party\nBlogs\n13 May 2024\nPublished by David on 13 May 2024\nCategories\nUncategorised\nLocal Over-Development Its not just happening in Barnsley, it is happening across the UK. Over-development of areas with housing and industry but seemingly without the consideration […]\n13 May 2024\nPublished by David on 13 May 2024\nCategories\nUncategorised\n‘Joy-Riding’ with SYP It is most kids’ dream (or used to be anyway) to spend a couple of hours with the local police on a shift […]\n18 July 2024",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_faqs/content_4.html": "Faq's\nReform UK is a political party less than 3 years old. We are currently polling very close behind the Conservative Party in the UK, ahead of the Lib Dems and the Greens.\nIn our view this is because we represent the views of so many people in the UK. Reform UK says what people are thinking.\nIf we can get a handful of MP’s elected in the next General Election it will give millions of people a voice across the UK.\nBy having a voice in Westminster, Reform UK can hold to account any Government that is in place. Putting pressure on decisions made and speaking out for what many people are thinking.\nThis willhelp our party to grow membership and support through common sense policies.\nYou may want to simply join Reform UK. You may want to help our candidates to campaign, or you may even want to apply to be a Reform UK candidate yourself.\nVisit the Reform Party HERE\nJoin Reform UK...\nBritain needs Reform, and Reform UK needs you – enquire now and help save our country\nConsidering Defecting?\nMember of another political party considering defecting, get in touch\nMiners Pensions\nReform UK support in full all of the recommendations in the BEIS Miners Pension Report",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_news/content_6.html": "My news from across Barnsley South along with my thoughts on politically related issues. Please note that these are my views and not necessarily the views of The Reform Party\nBlogs\n14 March 2024\n14 March 2024\nPublished by David on 14 March 2024\nCategories\nUncategorised\nWhat happened to the miners pension fund? In 1994, a privatisation agreement was signed meaning the government would get half of any surplus cash from a […]\n13 April 2024\nPublished by David on 13 April 2024\nCategories\nUncategorised\nPost — I’m sure it’s not just me, and I am sure that their are many people out there enjoying their electric vehicles. The motivations for […]",
  "https_davidwhitereform_uk/https_davidwhitereform_uk/content_1.html": "Cllr David White Reform UK\nBarnsley South\nI am a Reform UK Councillor representing the Rockingham Ward in Barnsley South, and I am the county organiser for South Yorkshire for Reform UK\nAbout Me\nI live in the Borough of Barnsley with my Fiancee and our mad cocker spaniel Wesley. I have lived here for over ten years…..read more\nMy Politics\nI have had a lifelong interest in politics and until a couple of years ago was a member of the Conservative Party (after a brief dalliance… read more\nGet in Touch\nAny issues that you may have, locally or of a national political issue, please contact HERE. I do my best to help people, regardless of …read more\nAs well as being an active local Reform UK Cllr in Barnsley, having sat on the licensing, Standards, and Planning boards, I also hold a few roles within Reform UK.\nI am the county Organiser, responsible for looking after Barnsley, Rotherham, Sheffield, and Doncaster candidates and activists.\nI am also one of several Party members that interview potential Parliamentary candidates nationally.\nI am also the first point of contact for anyone considering defecting from other political parties.\nCampaigning\nCampaigning with just a few of our hugely motivated activists across Barnsley South.\nIn all my time in politics, I have never before met such a determined group of people, who ‘get of their backsides’ for the first time to help bring much-needed change to the UK.\nHumbling to see the support given by these passionate and caring people from all walks of life. Respect to you all.\nJoin Reform UK...\nBritain needs Reform, and Reform UK needs you – enquire now and help save our country\nConsidering Defecting?\nMember of another political party considering defecting, get in touch\nMiners Pensions\nReform UK support in full all of the recommendations in the BEIS Miners Pension Report",
  "https_davidwhitereform_uk/https_davidwhitereform_uk_considering-defecting-to-reform-uk/content_12.html": "Are your political beliefs and convictions still in line with the political party that you represent?\nAre you thinking of defecting to Reform UK?\nIt will come as no surprise that Reform UK talks to people in our position on a regular basis. From Parish Councillors, local Ward Councillors, Mayors, and Council Leaders, many across the country are feeling politically homeless and are liking what Reform UK is saying.\nIn the first instance, get in touch with me for a discreet call to discuss your thoughts and answer any questions. You won’t be the first and you certainly won’t be the last.\n07562 550257 or mail me at david.white@reformuk.com"
}