{
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_standing-local-consent-planning/content_4.html": "I was pleased to speak out against the Government's Planning and Infrastructure Bill in Parliament.\nWe need infrastructure in this country - but it can’t be at the cost of our Green Belt or community consent.\nThe Government’s Planning and Infrastructure Bill is a licence for Labour to impose infrastructure on communities without them having a say. It will lead to our Green Belt being lost in huge swathes.\nFrom the data centre applications in the Ivers to the Film Studios in Marlow, and everywhere in between, I will always fight for local opinion to matter and to defend our Green Belt in Beaconsfield, Marlow and the South Bucks villages.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_how-has-winter-fuel-payment-cut-impacted-you/content_10.html": "Over the past few months, I’ve heard from many people across Beaconsfield, Marlow, and the South Bucks villages who are deeply concerned about the Government’s decision to cut the Winter Fuel Payment. This vital lifeline has helped pensioners and those on fixed incomes heat their homes and stay safe during the colder months.\nThe cut has caused real distress, leaving many in our community worried about how they’ll manage their energy bills this winter. At a time when energy costs remain high and vulnerable people are already struggling, I believe it was wrong for the Government to remove this essential support.\nI want to hear directly from you about how this decision is affecting you and your family. By sharing your experiences through this survey, you’ll help me build a clearer picture of its real impact on our local area. Your responses will help challenge this decision and fight for better support for those who need it most.\nIf you or someone you know has been affected, please take a few moments to fill out the survey below.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_campaigns_better-transport-links-residents-and-businesses/content_3.html": "Joy has campaigned for better transport links for residents including the new bus service for Flackwell Heath. Joy knows good transport links are vital for residents and local businesses.\nJoy has campaigned for better transport links for residents including the new bus service for Flackwell Heath. Joy knows good transport links are vital for residents and local businesses.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_joy-morrissey-mp-meets-bucks-tourism-businesses/content_30.html": "A very useful roundtable today with local businesses from the tourism sector. Thanks to Buckinghamshire Business First for hosting and to everyone who attended.\nBuckinghamshire has so much to offer, attracting visitors from across the country. I'll be doing what I can to help and support them.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_joy-morrissey-mp-helping-opening-dove-cafe/content_23.html": "An amazing morning in Holtspur, helping at the opening of the Dove Cafe, meeting the brilliant staff and volunteers. Then presenting the inaugural Beaconsfield Community Star Awards to some of the people who carry the local community on their shoulders. Huge thanks to all!",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_standing-up-for-green-belt-in-parliament/content_17.html": "My constituents sent a clear message in the General Election - To protect our Green Belt and green spaces.\nThat is precisely what I am doing. Our Green Belt in Beaconsfield, Marlow and across South Bucks is vital.\nIt is vital as the lungs of London, as a buffer from the urban sprawl of London and Slough, for mental health and well-being, and for our biodiversity and nature conservation areas.\nI will continue to champion its protection.\nRead my full speech below:\nI congratulate the hon. Member for Edinburgh South West (Dr Arthur) on his maiden speech. It was wonderful to hear him champion so many local charities and causes, particularly for young people. It is great to hear that he cares about the mental health and wellbeing of young people. I also congratulate the new hon. Member for Bishop Auckland (Sam Rushworth) on his speech, and his drive-by of the entire constituency and the wonderful things that people can see and experience in his patch. What I loved about both speeches is that both hon. Members put their constituents first and talked about being a local champion. I will support anyone, whatever party or part of the House they are from, who wants to put their constituents first and be an advocate for them in this House.\nOn that subject, I am here because the people of Beaconsfield, Marlow and the south Bucks villages sent a clear message to me during the general election that they want me to stand up and defend the green belt. I made a promise to them back in 2019 and again in 2024 that I would stand up and defend the green belt. I will continue to do so. For my constituents, the green belt is not just special; it is vital. It acts as the lungs of London. It is vital because for my constituents it is the buffer between the sprawl of London and Slough; because green space provides much-needed mental health and wellbeing space for my constituents; and because it provides the biodiversity and nature conservation areas that we need between London and the home counties. It is essential that we protect nature, and I want to be a champion for that as well. Once our green belt is lost, it is lost forever and we cannot get it back.\nI want to be clear: I believe in the right housing, in the right place, with the right infrastructure. It is entirely a false prospectus to think that people who defend the green belt are somehow anti-growth and anti-housing. That is not true. Here is the truth: the Government seem determined to deny that the green belt is green space, but any attempt by the Government to use some Orwellian twisting of words to make it grey belt will fail in the sunlight of simple truth.\nIn Marlow in my constituency, we fought together with local community groups to stop the Marlow film studios being built on green-belt space. We worked tirelessly to protect the green belt, so that future generations could enjoy that beautiful green area. We fought as a community, and the proposal was rightly rejected. If the Government try to bring it back, I and the residents will fight it every inch of the way.\nThe Government established their intent in their first three days of existence: the Government know best and communities will be ignored. The Chancellor—not, funnily enough, the Deputy Prime Minister—announced that the Government were calling in an application, rejected by planners and the Planning Inspectorate, to build a data centre in the Ivers, right up against London. It was a blatant attack on local opinion and professional planning officers. Do Ministers really believe that there are no better sites for a data centre than directly on the only green belt that separates us from London? I say to the Government: you will soon discover that you are on the wrong side of this debate. Our green belt in south Bucks is not a political, ideological prize to be won. Residents will make their voices heard, and I will be right there by their side. It matters to my constituents and the generations to follow who will grow up and live in the beautiful area of Beaconsfield, Marlow and the south Bucks villages. I urge the Government to think again. Leave our green belt alone.\nhttps://hansard.parliament.uk/Commons/2024-07-19/debates/6A1FA3E9-41B0-…",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_joy-morrissey-mp-supporting-green-businesses-south-buckinghamshire/content_32.html": "We have some fantastic, dynamic businesses in south Buckinghamshire, making a real difference while finding success. One of them is UKSOL the British solar PV panel company, producing solar panels that are powering the world. Great to meet founder Andrew Moore last week.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_contact/content_12.html": "Skip to main content\nMain navigation\nAbout Joy Morrissey\nNews\nMy Priorities\nIn Parliament\nContact\nHow has the Winter Fuel Payment cut impacted you?\nContact\nLeave this field blank\nConstituency Office\nDisraeli House, 12 Aylesbury End, Beaconsfield, HP9 1LW\n01494 977505\n[email protected]\nJoy on Facebook\nJoy on Twitter\nJoy on Instagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_cookies/content_27.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk/content_1.html": "My Priorities My Spiking Survey As your MP, I am committed to addressing the growing and concerning issue of… A Secondary School for Burnham Joy has been working tirelessly since 2019 to address the pressing need for a… Protecting our Local Waterways Joy has been dedicated to delivering stronger protections for local waterways… Am I your MP? Enter your postcode Postcode Latest news Save Our Day Centres Rally Day Centres are a lifeline for local families, offering invaluable care and… Standing up for Local Consent in Planning I was pleased to speak out against the Government's Planning and Infrastructure… The Marlow Civic Celebration A fantastic afternoon at the Marlow Civic Celebration, honouring the incredible… Joy on Twitter Contact Constituency OfficeDisraeli House, 12 Aylesbury End, Beaconsfield, HP9 1LW01494 977505[email protected]Joy on FacebookJoy on TwitterJoy on Instagram Beaconsfield\nA Secondary School for Burnham Joy has been working tirelessly since 2019 to address the pressing need for a…\nProtecting our Local Waterways Joy has been dedicated to delivering stronger protections for local waterways…\nSave Our Day Centres Rally Day Centres are a lifeline for local families, offering invaluable care and…\nStanding up for Local Consent in Planning I was pleased to speak out against the Government's Planning and Infrastructure…\nThe Marlow Civic Celebration A fantastic afternoon at the Marlow Civic Celebration, honouring the incredible…",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_video-joy-morrissey-mp-asks-ministry-justice-about-criminal-courts/content_35.html": "This afternoon, I asked Minister for the Courts, Chris Philp, what investment the Government has made to help alleviate criminal court backlogs.\nI was delighted to hear the excellent commitment the Government has made to our justice system!\nThis afternoon, I asked Minister for the Courts, Chris Philp, what investment the Government has made to help alleviate criminal court backlogs.\nI was delighted to hear the excellent commitment the Government has made to our justice system!",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_marlow-civic-celebration/content_11.html": "A fantastic afternoon at the Marlow Civic Celebration, honouring the incredible local champions who make our town thrive!\nFrom our Mayor, Town Councillors and Marlow Fire Service, to dedicated charities and community leaders: thank you for your unwavering commitment to Marlow!",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_joy-morrissey-mp-celebrates-action-protecting-access-cash/content_24.html": "Lots of important measures in the Queen's Speech this week, one that stands out for me is protecting access to cash. I have been campaigning on this issue for some time, with bank branches closing in my constituency. I am so pleased the Government has listened and is acting!",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_joy-morrissey-mp-welcomes-keep-holtspur-green-team/content_36.html": "Today, Joy Morrissey MP welcomed the team from Keep Holtspur Green to discuss ongoing issues, primarily focused around over development, in Holtspur. There is a particular problem with small houses and bungalows being replaced with extremely large houses, with some plots doubled up to take multiple semidetached homes.\nThis over development causes a number of problems in the area, from the appearance of the neighbourhood, to traffic safety, and impact on the nearby nature reserve and Area of Outstanding Natural Beauty. Homes on the periphery of such sites often have a significant impact on the areas biodiversity, as their gardens support plants and animals on the borders.\nPreserving and protecting the small green spaces represented by the gardens and street scene of these properties has a disproportionate impact on the long term health of the local ecosystem, not least because of the dangerous precedent initial overdevelopment can set.\nMrs Morrissey will be working to support the fantastic work of the Keep Holtspur Green campaign and render any assistance she can provide, including raising the profile of the organisation and taking up the argument on national housing targets in Parliament.\nA great day in Beaconsfield meeting constituents, including the team from Keep Holtspur Green, who I will be working with to preserve green spaces in the area. Thank you so much to everyone who came along today.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_category_Speeches-in-Parliament/content_7.html": "Standing up for the Green Belt in Parliament 19th July 2024 My constituents sent a clear message in the General Election - To protect our Green Belt and green spaces. That is precisely what I am doing. Our Green Belt in... Speeches in Parliament",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_campaigns_champion-high-streets-and-local-business/content_8.html": "South Buckinghamshire offers a huge range of fantastic local businesses that are invested in our community and our future. These businesses not only generate meaningful local jobs and build a stronger economy, but they also build a stronger community as they make a real difference. Whether that be your local coffee shop, your favourite pub, our environmentally conscious businesses, or our bank and healthcare services, our high streets are bustling with dynamism and vibrancy.\nHere in Buckinghamshire, we also have fascinating history and heritage attracting visitors from all over the country, which of course creates a wonderful platform for our local businesses in the tourism sector. I was very inspired when I met with Buckinghamshire Business First to see first-hand the support that they provide to established and growing businesses all across our constituency.\nAlongside all the hardworking staff and volunteers, our local community thrives and unites the citizens of my constituency, as the support for our high streets and our local businesses is key in creating the welcoming environment of south Buckinghamshire.\nI also focused on the Protecting Access to Cash campaign which saw numerous bank branches close on our local high streets. Since the closure of these branches, I took action both at a local and parliamentary scale, and I was happy that the Government committed to legislate for the protection of access to cash. I will continue to support this campaign and advocate the strength of our high streets and local businesses.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_campaigns_my-spiking-survey/content_31.html": "As your MP, I am committed to addressing the growing and concerning issue of spiking, a crime that affects many individuals across the UK. To better understand its impacts, I have launched a survey to gather insights from those who have been directly affected by this distressing crime.\nThe survey is designed to explore how the NHS responds to and supports individuals who have been spiked, ensuring they receive the necessary medical care and assistance. It also seeks to understand public expectations regarding the NHS’s role, as well as personal experiences with the healthcare system in relation to spiking. Furthermore, the survey aims to assess how the NHS’s response can support future police investigations and identify opportunities for improvement in both law enforcement practices and victim support.\nI strongly encourage everyone to take part in the survey, particularly those who have experienced spiking or know someone who has. Your input is invaluable in helping to shape policies and initiatives that will better protect victims, improve healthcare responses, and strengthen the fight against this crime.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_accessibility/content_13.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_joy-morrissey-mp-taking-action-ivers/content_28.html": "After holding a surgery appointment with a number of residents of Pinewood Green in Iver Heath, Joy Morrissey MP has organised a meeting to bring together residents, Buckinghamshire Council, and Thames Valley Police to look into and address the issues raised.\nLast Friday Joy Morrissey MP organised for an engaged group of local residents to meet with Sgt Dan Ryder of Thames Valley Police and Transport for Buckinghamshire's Community Liaison Manager, on the streets of Iver Heath. This group of local residents had arranged a route for the group to walk, which would showcase the issues that they wanted to see addressed.\nThese issues ranged from anti social behaviour and aggressive driving, to HGVs use of the road, and the implications of over development at Pinewood Studios. During the walk about on Friday afternoon, Thames Valley Police and Buckinghamshire Council were not only informed of this range of problems, but also had the opportunity to see them in their full context, and how they are impacting local residents.\nAfter the walk about all parties gathered around the kitchen table of one of the residents to discuss what they had seen and to start to look at solutions to the problems. Mrs Morrissey was clear that she supported residents in finding ways to fix these problems and urged that the police and council take real action to help her constituents. After a positive meeting all parties left to work on solutions, with a number of possible actions already agreed.\nMrs Morrissey said: \"I was so pleased to be able to bring together this group, where we could look at the issues and come up with some real solutions. In particular, we must be aware of the damage that over development can do to communities, resulting in a lot of unforeseen consequences. I will be keeping up this dialogue and urging Buckinghamshire Council and Thames Valley Police to take meaningful action to help my constituents.\"",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_campaigns_protecting-our-local-waterways/content_18.html": "Joy has been dedicated to delivering stronger protections for local waterways across Beaconsfield, Marlow, and the South Bucks villages, fulfilling a promise made during the last election. At the first opportunity, she has taken decisive action to address these critical environmental issues.\nShe has worked to ensure greater protections for aquatic sports from the impacts of sewage discharges. To this end, she tabled an amendment to the Water Bill to make it a criminal offense to discharge sewage in areas where rowing, sailing, and other water sports clubs operate.\nJoy has also championed accountability for water company executives. She proposed an amendment to the Water Bill that would impose a criminal sanction of up to five years in prison for failing to report a sewage discharge, pushing for stronger measures to hold water bosses to account.\nAfter years of inaction by water companies, Joy's initiatives are a call to action. She is urging the Labour Government to support these amendments to ensure real change.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_campaigns_protect-green-belt/content_29.html": "To protect our green spaces, Joy Morrissey has been fighting for our greenbelt, green spaces and the semi-rural heritage of our community. Joy is opposing Pinewood expansion and the proposed new data centres in the Ivers.\nTo protect our green spaces, Joy Morrissey has been fighting for our greenbelt, green spaces and the semi-rural heritage of our community. Joy is opposing Pinewood expansion and the proposed new data centres in the Ivers.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_campaigns_safer-community/content_6.html": "Local police have been bolstered with another 784 officers since the government launched its recruitment drive in 2019. It is at the centre of our commitment to back the police with more resources & powers in order to keep our communities safe.\nLocal police have been bolstered with another 784 officers since the government launched its recruitment drive in 2019. It is at the centre of our commitment to back the police with more resources & powers in order to keep our communities safe.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_joy-morrissey-mp-supports-english-tourism-week-2022/content_15.html": "After a very difficult few years, English Tourism Week 2022 is more important than ever. Buckinghamshire is a beautiful county with so much to do and see, especially in my constituency!\nAfter a very difficult few years, English Tourism Week 2022 is more important than ever. Buckinghamshire is a beautiful county with so much to do and see, especially in my constituency!",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_cdn-cgi_l_email-protection/content_21.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_campaigns/content_2.html": "My Spiking Survey As your MP, I am committed to addressing the growing and concerning issue of spiking, a crime that affects many individuals across the UK. To better understand...\nA Secondary School for Burnham Joy has been working tirelessly since 2019 to address the pressing need for a secondary school in Burnham. Collaborating closely with the Secondary School for...\nProtecting our Local Waterways Joy has been dedicated to delivering stronger protections for local waterways across Beaconsfield, Marlow, and the South Bucks villages, fulfilling a promise...\nBetter transport links for residents and businesses Joy has campaigned for better transport links for residents including the new bus service for Flackwell Heath. Joy knows good transport links are vital for...\nProtect the Green Belt To protect our green spaces, Joy Morrissey has been fighting for our greenbelt, green spaces and the semi-rural heritage of our community. Joy is opposing...\nA safer community Local police have been bolstered with another 784 officers since the government launched its recruitment drive in 2019. It is at the centre of our commitment to...\nImproved access to GPs and better healthcare facilities Joy is advocating to local NHS leaders for better local healthcare facilities and particularly improved access to GPs. Joy wants residents to feel the benefit...\nChampion for High Streets and Local Business South Buckinghamshire offers a huge range of fantastic local businesses that are invested in our community and our future. These businesses not only generate...\nInvesting in education Joy has successfully secured funding from the government to upgrade some of our local school buildings. Joy has also been active in promoting Buckinghamshire’s...",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_joy-morrissey-mp-meets-superintendent-burroughs-area-commander-south-bucks-talk-policing/content_26.html": "Great catch up with Superintendent Emma Burroughs to discuss what @thamesvalleypolice is doing to tackle antisocial behaviour and reduce crime across South Bucks. I also raised the issue of car theft which has become and issue of concern for some local residents.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_joy-morrissey-mp-welcomes-recruitment-368-more-officers-thames-valley-police/content_22.html": "Fantastic news that we are well on the way to meeting our commitment to recruit 20,000 more police, with 368 extra officers already for Thames Valley Police, with more to come.\nAcross the country only Labour in London and Manchester have failed to meet their recruitment targets.\nJoy Morrissey MP today welcomed the news that the Government is on track to deliver on the promise, made in the 2019 Conservative manifesto, to recruit 20,000 more police officers.\nThe latest figures are part of the Conservative Government’s drive to get 20,000 more police officers on the street by March 2023, and puts the Government on track to fulfil its manifesto commitment with 68 per cent of the target now met.\nAcross the 43 police forces, an additional 13,576 officers have been recruited, bringing the total number of police officers in England and Wales to 142,526 – where they are already having an impact in tackling crime and keeping communities safe.\nThe latest figures also show that the police are more representative of the communities they serve. More than four in ten new recruits since April 2020 are female and nearly 12 per cent of new recruits identify as belonging to a Black, Asian, Mixed or other minority ethnic group.\nHowever, the figures show Labour Mayor’s Sadiq Khan and Andy Burnham, who run the Met and Greater Manchester Police forces, the largest and third largest forces in the country, failed to meet their targets for recruiting additional officers. Sadiq Khan fell 133 officers short of his target and Andy Burnham fell 30 short of his.\nThe 13,576 extra officers will support the Conservative Government’s crack down on crime, which has seen the launch of the Beating Crime Plan and the passing of the Police, Crime, Sentencing and Courts Bill through the House of Commons.\nThis builds on the action already taken by the Conservative Government since Boris Johnson became Prime Minister two years ago – including boosting police funding to a record £15.8 billion and delivering £70 million through the Safer Streets Fund to make neighbourhoods secure.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_about-joy-morrissey/content_16.html": "Being elected the Member of Parliament for Beaconsfield in 2019 for the first time was the single greatest honour of my life. It is a great pleasure to represent one of the most beautiful and unique parts of the country, populated by some of the most dynamic, creative, and successful people the UK has to offer. From the banks of the Thames in Marlow to the border with London in Denham, this constituency covers different people, changing landscapes and diverse needs.\nWhen I was your MP, I secured funding for our roads, brought about improvements to the Domestic Abuse Act and championed the concerns of my constituents through the Covid-19 pandemic. I will always prioritise the needs of the people of the Beaconsfield constituency, endeavouring to always see the national picture through the local lens.\nI grew up in the United States of America, moving to the UK when I attended the London School of Economics in 2008. Before that, I travelled the world undertaking humanitarian work in Albania, Kosovo, China and India, studying Chinese & Albanian on my travels. I spent eighteen months in Albania and Kosovo in 1999 and 2000 helping with refugees, working in a local orphanage and teaching English.\nPrior to my election to the Commons in 2019, I served as a London Councillor, staffed the offices for two MPs in Parliament and worked at the Centre for Social Justice. These experiences have helped me to get to grips with real world challenges that have allowed me to hit the ground running as a new MP.\nHaving held the post of Parliamentary Private Secretary to the Foreign Commonwealth and Development Office from early 2020, and PPS to the Lord Chancellor and Secretary of State for Justice from late 2021, I was deeply honoured to be appointed Parliamentary Private Secretary to the Prime Minister in February 2022.\nIn October 2022 I was reappointed an Assistant Government Whip by Rishi Sunak, having also served in the Whips Office for the previous two Prime Ministers.\nI was honoured to be re-elected in the July 2024 General Election. I was both delighted and honoured to be asked by Kemi Badenoch to serve as the new Shadow Deputy Chief Whip.\nAs each day goes by of this Labour Government the need for a strong Opposition to hold them to account in Parliament becomes ever more vital. Their attack on free speech, aspiration, businesses, pensioners, farmers and working people is about putting ideology before sound governing. I am looking forward to playing my role in ensuring a united and effective Conservative Parliamentary Party and supporting Kemi as she renews our Party and we seek to return to Government.\nI love where we live and that is why I have fought so hard to protect the Green Belt, ensure a safer community, invest in our children's education, improve our transport links and get better local healthcare services.\nI look forward to continue being your local champion for Beaconsfield, Marlow & the South Bucks villages.\nJoy Morrissey - MP for Beaconsfield",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_joy-morrissey-mp-congratulates-fox-and-pheasant-staff-long-service/content_14.html": "Congratulations to Ray, the Assistant Manager of Fox & Pheasant in Stoke Poges for 40 years working at the pub. Ray started back in 1981 and is still going strong.\nOver some delicious cake and coffee we celebrated Rays achievements and discussed Christmas, Covid, customers and how Ray still enjoys going to work everyday. Congratulations again",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_campaigns_improved-access-gps-and-better-healthcare-facilities/content_34.html": "Joy is advocating to local NHS leaders for better local healthcare facilities and particularly improved access to GPs. Joy wants residents to feel the benefit of record NHS investment.\nJoy is advocating to local NHS leaders for better local healthcare facilities and particularly improved access to GPs. Joy wants residents to feel the benefit of record NHS investment.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_parliament/content_25.html": "This page shows the Parliamentary activity of Joy Morrissey before the dissolution of the House. The feed is provided by theyworkforyou.com.\nThis page shows the Parliamentary activity of Joy Morrissey before the dissolution of the House. The feed is provided by theyworkforyou.com.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_save-our-day-centres-rally/content_19.html": "Day Centres are a lifeline for local families, offering invaluable care and support. Hearing of their impact has been deeply moving.\nIt’s an honour to stand alongside such dedicated individuals—local families, community leaders, and our Unitary and Burnham Parish Councillors—in this campaign to protect these vital services.\nA special thank you to Hazel for bringing us together today—you are a true local champion!",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_joy-morrissey-mp-thanks-thames-valley-police-their-hard-work/content_9.html": "Tweet Sunday, 13 March, 2022 Local News Thank you @thamesvalleypolice for all your help, support and community work in South Buckinghamshire. #beaconsfield You may also be interested in A safer community Local police have been bolstered with another 784 officers since the government launched its recruitment drive in 2019. It is at the centre of our commitment to back the police with more resources & powers in order to keep our communities safe.\nA safer community Local police have been bolstered with another 784 officers since the government launched its recruitment drive in 2019. It is at the centre of our commitment to back the police with more resources & powers in order to keep our communities safe.\nSave Our Day Centres Rally Saturday, 29 March, 2025 Day Centres are a lifeline for local families, offering invaluable care and support.",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_privacy/content_5.html": "This document outlines how Joy Morrissey processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Joy Morrissey\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Joy Morrissey.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Joy Morrissey, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Joy Morrissey via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_joy-morrissey-mp-attends-reopening-zebra-technologies-experience-centre/content_20.html": "Today Joy Morrissey MP attended the reopening of the Zebra Experience Centre in Bourne End. The Centre demonstrates to businesses how they can use the latest technology to give them a performance edge in their operations.\nFantastic to see the reopening of the Zebra Technologies Experience Centre in Bourne End. If you have shopped at a major retailer in the UK, you have probably benefitted from Zebra technology. So glad to have an innovative company like this in my constituency! 🦓🧑🔬🤖",
  "https_www_joymorrissey_uk_/https_www_joymorrissey_uk_news_category_Articles/content_33.html": "Protecting Wildlife and Enhancing Animal Welfare 6th March 2025 I have always been passionate about protecting wildlife and making sure that those who harm animals face the full force of the law. When we were in Government... Articles\nSupporting Small Businesses in Parliament 5th March 2025 Across Beaconsfield, Marlow and the South Bucks villages, our community thrives thanks to the dedication and innovation of small businesses. It was a pleasure... Articles\nMeeting with the Thames Hospice CEO 17th February 2025 It was a pleasure to meet Dr. Rachael de Caux, the new CEO of Thames Hospice. Hospices like Thames Hospice provide vital care, compassion, and dignity to... Articles\nStanding with Farmers in Westminster 10th February 2025 Farmers from across the country gathered in Westminster today to demand a U-turn on damaging Government policies that threaten family farms. These hardworking... Articles\nStanding Up for Our Local Pubs 5th February 2025 Local bars and pubs in Beaconsfield, Marlow, and the South Bucks villages are being hit hard by Labour’s tax hikes. Landlords are struggling, costs are rising... Articles\nSpeaking in the Water (Special Measures) Bill Debate 28th January 2025 Today, I spoke in the debate on the Water (Special Measures) Bill, standing up for our local waterways and the vital role they play in our communities. I have... Articles\nNational Autistic Society in Parliament 24th January 2025 Honoured to attend the National Autistic Society's event in Parliament and connect with others on how we can better support autistic people and their families... Articles\nAPPG for Dog Advisory Welfare 22nd January 2025 Yesterday, I attended the APPG for Dog Advisory Welfare in Parliament. This was a great opportunity to meet with representatives from incredible charities... Articles\nSigning the Holocaust Educational Trust’s Book of Commitment 14th January 2025 Today I had the honour of signing the Holocaust Educational Trust’s Book of Commitment, pledging my unwavering dedication to marking Holocaust Memorial Day on... Articles"
}