{
  "https_www_joelwilliams_net_/https_www_joelwilliams_net_about-joel/content_2.html": "About\nProfessional\nJoel attended St David’s Catholic College in Cardiff, studying history, law and economics, serving as Student Union President. Following his A-levels Joel read law at Cardiff University, attaining a Bachelor of Laws (LL.B. Hons). After graduating, Joel remained at Cardiff University to study for the Bar and was Called to the Bar as a barrister of England and Wales also attaining a Masters of Laws (LL.M. Hons).\nWhilst studying for his law degree Joel undertook the ILM Course of Workplace Investigator and commenced his work as a qualified workplace investigator in 2017. Since this time Joel has undertaken a significant number of complex workplace investigations and hundreds of investigation interviews.\nOutside of professional commitments, Joel enjoys spending time with family and friends, playing racket sports and climbing mountains.\nVoluntary\nJoel has been a school governor of two local schools in Cardiff for a number of years and is a Director and Trustee of Diverse Cymru and has been an active member of the organisation since joining the Board in 2013. Diverse Cymru is a Welsh charity committed to supporting people facing unlawful forms of discrimination.\nJoel is Chairman of the Board of Cartref, a charity based in Cardiff, South Wales. As Chairman of the Board of Directors and Trustees, Joel is responsible for leading the board; ensuring smooth running of board meetings; promoting good governance among fellow charity trustees; providing supervision and support to the CEO; and acting as a figurehead or spokesperson where required.",
  "https_www_joelwilliams_net_/https_www_joelwilliams_net/content_1.html": "Joel Williams LLB(hons) LLM(hons)\nEmployment Specialist and Workplace Investigator\nJoel Williams is a respected employment specialist with extensive experience of undertaking complex workplace investigations.\nWelcome/Croeso to my website. My name is Joel Williams and I am an experienced employment specialist and workplace investigator.\nI am a non-practicing barrister and specialise in undertaking workplace investigations including; complaint, whistleblowing, grievance and disciplinary investigations, with extensive experience of undertaking disciplinary investigations for registrants of professional bodies.\nI am a professional and undertake my work in a diligent and conscientious manner, mindful of the sensitivities involved in such processes."
}