{
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_category_Local-News/content_38.html": "15 years of Veterans’ NHS Wales celebrated at Senedd event 2nd May 2025 Leader of the Welsh Conservatives and Clwyd West MS Darren Millar hosted an event in the Senedd this week to celebrate 15 years of Veterans’ NHS Wales. Veterans... Local News\nHealth Board urged to address lengthy wait times for blood tests 2nd May 2025 With patients reporting that they are having to wait up to six weeks for blood tests, Leader of the Welsh Conservatives and Clwyd West MS Darren Millar is... Local News\nWales has worst childcare offer in Great Britain 1st May 2025 With Wales having the worst childcare offer in Great Britain, Leader of the Welsh Conservatives and Clwyd West MS Darren Millar has implored the First Minister... Local News\nSantander urged to reconsider closure of Colwyn Bay branch 29th April 2025 Following last month’s announcement of the planned closure of Santander in Colwyn Bay, Leader of the Welsh Conservatives and Clwyd West MS Darren Millar has met... Local News\nOrthopaedic Waiting Lists - \"Nobody should have to live in severe, persistent pain\" 25th April 2025 Approximately 970,000 people live with musculoskeletal (MSK) conditions in Wales and the impact on individuals, their families, on communities and on our health... Local News\nLeader of Welsh Conservatives pays tribute to Pope Francis 22nd April 2025 Leader of the Welsh Conservatives and Clwyd West MS Darren Millar has paid tribute to His Holiness Pope Francis. The leader of the world’s Roman Catholics died... Local News\n“A dereliction of duty” – no FM correspondence with UK Government on winter fuel cut 17th April 2025 A Welsh Conservative FOI, requesting the publication by the Welsh Government of “all correspondence between the First Minister, Cabinet Secretaries and... Local News\nPoliticians visit unique Ruthin business 15th April 2025 A Ruthin business which is the world’s leading supplier of polymer stamps has been praised by two politicians who paid them a visit at their new premises... Local News\nMS meets with British Red Cross to discuss axing of vital hospital service 7th April 2025 Leader of the Welsh Conservatives and Clwyd West MS Darren Millar met with the British Red Cross on Friday to discuss the Betsi Cadwaladr University Health... Local News",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_map-locations/content_22.html": "This map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_sandy-cove-roads-survey-work-set-begin/content_33.html": "Clwyd West MS Darren Millar has welcomed Conwy County Borough Council’s announcement that survey work required to make improvements to the roads at Sandy Cove, Kinmel Bay is due to begin.\nIn July the local authority secured £140,000 in funding as part of a pilot study to fund a plan to prepare for the development of unadopted roads on the estate.\nSpeaking following the announcement Darren said –\n“This is great news that I know residents in Sandy Cove will welcome.\n“Survey work is the first step towards making the estate a safer, cleaner and more attractive place to live.\n“I am delighted to see that the local authority are seeking to develop a plans to improve drainage, parking and electric vehicle charging points on Sandy Cove as well as improving the quality of the road surfaces.\n“With around 250 homes, the estate is probably the largest single community affected by poorly maintained unadopted roads in Wales.\n\"For too long residents with mobility problems have bene trapped in their homes and socially isolated due to the state of these roads.\n“I have been calling for improvements on this estate for two decades and I am delighted to see that things are moving forward but there is still a long way to go so I will continue to work with the local authority and Welsh Government until the roads are upgraded and adopted.”\nThe survey work is due to be completed by March 2022.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_mss-visit-almost-home-dog-rescue-nercwys/content_39.html": "Two North Wales Members of the Senedd have been seeing at first-hand how abandoned dogs enjoy a new lease of life.\nShadow Minister for North Wales, Darren Millar MS and North Wales regional Member of the Senedd, Sam Rowlands MS, recently visited Almost Home Dog Rescue, a small, passionate dog rescue centre based in Nercwys, near Mold, Flintshire.\nMr Millar said:\n“I was delighted to find out more about Almost Home Dog home which has been running successfully in North Wales for the last six years.\n\"As an owner of a rescue dog I was particularly interested to hear about the way Dave and Joan want to promote responsible ownership and develop an education programme for young people, the next generation of dog owners. It is an excellent idea.”\nMr Rowlands said:\n“I was pleased to have the opportunity to visit Almost Home and see for myself the great work which is carried out by Joan and Dave, who run the home, and their volunteers. As a dog owner I find it very sad to hear about animals either being cruelly treated or, through no fault of their own, being abandoned. It was heartening to be told that in the last six years almost 1,000 dogs nave been rehomed.\n“Places like Almost Home do a fantastic job, providing a safe haven for the dogs relying solely on grants and donations. They deserve all our support.\nAlmost Home Dog Home, is a registered charity and their vision is for all dogs to ‘live the good life’, free from cruelty, abuse, neglect or fear and having their physical, social and emotional needs met.\nThey want to promote responsible ownership and provide support to both fosterers and adopters from two fully qualified dog behaviour specialists and experienced volunteers.\nThrough developing an education programme, they also aim to reach young people and to help them to: be safe around and respect dogs; understand different breeds to make an informed decision when choosing a dog and be aware of animal cruelty and exploitation (including online sales and working dogs).\nThey also offer support to the appropriate bodies in order to put a stop to the unnecessary and needless suffering of dogs but in particular: racing greyhounds, breeding dogs and their puppies and dogs sold online.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales/content_1.html": "Contact\nGet in touch...\nIf there is ever anything I can do to help, or if there is an issue you would like to raise with me, please do not hesitate to get in touch via email or by calling me on 0300 200 6206.\nIf there is ever anything I can do to help, or if there is an issue you would like to raise with me, please do not hesitate to get in touch via email or by calling me on 0300 200 6206.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_archived-campaigns/content_29.html": "Nia's Road Safety Campaign Darren Millar is backing a campaign for Welsh Government action to address road safety concerns on the A494 Ruthin to Mold road in and around Llanbedr DC.\nSave our Bin Collections! Darren Millar is campaigning to stop Conwy County Borough Council scrapping fortnightly bin collections and moving to a four weekly collection cycle. Please have your say on Darren's campaign on Facebook: Facebook.com/saveourbincollections\nAbout Darren A record of action... Darren was first elected to the National Assembly for Wales in May 2007 and was returned to the Senedd in 2011 and 2016 with increased majorities at each election. Having been brought up in Towyn, Darren now lives in Kinmel Bay with his wife Rebekah and their two children, Mary and Toby. He is enjoys reading and history.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_campaigns_west-end-medical-centre/content_15.html": "Tweet Please sign below to register for updates on action to improve services at the West End Medical Centre in Colwyn Bay. Improve West End Medical Centre Current Your details Leave this field blank First name Last name Email Mobile number Postcode Address ID Address Parliamentary constituency Admin county Admin district CED Admin ward Parish I would like to be kept up-to-date by Darren Millar MS on future issues that matter to me: Yes There will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our Privacy Policy.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_speed-limit-changes-war-common-sense-says-ms/content_36.html": "Here in North Wales the vast majority of people rely on their car to get on with day to day life. Whether that involves commuting to work, dropping the kids off at school, attending a medical appointment or going for the weekly shop, most of us rely on our cars.\nYet earlier this month during a vote in the Senedd both Welsh Labour and Plaid Cymru voted to make life more difficult for those of us who rely on our cars by introducing a 20 mile per hour speed limit zones on the vast majority of roads across Wales.\nNow like me you might be confused about why these changes are being introduced; after all no one was crying out for blanket speed reductions and many of the roads that should be restricted to 20 miles per hour already are.\nRoads outside of schools, hospitals and pedestrianised areas should all be subject to lower speed limits, and there are already many 20 limits in such places, but a blanket roll-out of 20 mph in current 30 mph areas is frankly ludicrous and unnecessary.\nLocal Authorities already have the power to make an assessment on a road-by-road basis and lower the limit where it makes sense to do so. But under the Welsh Government’s new plans that common sense is being thrown out of the window.\nThe scheme comes at acost to the tax payer of an eyewatering £33 million, and that is on top of the massive £4.5 billion hit to the Welsh economy which longer journeys are estimated to cost.\nAnd there is no reason to suggest the plans will even slow down motorists. According to the Department of Transport, 87% of motorists routinely break the speed limit in 20 mph residential areas. Any Government with common sense would recognise that criminalising motorists for going the same speed they have always done safely, would be wrong.\nTrials of 20 mph zones have not gone well. Residents in Buckley, for example, have complained of more pollution, are worried about an increase in accidents and are seeing longer delays than ever before and cite no tangible benefits.\nBlanket 20 miles per hour zones is the Welsh Government’s answer to problem that doesn’t exist.\nCouple these new measures with the Welsh Governments ban on building new roads and it is plain to see that Labour and Plaid Cymru’s war on motorists, and war on common sense, is well underway.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_improve-west-end-medical-centre/content_3.html": "Too many patients are being let down by the West End Medical Centre in Colwyn Bay.\nPlease sign the petition below to back my campaign for improvements and to receive updates on my work to address concerns.\nToo many patients are being let down by the West End Medical Centre in Colwyn Bay.\nPlease sign the petition below to back my campaign for improvements and to receive updates on my work to address concerns.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_prehistoric-dinosaur-abergele-adventure-will-be-roaring-success/content_31.html": "Darren Millar MS got to grips with Abergele’s newest prehistoric residents at Manorafon Farm near Gwyrch Castle as part of their new Dinosaur Adventure attraction.\nDarren visited the attraction earlier this week. It gives visitors the opportunity to see the life-like dinosaurs and enjoy a Jurassic themed day out.\nDarren said:\n“Manorafon Farm Park is an absolutely fantastic North Wales attraction and I have no doubt that the new Dinosaur Adventure will be a roaring success with everyone who visits.\n“It was a pleasure to pop along to see the life-like dinosaurs, take part in a dinosaur dig and cast a fossil.\n“As well as being a phenomenal tourist attraction the dinosaur adventure is a fantastic educational resource for the thousands of families who visit every year.\n“With staycations more popular than ever it is great to see Manorafon go from strength to strength and take advantage of the boom in visitor numbers.\n“I would like to thank Will and Jules Arrowsmith for inviting me to visit and wish them all the very best for the summer.\"",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_node_6985/content_27.html": "Help me to represent your views by completing the survey below.\nThank you!\nDarren Millar MS\nClick here to complete the survey in Welsh\nHelp me to represent your views by completing the survey below.\nThank you!\nDarren Millar MS\nClick here to complete the survey in Welsh",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_thousands-back-rhos-sea-kiosks-campaign/content_25.html": "More than 2,500 people have signed a petition to calling for Conwy County Borough Council to ensure that Rhos on Sea continues to have kiosks on its promenade.\nThe petition follows publication of plans by Conwy County Borough Council the seafront kiosks as part of a scheme to widening the promenade for cyclists and pedestrians, with no clear plan for the replacement of the kiosks.\nThe plans have put businesses operating from the kiosks in jeopardy, including that of Moussa Salem, who has been operating a family run refreshments business from The Cayley kiosk on the promenade for more than two decades. The business provides an income for Mr Salem and his family and also employs two members of staff all year round.\nClwyd West MS Darren Millar met with Moussa Salem this week. Speaking following the meeting, Darren said -\n“It’s scandalous that a thriving business which is loved by thousands and offers employment and an income for local people is being put at risk in this way.\n“Moussa’s business has never been so busy as t has been in recent years and it has been a lifeline for people during the pandemic.\n“The demolition of the kiosk will have a devastating impact on Moussa and his family and those they employ and it will also leave a big hole on the promenade and what it has to offer for locals and visitors alike.\n“The fact that more than 2,500 people have signed a petition calling for the kiosks on the promenade to be saved shows the strength of feeling and affection that people have towards Moussa and his staff, and the amenity they provide.\n“I will continue to work with Moussa in the hope that the local authority will listen and amend their proposals.”",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_campaigns_pwllglas-road-safety-campaign/content_32.html": "Pwllglas is benefitting from a new fun and fitness park but access across the A494 trunk road is dangerous for children and other pedestrians.\nSign this petition to call on the Welsh Government to install a pedestrian crossing in the village.\nPwllglas is benefitting from a new fun and fitness park but access across the A494 trunk road is dangerous for children and other pedestrians.\nSign this petition to call on the Welsh Government to install a pedestrian crossing in the village.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_contact-darren/content_10.html": "Call, write or email...\nDarren Millar is committed to being as accessible to all local residents as possible. If you need Darren's help, or would like to raise an issue with him, then please do not hesitate to get in touch.\nYou can contact Darren in the following ways:\nBy Post (Welsh Parliament): Darren Millar MS, Welsh Parliament, Cardiff, CF99 1SN\nBy Post (Constituency): Darren Millar MS, North Wales Business Park, Abergele, LL22 8LJ\nTelephone: 0300 200 6206\nEmail: [email protected]",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_campaigns_save-abergele-youth-and-community-centre/content_12.html": "Conwy County Borough Council has taken the decision to close the Youth and Community Centre in Abergele. This decision has been made without consultation with the public or those who use the building, which is part of our local heritage.\nThis closure of the centre would be devastating for those who use it and leave yet another derelict site in the centre of the town.\nSign my petition below to support my calls to save the Youth and Community Centre.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_about-clwyd-west/content_35.html": "Clwyd West - the heart of North Wales...\nClwyd West is a beautiful constituency situated in the heart of North Wales. In the north it incorporates some of the most popular seaside resorts in the country whilst to the south the outstanding scenery of the Vale of Clwyd and the Clwydian Range is breathtaking.\nStretching from Rhos-on-Sea to Kinmel Bay along the coast and inland to the market town of Ruthin and the surrounding villages and hamlets, Clwyd West is a large and diverse constituency. Tourism is the main industry in the North whilst agriculture still forms the backbone of the rural parts of the constituency.\nThe people of Clwyd West are as diverse as its landscapes, whilst many have settled here from elsewhere in the United Kingdom, Welsh is still the first language in many homes, particularly in the more rural areas.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_campaigns_north-denbighshire-community-hospital/content_20.html": "The Welsh Government has failed to deliver a new hospital in Rhyl to take pressure off Ysbyty Glan Clwyd.\nMinisters promised Rhyl a new hospital with a Minor Injuries Unit in 2013 but a decade on and we are yet to see a spade in the ground.\nSign the petition below to receive updates on this issue.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_campaigns_residents-survey/content_8.html": "Tweet Help me to represent your views by completing my survey. Thank you!Darren Millar MSClick here to complete the survey in Welsh Residents' Survey Current Your details Questions Leave this field blank First name Last name Email Mobile number Postcode Address ID Address Parliamentary constituency Admin county Admin district CED Admin ward Parish I would like to be kept up-to-date by Darren Millar MS on future issues that matter to me: Yes There will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our Privacy Policy.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_campaigns_about-clwyd-west/content_7.html": "Clwyd West - the heart of North Wales...\nClwyd West is a beautiful constituency situated in the heart of North Wales. In the north it incorporates some of the most popular seaside resorts in the country whilst to the south the outstanding scenery of the Vale of Clwyd and the Clwydian Range is breathtaking.\nStretching from Rhos-on-Sea to Kinmel Bay along the coast and inland to the market town of Ruthin and the surrounding villages and hamlets, Clwyd West is a large and diverse constituency. Tourism is the main industry in the North whilst agriculture still forms the backbone of the rural parts of the constituency.\nThe people of Clwyd West are as diverse as its landscapes, whilst many have settled here from elsewhere in the United Kingdom, Welsh is still the first language in many homes, particularly in the more rural areas.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_campaigns_about-darren/content_11.html": "Leader of the Welsh Conservatives in the Senedd.\nMember of the Welsh Parliament for Clwyd West\nA record of action...\nDarren was first elected to the Welsh Parliament in 2007 and is now serving his fourth term.\nBefore being elected to the Senedd, Darren worked as a manager for an international charity supporting persecuted Christians around the world. He has also been an accountant working in the construction, care home and telecommunications industries.\nHaving been brought up in Towyn, Darren now lives in Kinmel Bay with his wife and their two grown up children.\nFollowing the 2021 Senedd election Darren was appointed to the position of Chief Whip and Shadow Minister for the Constitution and North Wales on the Welsh Conservative front bench.\nDuring his time as a Member of the Welsh Parliament Darren has held various Shadow Ministerial portfolios including Health, Education, Local Government and International Affairs. In addition to these he has also served as the Chair of the Senedd’s influential Public Accounts Committee.\nIn 2000/2001, Darren became the youngest serving Mayor in Wales, a record which he understands is as yet unbroken, when he served the township of Towyn and Kinmel Bay. He has also served as a member of Conwy County Borough Council, the North Wales Police Authority and the North Wales Fire and Rescue Service.\nDarren is a committed Christian, avid reader and amateur astronomer.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_ms-celebrates-colwyn-bay-library-decision/content_23.html": "Clwyd West MS Darren Millar has welcomed Conwy County Borough Council’s decision to save Colwyn Bay Library following a consultation over its future.\nThe local authority had considered moving the library into the Coed Pella building but opted to scrap changes following a public consultation. Darren wrote to the local authority in April to object to the plans.\nSpeaking following the announcement Darren said:\n“I am absolutely delighted to see that the local authority has listened to local opposition and taken the right decision to maintain Colwyn Bay library in its current location.\n“Colwyn Bay library is an important part of our local heritage and a well used asset in the town with parking immediately outside and good disabled access.\n“There are also many groups that use the rooms available in the library for their activities, including the local college and community groups, and I also hold regular surgeries for my constituents there.\"\nHe added:\n“It's now important that the local authority invest in the library to demonstrate their long term commitment to this much loved building.”",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_about-darren/content_28.html": "Leader of the Welsh Conservatives in the Senedd.\nMember of the Welsh Parliament for Clwyd West\nA record of action...\nDarren was first elected to the Welsh Parliament in 2007 and is now serving his fourth term.\nBefore being elected to the Senedd, Darren worked as a manager for an international charity supporting persecuted Christians around the world. He has also been an accountant working in the construction, care home and telecommunications industries.\nHaving been brought up in Towyn, Darren now lives in Kinmel Bay with his wife and their two grown up children.\nFollowing the 2021 Senedd election Darren was appointed to the position of Chief Whip and Shadow Minister for the Constitution and North Wales on the Welsh Conservative front bench.\nDuring his time as a Member of the Welsh Parliament Darren has held various Shadow Ministerial portfolios including Health, Education, Local Government and International Affairs. In addition to these he has also served as the Chair of the Senedd’s influential Public Accounts Committee.\nIn 2000/2001, Darren became the youngest serving Mayor in Wales, a record which he understands is as yet unbroken, when he served the township of Towyn and Kinmel Bay. He has also served as a member of Conwy County Borough Council, the North Wales Police Authority and the North Wales Fire and Rescue Service.\nDarren is a committed Christian, avid reader and amateur astronomer.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_campaigns_upgrade-flood-defences-and-roads-sandy-cove/content_14.html": "Sign here to show your support for the campaign for improved flood defences and roads on the Sandy Cove estate and Darren Millar will keep you posted on developments.\nSign here to show your support for the campaign for improved flood defences and roads on the Sandy Cove estate and Darren Millar will keep you posted on developments.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_cookies/content_19.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_campaigns_support-campaign-ruthin-road-improvements/content_9.html": "The A494 trunk road through Ruthin is dangerous and needs an upgrade.\nLôn Fawr and Corwen Road are gateways into Ruthin and part of a key circular route for traffic and residents, but parts of Lôn Fawr are dangerously narrow, the speed limit is too high, and the junction with Corwen Road needs re-engineering to improve safety.\nSign this petition to call on the Welsh Government to release the capital investment needed to widen Lôn Fawr, reduce the speed limit and improve the junction with Corwen Road as soon as possible.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_access-nhs-dentistry-north-wales/content_16.html": "I have been raising concerns regarding access to NHS dentists in the Welsh Parliament in for many months, due to the withdrawal of NHS dentistry from a number of practices in Conwy and Denbighshire and the impact this is having on many thousands of patients across the region.\nSign up below for updates on this issue.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_get-postal-vote/content_2.html": "Vote from home...\nMore and more people in North Wales are choosing to vote from home by registering to vote by post.\nVoting by post is easy and convenient, enabling you to vote before polling day, without having to go to a polling station.\nEven if you don't get around to posting your vote, you can still take it to your polling station on election day.\nVoting by post will also mean that you won't lose the opportunity to cast your ballot if you are ill, working, away on holiday, or simply too busy on polling day.\nRegistering for a postal vote is easy, just click on the link below:",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_campaigns_home-school-transport-llysfaen/content_13.html": "Conwy County Borough Council has announced plans to withdraw free home to school transport for children in Llysfaen to Ysgol Bryn Elian.\nThe plans are unacceptable and will pose a significant challenge to local families.\nDarren Millar has urged the local authority to reconsider the decision.\nSign up to receive updates on the matter here.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_category_Articles/content_5.html": "MSs visit Almost Home Dog Rescue in Nercwys 26th July 2022 Two North Wales Members of the Senedd have been seeing at first-hand how abandoned dogs enjoy a new lease of life. Shadow Minister for North Wales, Darren... Articles\n‘Join the Big Butterfly Count’ urges MS 26th July 2022 Clwyd West MS Darren Millar has joined with Butterfly Conservation to promote the ‘Big Butterfly Count’ taking place from the 15th July to the 7th August. Over... Articles\nSpeed limit changes \"war on common sense\" says MS 25th July 2022 Here in North Wales the vast majority of people rely on their car to get on with day to day life. Whether that involves commuting to work, dropping the kids off... Articles\nWelsh Government 'war on motorists' will hit North Wales the hardest 22nd July 2022 Welsh Conservative Shadow Minister for North Wales Darren Millar has slammed the Welsh Government's plans to introduce new charges which will hike the cost of... Articles\nPrehistoric Dinosaur Abergele Adventure will be a 'roaring success' 22nd July 2022 Darren Millar MS got to grips with Abergele’s newest prehistoric residents at Manorafon Farm near Gwyrch Castle as part of their new Dinosaur Adventure... Articles\nCalls for urgent statement following Health Board attempt to avoid public scrutiny 28th October 2021 Clwyd West MS Darren Millar has called on the Minister for Health and Social Services to make an urgent statement following reports that Betsi Cadwaladr... Articles\nMS Celebrates Colwyn Bay Library decision 28th October 2021 Clwyd West MS Darren Millar has welcomed Conwy County Borough Council’s decision to save Colwyn Bay Library following a consultation over its future. The local... Articles\nThousands back Rhos on Sea kiosks campaign 28th October 2021 More than 2,500 people have signed a petition to calling for Conwy County Borough Council to ensure that Rhos on Sea continues to have kiosks on its promenade... Articles\nSandy Cove roads: survey work set to begin 28th October 2021 Clwyd West MS Darren Millar has welcomed Conwy County Borough Council’s announcement that survey work required to make improvements to the roads at Sandy Cove... Articles",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_health-board-urged-address-lengthy-wait-times-blood-tests/content_26.html": "With patients reporting that they are having to wait up to six weeks for blood tests, Leader of the Welsh Conservatives and Clwyd West MS Darren Millar is calling on Betsi Cadwaladr University Health Board to take urgent action to improve the situation.\nDarren recently wrote to the Health Board after receiving complaints from residents about the long waits, and in an emailed response was told that “that waiting times for this service have increased over recent months with appointments now typically being booked up three to six weeks in advance”.\nConstituents have described the booking system “a nightmare”, with patients eventually being forced to do it online, which he said some elderly patients may have problems with.\nDarren has urged Health Board bosses to get to grips with the problems and address the long wait times.\nHe said:\n“Patients are contacting me because they are rightfully frustrated that they are having to wait so long to get a blood test.\n“This is an anxious time for them, where they are desperate to find out the cause of their symptoms.\n“They are experiencing problems booking their test and when they eventually can book, they are being given appointments that are weeks later - it simply isn’t good enough!\n“Timely access to diagnostic services is essential for early treatment and peace of mind, which is why I’m urging the health board to urgently review their booking system and to invest in solutions that will put patients first and won't put them at risk of harm.\"",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_about-rss/content_21.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_calls-urgent-statement-following-health-board-attempt-avoid-public-scrutiny-0/content_34.html": "Clwyd West MS Darren Millar has called on the Minister for Health and Social Services to make an urgent statement following reports that Betsi Cadwaladr University Health Board attempted to keep its name secret in a case involving ‘substantial and alarming failures’ in the care of mental health patient.\nDarren called for the statement following reports that a judge had rejected the Health Board’s request to hide its name in a case concerning the poor care of a 43 year old man in January last year.\nDarren said:\n“Reports have suggested that the Besti Cadwaladr Health Board attempted to prevent the name of the Board being made public following the scandalous care of a mental health patient.\n“The judge described the patient's needs as being ‘substantially unaddressed’, ‘unacknowledged’, ‘unidentified’, and ‘neglected’, and yet the Besti Cadwaladr health board was trying to hide its association with the case from the public.\n“I had hoped that there had been a culture change in the organisation in recent years, but this case suggests otherwise.\n“For a health board that’s was in special measures for more than 5 years for problems with its mental health services this is totally unacceptable. We need an urgent statement from the Health Minister to determine what action she now intends to take to ensure that the Health Board is accountable for what has happened.”",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_join-big-butterfly-count-urges-ms/content_17.html": "Clwyd West MS Darren Millar has joined with Butterfly Conservation to promote the ‘Big Butterfly Count’ taking place from the 15th July to the 7th August.\nOver the three week period people are being asked to spend 15 minutes outside in a sunny spot and count the amount and type of butterflies they see. They can then submit their results via the free app or via www.bigbutterflycount.org.\nSpeaking on the ‘Big Count’ Darren said:\n“I am delighted to be joining with Butterfly Conservation in this amazing effort to gather as much data as possible to secure the future for as many species as possible.\n“North Wales is the home to a great range of butterflies which form such an important and beautiful part of biodiversity across the region.\n“In May this year we learned that half of Britain’s remaining butterfly species are now on the Red List and threatened or near threatened with extinction. The Big Butterfly Count is vital in helping scientists understand more about what is happening to the nation’s butterflies.\n“I would encourage everyone across North Wales to visit the website, take part in the Big Butterfly Count and to encourage friends and family to join in too.\n“Efforts like this are so important for species conservation and for having a better understanding of what is happening to our environment and local species.”",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_campaigns_save-our-libraries/content_18.html": "Both Conwy County Borough Council and Denbighshire County Council are consulting on cuts to library services which will have a significant impact on staff and local communities.\nI strongly oppose any library closures or cuts to library opening hours and have urged council leaders to think again.\nSign up here to receive updates on this matter.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_15-years-veterans-nhs-wales-celebrated-senedd-event/content_30.html": "Leader of the Welsh Conservatives and Clwyd West MS Darren Millar hosted an event in the Senedd this week to celebrate 15 years of Veterans’ NHS Wales.\nVeterans NHS Wales is a specialised, priority service for individuals who have served in the Armed Forces and are experiencing mental health difficulties related specifically to their military service.\nIt is made up of six local health boards in Wales. Each board has a veteran therapist experienced in mental health issues relating to military service. Referrals can be made through a GP or veteran charity, or directly by the veteran or representative themselves.\nFive years ago, Darren, who for 15 years was Chair of the Senedd Cross Party Group on the Armed Forces and Cadets, hosted an event to celebrate the 10th anniversary of the services, so was delighted to do the same to mark this latest milestone.\nSpeaking after the celebrations in Pierhead Building, he said:\n“As I have repeatedly said throughout my time as a Member of the Senedd, we owe it to those who sacrifice so much for our country, to provide them, and their families, with the very best services and support.\n“The Veterans NHS Service plays an integral role in helping to achieve this and it was a privilege to sponsor yesterday’s event to celebrate 15 years of this fantastic service.\n“During the event, we heard from Peer Mentors from a number of Health Boards across Wales, along with service users who shared their own stories of how the support provided by Veterans NHS Wales has helped them to improve their mental health.\n“Over the past decade and a half, Veterans NHS Wales has done incredible work to support the wellbeing of veterans in Wales, saving lives and livelihoods. Here’s to the next 15 years!”",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_accessibility/content_37.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_privacy/content_24.html": "This document outlines how Darren Millar MS processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Darren Millar MS\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Darren Millar MS.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Darren Millar MS, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Darren Millar MS via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_cdn-cgi_l_email-protection/content_40.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_news_wales-has-worst-childcare-offer-great-britain/content_4.html": "With Wales having the worst childcare offer in Great Britain, Leader of the Welsh Conservatives and Clwyd West MS Darren Millar has implored the First Minister to provide working parents with the support with childcare costs that they need.\nSpeaking in Tuesday’s meeting of the Welsh Parliament, Darren said hard-working parents from Wales are deliberately moving over the border to England where they can get free childcare support for babies from nine months old.\nHe therefore urged the First Minister to improve the childcare offer in Wales.\nDarren said;\n“Research by Coram Family and Childcare found that the parent of a child under two in Wales spends an average of £4,400 more per year to send their child to nursery on a part-time basis than over the border in England. That's £1,700 more per year than is currently the case in Scotland. This is due to parents in Wales getting less support with childcare costs than anywhere else in Britain.\n“Can you explain to us today, First Minister, why is it that the Labour Party in Wales does not support or value hard-working mums and dads by providing them with access to more support with free childcare?”\nAfter the First Minister tried to point out differences between England and Wales, Darren added:\n“In England, you can get free childcare support for babies from nine months old. You don't get that support if you live in Wales. In Wales, most people don't get any financial support with childcare costs until their child is three years old, and the financial gap between childcare costs in England and Wales is likely to increase significantly because they're going to extend the offer and double the number of free hours for under-threes in September of this year.\n“Your Welsh Government received £140 million from the UK Government to allow you to extend your offer and to make it at least as equal to the offer in England. What have you done with that money, because you clearly haven't invested it in childcare?”\nHe added:\n“I'm not proud of the fact that we have working parents from Wales who are deliberately relocating to England in order to get support with their finances in terms of childcare. The reality is this: parents in Wales have the lowest wages, the highest childcare costs and the worst childcare offer in Great Britain.\"\nSpeaking after the exchange, Darren said:\n“Under Labour, parents are worse off than elsewhere in the UK yet face the highest childcare costs. A Welsh Conservative Government will give more help to hardworking parents as part of our plans to fix Wales.\"",
  "https_www_darrenmillar_wales_/https_www_darrenmillar_wales_campaigns/content_6.html": "Residents' Survey Help me to represent your views by completing my survey. Thank you! Darren Millar MS Click here to complete the survey in Welsh\nHome to School Transport, Llysfaen Conwy County Borough Council has announced plans to withdraw free home to school transport for children in Llysfaen to Ysgol Bryn Elian. The plans are...\nUpgrade flood defences and roads in Sandy Cove Sign here to show your support for the campaign for improved flood defences and roads on the Sandy Cove estate and Darren Millar will keep you posted on...\nScrap the new parking charges at Rhyl Harbour Denbighshire County Council recently introduced parking charges at Rhyl Harbour which came as a surprise to locals in Kinmel Bay and other areas, none of whom...\nNorth Denbighshire Community Hospital The Welsh Government has failed to deliver a new hospital in Rhyl to take pressure off Ysbyty Glan Clwyd. Ministers promised Rhyl a new hospital with a Minor...\nSave our Libraries! Both Conwy County Borough Council and Denbighshire County Council are consulting on cuts to library services which will have a significant impact on staff and...\nAccess to NHS Dentistry in North Wales I have been raising concerns regarding access to NHS dentists in the Welsh Parliament in for many months, due to the withdrawal of NHS dentistry from a number...\nSave the Abergele Youth and Community Centre Conwy County Borough Council has taken the decision to close the Youth and Community Centre in Abergele. This decision has been made without consultation with...\nWest End Medical Centre Please sign below to register for updates on action to improve services at the West End Medical Centre in Colwyn Bay.\nPwllglas Road Safety Campaign Pwllglas is benefitting from a new fun and fitness park but access across the A494 trunk road is dangerous for children and other pedestrians. Sign this...\nSupport the campaign for Ruthin road improvements The A494 trunk road through Ruthin is dangerous and needs an upgrade. Lôn Fawr and Corwen Road are gateways into Ruthin and part of a key circular route for..."
}