{
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_27_pelsall-armed-forces-day-success/content_26.html": "Today was one of those moments you wished you could pause and replay whenever you require a ‘lift’ in life.\nAround 80 villagers attended the ‘free’ concert organised to commemorate, remember and celebrate the role of our Armed Forces in Great Britain.\nFirstly, Pelsall Pride continues to work its magic in bringing people together and galvanising community spirit, a spirit alive and well in our village. Thank you to the officers and members who work so hard to make things happen.\nThe concert by Maggie O’Hara was excellent to say the least, she displayed a warmth and genuiness of character, so akin to the war time entertainers of the past such as Vera Lynn and Gracie Fields.\nRichard Shepherd MP spoke as eloquently as ever, and my ward colleague Cllr Longhi was in attendance.\nTo have ‘bottled’ up and sold the finale of Land of Hope and Glory and Rule Brittainia with the audience on its feet, flag waving and cheering – we would make a fortune!\nIt is not always seen as Politically Correct to be Patriotic and Proud, but events like today not only transcends politics in all its forms, it demonstrates what its all about, people, community and a sense of belonging.\nLong may this continue.\nJune 27, 2009 at 8:34 pm |\nGreat event Garry, a big thanks to you and all the organizers / helpers.\nJune 28, 2009 at 6:47 am |\nCongratulations to the people of Pelsall!\nIt is a pity Walsall could not manage anything this year – hopefully the town will do better next time.\n– The Edditer",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_16_stonnall-road-bail-hostel/content_32.html": "Today I attended a protest meeting at the above ‘approved premise’. This was organised by local residents and in attendance were Councillor colleagues from Aldridge North and Walsall Wood, Aldridge Central and South, and Richard Shepherd MP.\nI do not pretend to be as well read on this subject as some, but what I do know is that it is very clear that the site with its ‘approved status’ and all that entails, is completely unacceptable and should not be in this location.\nIn recent months I have received updates and briefings frrom Cllr Mike Flower and Richard Shepherd and have attended a meeting with them and the probabtion service.\nNo matter what the ‘flannel’ given by the probation service, there is no justification to ignore public opinion and continuing to maintain a position at odds with common sense.\nYears of pressure amounts to little when unelected officials shut the door before those who can make a decision on whether the premise stays open or not.\nI will fully support Cllr Flower and his colleagues and will do all I can to work with residents in attempting to find the best resolution for the peoplemof Stonnall Road, CLOSURE!\nAs I said at the meeting, ‘People CAN win’, I believe there is a hunger and will for this.\nMay 19, 2009 at 10:46 am |\nWell said that man!",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_09_hello-world_trackback/content_39.html": "Welcome to my first blog on what I hope will become a well used tool in communicating with the people of Pelsall. Along with my colleague Cllr Marco Longhi we have taken great steps to enhance the way in which we listen and respond to the needs of Pelsall and its people.\nOur traditional advice surgeries continue to be popular and we will maintain our contact through our regular Pelsallfirst newsletter.\nHowever the use of social media such as Facebook and Twitter has opened up access for us to a whole new generation of people who use these mediums as way of keeping in touch and posting messages.\nSo do not be afraid to contact us and leave us messages! Polite of course.\nMay 10, 2009 at 4:57 pm |\nWelcome to the blogosphere!",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_22_enjoy-the-break/content_5.html": "Well its ‘whit’ weekend again, where does time go? whatever you are doing or wherever you are going enjoy and relax.\nNext week I will be arranging further meetings regarding Pelsall Common play area, and pursuing the resolution of flooding issues at Highfield Road North.\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_category_uncategorized/content_18.html": "A campaign that is now in its third year, including a 600 signature petition, will soon see Pelsall receive inward investment worth several million pounds subject to final approval on the 6th July from NHS Walsall (tPCT) and Walsall Council’s Cabinet decision on 15th July.\nIt all started in the summer of 2006 when residents approached my colleague Garry Perry and I to help secure a\nMarco, Garry and Richard Shepherd MP with petition outside Pelsall library.\nnew medical centre as seen in other areas of the borough. But we knew from the outset that ours had to be different because of the limited availability of land which meant that the only option was the library site.\nSo an idea grew that we should combine Council and tPCT resources to deliver a facility that included a Medical centre, Library and a Children’s centre (this was Garry’s idea!). Inevitably, while presenting a uniquely attractive opportunity, this meant overcoming the significant inertia of two large organisations as well as silo working.\nThen a hammer blow. After all the work to get agreement from all parties it seemed that even the pooled budgets were insufficient to construct the building. This was devastating news, but I was not going to accept this. So I started asking much more detailed questions about costings and I soon found out that prices were significantly inflated because they were based on building rates by ‘LIFT Co’ an organisation that channels funds to PCTs to build medical centres.\nImmediately I requested that the Council should lead on the building of the project and this meant that a saving of around 20% was possible – making the whole thing just about viable. Thankfully the PCT agreed to this approach!\nIf on the 6th July NHS Walsall finally endorses the funding needed for the project, and Walsall’s cabinet agree to the recommendations in their report on 15th July, we will soon have a fantastic resource that will support Pelsall people for generations to come.",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_20_richard-shepherd-mp-for-speaker_trackback/content_47.html": "What is Westminster scared of? Our MP is one of ‘Britains Best Kept Secrets’, It is clear he is a parliamentarian of fine standing and has always demonstrated his understanding of the role of parliament in defending our freedoms and the traditions and customs once the envy of the world.\nRichard Shepherd has spoken with clear conviction on the crisis that has beset Parliament in recent weeks. His voice should resonate to all politicians who seek to serve self first!\nRichard is one of ‘Britains Best Kept’ secrets, and is more than capable of taking up the challenge of restoring public confidence in a Paliament once the envy of the World.\nLets get behind him!\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_07_02_michael-jackson-conspiracy-theories_feed/content_30.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_10_dont-leave-it-pick-it-up_feed/content_38.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_11_mps-allowances_trackback/content_55.html": "I am sure im not the only one most put off by the recent debacle regarding MP’s allowances. No party is innocent and I suspect that there a few on the fringes who have abused the system too. But is it an abuse?! according to parliamentary regulations few MP’s have actually broken the rules. The now infamous ‘green book’, devised by MP’s themselves has legitimised the ridiculous and in some cases furthered financial interests.\nWhats even more bemusing is the fact that we have a Chancellor, in charge of ‘stamp duty’ playing the system to avoid paying it himself and a Prime Minister, the man who made his career out of closing loopholes and benefits in kind, from company cars to private health insurance, twisting and turning to screw every last penny out of the public purse.\nAs Councillors our allowances were reviewed and set by an INDEPENDENT panel, based on hours spent on case work and civic duties. No ‘green Book’ for us and certainly no such thing as second home payments, food allowance and renovation grants! ridiculous!\nWhilst the current scandal is shocking I wonder how many of us would have done the same, within the permitted rules! and I include in that the journalists and correspondents who are quick to make hay.\nThe public deserve better and if that costs some MP’s their seats, so be it! Full accountability to Parliament not another commission or review body should be the first priority. Scrap the ‘green book’ and make a sensible, common sense decision on paying a flat rate to MP’s, abiding by the same rules and regulations that is so often imposed upon the rest of us.\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_10_dont-leave-it-pick-it-up/content_11.html": "Yes, its that subject again, as the better weather is upon us and people are more active – its the same old in relation to Litter and dog fouling. The situation is probably no worse than usual its just that it is more visible as people are out and about.\nI get quite annoyed when people criticise the Council of not removing litter or dog fouling quickly enough. The Council do not put it there in the first place, and apart from having a 24/7 cleansing service the answer does not lie with Street Pride at Walsall Council.\nEnforcement and Education are the key, in recent weeks I have had some success in utilising the dog warden to target an area near Little Common, Pelsall. An approach has been made for him to go into the primary schools in the coming weeks and ALL Primary heads have put a message out to parents from me on this particular issue.\nWorking together and doing our bit, we can have some impact! so be vigilant but more so be caring towards Pelsall – its simple, dont leave it, Pick it up!\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_18_busy-day-fighting-pelsalls-corner_feed/content_33.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06/content_25.html": "Today was one of those moments you wished you could pause and replay whenever you require a ‘lift’ in life.\nAround 80 villagers attended the ‘free’ concert organised to commemorate, remember and celebrate the role of our Armed Forces in Great Britain.\nFirstly, Pelsall Pride continues to work its magic in bringing people together and galvanising community spirit, a spirit alive and well in our village. Thank you to the officers and members who work so hard to make things happen.\nThe concert by Maggie O’Hara was excellent to say the least, she displayed a warmth and genuiness of character, so akin to the war time entertainers of the past such as Vera Lynn and Gracie Fields.\nRichard Shepherd MP spoke as eloquently as ever, and my ward colleague Cllr Longhi was in attendance.\nTo have ‘bottled’ up and sold the finale of Land of Hope and Glory and Rule Brittainia with the audience on its feet, flag waving and cheering – we would make a fortune!\nIt is not always seen as Politically Correct to be Patriotic and Proud, but events like today not only transcends politics in all its forms, it demonstrates what its all about, people, community and a sense of belonging.\nLong may this continue.",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_feed/content_4.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_18_busy-day-fighting-pelsalls-corner/content_19.html": "Well what a day! Three threats to services for our local community.\n1) Apparently National Express (formerly WM Travel) are proposing under a so called ‘reorganisation’ to make significant changes to the 346, 348 and 372 Bus Services. Details have not yet been announced, however with my colleague Marco Longhi, we have today contacted bosses to request a full briefing so that we can consult Pelsall people, and dfend anything not in our interests.\n2) I have learnt via the Council Chief Executive that NHS Walsall (PCT) willnot sign the statement of intent for the new Pelsall Medical Centre, until it has approval from the Strategic Health Authority. This could take weeks, and jeopardise the work being underatken by Walsall Council on the new Library and Childrens Centre. Time is not on our side. A broadside is being sent to the Strategic Health Authority and we will not stop at anything until we get the ‘yes’ from the SHA that will pave the way for the work to commence on bringing this long awaited and valuable provision to fruitition.\n3) The ‘play builders’ award that DCMS has granted Walsall to further enhance play provision across the Borough, does niot include Pelsall Common on the list.\nAgain, we will take a fight to officers, and seek support to find external funding to improve and enhance the play area, in response to an overwhelming request from residents and young people alike.\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_20_richard-shepherd-mp-for-speaker_feed/content_23.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com/content_1.html": "A campaign that is now in its third year, including a 600 signature petition, will soon see Pelsall receive inward investment worth several million pounds subject to final approval on the 6th July from NHS Walsall (tPCT) and Walsall Council’s Cabinet decision on 15th July.\nIt all started in the summer of 2006 when residents approached my colleague Garry Perry and I to help secure a\nMarco, Garry and Richard Shepherd MP with petition outside Pelsall library.\nnew medical centre as seen in other areas of the borough. But we knew from the outset that ours had to be different because of the limited availability of land which meant that the only option was the library site.\nSo an idea grew that we should combine Council and tPCT resources to deliver a facility that included a Medical centre, Library and a Children’s centre (this was Garry’s idea!). Inevitably, while presenting a uniquely attractive opportunity, this meant overcoming the significant inertia of two large organisations as well as silo working.\nThen a hammer blow. After all the work to get agreement from all parties it seemed that even the pooled budgets were insufficient to construct the building. This was devastating news, but I was not going to accept this. So I started asking much more detailed questions about costings and I soon found out that prices were significantly inflated because they were based on building rates by ‘LIFT Co’ an organisation that channels funds to PCTs to build medical centres.\nImmediately I requested that the Council should lead on the building of the project and this meant that a saving of around 20% was possible – making the whole thing just about viable. Thankfully the PCT agreed to this approach!\nIf on the 6th July NHS Walsall finally endorses the funding needed for the project, and Walsall’s cabinet agree to the recommendations in their report on 15th July, we will soon have a fantastic resource that will support Pelsall people for generations to come.",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_04_from-the-difficult-to-the-ridiculous/content_2.html": "In 11 years serving Pelsall I have been involved in some really difficult case work on behalf of constituents. This I am sure is the case for my colleagues across Walsall.\nHowever I never cease to be amazed how ridiculous the system can be, and frustrate the rule of common sense.\nI have been to see a constituent with a problem today. I was advised how he had been pursued for £2.61 overpayment of rent, from a property he lived in Two years ago! Privately rented, that the DSS paid directly to the Landlord.\nA debt collection agency was also sent out to him to advise that he had rent arrears and he wanted to know why this had not been paid.\nI am glad this was not Walsall Council who had sent out the agency as I would have been demanding answers. As it happens the resident does not want me to pursue the case, he thought I should be aware.\nI respect this, however I will be following this up with the relevant organisation.\nIts situations like this that ‘take the biscuit’, especially when those who are abusing the system appear to get away with it without fear or penalty.\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_18_busy-day-fighting-pelsalls-corner_trackback/content_24.html": "Well what a day! Three threats to services for our local community.\n1) Apparently National Express (formerly WM Travel) are proposing under a so called ‘reorganisation’ to make significant changes to the 346, 348 and 372 Bus Services. Details have not yet been announced, however with my colleague Marco Longhi, we have today contacted bosses to request a full briefing so that we can consult Pelsall people, and dfend anything not in our interests.\n2) I have learnt via the Council Chief Executive that NHS Walsall (PCT) willnot sign the statement of intent for the new Pelsall Medical Centre, until it has approval from the Strategic Health Authority. This could take weeks, and jeopardise the work being underatken by Walsall Council on the new Library and Childrens Centre. Time is not on our side. A broadside is being sent to the Strategic Health Authority and we will not stop at anything until we get the ‘yes’ from the SHA that will pave the way for the work to commence on bringing this long awaited and valuable provision to fruitition.\n3) The ‘play builders’ award that DCMS has granted Walsall to further enhance play provision across the Borough, does niot include Pelsall Common on the list.\nAgain, we will take a fight to officers, and seek support to find external funding to improve and enhance the play area, in response to an overwhelming request from residents and young people alike.\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_page_2/content_20.html": "Well what a day! Three threats to services for our local community.\n1) Apparently National Express (formerly WM Travel) are proposing under a so called ‘reorganisation’ to make significant changes to the 346, 348 and 372 Bus Services. Details have not yet been announced, however with my colleague Marco Longhi, we have today contacted bosses to request a full briefing so that we can consult Pelsall people, and dfend anything not in our interests.\n2) I have learnt via the Council Chief Executive that NHS Walsall (PCT) willnot sign the statement of intent for the new Pelsall Medical Centre, until it has approval from the Strategic Health Authority. This could take weeks, and jeopardise the work being underatken by Walsall Council on the new Library and Childrens Centre. Time is not on our side. A broadside is being sent to the Strategic Health Authority and we will not stop at anything until we get the ‘yes’ from the SHA that will pave the way for the work to commence on bringing this long awaited and valuable provision to fruitition.\n3) The ‘play builders’ award that DCMS has granted Walsall to further enhance play provision across the Borough, does niot include Pelsall Common on the list.\nAgain, we will take a fight to officers, and seek support to find external funding to improve and enhance the play area, in response to an overwhelming request from residents and young people alike.",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_16_stonnall-road-bail-hostel_feed/content_42.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_07_floody-busy_feed/content_46.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_26_32_feed/content_48.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_07_02_michael-jackson-conspiracy-theories/content_3.html": "The continued media frenzy surrounding Michael Jackson continues to gather pace. Daily another media story appears that either confounds critics or gives weight to popular theories about his life.\nThere is no doubt that Michael Jackson was an iconic figure – I am a fan and certainly enjoyed his music, in the 80’s I bought Thriller! Billie Jean was my favourite.\nLike so many celebrities Michael appears to have danced with controversy and has had produced some shocking media headlines. Beyond the grave he continues to do so!\nI am not here to ‘judge’ and he has certainly been before them enough times, but what I think he deserves like the late Princess of Wales is to be left to rest in peace and his family to be dignified with putting their son to rest.\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_07_floody-busy_trackback/content_51.html": "Well yet again our fine Summer descends into its usual ‘wet and wonderful’ self.\nThis has again brought with it problems of ‘flash flooding’ and drain overflow.\nI spent several hours yesterday fielding calls regarding flooding in the High Street and in the ‘hot spot’ areas along Walsall Road.\nThankfully I managed to get Severn Trent/South Staffs between them to sort out the High Street, but the constant rain over night has again defeated efforts.\nGully cleansing of drains have been carried out in recent weeks, even so it is impossible for the system to cope fully with the deluge.\nAt this rate Pelsall will become Venice – anyone for a ride on a Gondola!\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_11_mps-allowances_feed/content_54.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_04_from-the-difficult-to-the-ridiculous_trackback/content_9.html": "In 11 years serving Pelsall I have been involved in some really difficult case work on behalf of constituents. This I am sure is the case for my colleagues across Walsall.\nHowever I never cease to be amazed how ridiculous the system can be, and frustrate the rule of common sense.\nI have been to see a constituent with a problem today. I was advised how he had been pursued for £2.61 overpayment of rent, from a property he lived in Two years ago! Privately rented, that the DSS paid directly to the Landlord.\nA debt collection agency was also sent out to him to advise that he had rent arrears and he wanted to know why this had not been paid.\nI am glad this was not Walsall Council who had sent out the agency as I would have been demanding answers. As it happens the resident does not want me to pursue the case, he thought I should be aware.\nI respect this, however I will be following this up with the relevant organisation.\nIts situations like this that ‘take the biscuit’, especially when those who are abusing the system appear to get away with it without fear or penalty.\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_about/content_14.html": "About Garry Perry\nI have represented Pelsall on Walsall Council since 1998. I am proud and feel privilieged to serve this distinct, unique and special community. This blog is my opportunity to communicate some of the key issues that I am dealing with locally as well as comment on issues that affect us both locally and Nationally. I look forward to receiving feedback from residents on some of my postings and will endeavour to use this in a constructive way to further enhance my work in Pelsall.\nMay 12, 2009 at 9:54 pm |\nGarry\nWith the apparent success of the green bins I wonder what are the chances of weekly rather than fortnightly collections of recycling materials? Many many friends and colleagues are asking the same question. We find that within a short time of the green bin being emptied, it is soon full yet again and we always have more to recycle than we have room in the bin for!\nI’d love to hear your feelings on the matter.\nregrds\nSue\nMay 13, 2009 at 7:03 am |\nVery Real Sue, as the contract promised – it’s 6month review takes place in September. Here we will assess the full effects of the changes, ie total increases in collection of recyclables, reduced amounts of landfill etc. This will inform the Cabinet and Council as to the next steps – ie weekly collections, the only sticking point being the financial implications. All signs at this stage are good though.\nMay 15, 2009 at 3:39 am |\nHi Garry\nCan I put in a plea for weekly brown bin collection too? Or if finance is an issue how about text or Twitter reminders from the Council 🙂\nMark\nMay 16, 2009 at 12:53 pm |\nGreat idea!",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_27_pelsall-armed-forces-day-success_feed/content_41.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_27_pelsall-pride-partnership/content_8.html": "On Friday 12th June, the partnership will bring the ‘Magic of the Musicals’ show to Pelsall Community Centre. The show is a fast moving extravaganza that will feature songs from some of the Top West End and Broadway Shows –\nTickets are £5 and monies raised help support the organisation of the Annual Victorian Christmas. Available on 01922 682140\nWe are also putting on a Free Concert on a first come first served basis, on Saturday June 27th at St Michaels Church Hall, Pelsall.\nThe entertainment is provided by Maggie O’Hara who will perform her ‘Victory Years’ repertoire, there is afternoon tea provided – all in celebration of Armed Forces Day!\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_27_pelsall-pride-partnership_feed/content_35.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_07/content_10.html": "The continued media frenzy surrounding Michael Jackson continues to gather pace. Daily another media story appears that either confounds critics or gives weight to popular theories about his life.\nThere is no doubt that Michael Jackson was an iconic figure – I am a fan and certainly enjoyed his music, in the 80’s I bought Thriller! Billie Jean was my favourite.\nLike so many celebrities Michael appears to have danced with controversy and has had produced some shocking media headlines. Beyond the grave he continues to do so!\nI am not here to ‘judge’ and he has certainly been before them enough times, but what I think he deserves like the late Princess of Wales is to be left to rest in peace and his family to be dignified with putting their son to rest.",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_16_stonnall-road-bail-hostel_trackback/content_49.html": "Today I attended a protest meeting at the above ‘approved premise’. This was organised by local residents and in attendance were Councillor colleagues from Aldridge North and Walsall Wood, Aldridge Central and South, and Richard Shepherd MP.\nI do not pretend to be as well read on this subject as some, but what I do know is that it is very clear that the site with its ‘approved status’ and all that entails, is completely unacceptable and should not be in this location.\nIn recent months I have received updates and briefings frrom Cllr Mike Flower and Richard Shepherd and have attended a meeting with them and the probabtion service.\nNo matter what the ‘flannel’ given by the probation service, there is no justification to ignore public opinion and continuing to maintain a position at odds with common sense.\nYears of pressure amounts to little when unelected officials shut the door before those who can make a decision on whether the premise stays open or not.\nI will fully support Cllr Flower and his colleagues and will do all I can to work with residents in attempting to find the best resolution for the peoplemof Stonnall Road, CLOSURE!\nAs I said at the meeting, ‘People CAN win’, I believe there is a hunger and will for this.\nMay 19, 2009 at 10:46 am |\nWell said that man!",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_07_floody-busy/content_21.html": "Well yet again our fine Summer descends into its usual ‘wet and wonderful’ self.\nThis has again brought with it problems of ‘flash flooding’ and drain overflow.\nI spent several hours yesterday fielding calls regarding flooding in the High Street and in the ‘hot spot’ areas along Walsall Road.\nThankfully I managed to get Severn Trent/South Staffs between them to sort out the High Street, but the constant rain over night has again defeated efforts.\nGully cleansing of drains have been carried out in recent weeks, even so it is impossible for the system to cope fully with the deluge.\nAt this rate Pelsall will become Venice – anyone for a ride on a Gondola!\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_04_from-the-difficult-to-the-ridiculous_feed/content_45.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_26_32_trackback/content_27.html": "A campaign that is now in its third year, including a 600 signature petition, will soon see Pelsall receive inward investment worth several million pounds subject to final approval on the 6th July from NHS Walsall (tPCT) and Walsall Council’s Cabinet decision on 15th July.\nIt all started in the summer of 2006 when residents approached my colleague Garry Perry and I to help secure a\nMarco, Garry and Richard Shepherd MP with petition outside Pelsall library.\nnew medical centre as seen in other areas of the borough. But we knew from the outset that ours had to be different because of the limited availability of land which meant that the only option was the library site.\nSo an idea grew that we should combine Council and tPCT resources to deliver a facility that included a Medical centre, Library and a Children’s centre (this was Garry’s idea!). Inevitably, while presenting a uniquely attractive opportunity, this meant overcoming the significant inertia of two large organisations as well as silo working.\nThen a hammer blow. After all the work to get agreement from all parties it seemed that even the pooled budgets were insufficient to construct the building. This was devastating news, but I was not going to accept this. So I started asking much more detailed questions about costings and I soon found out that prices were significantly inflated because they were based on building rates by ‘LIFT Co’ an organisation that channels funds to PCTs to build medical centres.\nImmediately I requested that the Council should lead on the building of the project and this meant that a saving of around 20% was possible – making the whole thing just about viable. Thankfully the PCT agreed to this approach!\nIf on the 6th July NHS Walsall finally endorses the funding needed for the project, and Walsall’s cabinet agree to the recommendations in their report on 15th July, we will soon have a fantastic resource that will support Pelsall people for generations to come.\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_07_02_michael-jackson-conspiracy-theories_trackback/content_34.html": "The continued media frenzy surrounding Michael Jackson continues to gather pace. Daily another media story appears that either confounds critics or gives weight to popular theories about his life.\nThere is no doubt that Michael Jackson was an iconic figure – I am a fan and certainly enjoyed his music, in the 80’s I bought Thriller! Billie Jean was my favourite.\nLike so many celebrities Michael appears to have danced with controversy and has had produced some shocking media headlines. Beyond the grave he continues to do so!\nI am not here to ‘judge’ and he has certainly been before them enough times, but what I think he deserves like the late Princess of Wales is to be left to rest in peace and his family to be dignified with putting their son to rest.\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_21_council-21th-may-2009_trackback/content_52.html": "Last nights Council meeting was one of the worst that I have attended in a long time.\nPolitics in Walsall has always been interesting and no one should deny anyone a right to free speech.\nHowever respect for opinion and for the individual should be paramount.\nThe atmosphere was highly charged and expected when considering the issues being debated, Sneyd School and the M6 Tree works.\nI would hope that members do not enact a repeat performance at future meetings.\nMay 21, 2009 at 10:03 am |\n[…] precipitated some hostility. (Later Edit, 11:0AM 21th May – even the normally mild-mannered Garry Perry joins in the grumble) From the sounds of things, this could be a portent of future council meetings and I fear we could […]\nMay 21, 2009 at 6:40 pm |\nSo, any chance of naming names so we can vote accordingly when the time comes? Any one but X is not normally a good way to vote but some times (as with tainted MP’s) it may be valid. It is also a way of assisting the defeat of extremists.\nMay 21, 2009 at 10:59 pm |\nSo, Garry, what are you going to do about it?\nMay 22, 2009 at 1:14 am |\n[…] have probably not been welcomed in some quarters – in fact, as councillors Marco Longhi and Garry Perry moved to support the statement with similar posts of their own, one wondered if they would have […]\nMay 22, 2009 at 3:22 pm |\nThanks for the feedback.\n1) I would have posted on the issue, regardless of my colleague\n2) The Council monitoring officer was present and therefore at witness to any inappropriate behaviour, I am sure he will be dealing/speaking with the number of individuals involved.\n3) Councillors of ALL political persuasion, and judging by debate since Wednesday will hopefully ‘think on’ in future.\nI am not afraid to report matters to the monitoring officer, and have done so in the past! whether they are a party colleague or not. In this instance Im not certain there was any single person to blame, I think shared ownership and collective responsible to move forward is the answer.\nJune 19, 2009 at 12:52 am |\n[…] the 20th May 2009, and the sympathetic, definitely not me-too followups by councillors Longhi and Perry, things have been uncharacteristically quiet on the local authority blog scene. Even the formerly […]",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_26_cracking-environmental-crime_trackback/content_36.html": "On Monday I will launch a year long publicity campaign to clamp down on louts who vandalise our borough and make it untidy.\nThe aim is to ‘stamp out’ serious issues including fly tipping, litter, graffiti and vandalsim.\nWe are calling on residents and people who work in the borough to join us in the fight agaisnt environmental crime and help us catch the irresponsible people who blight our borough with litter and vandalism.\nThe campaign will run throughout the year and will target specific issues every few months.\nThe first crack down within the campaign will be targetted on Fly-tippers, Tackle the Tippers will run from June 29th.\nApprox 30 tonnes of rubbish is illegally fly tipped in the borough every week and over £120,000 of public money is spent on cleaning up fly tipping in the borough each year.\nAnyone wishing to report incidents or have any information on perpetrators should contact 01922 653344\nJune 26, 2009 at 9:14 pm |\nThis great. Key to its success will be the followup/enforcement element – if people do report incidents they will expect action to be taken.\nI remember when as cabinet member for environment I set the ball rolling to try and have a much bigger enforcement team by having traffic wardens, highways officers, wardens etc all trained and licensed to fine offenders. Hopefully this is something we can still do.\nLet’s also hope that magistrates co-operate too and start treating this type of ‘low level’ crime much more seriously.\nI support it all the way!",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_21_council-21th-may-2009/content_28.html": "Last nights Council meeting was one of the worst that I have attended in a long time.\nPolitics in Walsall has always been interesting and no one should deny anyone a right to free speech.\nHowever respect for opinion and for the individual should be paramount.\nThe atmosphere was highly charged and expected when considering the issues being debated, Sneyd School and the M6 Tree works.\nI would hope that members do not enact a repeat performance at future meetings.\nMay 21, 2009 at 10:03 am |\n[…] precipitated some hostility. (Later Edit, 11:0AM 21th May – even the normally mild-mannered Garry Perry joins in the grumble) From the sounds of things, this could be a portent of future council meetings and I fear we could […]\nMay 21, 2009 at 6:40 pm |\nSo, any chance of naming names so we can vote accordingly when the time comes? Any one but X is not normally a good way to vote but some times (as with tainted MP’s) it may be valid. It is also a way of assisting the defeat of extremists.\nMay 21, 2009 at 10:59 pm |\nSo, Garry, what are you going to do about it?\nMay 22, 2009 at 1:14 am |\n[…] have probably not been welcomed in some quarters – in fact, as councillors Marco Longhi and Garry Perry moved to support the statement with similar posts of their own, one wondered if they would have […]\nMay 22, 2009 at 3:22 pm |\nThanks for the feedback.\n1) I would have posted on the issue, regardless of my colleague\n2) The Council monitoring officer was present and therefore at witness to any inappropriate behaviour, I am sure he will be dealing/speaking with the number of individuals involved.\n3) Councillors of ALL political persuasion, and judging by debate since Wednesday will hopefully ‘think on’ in future.\nI am not afraid to report matters to the monitoring officer, and have done so in the past! whether they are a party colleague or not. In this instance Im not certain there was any single person to blame, I think shared ownership and collective responsible to move forward is the answer.\nJune 19, 2009 at 12:52 am |\n[…] the 20th May 2009, and the sympathetic, definitely not me-too followups by councillors Longhi and Perry, things have been uncharacteristically quiet on the local authority blog scene. Even the formerly […]",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_26_cracking-environmental-crime/content_13.html": "On Monday I will launch a year long publicity campaign to clamp down on louts who vandalise our borough and make it untidy.\nThe aim is to ‘stamp out’ serious issues including fly tipping, litter, graffiti and vandalsim.\nWe are calling on residents and people who work in the borough to join us in the fight agaisnt environmental crime and help us catch the irresponsible people who blight our borough with litter and vandalism.\nThe campaign will run throughout the year and will target specific issues every few months.\nThe first crack down within the campaign will be targetted on Fly-tippers, Tackle the Tippers will run from June 29th.\nApprox 30 tonnes of rubbish is illegally fly tipped in the borough every week and over £120,000 of public money is spent on cleaning up fly tipping in the borough each year.\nAnyone wishing to report incidents or have any information on perpetrators should contact 01922 653344\nJune 26, 2009 at 9:14 pm |\nThis great. Key to its success will be the followup/enforcement element – if people do report incidents they will expect action to be taken.\nI remember when as cabinet member for environment I set the ball rolling to try and have a much bigger enforcement team by having traffic wardens, highways officers, wardens etc all trained and licensed to fine offenders. Hopefully this is something we can still do.\nLet’s also hope that magistrates co-operate too and start treating this type of ‘low level’ crime much more seriously.\nI support it all the way!",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_22_enjoy-the-break_trackback/content_16.html": "Well its ‘whit’ weekend again, where does time go? whatever you are doing or wherever you are going enjoy and relax.\nNext week I will be arranging further meetings regarding Pelsall Common play area, and pursuing the resolution of flooding issues at Highfield Road North.\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_27_pelsall-pride-partnership_trackback/content_12.html": "On Friday 12th June, the partnership will bring the ‘Magic of the Musicals’ show to Pelsall Community Centre. The show is a fast moving extravaganza that will feature songs from some of the Top West End and Broadway Shows –\nTickets are £5 and monies raised help support the organisation of the Annual Victorian Christmas. Available on 01922 682140\nWe are also putting on a Free Concert on a first come first served basis, on Saturday June 27th at St Michaels Church Hall, Pelsall.\nThe entertainment is provided by Maggie O’Hara who will perform her ‘Victory Years’ repertoire, there is afternoon tea provided – all in celebration of Armed Forces Day!\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_11_mps-allowances/content_37.html": "I am sure im not the only one most put off by the recent debacle regarding MP’s allowances. No party is innocent and I suspect that there a few on the fringes who have abused the system too. But is it an abuse?! according to parliamentary regulations few MP’s have actually broken the rules. The now infamous ‘green book’, devised by MP’s themselves has legitimised the ridiculous and in some cases furthered financial interests.\nWhats even more bemusing is the fact that we have a Chancellor, in charge of ‘stamp duty’ playing the system to avoid paying it himself and a Prime Minister, the man who made his career out of closing loopholes and benefits in kind, from company cars to private health insurance, twisting and turning to screw every last penny out of the public purse.\nAs Councillors our allowances were reviewed and set by an INDEPENDENT panel, based on hours spent on case work and civic duties. No ‘green Book’ for us and certainly no such thing as second home payments, food allowance and renovation grants! ridiculous!\nWhilst the current scandal is shocking I wonder how many of us would have done the same, within the permitted rules! and I include in that the journalists and correspondents who are quick to make hay.\nThe public deserve better and if that costs some MP’s their seats, so be it! Full accountability to Parliament not another commission or review body should be the first priority. Scrap the ‘green book’ and make a sensible, common sense decision on paying a flat rate to MP’s, abiding by the same rules and regulations that is so often imposed upon the rest of us.\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05/content_7.html": "I am sure im not the only one most put off by the recent debacle regarding MP’s allowances. No party is innocent and I suspect that there a few on the fringes who have abused the system too. But is it an abuse?! according to parliamentary regulations few MP’s have actually broken the rules. The now infamous ‘green book’, devised by MP’s themselves has legitimised the ridiculous and in some cases furthered financial interests.\nWhats even more bemusing is the fact that we have a Chancellor, in charge of ‘stamp duty’ playing the system to avoid paying it himself and a Prime Minister, the man who made his career out of closing loopholes and benefits in kind, from company cars to private health insurance, twisting and turning to screw every last penny out of the public purse.\nAs Councillors our allowances were reviewed and set by an INDEPENDENT panel, based on hours spent on case work and civic duties. No ‘green Book’ for us and certainly no such thing as second home payments, food allowance and renovation grants! ridiculous!\nWhilst the current scandal is shocking I wonder how many of us would have done the same, within the permitted rules! and I include in that the journalists and correspondents who are quick to make hay.\nThe public deserve better and if that costs some MP’s their seats, so be it! Full accountability to Parliament not another commission or review body should be the first priority. Scrap the ‘green book’ and make a sensible, common sense decision on paying a flat rate to MP’s, abiding by the same rules and regulations that is so often imposed upon the rest of us.",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_comments_feed/content_6.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_category_uncategorized_page_2/content_50.html": "Well what a day! Three threats to services for our local community.\n1) Apparently National Express (formerly WM Travel) are proposing under a so called ‘reorganisation’ to make significant changes to the 346, 348 and 372 Bus Services. Details have not yet been announced, however with my colleague Marco Longhi, we have today contacted bosses to request a full briefing so that we can consult Pelsall people, and dfend anything not in our interests.\n2) I have learnt via the Council Chief Executive that NHS Walsall (PCT) willnot sign the statement of intent for the new Pelsall Medical Centre, until it has approval from the Strategic Health Authority. This could take weeks, and jeopardise the work being underatken by Walsall Council on the new Library and Childrens Centre. Time is not on our side. A broadside is being sent to the Strategic Health Authority and we will not stop at anything until we get the ‘yes’ from the SHA that will pave the way for the work to commence on bringing this long awaited and valuable provision to fruitition.\n3) The ‘play builders’ award that DCMS has granted Walsall to further enhance play provision across the Borough, does niot include Pelsall Common on the list.\nAgain, we will take a fight to officers, and seek support to find external funding to improve and enhance the play area, in response to an overwhelming request from residents and young people alike.",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_22_enjoy-the-break_feed/content_31.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_26_cracking-environmental-crime_feed/content_15.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_20_richard-shepherd-mp-for-speaker/content_17.html": "What is Westminster scared of? Our MP is one of ‘Britains Best Kept Secrets’, It is clear he is a parliamentarian of fine standing and has always demonstrated his understanding of the role of parliament in defending our freedoms and the traditions and customs once the envy of the world.\nRichard Shepherd has spoken with clear conviction on the crisis that has beset Parliament in recent weeks. His voice should resonate to all politicians who seek to serve self first!\nRichard is one of ‘Britains Best Kept’ secrets, and is more than capable of taking up the challenge of restoring public confidence in a Paliament once the envy of the World.\nLets get behind him!\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_09_hello-world/content_29.html": "Welcome to my first blog on what I hope will become a well used tool in communicating with the people of Pelsall. Along with my colleague Cllr Marco Longhi we have taken great steps to enhance the way in which we listen and respond to the needs of Pelsall and its people.\nOur traditional advice surgeries continue to be popular and we will maintain our contact through our regular Pelsallfirst newsletter.\nHowever the use of social media such as Facebook and Twitter has opened up access for us to a whole new generation of people who use these mediums as way of keeping in touch and posting messages.\nSo do not be afraid to contact us and leave us messages! Polite of course.\nMay 10, 2009 at 4:57 pm |\nWelcome to the blogosphere!",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_26_32/content_22.html": "A campaign that is now in its third year, including a 600 signature petition, will soon see Pelsall receive inward investment worth several million pounds subject to final approval on the 6th July from NHS Walsall (tPCT) and Walsall Council’s Cabinet decision on 15th July.\nIt all started in the summer of 2006 when residents approached my colleague Garry Perry and I to help secure a\nMarco, Garry and Richard Shepherd MP with petition outside Pelsall library.\nnew medical centre as seen in other areas of the borough. But we knew from the outset that ours had to be different because of the limited availability of land which meant that the only option was the library site.\nSo an idea grew that we should combine Council and tPCT resources to deliver a facility that included a Medical centre, Library and a Children’s centre (this was Garry’s idea!). Inevitably, while presenting a uniquely attractive opportunity, this meant overcoming the significant inertia of two large organisations as well as silo working.\nThen a hammer blow. After all the work to get agreement from all parties it seemed that even the pooled budgets were insufficient to construct the building. This was devastating news, but I was not going to accept this. So I started asking much more detailed questions about costings and I soon found out that prices were significantly inflated because they were based on building rates by ‘LIFT Co’ an organisation that channels funds to PCTs to build medical centres.\nImmediately I requested that the Council should lead on the building of the project and this meant that a saving of around 20% was possible – making the whole thing just about viable. Thankfully the PCT agreed to this approach!\nIf on the 6th July NHS Walsall finally endorses the funding needed for the project, and Walsall’s cabinet agree to the recommendations in their report on 15th July, we will soon have a fantastic resource that will support Pelsall people for generations to come.\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_10_dont-leave-it-pick-it-up_trackback/content_43.html": "Yes, its that subject again, as the better weather is upon us and people are more active – its the same old in relation to Litter and dog fouling. The situation is probably no worse than usual its just that it is more visible as people are out and about.\nI get quite annoyed when people criticise the Council of not removing litter or dog fouling quickly enough. The Council do not put it there in the first place, and apart from having a 24/7 cleansing service the answer does not lie with Street Pride at Walsall Council.\nEnforcement and Education are the key, in recent weeks I have had some success in utilising the dog warden to target an area near Little Common, Pelsall. An approach has been made for him to go into the primary schools in the coming weeks and ALL Primary heads have put a message out to parents from me on this particular issue.\nWorking together and doing our bit, we can have some impact! so be vigilant but more so be caring towards Pelsall – its simple, dont leave it, Pick it up!\nLeave a comment",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_21_council-21th-may-2009_feed/content_53.html": null,
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_06_27_pelsall-armed-forces-day-success_trackback/content_44.html": "Today was one of those moments you wished you could pause and replay whenever you require a ‘lift’ in life.\nAround 80 villagers attended the ‘free’ concert organised to commemorate, remember and celebrate the role of our Armed Forces in Great Britain.\nFirstly, Pelsall Pride continues to work its magic in bringing people together and galvanising community spirit, a spirit alive and well in our village. Thank you to the officers and members who work so hard to make things happen.\nThe concert by Maggie O’Hara was excellent to say the least, she displayed a warmth and genuiness of character, so akin to the war time entertainers of the past such as Vera Lynn and Gracie Fields.\nRichard Shepherd MP spoke as eloquently as ever, and my ward colleague Cllr Longhi was in attendance.\nTo have ‘bottled’ up and sold the finale of Land of Hope and Glory and Rule Brittainia with the audience on its feet, flag waving and cheering – we would make a fortune!\nIt is not always seen as Politically Correct to be Patriotic and Proud, but events like today not only transcends politics in all its forms, it demonstrates what its all about, people, community and a sense of belonging.\nLong may this continue.\nJune 27, 2009 at 8:34 pm |\nGreat event Garry, a big thanks to you and all the organizers / helpers.\nJune 28, 2009 at 6:47 am |\nCongratulations to the people of Pelsall!\nIt is a pity Walsall could not manage anything this year – hopefully the town will do better next time.\n– The Edditer",
  "https_garryperry_wordpress_com_/https_garryperry_wordpress_com_2009_05_09_hello-world_feed/content_40.html": null
}