{
  "https_franbelbin_wordpress_com_/https_franbelbin_wordpress_com_2021_08_16_vote-labour-in-firth-park-on-16th-september/content_3.html": "I’m delighted to have been selected as the Labour candidate for Firth Park ward in the forthcoming by-election on 16th September.\nI’m a hardworking community activist with a track record of delivering improvements and bringing investment into communities. I’m really looking forward to working with the residents of Firth Park to make it a better place to live.\nYou can keep in touch with the campaign by following Firth Park Labour on Facebook or by sending an email to hello@firthparklabour.org.uk.",
  "https_franbelbin_wordpress_com_/https_franbelbin_wordpress_com_2020_10_16_food-justice-needed-now/content_8.html": "Today is World Food Day which is an appropriate time to reflect on the national disgrace of food poverty in the UK.\nEven before Covid-19, foodbank use has spiralled under years of Tory austerity. Over the last 8 years the number of food parcels supplied by the Trussell Trust in Yorkshire and Humberside has tripled to nearly 2 million, and this figure does not include food supplied by independent foodbanks and other food projects.\nSince Covid-19 the situation has got much worse, with many families struggling to feed their children due to lost income. Demand on Sheffield foodbanks rose fourfold during this period, which has only been met through the heroic efforts of volunteers and community based projects, with the support of Sheffield City Council and various supermarkets and businesses.\nOver the summer I was involved in co-ordinating Sheffield’s Healthy Holidays programme, which provided healthy food hampers to more than 6700 children in the city over the summer holidays. Thanks to Marcus Rashford’s relentless campaigning, food vouchers continued to be given to families on free school meals during the holidays, or this effort would have been nowhere near enough. But the government are refusing to extend the scheme for the approaching half-term and Christmas holidays.\nResearch shows quite clearly the reasons behind growing foodbank use, which fall into two themes:\n- The punitive benefits regime imposed by the Tories and the LibDem/Tory coalition before them. In particular, the benefits freeze and the rollout of Universal Credit, increased use of benefit sanctions and the withdrawal of disability benefits.\n- An even greater number of people using foodbanks are actually in work, but thanks to poor quality jobs and low wages they still cannot afford to make ends meet. Working single parents have been the worst affected group, but you are also more likely to be affected by in work poverty if you live in the North, are in a family with a disabled person or carer, work in hospitality or retail, and/or live in rented housing.\nLabour’s 2019 manifesto promised a Fair Food Act, and Labour for a Green New Deal continue to campaign for a National Food Service. These policies were rightly aimed at eliminating the need for foodbanks altogether, and reforming the food industry in the interests of food producers and consumers rather than the constant drive for profit.\nBut as well as policies centred on food itself, we need to tackle the underlying causes of poverty. Research by the Joseph Rowntree Foundation shows that a sustainable, long-term approach must focus on good jobs, better pay, a strengthened benefits system and improved availability of low cost housing. Under the Tories, all of these factors are moving in the wrong direction – the only conclusion can be that they don’t give a stuff about the impact of poverty on millions of children and adults.\nUntil we get the opportunity to kick this unscrupulous shambles of a government out of office, we need to carry on supporting our local foodbanks and food projects, and campaigning for #foodjustice. To paraphrase Marcus Rashford, this issue is not going away anytime soon, and neither are we.",
  "https_franbelbin_wordpress_com_/https_franbelbin_wordpress_com_2020_02_12_south-yemen-womens-forum/content_10.html": "Thank you to the South Yemen Women’s Forum for inviting me to their launch event in Upperthorpe on 1st February. Wonderful to see women from around the UK planning campaigns to improve the rights of women and girls in Yemen and getting active in political life in the UK.",
  "https_franbelbin_wordpress_com_/https_franbelbin_wordpress_com_2020_02_15_support-workers-on-zero-hour-contracts/content_7.html": "I was at the support action for Deliveroo workers last night. Deliveroo riders boycotted Wagamama orders due to their denying holiday pay, minimum wage and pensions to workers, refusing to pay for time spent waiting for deliveries to be ready and other delays, and a basic lack of support and respect.\nZero hour contracts mean workers don’t know how much they will earn from week to week, yet still have to be prepared to go to work at a few moment’s notice. It’s impossible to earn a decent livelihood in these conditions. Please support the Deliveroo workers taking action – you can find more infomation on how you can help on the ridersroovolt website.",
  "https_franbelbin_wordpress_com_/https_franbelbin_wordpress_com_2020_03_11_better-buses/content_6.html": "The state of our buses is a hot topic! SYPTE and bus companies have acknowledged the current partnership is not fit for purpose – so what are the alternatives?\nI’ve spent time in Nottingham and London over the last month, and in both cities was struck by how proud local people are of their public transport systems.\nNottingham buses are modern, accessible and eco-friendly, and – crucially – still locally owned rather than operated by the “big 5” companies, as Nottingham City Transport is 95% owned by the City Council. The number of bus journeys taken in the city is increasing, which bucks the national trend. Despite this success, the government’s 2017 Bus Services Bill effectively banned councils from setting up public bus companies.\nTravelling in London by bus and tube was actually a joy – the largest electric bus fleet in Europe, free fares for under-16s and fully integrated ticketing at very reasonable prices. Combined with the congestion charge and ultra low emission zone, public transport is the obvious choice for travel in London.\nTransport for London is a local government body chaired by the Mayor of London, that specifies the services provided, including routes, timetables and fares, then awards franchises to private companies through competitive tendering. The crucial success factor here is that TfL have control over what services are offered and the bus companies can’t pick and choose based on what is most profitable.\nA Local Government Association commissioned survey found that 69% of UK residents support councils being the main decision-makers on bus services. Support for local control rises even higher in cities like Manchester where consultation is taking place on re-regulating the buses. But despite the obvious advantages, it won’t be an easy ride – the process is complex and in Manchester the bus companies have started to collaborate as “OneBus” – but only to oppose the re-regulation plans.\nI will await the publication of the Sheffield City Region review of bus services with interest, but the partnership model has failed. We need control of our buses back in the hands of a publicly accountable body. The bus franchising model would vastly improve services in Sheffield, and one of the reasons I have joined Acorn Sheffield’s campaign to take back our buses.",
  "https_franbelbin_wordpress_com_/https_franbelbin_wordpress_com_about/content_4.html": "I am a hard-working, dedicated Labour, trade union and community activist with a wide range of experience of working on community led initiatives in both voluntary and work roles. Current roles include:\n- Finance and Funding Manager at Pitsmoor Adventure Playground\n- Project Co-ordinator, Sheffield Youth – Neighbourhoods and Communities (community youth partnership)\n- Trustee/Board member at SOAR, North East Sheffield regeneration charity\n- Trustee/Treasurer of Ellesmere Youth Project\n- Secretary of Sheffield Brightside and Hillsborough CLP and Burngreave Ward Labour Party\n- Member of Unite’s Community, Youth and Playwork section\nPast roles include:\n- Chair of Unite Community Sheffield for 3 years\n- UNISON representative/officer for 18 years\n- Trustee/Chair of community newspaper the Burngreave Messenger for 10 years\n- Library volunteer and Chair of Friends of Burngreave Library for 2 years\n- Work in various roles at Sheffield Hallam University for 18 years\nOther achievements include:\n- Raising over £1 million for community-led projects in the last five years\n- Co-ordinating the organisation of a range of community events\n- Campaigning on a wide range of issues including services for children and young people, funding for libraries, universal credit, benefit sanctions, the environment, rights for refugees and asylum seekers, and the crisis in the Yemen.\nSpeaking on the crisis in the Yemen at\nLabour Party Conference 2019",
  "https_franbelbin_wordpress_com_/https_franbelbin_wordpress_com_my-priorities/content_11.html": "More services for children, young people and families\nAusterity measures initiated by the Tory/LibDem coalition government have devastated our youth services. Too many of our young people don’t have access to affordable leisure facilities or support with their physical and mental health, personal relationships, finances, education and employment needs; many of the support services that do exist are only available in the city centre. Some young people are falling victim to criminal exploitation which has horrendous impacts on children, families and communities. Voluntary, community and faith sector organisations are filling the gaps to an extent but are under-resourced and under-represented in policy making.\nI work for a children’s charity and over the last 18 months I have worked closely with community organisations to address this yawning gap in provision and to bring external investment into communities for youth and family services. Our youth strategy aims to upskill community workers, young people and their family members to design and deliver more community-based services and projects, providing support where and when it is needed.\nTackle litter and fly-tipping\nThe amount of litter and fly-tipping in Firth Park and across the city rightly upsets residents. Thank you to all those who do their bit to look after our communities through litter picking. As your councillor I will support litter picking groups to get the resources they need, get stuck in myself and work with refuse services, the police and other partners to ensure we have the education and enforcement we need in place to tackle this blight on our communities.\nProtect our green spaces\nOur green spaces are community resources that are valued by residents in many ways, contributing to their health and wellbeing through access to nature and reducing air pollution and providing spaces for people to come together, play, take part in sports and other activities. They need to be protected.\nAs part of Labour’s commitment to addressing the climate emergency at local government level, our trees and woodland strategy will involve planting 100,000 trees over the next 10 years. We have also committed to protecting Green Belt land and spaces from developers.\nI particularly welcome the commissioning of a Climate Citizens Assembly, made up of people (including young people) from across Sheffield, which will consider and contribute to the actions we take over climate change as a city. Lack of genuine consultation has led us to make mistakes in the past, and I am pleased to see the Council learning from this.\nInvesting in communities\nCommunity wealth building, as demonstrated by the “Preston Model” has been widely praised as a way to boost local economies undermined by austerity, through persuading anchor organisations such as councils, hospitals and universities to buy in goods and services from local suppliers where possible, procuring for social value as well as cost. We’re investigating this approach in Sheffield and the Council already commission some of their work through community based partners, creating local jobs and providing services in the neighbourhoods where they are most needed.\nBut we can always do more! Some parts of Firth Park ward are really disadvantaged and in need of investment, jobs and training. The Council should use its influence and leverage with businesses and large organisations to provide such opportunities in these communities, to increase wealth in neighbourhood economies and reduce inequalities across the city.",
  "https_franbelbin_wordpress_com_/https_franbelbin_wordpress_com_testimonials/content_5.html": "“Fran is driven by social inclusion and creating opportunities for members of her community, this is shown in all aspects of her life. She has given an immense amount of time and energy to working to build connections in her community and across Sheffield.\nFran has an awareness of problems in the community and finds practical solutions to these problems. She saw how the cuts to local library services are affecting people and started a petition to ring fence library funding. Thanks to Fran’s promotion of the petition it reached over 30,000 signatures and received the backing of JK Rowling and other significant authors. She encapsulates the goals and vision of the Labour Party.”\nGill Furniss MP, Sheffield Brightside and Hillsborough\n“Fran is extremely hardworking and determined and is committed to improving communities, demonstrated by her strategic support to many community organisations in her work and voluntary capacities. She has helped to support organisations to obtain funding when almost on the brink of closure. She has considerable skill at conflict resolution and is tenacious, being prepared to take on difficult situations and see them through to a successful resolution.\nShe is very well known and loved locally because of her determined activism and selfless voluntary commitments. She has an excellent record in supporting campaigns to keep services open as well as more recently getting involved in a humanitarian campaign to raise funds for the Yemen. There need to be more Frans in this world!”\nFirth Park Councillor Abtisam Mohamed",
  "https_franbelbin_wordpress_com_/https_franbelbin_wordpress_com_contact-me/content_2.html": "Email:\nhello@firthparklabour.org.uk\nTelephone:\n07958559088\nFacebook:\nhttps://www.facebook.com/firthparklabour\nFran Belbin for Firth Park ward\nYour Labour candidate working for Firth Park all year round\nEmail:\nhello@firthparklabour.org.uk\nTelephone:\n07958559088\nFacebook:\nhttps://www.facebook.com/firthparklabour",
  "https_franbelbin_wordpress_com_/https_franbelbin_wordpress_com_2020_08_11_a-better-future-for-buses/content_9.html": "The review of South Yorkshire bus services, commissioned by Sheffield City Region Mayor Dan Jarvis, has finally been published. I’ve written a brief summary of the review for Acorn Sheffield, that you can read in full here.\nOverall it’s a positive and ambitious report that demonstrates a thorough understanding of current failings as well as a strong vision for the role of buses in tackling climate change and inequalities in the region. The recommendations are clear and specific, which is welcome and suggests a commitment to accountability.\nThe document raised some questions for me as well:\nThe report discusses the need for greater passenger influence on services, but what would this look like? Is there a need for a single passenger group that works with community and campaign groups for a stronger voice?\nThe fundamental changes needed will understandably take some years to come to fruition – how do we guard against proposals being watered down or kicked into the long grass? And how do we address the immediate needs of people reliant on public transport who are currently struggling with poor services?\nCOVID-19 has caused many changes to how we use our buses, that are likely to be with us for some time to come. Does this present an opportunity to speed up some of the much needed proposals and how do we ensure the needs of all passengers are met?",
  "https_franbelbin_wordpress_com_/https_franbelbin_wordpress_com_2020_02_12_bring-our-buses-back-in-house/content_12.html": "Across Walkley ward the same issue keeps surfacing – bus services in the area are not fit for purpose. The 95 service has deteroriated, the 31/31a is discontinued altogether and the 135 has been described as “the worst service in Sheffield”. These problems are mirrored across other parts of the city.\nLabour councillors and activists have consistently campaigned on this issue (for example presenting a petition to full Council). A review is now under way by Clive Betts MP and Dan Jarvis, Mayor of Sheffield City Region – it’s time for the bus companies and SYPTE to listen to bus users and make improvements to the dire service currently on offer. In the longer term, Sheffield needs to bring bus services back under local authority control and design them to meet the needs of residents of the city, not private profit.",
  "https_franbelbin_wordpress_com_/https_franbelbin_wordpress_com/content_1.html": "I’m delighted to have been selected as the Labour candidate for Firth Park ward in the forthcoming by-election on 16th September.\nI’m a hardworking community activist with a track record of delivering improvements and bringing investment into communities. I’m really looking forward to working with the residents of Firth Park to make it a better place to live.\nYou can keep in touch with the campaign by following Firth Park Labour on Facebook or by sending an email to hello@firthparklabour.org.uk.\nToday is World Food Day which is an appropriate time to reflect on the national disgrace of food poverty in the UK.\nEven before Covid-19, foodbank use has spiralled under years of Tory austerity. Over the last 8 years the number of food parcels supplied by the Trussell Trust in Yorkshire and Humberside has tripled to nearly 2 million, and this figure does not include food supplied by independent foodbanks and other food projects.\nSince Covid-19 the situation has got much worse, with many families struggling to feed their children due to lost income. Demand on Sheffield foodbanks rose fourfold during this period, which has only been met through the heroic efforts of volunteers and community based projects, with the support of Sheffield City Council and various supermarkets and businesses.\nOver the summer I was involved in co-ordinating Sheffield’s Healthy Holidays programme, which provided healthy food hampers to more than 6700 children in the city over the summer holidays. Thanks to Marcus Rashford’s relentless campaigning, food vouchers continued to be given to families on free school meals during the holidays, or this effort would have been nowhere near enough. But the government are refusing to extend the scheme for the approaching half-term and Christmas holidays.\nResearch shows quite clearly the reasons behind growing foodbank use, which fall into two themes:\nThe punitive benefits regime imposed by the Tories and the LibDem/Tory coalition before them. In particular, the benefits freeze and the rollout of Universal Credit, increased use of benefit sanctions and the withdrawal of disability benefits.\nAn even greater number of people using foodbanks are actually in work, but thanks to poor quality jobs and low wages they still cannot afford to make ends meet. Working single parents have been the worst affected group, but you are also more likely to be affected by in work poverty if you live in the North, are in a family with a disabled person or carer, work in hospitality or retail, and/or live in rented housing.\nLabour’s 2019 manifesto promised a Fair Food Act, and Labour for a Green New Deal continue to campaign for a National Food Service. These policies were rightly aimed at eliminating the need for foodbanks altogether, and reforming the food industry in the interests of food producers and consumers rather than the constant drive for profit.\nBut as well as policies centred on food itself, we need to tackle the underlying causes of poverty. Research by the Joseph Rowntree Foundation shows that a sustainable, long-term approach must focus on good jobs, better pay, a strengthened benefits system and improved availability of low cost housing. Under the Tories, all of these factors are moving in the wrong direction – the only conclusion can be that they don’t give a stuff about the impact of poverty on millions of children and adults.\nUntil we get the opportunity to kick this unscrupulous shambles of a government out of office, we need to carry on supporting our local foodbanks and food projects, and campaigning for #foodjustice. To paraphrase Marcus Rashford, this issue is not going away anytime soon, and neither are we.\nThe review of South Yorkshire bus services, commissioned by Sheffield City Region Mayor Dan Jarvis, has finally been published. I’ve written a brief summary of the review for Acorn Sheffield, that you can read in full here.\nOverall it’s a positive and ambitious report that demonstrates a thorough understanding of current failings as well as a strong vision for the role of buses in tackling climate change and inequalities in the region. The recommendations are clear and specific, which is welcome and suggests a commitment to accountability.\nThe document raised some questions for me as well:\nThe report discusses the need for greater passenger influence on services, but what would this look like? Is there a need for a single passenger group that works with community and campaign groups for a stronger voice?\nThe fundamental changes needed will understandably take some years to come to fruition – how do we guard against proposals being watered down or kicked into the long grass? And how do we address the immediate needs of people reliant on public transport who are currently struggling with poor services?\nCOVID-19 has caused many changes to how we use our buses, that are likely to be with us for some time to come. Does this present an opportunity to speed up some of the much needed proposals and how do we ensure the needs of all passengers are met?\nThe state of our buses is a hot topic! SYPTE and bus companies have acknowledged the current partnership is not fit for purpose – so what are the alternatives?\nI’ve spent time in Nottingham and London over the last month, and in both cities was struck by how proud local people are of their public transport systems.\nNottingham buses are modern, accessible and eco-friendly, and – crucially – still locally owned rather than operated by the “big 5” companies, as Nottingham City Transport is 95% owned by the City Council. The number of bus journeys taken in the city is increasing, which bucks the national trend. Despite this success, the government’s 2017 Bus Services Bill effectively banned councils from setting up public bus companies.\nTravelling in London by bus and tube was actually a joy – the largest electric bus fleet in Europe, free fares for under-16s and fully integrated ticketing at very reasonable prices. Combined with the congestion charge and ultra low emission zone, public transport is the obvious choice for travel in London.\nTransport for London is a local government body chaired by the Mayor of London, that specifies the services provided, including routes, timetables and fares, then awards franchises to private companies through competitive tendering. The crucial success factor here is that TfL have control over what services are offered and the bus companies can’t pick and choose based on what is most profitable.\nA Local Government Association commissioned survey found that 69% of UK residents support councils being the main decision-makers on bus services. Support for local control rises even higher in cities like Manchester where consultation is taking place on re-regulating the buses. But despite the obvious advantages, it won’t be an easy ride – the process is complex and in Manchester the bus companies have started to collaborate as “OneBus” – but only to oppose the re-regulation plans.\nI will await the publication of the Sheffield City Region review of bus services with interest, but the partnership model has failed. We need control of our buses back in the hands of a publicly accountable body. The bus franchising model would vastly improve services in Sheffield, and one of the reasons I have joined Acorn Sheffield’s campaign to take back our buses.\nI was at the support action for Deliveroo workers last night. Deliveroo riders boycotted Wagamama orders due to their denying holiday pay, minimum wage and pensions to workers, refusing to pay for time spent waiting for deliveries to be ready and other delays, and a basic lack of support and respect.\nZero hour contracts mean workers don’t know how much they will earn from week to week, yet still have to be prepared to go to work at a few moment’s notice. It’s impossible to earn a decent livelihood in these conditions. Please support the Deliveroo workers taking action – you can find more infomation on how you can help on the ridersroovolt website.\nAcross Walkley ward the same issue keeps surfacing – bus services in the area are not fit for purpose. The 95 service has deteroriated, the 31/31a is discontinued altogether and the 135 has been described as “the worst service in Sheffield”. These problems are mirrored across other parts of the city.\nLabour councillors and activists have consistently campaigned on this issue (for example presenting a petition to full Council). A review is now under way by Clive Betts MP and Dan Jarvis, Mayor of Sheffield City Region – it’s time for the bus companies and SYPTE to listen to bus users and make improvements to the dire service currently on offer. In the longer term, Sheffield needs to bring bus services back under local authority control and design them to meet the needs of residents of the city, not private profit.\nThank you to the South Yemen Women’s Forum for inviting me to their launch event in Upperthorpe on 1st February. Wonderful to see women from around the UK planning campaigns to improve the rights of women and girls in Yemen and getting active in political life in the UK."
}