{
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted_friends-of-kinsbourne-green-common/content_29.html": "A new charity, Friends of Kinsbourne Green Common, has been established to preserve the Common which they have purchased.\nThe Common has been in the ownership of the same family over two generations, for almost 50 years and has flourished as a well-loved local amenity under their careful management. In agreeing to sell the common to the community this beautiful and biodiverse open space will be secured in perpetuity for us all to enjoy.\nFriends of Kinsbourne Green Common will be structured so that all local residents can be members and have a say in how it is cared for. With the purchase agreed, and a number of pledges already in place, funds must now urgently be raised by the end of November 2023 in order to complete the sale. The aim is to maintain the land in its current state and going forward, work to further improve the rich biodiversity and ensure it is accessible to all.\nContact them by email:\nVisit their website: www.kinsbournegreencommon.org.uk",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted_labour-and-tory-stealth-taxes/content_13.html": "Political parties must be honest with the public. Only factual information will be provided by Harpenden and Berkhamsted Reform; where possible, with links to verify it.\nWhat are Stealth Taxes?\nThirty years ago, governments were more honest – when changes were made to taxation, they raised or lowered the headline rates of tax. This made it clear that the government was increasing or reducing taxes. Now governments resort to stealth taxes – taxing you more, while hoping you won’t notice. One way of doing this is leaving the tax thresholds untouched, instead of increasing them in line with inflation. The example below shows how it works.\nCurrent UK Tax Rates for an Employee\nIn the current tax year:\nIncome tax is 20% on all earnings over the personal allowance of £12,570.\nFor national insurance, nothing is paid for the first £12,584, 8% up to £50,284, and then a further 2% on all income above that.\nCurrent Tax and National Insurance Paid\nFor someone earning £30,000 a year:\nIncome tax of 20% is payable on £17,430 – this is £3,486.\nNational insurance of 8% is payable on £17,416 – this is £1,393.\nOf the £30,000, the government has taken £4,879. This is just over 16% of the employee’s wages – about one pound in every six.\nStealth Taxes in Action\nAssume this employee gets an annual 5% pay rise – this takes their pay up to £31,500. However, the government leaves the personal allowances and tax rates untouched in the budget despite inflation – a stealth tax.\nIncome tax of 20% is payable on £18,930 – this is £3,786\nNational insurance of 8% is payable on £18,816 – this is £1,513.\nOf the £31,500, the government has taken £5,299. This is close to 17% of the employee’s wages\nJust by leaving the tax thresholds and headline tax rate untouched, the government has taken another 1% of the employee’s wages; 17%, rather than 16%.\nThe Honest Way of Increasing Taxation\nThe honest way of increasing the tax take would have been to put up the thresholds on which tax was paid and simultaneously increase the headline tax rate. This might have been (assuming) 3% inflation:\nIncome tax is 21% on all earnings over the increased personal allowance of £12,950.\nFor national insurance, nothing is paid for the first £12,961, 8% up to £51,793, and then a further 2% on all income above that.\nBut governments no longer have the courage to change the headline rate of tax – this is too noticeable. Instead, they increase taxes by stealth.\nBoth Tory and Labour governments are like pickpockets taking money out of your pocket without you noticing.\nReferences\nUK Income Tax Rates\nhttps://www.gov.uk/income-tax-rates\nUK National Insurance Rates\nhttps://www.gov.uk/national-insurance-rates-letters",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_st-albans_join-the-reform-peoples-army/content_28.html": "In the last six-weeks St Albans have had a surge in membership, with numbers increasing by 120%.\nThis is great news in the lead up to the May County Council elections. As a member you can attend conferences, apply to be a candidate in local elections, and be kept in the loop with regular email updates from your local branch.\nIf you would like to join or donate to your local branch, please use the below links.\nSt Albans Branch Donation - ReformUK\nMembership - Become a Member - Reform UK",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_sw-council-candidates/content_34.html": "Rickmansworth East, Carpenders Park and Moorpark\nSonja Flynn\nI am a local girl, through and through. I was born in Watford, grew up in Oxhey, went to school in Rickmansworth.\nThe people of this country need a change, a real choice for something different.\nThat starts at District and County level; and that is why I have stepped forward, to serve the community I Love.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted_kinsbourne-green-common-to-be-sold/content_60.html": "Harpenden’s Member of Parliament Bim Afolami MP has written to the Mayor of Harpenden to ask Harpenden Town Council to purchase Kinsbourne Green Common, after it was revealed the Common would be auctioned.\nThe 35 acre Common – set to be sold at auction on the 21st September with a guide price of £150k – is an amenity green space for residents in both north Harpenden and Kinsbourne Green. In his letter, Mr Afolami said that the Town Council would make an “excellent custodian” of the Common, protecting it as an important amenity space for Harpenden over the longer term and ensuring that there is no future risk of developers attempting to build on the site.\nBim Afolami MP said,\n“Residents have shared their concerns with me over the future of Kinsbourne Green Common – and I share those concerns. This is a crucial green space for people in Harpenden and Kinsbourne Green and it is important that it should be owned and managed for the benefit of local residents.\n“Harpenden Town Council is already a significant local landowner, managing Harpenden Common, Rothamsted Park and a number of smaller greens and open spaces in Harpenden. I believe that they would be the ideal long-term owner of this site.\n“I urge them to consider engaging with the sale process, to safeguard the Common for future residents of Harpenden and Kinsbourne Green.”",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_wat-council-candidates/content_43.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nCouncil Candidates\nGroup by\nNone\nWard\nImage\nFull Name\nAbout Me\nClear filters\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_south-west-herts/content_65.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nKeith Steers\nWebsite\nhttp://reformuk-herts.uk/herts-wards/south-west-herts\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_hamish-haddow/content_79.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nHamish Haddow\nWebsite\nhttp://Hamish+Haddow\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_profiles_andy-white/content_57.html": "Dear fellow residents of Tring.\nMy name is Andy White. I live in Tring with my wife and three children and a car with over 200,00 miles on the clock.\nIt's a privilege to stand for ReformUK as a councillor for our loved town of Tring.\nMy ambition is to unite our community under a shared vision of fairness, progress, and opportunity for all, whether you’re a lifelong local, a new arrival, a small business owner, or someone striving to make your mark, I believe that our strength lies in unity. ReformUK stands for genuine cross-roads in local politics that listens to your concerns, values your ideas.\nLocal government should truly serve the people and not be dragged into routine 'pot hole maintenance. Join me in this journey to create a community where hope, progress, and unity reign—because every one of us deserves a future we can be proud of.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_roy-farrier/content_75.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nRoy Farrier\nWebsite\nRoy+Farrier\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/http_reformuk-herts_uk_herts-wards_hertsmere/content_83.html": "Joint statement from Leader of Hertsmere Borough Council, Cllr Jeremy Newmark and Chief Executive, Sajida Bijle – Responding to the English Devolution White Paper\nChelmsford ReformUK Conference 2025\nMy speech to the Chelmsford conference. A full to capacity crowd turned up to be part of the growing movement of 'The People's Army'.\nA fun packed day with many speakers entertaining the crowds.\nThe Leader of Hertsmere Borough Council, Cllr Jeremy Newmark, who is also Chair of Herts Growth Board, has issued this joint statement alongside the other district and borough council leaders in Hertfordshire:\nCommunity groups and voluntary organisations in Hertsmere are being encouraged to apply for a grant of up to £500 for events taking place on the weekend of the Coronation.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_profiles_john-frogget/content_58.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nProfile to follow\nMy Facebook page\nContact me on Twitter\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_profiles_gary-ling/content_52.html": "Hello, Fellow Watfordians!\nMy name is Gary Ling and I am proud to have been appointed Spokesman for the ReformUK Party in the Watford constituency. Since the misguided politically correct are corrupting the English language in the name of wokery, if you are unhappy with the 'man' bit, I am happy to be called 'Spokey. Visit www.ReformUKWatford.net to find out more about me.\nIn my world, other than spiritual matters, the happiness and vibrancy of the community in which I live are most important to me. This is why politics matters. Watford is a great place to live. Just a few years ago, for example, government data showed that almost 90% of people aged 50 to 64 were in work here. The highest employment rate for that age group in Britain. With the crushing burden of Tory taxes, the disincentive built into the benefits system and the lack of trust in Government and institutions, those numbers today are a pipe dream.\nThe core message of Reform UK in Watford about the current state of UK politics is: 'We Can't Go On Like This'. The UK's two- party system at a national level is broken and has become unworkable. The Tory Party is too broad a church and has become ungovernable. How can one party accommodate the Liberal Democrat politics of Theresa May and the Libertarian policies of Liz Truss? How can another main party accommodate the revolutionary socialist politics of supporters of Jeremy Corbyn and the corporatist politics of Kier Starmer? The behind-locked-doors ructions in the Conservative Government and the Labour Party should be out in the open, as part of transparent coalition talks, with parliamentarians elected under proportional representation.\nWe are over-governed. Key UK institutions need reform. Undemocratic House of Lords, too many Members of Parliament, in Watford too many local councillors and a UK civil service too woke to be operationally effective and not fit for purpose. We need to change things up. On the Watford Borough Council, the Liberal Democrats have a crushing majority and like the two big parties at Westminster, control the future of all of us in closed party meetings. Their arrogance is such that in Park Ward the LibDem councillor claimed allowances of £7,554.96 without attending one full Council Meeting since May 2022. In this local election, Reform UK candidates offer an alternative choice. When elected, none of our candidates will face a party whip. They will always act in the interests of their residents, not their Party's. Reform UK Watford wants to reduce the number of Borough Councillors from THREE per ward to TWO. We want to scrap the elected Mayor position when the Council already has a highly-paid Chief Executive, saving hundreds of thousands of pounds in salary, pension, and office costs over a four-year term.\nWe offer a different way of doing things. Think out of the box on election day and lend your vote to Reform UK Watford.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_john-dowdle/content_80.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nJohn Dowdle\nWebsite\nhttps://reformuk-herts.uk/herts-wards/st-albans\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_andrew-white/content_71.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nAndrew White\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_profiles_saba-poursaeedi/content_30.html": "Take it from someone who left the Labour Party two years ago, Reform UK is the only party that will stick up for the working people of this country. That’s why I’m proud to be a member of Reform UK, and prouder still be a spokesman for Harpenden & Berkhamsted, where I grew up.\nThe people of Britain have been betrayed by 25 years of Labour and Conservative rule. That’s 25 years of undermining people’s wages with foreign labour, increasing fuel costs with “green” zealotry, delegating decisions overseas, letting criminals run rampant, letting corruption go unchecked, letting standards fall and never once taking responsibility. Our political class have been robbing us blind and selling off the rest at half-price all while having the audacity to blame you and me for it all!\nNo more. Reform UK is here to take the power back from those who have abused it and frittered it away.\nThings may seem bleak right now, things may get worse, but our history is undeniable, and our character remains, in spite of those who would fit us into a globalist straight jacket.\nThere is so much beauty in this country and, I may be biased when I say this, but Harpenden and Berkhamsted are the most beautiful towns it has to offer. Two twin jewels of Hertfordshire. As spokesman I’ll do everything in my power to make sure their character is preserved. No more building on green belt, no more choking up the streets with traffic, no more suffocating small business in red tape and no more compromising our doctor surgeries and schools with over subscription.\nAs a local man, with a loving wife and a gorgeous baby boy, I’m staying right where I am. Too many people my age (mid-30’s) are running away from this country, they think there’s nothing for us, they think we’re not wanted. My Dad had to run from Iran, when madness and theocracy took over that beautiful country, and I know one thing from his story, it’s that when all is going to hell, Britain is the last place you can go, to be free, to be safe, to say want you want to say and to be who you want to be. I’m going nowhere, I’m staying right here and I’m fighting for a future my son can be proud of.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_sw-branch-team_form_8/content_48.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nBranch Team\nBranch Team\nImages should be max 400px wide\ncreated\nid\nConstituency\nImage\nFirst Name\nLast Name\nFull Name\nPosition\nSave\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_profiles_stevenage/content_53.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nMy name is Doug Bainbridge and I’m the chair for the Stevenage Branch.\nMore information pending\nMy Facebook page\nContact me on Twitter\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_hb-branch-team_details_8_5/content_12.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nHarpenden & Berkhamsted Branch Team\nBranch Team\nImages should be max 400px wide\ncreated\n2025-03-13 06:02:55\nid\nConstituency\nHarpenden and Berkhamsted\nImage\nFirst Name\nPhilip\nLast Name\nWells\nFull Name\nPhilip Wells\nPosition\nChairman\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_b-branch-team/content_27.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nBranch Team\nAdd\nGroup by\nNone\nConstituency\nImage\nFull Name\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_saba-poursaeedi/content_55.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nSaba Poursaeedi\nWebsite\nhttps://reformuk-herts.uk/herts-wards/harpenden-berkhamsted\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_policies_reform-uk-healthcare-policy/content_20.html": "The NHS is possibly the most loved healthcare system in the world. Being free at the point of delivery is at its core and must always continue.\nThe frontline care is normally amazing, dedicated, and always appreciated. But we have to be honest that in the back office, it is neither the most efficient nor the best managed system in the world.\nLet’s be ambitious: we should aim for zero waiting lists. This is achievable with reform. Many other countries don’t have waiting lists, why should we put up with them? We have been brainwashed that they are the norm; they should not be, and we can achieve zero waiting lists.\nWe must put the patient in charge by having a voucher scheme so they can be seen and treated promptly. Healthcare will always, of course, remain free at the point of delivery.\n- If you cannot be seen by a GP in 3 days, you get a voucher to go private elsewhere.\n- If you cannot be seen by a consultant in 3 weeks, you get a voucher to go private elsewhere.\n- If you cannot have an operation in 9 weeks from Day 1, you get a voucher to go private elsewhere.\nWe must also urgently solve the staffing crisis in health and social care. Our healthcare plan includes zero basic rate income tax for 3 years for all frontline patient facing staff in health and social care. This will significantly help retain and attract back recently departed staff, whilst we train new staff as well. This should mean zero waiting lists in around 24 months as private capacity increases rapidly. Retired medics will come back to work part-time in less bureaucratic healthcare settings.\nOverall efficiency will improve dramatically. Citizens in many countries expect and demand to see a doctor within 1 day. So should we. This is why reform is essential",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_charlotte-yendall/content_74.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nCharlotte Yendall\nWebsite\nCharlotte+Yendall\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_events_public-meeting-the-artichoke/content_8.html": "Public Meeting. The Artichoke.\nSouth West Herts\nTuesday, 16 October 2029 00:00\nThe Artichoke. Green Lane. Croxley | Three Rivers, United Kingdom\nCome and meet the Team. Members of the committee and candidates standing in the Hertfordshire County Council Electiond for South West Hertfordshire branch of Reform UK. A unique opportunity to meet all six candidates at one time. Ask Questions over a relaxed setting. Enjoy a drink. and mingle with like minded people. Starts 7.00 pm\nTelephone\nEmail\nAddress\nThe Artichoke, The Green, Croxley Green, Rickmansworth, Three Rivers, Hertfordshire, England\nWD3 3HN, United Kingdom\nWD3 3HN, United Kingdom\nMap\nAll Dates\n- Tuesday, 16 October 2029 00:00",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_policies_our-contract-with-you/content_31.html": "Britain has so much potential. Our country is full of talent and energy. Brexit is the opportunity of a lifetime. Yet the challenges we face are vast. Both Labour and Tory governments have broken promise after promise. They have destroyed trust in our democracy and let down the British people.\nOur country is worse off, both financially and culturally. The economy isn’t growing. It is being wrecked by record taxes, wasteful government spending and nanny state regulations. Record mass immigration has damaged our country. The small boats crisis threatens our security. Brexit has been betrayed.\nMulticulturalism has imported separate communities that reject our way of life. ‘Woke’ ideology has captured our public institutions.\nBritain has a housing crisis. Record NHS waiting lists. A benefits crisis. Record crime. Net Zero is making us poorer and colder, damaging British industry and forcing motorists off the road.\nThe Tories have Broken Britain. Labour will bankrupt Britain. A vote for either is a vote for more incompetence, dishonesty and defeat. The two-party system has failed.\nThe United Kingdom therefore faces an urgent existential threat. Whilst people worry about how to define a woman, our leaders have allowed a border to be imposed between Great Britain and Northern Ireland, leaving our Northern Irish kin still tied into the EU.\nThere is an alternative. The British people have a real common sense choice in Reform UK.\nThis is a serious plan to reshape the way our country is organised and run.\nOnly reform will stand up for British culture, identity and values. We will restore trust in our democracy. repair our broken public services. Cut taxes to make work pay. Slash government waste and red tape.\nMaximise Britain’s vast energy treasure of oil and gas, to reduce the cost of energy, beat the cost of living crisis and help unleash real economic growth.\nOnce and for all, we will take back control over our borders, our money and our laws. Reform UK will secure Britain’s future as a free, proud and independent sovereign nation.\nRead this Contract with You to find out how.\nRichard Tice\nLeader, Reform UK\n2: SLASH GOVERNMENT WASTE\nGovernment spending needs major reform.\nGovernment spending has increased by nearly £200 billion per year since 2019. Some 600,000 more people work in the public sector. What is the result? Outcomes are far worse, growth is down and people are receiving a worse service from the public sector, where performance has collapsed. The idea that waste cannot be found, nor efficiencies made, obviously lacks any credibility.\nEveryone has to watch what they spend and make savings. So should the government. After all, they are spending our money, not theirs. We must change course urgently, or Britain will go bust. Reform UK would make sure your hard earned cash is treated with care and respect.\nCritical reforms needed in the first 100 days:\nBank of England Must Stop Paying Interest to Commercial Banks on QE Reserves.\nOther central banks are not doing this. Senior economists and a former Deputy Governor of the Bank of England (BoE) agree. This saves £30-40 billion per year. The BoE must also stop Quantitative Tightening, which is negligently costing the taxpayer billions; stopping this will also help lower interest rates.\nSave £5 in every £100.\nWe make these savings in business and at home. The public sector must be no exception. Every manager across government must find savings without touching frontline services. We should slash wasteful spending, cut bureaucracy and negotiate better value procurement across every department. This will enable lower taxes, more money in your pocket and boost our economy. This saves £50 billion per year.\nScrap Unnecessary Government Quangos and Commissions.\nThere are over 600 government departments, Arm’s Length Bodies or Quangos. Many are unaccountable to parliament. Quango advisors can charge £1,000 per day. Some bosses are paid over £600k per year. Billions of pounds are wasted. The public wouldn’t notice if many dozens were scrapped. These savings are part of the £5 in every £100 mentioned above.\nBrexit Bonus. Cut Unnecessary Regulations.\nGovernment red tape and nanny state regulations are estimated to have cost the UK economy £143 billion since 2015. That means billions of pounds lost in growth and taxes.\nCut Foreign Aid by 50%.\nSave £6 billion from the £12.8 billion budget. British taxpayers should not be funding countries like China or India who have their own space programs. We can do much more good by spending less with better targeting. A major review is needed into the effectiveness of overseas aid.\nSlash Government waste: Potential Savings = £91 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n3: ECONOMY – PERSONAL\nOur economy needs Reform, to become high growth, with high wages, and lower taxes. We must make work pay.\nSmart tax cuts create growth and pay for themselves. That means more money to invest in reformed public services. It is called the multiplier factor. Instead, the government has hit us with the highest tax burden in 70 years. Record debt, record borrowing and record waste. For too many work no longer pays whilst the cost of living crisis rages.\nBritain produces world class business leaders, innovators, industrialists, scientists and a huge small business sector. We must get the government out of their way. We must trust the British people to build a thriving economy.\nCritical reforms needed in the first 100 days:\nMake Work Pay. Lift the Income Tax Start Point to £20,000 Per Year.\nThis frees up to 7 million people from paying income tax and saves every worker almost £1,500 per year. This will help many back into work and escape the benefits trap. Basic Tax rate stays at 20%. The higher rate should begin at £70,000.\nCut Energy Taxes and Beat the Cost of Living Crisis.\nSave households over £500 per year. Scrap VAT on energy bills. Lower fuel duty by 20p per litre. Scrap environmental levies.\nCut Residential Stamp Duty.\nSubstantially boost economic activity and housebuilding by cutting Stamp Duty to 0% below £750k; 2% from £750k – £1.5m; 4% over £1.5m.\nAbolish the VAT Tourist Tax.\nThe government has cost our economy over £10 billion when they stopped the VAT refund scheme for tourist shopping. This also deterred up to 2 million tourists.\nAbolish the Grief Tax, IHT, for all Estates under £2m.\nThat means some 98% of all estates.\nThe rate above £2m will be 20% tax, with the option to donate to charity instead.\nEconomy – Personal Pledges Costs = £70 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n4: ECONOMY – BUSINESS\nReform is urgently needed to enjoy a high growth, high wage, low tax economy that is critical for Britain’s future. This cannot be emphasised enough. Smart tax cuts create growth and pay for themselves year after year. That means more money to invest in reformed public services. The Multiplier Factor.\nBritish businesses are under huge pressure from high rates, high taxes, red tape, energy costs, skills shortages and a government that doesn’t listen. Our high streets are blighted by empty properties. Business talent is moving abroad. Reform UK will back risk takers and wealth creators. We will make sure that Britain is open for business.\nCritical reforms needed in the first 100 days:\nFree Over 1.2 Million Small and Medium Sized Businesses from Corporation Tax.\nLift the minimum profit threshold to £100k. Reduce the main Corporation Tax Rate from 25% to 20%, then to 15% from year 5.\nAbolish IR35 Rules to Support Sole Traders.\nBritain’s self-employed often work longer hours and take more risks. Many have no pension and receive no sick pay.\nLift the VAT Threshold to £120,000.\nFree up small entrepreneurs from red tape.\nThereafter:\nSupport Small and Medium Sized Enterprises.\nSMEs represent over 95% of UK business and two thirds of all employment. Abolish Business Rates for High Street Based Small & Medium Firms. Offset this with Online Delivery Tax at 4% for large, multinational enterprises to create a fairer playing field for high streets. Cut entrepreneur’s tax relief to 5%. SME Enterprise Zones for left-behind Areas with a period of zero tax for new or existing businesses that are creating jobs.\nReform the Planning System.\nFast track new housing on brownfield sites and infrastructure projects to boost businesses, especially in the North and in coastal regeneration areas.\nSlash Business Red Tape. The Brexit Bonus.\nScrap thousands of laws that hold back British business and damage productivity, including employment laws that make it riskier to hire people.\nReform the Tax System.\nMajor simplification is needed. At over 21,000 pages, the UK’s tax code is a burden. Hong Kong’s tax code is under 500 pages.\nEconomy – Business Pledges Costs = £18 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n5: IMMIGRATION\nUncontrolled mass immigration has pushed Britain to breaking point. A record 1,250,000 immigrants entered the UK in 2022. That is a city the size of Birmingham. Data is expected to show a similar number arrived in 2023 and probably 2024. New government figures say that almost 14 million people will arrive between 2021 and 2036. That is almost 1 million every year. The population explosion has led directly to the depression of local wages, the housing crisis and the NHS waiting list crisis. British culture, identity and values are under threat.\nIn 2022 over 45,000 illegal immigrants crossed the channel in small boats, followed by some 30,000 in 2023. Most were allowed in with no criminal checks. Over 17,000 have gone missing. Foreign criminals and terrorists walk our streets. Record numbers of asylum claims have been granted, increasing the magnet factor to the UK. Labour and the Tories will never control our borders. The British people have been lied to, ignored and betrayed.\nCritical reforms needed in the first 100 days:\nFreeze Non-Essential Immigration. Smart immigration can target the essential skills our economy needs such as doctors, nurses and successful business people, earning above the average salary.\nStop the Boats with our 6 Point Plan.\nRecognise a national Security Threat. Leave the European Convention on Human Rights: Zero Illegal Immigrants to be Resettled in the UK; Offshore Processing for Illegal Arrivals; New Department of Immigration; Pick up Migrants out of Boats and Take Back to France. (We are legally allowed to do this under international treaties).\nSecure Detention for all Asylum Seekers.\nAsylum claims that arrive though safe countries will be processed rapidly offshore in British Overseas Territories. This will stop the scandal of undocumented asylum seekers absconding to work illegally or commit crime.\nImmediate Deportation for Foreign Criminals.\nDeport foreign nationals immediately after their prison sentence ends. Withdraw citizenship from immigrants who commit significant crime.\nRestrict Student Dependents.\nIntroduce new visa rules for international students and their dependents. Only international students with essential skills can remain in the UK when their study ends. Close down fake courses and abusive immigration schemes.\nStop the Illegal Working Scandal.\nLocal wages have been slashed because of cheap, undocumented, illegal labour that undermines British workers. The pro-immigration establishment has not enforced the rules. Significant penalties will be imposed on companies and directors that breach these rules.\nImmigration Pledges Savings = £5 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n6: NHS\nOur NHS needs urgent Reform.\nWe must make it a national endeavour to get to Zero NHS Waiting Lists in 2 years. This can be done, but only with a fresh, bold, can-do approach. Healthcare must remain free at the point of use.\nWhilst we treasure some of the front line care provided by the NHS, we must be honest. The NHS is in crisis: patients are suffering. Too often the care lets people down badly. Waiting lists are at record highs. Hospital beds have been cut from 300,000 to 141,000 while the population has grown by 20%. Hundreds die every week because of delays in Accident and Emergency. Ambulance waiting times are at record highs. This has contributed to an excess deaths crisis and some of the worst health outcomes in Europe.\nThis is not about funding. Per head of population, NHS spending is similar to other western countries. Sadly, the NHS is being let down by incompetent management, bureaucracy, waste, cover-ups and scandals. The NHS has a crisis in leadership. This will take time to fix. It is about structure and motivation.\nCritical reforms needed in the first 100 days:\nTransform Doctor and Nurse Availability.\nAll frontline NHS and social care staff to pay zero basic rate tax for 3 years. This will help retain existing staff and attract back many who have recently left. We want the best staff with patients, not in offices behind desks or retired.\nUse Independent Healthcare Capacity.\nCut waiting lists by using UK & overseas providers. The vast majority do not mind who delivers the cure, we just want the pain gone. This independent sector includes many not for profit health providers that provide some of the best care. Organisations such as Nuffield Health and Marie Curie, which provides end of life cancer care are charities. We want to encourage more of these organisations to end the NHS crisis.\nTax Relief of 20% on all Private Healthcare and Insurance.\nWe will incentivise people who can afford to pay more. This will improve care for all as pressure on the NHS is significantly reduced. Those who rely on the NHS will enjoy faster, better care. Independent healthcare capacity will grow rapidly, providing competition and reducing costs. Firms should be encouraged to offer staff health insurance – this will become standard. Labour will instead add VAT on independent healthcare, which will make the NHS worse off.\nDoctor and Nurse Training.\nEnd training caps for all UK medical students. Write off student fees pro rata per year over 10 years of NHS service for all doctors, nurses & medical staff.\nThereafter:\nPut Patients in Charge With a New NHS Voucher Scheme.\nPatients will receive a voucher for private treatment if they can’t see a GP within 3 days. For a consultant, the time limit would be 3 weeks. For an operation, 9 weeks.\nCut waste, Bureaucracy and Unnecessary Managers.\nFocus on results, not targets. Nail down better prices using economies of scale. Better IT for example. Review all Private Finance Contracts in NHS. Significant savings potential. Remove Lifetime Cap on NHS Pensions. This causes 70% of surgeons to reduce their hours.\nSave A&E.\nGP waiting lists are hitting A&E. Cut waiting times with a campaign of ‘Pharmacy First, GP Second, A&E Last’. More beds in A&E and other parts of the NHS are essential.\nExcess Deaths and Vaccine Harms Public Inquiry.\nExcess deaths are nearly as high as they were during the Covid pandemic. Young people are overrepresented.\nNHS Pledges Costs = £17 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n8: ENERGY & ENVIRONMENT\nOur energy market needs Reform.\nWe all care about the environment. Our air has never been cleaner. We want to use technology to do our bit. But Net Zero is the wrong bit, at the wrong price, in the wrong timeframe. Westminster’s obsession with Net Zero is damaging our livelihoods and the economy. It has sent energy bills soaring. Made it harder for businesses to compete. It is costing tens of thousands of jobs and increasing inflation.\nNet zero means reducing man made CO2 emissions to stop climate change. It can’t. Climate change has happened for millions of years, before man made CO2 emissions, and will always change. We are better to adapt to warming, rather than pretend we can stop it. Up to 10 times more people die of cold than warmth. In Roman Britain some 2,000 years ago, it was 2 degrees warmer than now. Grapes for wine were grown in Yorkshire.\nCO2 is essential for photosynthesis to enable plant growth. CO2 only represents 0.04% of the atmosphere; the average garden greenhouse has 3 times more! The UK produces only 1% of global CO2 emissions, yet China produces 27%. China & India are building hundreds of coal fired power stations. Even the IPCC admits Net Zero would make no difference to sea level rise for 200-1,000 years; in other words they do not have a clue.\nInstead, Net Zero sends our money abroad and damages critical industries like steel production. The government has turned Britain from being an exporter of oil and gas into a net importer. They have bet our future on unreliable wind and solar power and destroyed our energy security. It’s time for a common sense energy strategy.\nCritical reforms needed in the first 100 days:\nScrap Net Zero and Related Subsidies.The UK cost of Net Zero has been estimated by the National Grid and others at some £2 trillion or more. It is so big that no one really knows. The public sector is spending billions each year with no accountability or transparency. Ditching Net Zero would save the public sector some £20 billion per year for the next 25 years, possibly more.\nScrap Annual £10 Billion of Renewable Energy Subsidies.Achieve this through equivalent taxes on them. Renewables are not cheaper. Our bills have increased dramatically in line with the huge increase in renewables capacity over the last 15 years.\nCheap, Secure Energy.\nWe must use the energy treasure under our feet. Start fast-track licences of North Sea gas and oil. Grant shale gas licences on test sites for 2 years. Then enable major production when safety is proven, with local compensation schemes. The value of shale gas is potentially hundreds of billions over 30 years to the taxpayer. This could transform our nations fortunes and ensure prosperity for generations to come.\nThereafter:\nCleaner Energy from New Technology.\nFast-track clean nuclear energy with new small modular reactors, built in Britain. Increase and incentivise UK lithium mining for electric batteries, Combined Cycle gas turbines, clean synthetic fuel and clean coal mining.\nEnergy & Environment Pledges Savings = £30 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n9: POLICING\nLaw and Order urgently needs Reform.\nThe government is soft on crime and police leadership is badly failing. The bobby on-the-beat is almost extinct. Paperwork wastes huge amounts of police time. Crime solving is at an all-time low. Charging rates have collapsed to around 5%.\nAs a result, violent crime is at record highs. ‘County lines’ drugs gangs have spread across the UK. Teenage knife crime is out of control. Public confidence in the police is at an all-time low. The police must protect life, property and prevent crime without fear or favour.\nCritical reforms needed in the first 100 days:\nCommence Increase in Police Numbers.\nEngland and Wales have 235 police officers per 100k population. One of the lowest levels in Europe. France has nearly 300 police per 100k population. Commence recruitment to increase UK per capita police numbers to 300 per 100k population. That is 40,000 new front-line officers, over a 5 year parliament.\nCommence Zero Tolerance Policing.\nIt worked in New York. Clampdown on all crime and antisocial behaviour. Prison for all violent crimes and possessing a knife. Half of acquisitive crimes are drug related. Dealing and trafficking will get mandatory life imprisonment. A new offence of Substantial Possession of Drugs will meet heavy fines. Increase Stop and Search Substantially. It is a proven deterrent to knife crime.\nNew Police Leadership & Recruitment Regime.\nStrong preference for ex-military officers and personnel.\nMore Bobbies on the Beat.\nEnsure that police return to the beat and use better technology to stop wasting time on paperwork. Visible policing stops crime before it starts. Allow PCSOs to become police officers before the role is phased out.\nCommon Sense Policing not ‘Woke’ Policing.\nScrap all Diversity, Equality and Inclusion roles and regulations to stop two-tier policing. Protect the public without fear of favour. Reform The Independent Office of Police Conduct (IOPC) so that the police complaints system works for the law abiding public.\nThereafter:\nScrap or Reform Police and Crime Commissioners.\nPCCs do not have sufficient power to make a difference. Yet some employ 30 staff. That could be 30 more police officers on the beat. Either they get the power to make a real change or they should go.\nDe-Politicise the College of Policing.\nInstead, prioritise crime prevention, discipline, public service and high standards of strength and fitness. Replace degree-standard entry with an entrance exam. Require officers to complete a 2-year probationary period.\nPolicing Pledges Costs = £3 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n11: JUSTICE\nOur Justice System needs Reform.\nIt is failing the public. It is slow, bureaucratic and inefficient. It often puts offender rights above victim rights. Some violent repeat offenders commit over 100 offences, yet are still free to walk the streets. Over 75,000 defendants are awaiting trial at the Crown Court. The police are demoralised and the public are losing trust in the system. We will build a common sense justice system that keeps the public safe.\nCritical reforms needed in the first 100 days:\nUrgent Sentencing Review with Automatic Life Imprisonment for Violent Repeat Offenders.\nThose committing second violent or serious offences will receive mandatory life sentences.\nIncrease the Criminal Justice Budget.\nThe budget is almost the same as it was 10 years ago. Increase it from £10 billion to £12 billion to ensure more high calibre staff to cut delays.\nChange the Definition of Hate Crime.\nThe CPS and police definition of a hate crime has led to systemic bias. Members of the British public must not be investigated because ‘any’ person ‘perceives’ that a hate crime has been committed. Proper evidence must be required. Enforce existing laws to stop violent, hate demonstrations such as the Free-Palestine marches.\nCommence building of 10,000 New Detention Places. Start expansion in capacity of state built and managed prisons so that life means life for those who endanger the public. Commission disused military bases if needed.\nTackle Organised Crime.\nForeign gang crime accounts for most organised crime in the UK at a cost of £37 billion per year. This includes drugs, people trafficking and money laundering through barber shops, car washes and nail bars. Increase budget for both the National Crime Agency and The National Drugs Intelligence Unit.\nThereafter:\nReform the Child Maintenance Service.\nThe CMS is failing children and parents. It should be a Mediation Service and means-tested child support for parents who cannot arrange finances. Launch a special division of the family court for maintenance and defaults. Share parental care 50/50 where appropriate. Rights of access for Grandparents.\nStop Child Grooming Gangs.\nSystematic child sexual abuse continues unchecked. Child Protection Services needs a dedicated National Agency working with local charities, councils and health services. Upgraded intelligence can identify high-risk children and filter malicious claims.\nTackle Youth Crime.\nReopen High Intensity Training Camps for young offenders to teach basic education, teamwork and values. Military veterans can provide role models. This model worked at Thorn Cross in the 1990s. It is needed more than ever.\nJustice Pledges Costs = £2 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n13: EDUCATION\nToo many children and young people are being badly let down. Discipline, disruption and violence are huge issues in class. Teachers are drowning in bureaucracy. Woke ideology is spreading through our schools and universities. We want an education system that ensures young people learn the skills, character and values to succeed in life.\nCritical reforms needed in the first 100 days:\nBan Transgender Ideology in Primary and Secondary Schools.\nThere are 2 sexes and 2 genders. It is a dangerous safeguarding issue to confuse children by suggesting otherwise. No gender questioning, social transitioning or pronoun swapping. Inform parents of under 16s about their children’s life decisions. Schools must have single sex facilities.\nBan Critical Race Theory in Primary and Secondary Schools.\nIt is unacceptable to divide children on grounds of race and teach them to be ashamed of their country.\nTax relief of 20% on all Independent Education.\nNo VAT on Fees: If parents can afford to pay a bit more, we should incentivise them to choose independent schools. This will significantly ease pressure on state schools, so improve education for all. Independent education capacity will grow rapidly, providing competition and reducing costs\nScrap Interest on Student Loans.\nExtend loan capital repayment periods to 45 years. Restrict undergraduate numbers well below current levels, too many courses are simply not good enough and students are being ripped off. Enforce minimum entry standards. Stop backdoor route to immigration through use of low quality degree courses.\nThereafter:\nCut Funding to Universities that Undermine Free Speech.\nThe government’s Free Speech Act is toothless. Allowing political bias or cancel culture must face heavy financial penalties.\nPermanent Exclusions for Violent and Disruptive Students.\nDouble the number of Pupil Referral Units so schools can function safely. Disruptive children must also get support.\nUniversities Must Provide 2 Year Graduate Courses.\nThe option of 2 year courses would reduce student debt and allow earlier entry into employment to help pay it off.\nIncrease Technical Courses and Apprenticeships.\nValue young people with vocational talents. Britain needs skilled workers in engineering, construction, IT and high demand sectors.\nLife Skills Classes at School.\nSubjects such as home economics and social media risk should be part of the school curriculum. No smartphones or social media in schools under 16.\nEducation Pledges Costs = £5 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n15: BENEFITS\nThe benefits system is broken. There are 5.3 million people in Britain on out of work benefits. Around 3.7 million of these are not required to look for a job for health reasons. A substantial number are under 34 years of age. This number soared when face to face health checks were replaced by remote assessments.\nWe want an efficient welfare system that helps the genuinely disabled, sick, vulnerable and unemployed to find work. Currently our benefits system encourages dependency and entitlement. This damages mental health, locks people into poverty and wastes talent. Low pay and high tax means many can earn more on benefits than in work. Meanwhile nearly a million job vacancies are unfilled. If you can work you must work. There are too many shirkers and skivers while many with disabilities work hard and pay tax.\nCritical reforms needed in the first 100 days:\nMake Work Pay.\nLifting the income tax start point to £20,000 per year means an extra £1,500 per year. This would be a key incentive for those on benefits to find work.\nStart to Motivate up to 2 Million People Back to Work.\nReforms to benefit support & training will help people back into work. Particular focus on 16-34 year old s. Employment is critical to improving mental health. Tax relief for businesses that undertake apprenticeships.\nEnforce a 2-Strike Rule for Job Offers.\nAll Job seekers and those fit to work must find employment within 4 months or accept a job after 2 offers. Otherwise benefits are withdrawn.\nFace to Face, Not Remote Assessment for Personal Independence Payment.\nHuman contact is critical to build relationships and coach people back into work. We will also require independent medical assessments to prove eligibility for payments.\nThereafter:\nIntegrate Mental Health Services with Job Seeking Pathways.\nBritain’s young people are in the grip of a mental health crisis. Work is a cure not a cause.\nStop Benefit Fraud.\nOverhaul anti-fraud practices to ensure the Department for Work and Pensions cut fraudulent benefit claims to negligible levels.\nBenefits Pledges Savings = £15 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n16: BREXIT\nBrexit meant taking back control of our borders, laws and money. It should have allowed us to take our rightful place among the 168 other sovereign nations that succeed outside the European Union. Brexit meant more democracy. More accountability. More freedom.\nBrexit is a great opportunity for which the government has so far failed to take advantage. They have not controlled our borders, not reduced taxes and unnecessary EU laws still hinder growth. The Brexit that 17.4 million voted for, has been betrayed. An out-of-touch political elite is still obstructing the biggest democratic mandate in our history.\nCritical reforms needed in the first 100 days:\nLegislate to Scrap EU Regulations with Immediate Effect.\nBritish Laws on State Aid, Competition, Employment and the environment are still based on EU regulations. Nor have we reversed EU Net Zero laws which are sabotaging our economy.\nLeave the European Convention on Human Rights.\nBritish laws and judges must never be overruled by a foreign court. We must be free to deport those we consider a threat to our country. UK courts must be able to protect British citizens from EU arrest warrants.\nAbandon the Windsor Framework.\nThis is worse than the original Northern Ireland Protocol. The UK has been partitioned down the Irish Sea. Northern Ireland is still in the EU’s single market for goods. British citizens in Northern Ireland are being ruled by EU laws. Now the Tories have agreed to align new UK laws with EU laws.\nThereafter:\nIndependence for Britain’s Armed Forces.\nThe government has signed up to the EU Horizon programme. That means we send money to the European Defence Fund and part of the EU’s military mobility project. David Cameron met his EU counterparts to discuss EU defence policy. Our Armed Forces are at risk of being sucked into an EU Command and Control Force.\nPrepare for renegotiations on the EU Trade and Cooperation Agreement.\nA so-called EU ‘level playing field’ is holding us back.\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers.\nPlease email comments to:\n17: DEFENCE\nBritain has some of the best and bravest Armed Forces in the world. Yet grandstanding politicians send our servicemen and women abroad with poor equipment. They have cut the Army to its smallest size in 300 years. Military housing is substandard.\nOur wounded and veterans are often abandoned. Some still face unjust legal claims. We will reform our military covenant so those who put their lives on the line get the support they deserve both during and after service.\nCritical reforms needed in the first 100 days:\nIncrease Defence Spending to 2.5% of National GDP by year 3, then 3% within 6 years.\nThis will increase the size and capacity of our armed forces, ensuring our lead role in NATO. Will improve equipment and boost morale in military communities.\nIntroduce Urgent Pay Review.\nIncrease basic pay across our armed forces to boost recruitment and retention. It is unacceptable that a private soldier is paid less than an Amazon worker.\nIntroduce new Armed Forces Justice Bill.\nProtect our servicemen and women on active duty inside and outside the UK from civil law and human rights lawyers. The bill will also create an armed forces watchdog to fast-track complaints and appeals in housing and welfare.\nNew, Dedicated Ministerial Department for Veterans.\nA properly funded and resourced whole department is essential. The next page has more detail.\nThereafter:\nRegenerate Britain’s Defence Manufacturing and Technology.\nIntroduce incentives and tax breaks to boost the UK defence industry. Improve equipment self-sufficiency and manufacture world class products for export.\nReform Defence Procurement.\nLaunch a Joint Acquisition Corp to ensure world class procurement. The Ministry of Defence must listen to soldiers on the front line and ensure they get the equipment they need.\nEducation for Military Personnel.\nFree education both during and after service is vital to ensure a successful return to civilian life.\nDefence Pledges Costs = £13 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n18: DEPARTMENT FOR VETERANS\nVeterans are some of the nations’ greatest assets, not victims. They have a huge amount to offer. They should be valued, as well as thanked. Our veterans have valuable skills which should be used to their fullest potential after leaving the Armed Forces. Their leadership experience, logistics expertise, discipline, determination and can do attitude is unique.\nWe must properly look after veterans who have been wounded and those suffering from health issues. Veterans should not be homeless. Access to pensions and grants must be quick and straight forward.\nThese reforms are the fastest way to solve the Armed Forces recruitment crisis. People want to be part of a great lifelong successful team.\nCritical reforms needed in the first 100 days:\nCommence “You serve, You Deserve”.\nA fully recognised national rewards and benefits scheme for veterans and families including travel.\nInstigate “Veterans First” priority Status.\nFor healthcare, housing, training and education, together with support for dependents.\nPreferential Qualification for Key Public Sector Leadership Roles.\nSuch as Chief Superintendent of Police Forces, CEO / COO roles in hospitals amongst others.\nThereafter:\nTake Back Control of Recruitment for Armed Forces.\nThis has become a crisis due to woeful private sector outsourcing, bureaucracy and incompetence. Veterans can be best motivators for recruiting new people into the armed forces.\nTake Back Control of Military Accommodation.\nPoorly run and outsourced property management contracts have failed our armed forces. Thousands of homes are in poor condition or uninhabitable, which is inexcusable.\nDepartment for Veterans Pledges Costs = £1 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n19: HOUSING\nThe UK population has grown by over 1.3 million in just 2 years. Yet only 425,000 homes have been built. The Office of National Statistics forecast the population to grow by nearly 7 million between 2021 and 2036, putting huge pressure on housing.\nMass immigration is the main factor in this. Other factors that have damaged housing supply are overly bureaucratic planning regulations that delay decisions and add huge cost.\nCritical reforms needed in the first 100 days:\nReview the Planning System.\nFast track planning and tax incentives for development of brownfield sites, including unused offices and vacant high street properties. Review system of Section 103 Developer Contributions for infrastructure such as schools and surgeries to accelerate house building.\nReform Social Housing Law.\nPrioritise local people and those who have paid into the system. In parts of the UK almost half of all social housing is occupied by someone born overseas. Foreign nationals must go to the back of the queue. Not the front.\nScrap the 2019 Tax Changes for Landlords.\nThe tax system should encourage smaller landlords into the rental markets. Not penalise them.\nAbolish the Renters’ (Reform) Bill.\nExisting legislation was adequate to address bad practices. Instead, we will boost the monitoring, appeals and enforcement process.\nThereafter:\nIncentivise Use of New Construction Technology.\nSuch as modular construction, and smart infrastructure.\nMore Home-grown Qualified Traders.\nNew apprenticeships and vocational courses will increase the supply of skilled, well-paid workers to replace cheap overseas labour.\nHousing Pledges Costs = £ Neutral\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n20: CHILDREN AND FAMILIES\nBritain has one of the highest family breakdown rates in the western world. In 2021, more children were born to unmarried couples than to those who were married. Half of all children grow up in separate households. We have the unhappiest teenagers in Europe.\nThis has a devastating impact. On average, children from broken homes suffer from more educational failure, unemployment, homelessness and poverty. They suffer from more mental health issues, substance abuse, crime and imprisonment. This is a social and economic catastrophe that costs taxpayers tens of billions every year.\nCritical reforms needed in the first 100 days:\nSupport Marriage Through the Tax system.\nGermany and France let married couples with children share their tax allowance. British married couples with children deserve the same. As soon as finances allow, introduce a UK 25% transferable marriage tax allowance. This would mean no tax on the first £25,000 of income for either spouse. (Based on our higher income tax starting point of £20,000 per person). This will help make work pay, helping people trapped on benefits back into the workplace so reducing the benefits bill.\nChoice for Stay at Home Mums or Dads.\nThe majority of mothers would choose to stay at home more if they could. ‘Front-loading’ the Child Benefit system for children aged 1-4 would give parents the choice to spend more time with their children.\nMandate Single Sex Spaces.\nPublic toilets and changing areas must provide single sex facilities.\nPromote Child Friendly App Restricted Smartphones.\nReduce social media harms for children.\nThereafter:\nLaunch inquiry into Social Media Harms.\nSocial media is associated with eating disorders, anxiety, depression, suicide and the child mental health crisis. Critically, social media can change both behaviour and belief without the user’s consent. Protect children’s mental health. (Potential social media ban for under 16s if practicable.)\nReview the Online Safety Bill.\nSocial media giants that push baseless transgender ideology and divisive Critical Race theory should have no role in regulating free speech.\nChildren & Families Pledges Costs = £8 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n21: TRANSPORT & UTILITIES INFRASTRUCTURE\nOur Transport and Utilities Infrastructure has suffered from under investment and lack of joined up thinking. Much of it has been sold to overseas investors. Around 70% of water companies and 80% of our gas power stations and offshore wind farms are foreign owned, together with 100% of our nuclear power stations which are owned by EDF of France.\nOverseas shareholders get richer while prices have soared and the cost of living crisis rages. The regulators have been asleep at the wheel. Our infrastructure is crumbling. Risk of power cuts has increased. Raw sewage is pumped into our seas. Economic productivity has been damaged. We have given up control over much of our critical infrastructure, meaning national security is at risk.\nCritical reforms needed in the first 100 days:\nScrap HS2.\nSave £25 billion by scrapping the rest of this bloated vanity project.\nStop the War on Motorists. Legislate to ban all ULEZ and Low Traffic Neighbourhoods. We will scrap bans on selling petrol and diesel cars and scrap legal requirements for manufacturers to sell electric cars.\nAccelerate Already Announced Transport Infrastructure.\nFocus on the North.\nThereafter:\nTighter regulation and new ownership model for Critical National Infrastructure.\nConsumers have been ripped-off and failed by weak regulators. Launch a new model that brings 50% of each utility into public ownership. The other 50% would be owned by UK pension funds, benefiting from new expertise and better management. This is a win win situation.\nIntegrated Transport Infrastructure. Launch a national database for councils, contractors, government and utilities to ensure coordination of projects. Less road works, waste and delays.\nNational Water Grid and Reservoirs.\nThe UK is at risk of water shortages. Build new reservoirs in high rainfall areas. Water can be stored and transferred to low rainfall areas when required. Stop the release of sewage into our rivers and seas.\nA Single Government Infrastructure Funding Stream.\nOverhaul and merge the National Infrastructure Commission and the Infrastructure Bank. Scrap all Net Zero related objectives. Simplify the funding process, save time, cut waste, boost funding and ensure accountability.\nTransport and Utilities Infrastructure Pledges Savings = £25 billion one-off = £5 billion per year over first 5 years\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n22: AGRICULTURE\nBritish farming needs reform to take advantage of Brexit.\nFarming is in crisis and our food security is at risk. Government subsidies force farmers to meet environmental targets instead of producing food. Fuel and fertiliser costs have spiralled. Farmers have to deal with huge amounts of paperwork. Farmland is being lost to re-wilding and solar farms. High energy costs and supermarket price fixing has pushed many farmers to bankruptcy. Rural communities are dying.\nCritical reforms needed in the first 100 days:\nIncrease the farming budget to £3 Billion.\nFocus on smaller farms. Keep farmland in use. Bring young people into farming. Boost rural economy and culture. Increase innovation and diversification. Help farmers to farm, not pay them to leave or retire.\nScrap climate-related farming subsidies.\nProductive land must be farmed, not be used for solar farms or rewilding. Replace current subsidies with direct payments. Stop Natural England from taking action that damages farmers.\nProtect Country sports.\nThese increase investment in conservation of our environment. They boost rural jobs, communities and local economies.\nThereafter:\nStop supermarket price fixing.\nGrant powers to the Competitions and Markets Authority to ensure fair pricing. Help farmers sell their produce directly to the public. Change planning laws to support farm shops with zero business rates.\nBuy British. Buy quality.\nLittle more than half the food we consume is UK produced. Target 70% to ensure food security. Taxpayer funded organisations should source 75% of their food from the UK. Clear labelling for consumer choice. Boost smaller food processors and abattoirs through tax breaks and other incentives. This cuts transport costs and promotes animal welfare.\nFarming not form filling.\nMany farmers spend over 15 hours a week on paperwork. Cut red tape from HMRC and the British Cattle Movement Service.\nFuture technology & fertiliser supplies.\nFarmers must have access to new technology to boost production and cut costs. UK food security also depends on fertiliser supply and production.\nEncourage young people into farming.\nOffer subsidised courses at Agricultural Colleges and apprenticeships to help young people learn farming ‘craft’ and business management.\nAgriculture Pledges Costs = £2 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n22: FISHING & COASTAL COMMUNITIES\nBrexit was a huge opportunity to renew our fishing industry and revive our coastal communities. Yet, the government has not taken back control of our historic fishing grounds. Foreign vessels still plunder our waters and damage the sea bed. Major renegotiations of our fishing arrangements with the EU are essential in the run up to the 2026 review.\nCoastal communities are blighted by crime, poverty and unemployment. Fishing ports such as Fleetwood, Grimsby, Hull, Lowestoft, Aberdeen are desperate for regeneration. Fishing offers a unique opportunity to achieve this. Every one job at sea creates 8 jobs on the land through processing and support industries. Reform UK will restore the UK’s fishing industry and heritage.\nCritical reforms needed in the first 100 days:\nStop EU Fishers Taking UK Quotas.\nEnd automatic access to UK Waters. Every foreign fishing vessel must pay for a licence to gain access to the UK’s 12 nautical mile zone.\nExpand the Royal Navy Overseas Patrol Squadron.\nPolice British territorial waters properly. Assess the possibility of creating a dedicated coast guard or fisheries protection agency.\nBan Foreign Super trawlers from UK Waters.\nExtend the ban on pair trawling for bass beyond the South East and 12-mile territorial waters.\nStop Foreign Owners Using a British flag of Convenience.\nRequire tax and provenance tests. Ban the trading of fishing quotas. Revisit the 1988 Merchant Shipping Act and strengthen ‘Economic Link’ principles. Reform the quota system to benefit small scale fishing.\nThereafter:\nRebuild UK Fish Processing.\nTax and other incentives to ensure that all fish caught in British waters are landed and processed in the UK. Fish caught by foreign vessels in UK waters should also be landed and processed here when capacity allows.\nRevitalise the UK’s Fishing Fleet.\nTax incentives and vocational training to increase UK fishing fleets. Include fishing communities in policy making.\nLaunch a Sovereign Wealth Style Coastal Fund.\nProceeds from foreign fishing licences must be reinvested in coastal communities.\nGuarantee Sustainable Stocks.\nImplement a ‘dynamic management system’. Work with national and regional partners such as the North East Atlantic Fisheries Commission.\nNegotiate with Ireland on Rockall.\nEstablish a legal claim for EEZ. Secure territorial waters.\nFishing and Coastal Communities Pledges Costs = £2 billion pa\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n26: PENSIONS AND SOCIAL CARE\nOur elderly deserve to be treated with dignity and respect. For over 20 years the Tories and Labour failed to tackle the sue of Pensions and Social Care. The system is broken and time is running out. Since the 1950s, larger numbers of young people have funded the smaller numbers of elderly through the tax system. But people are living longer and the percentage of over 65s to the working age population has increased. This change has caused a major funding problem for our elderly and long – term sick.\nCritical reforms needed in the first 100 days:\nCommence Royal Commission of Inquiry into Social Care System.\nA national plan is critical for a sustainable social care system. Collaboration between central government, local authorities, social care providers and home carer support groups is vital to solve the growing challenge. (Flexibility, income tax and VAT breaks are potential factors). Streamlining and simplifying through a single funding stream, not split between NHS ands Local Authorities is essential. Improved regulation is required for this vital service which is part of UK PLC’s infrastructure. Additional funding will be required when a national plan is agreed.\nStop the Offshore Taxpayer Rip Off.\nSome larger care home providers avoiding tax on hundreds of millions of profits through complex offshore property company structures and high interest shareholder loans. At the same time they pay minimal wages to front line care staff.\nThereafter:\nReview Pension provision.\nThe current pension system is riddled with complexity, huge cost and poor returns leading to lower pensions. Other nations like Australia do savings and pensions much better and cheaper than we do, from a much younger age.\nPension and Social Care Reform: TBC\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n27: CONSTITUTIONAL REFORM\nThe UK’s constitutional arrangements need Reform.\nWe are ruled by an arrogant and out of touch elite. The two party system is broken. The social contract is broken.\nOur public sector is too often incompetent, wasteful and unaccountable. The Civil Service is no longer neutral. Many public institutions are pro-immigration, pro-remain and left-wing. Patronage around the House of Lords and honours system is leading to corruption in public life.\nWe have a constitutional crisis and our freedoms are at risk. Millions are taxed without proper representation. The British public must have a real, democratic choice on how our country is run.\nCritical reforms needed in the first 100 days:\nLeave the European Convention on Human Rights.\nCommence reform of the Human Rights Act.\nCommence Reform of the House of Lords.\nReplace the crony-filled House of Lords with a much smaller second chamber. Structure to be debated. Immediate end of political appointees.\nCommence Reform of the Civil Service.\nReplace Civil Service leaders with private sector successful people, who are political appointees, who come and go with the government. Enforce the Civil Service code of integrity, honesty, objectivity and impartiality. Ensure better value for money with proper, competitive tendering.\nCommence Reform of the Postal Voting System.\nPostal voting has allowed electoral fraud. We will stop postal voting except for the elderly, disabled or those who can’t leave their homes.\nThereafter:\nProportional Representation Voting for the House of Commons.\nFirst Past the Post is an outdated voting system. Large numbers of voters have no representation in parliament and new parties are shut out of the political system. Voter turnout would be some 10% higher with PR. A referendum is needed.\nA British Bill of Rights.\nOur freedoms must be codified and guaranteed. Political freedom, personal freedom, economic freedom. Never again can our entire country be locked down on shoddy evidence and lies.\nConstitutional Reform Pledges: Neutral\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\n28: RECLAIMING BRITAIN\nReform is needed to defend and promote British culture, heritage and identity. ‘Woke’ ideology has spread fear through our captured public institutions. No one voted for uncontrolled mass immigration. Multiculturalism has led to the growth of separate communities that risk nurturing extremism and the rejection our way of life. Christian values are under threat.\nLabour and the Tories have broken their promises and treated us with contempt. Divisive laws promote minority interests over the majority. Two-tier policing has damaged trust in the police. Freedom of speech has been undermined. Christians are arrested for expressing their beliefs in public. White people can even be barred from applying for jobs. No one voted for this. Yet British taxpayers are forced to fund it. The British people have been lied to, ignored and betrayed.\nCritical reforms needed in the first 100 days:\nAffirm British Sovereignty.\nReject the influence of the World Economic Forum. We will cancel our membership of the World Health Organisation unless there is fundamental reform to its structure and funding. Reform UK also opposes the Creation of a Central Bank Digital Currency (CBDC). We will legislate if necessary to stop Britain becoming a cashless society.\nReplace the 2010 Equalities Act.\nThe current Equalities Act requires discrimination in the name of ‘positive action’. It costs the economy billions of pounds, and has become a lawyer’s charter to print money. It has destroyed meritocracy, spread division and led to exclusion for some in majority groups. Scrap all Diversity Equality and Inclusion roles that cost huge sums, create division, inequality and exclusion, and reduce productivity.\nPropose a Comprehensive Free Speech Bill.\nLegislate to stop left-wing bias and ‘woke’ ideology. No more de-banking, cancel culture, left wing hate mobs or political bias in public institutions. Stop Sharia law being used in the UK. All public electoral activity including debates leaflets and other information must be in English.\nCommence Reform of the BBC.\nThe out-of-touch wasteful BBC is institutionally biased. The TV licence is taxation without representation. In a world of on-demand TV People should be free to choose.\nLaunch a Westminster Anti-Corruption Unit.\nThe Covid PPE scandal has raised serious questions about integrity in government. The public watchdog must close the ‘revolving door’ between government and big business. Address potential conflicts of interest. Ask why UK infrastructure costs so much more than other countries. Investigate Chinese espionage and influence over politicians, academics and key decision-makers which the UK Intelligence and Security Committee says is a major threat to national security.\nConstitutional Reform Pledges: Neutral\nThis proposed contract is deliberately issued as a working draft. We welcome your comments, challenges and queries. The contract will be finalised later in the year. This is what happens in business, and the nation should be run like a lean, efficient business with motivated employees and happy customers. Please email comments to:\nFUNDING OF REFORM UK PLANS\nTotal Savings Potential = £156 Billion PA",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_events/content_15.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nSearch\n- Select Category -\nBroxbourne\nHarpenden and Berkhamsted\nHemel Hempstead\nHertford and Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nMore Options\n- Select Month -\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\n- Select Year -\n2029\nSearch\nReset\nUpcoming Events\nThere is 1 upcoming event\nSouth West Herts\n16\nOctober\nPublic Meeting. The Artichoke.\nSouth West Herts\nTuesday, 16 October 2029\n00:00\nThe Artichoke. Green Lane. Croxley\n-\nThree Rivers, United Kingdom\nPublic Meeting\n+ info\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_welwyn-hatfield/content_5.html": "Giving Welwyn Garden City (and Letchworth Garden City) protected status to prevent building up the immediate area and to preserve their distinct character and aesthetic. Development in the area must not go beyond a certain height and buildings must remain spaced out for there to still be plenty of public garden.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_policies_economy/content_26.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nPolicies\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_policies_energy/content_49.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nPolicies\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_eleanor-jackson/content_69.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nEleanor Jackson\nWebsite\nhttp://reformuk-herts.uk/herts-wards/watford\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_hemel-hempstead_noel-wilcox-celebrates-a-win-agaist-khans-ulez-scam/content_9.html": "ULEZ (Ultra Low Emission Zones) - He stood up to Sadiq Khan's unlawful LEZ charges when they tried to shake his scaffolding company down for £11,000! Noel fought it all the way to the courtroom where they found Khan's ULEZ signs to be unlawful! In spite of this court ruling, Khan continues to rip off those travelling in and out of London, so Noel's taking the fight to Transport for London, and raising funds to take them to court and win everyone's money back.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_policies_immigration/content_64.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nPolicies\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_north-east-herts/content_18.html": "Reform UK candidate Steve Adelantado said: \"While being committed to healthcare still free at the point of delivery, our healthcare needs major reforms to improve results and enjoy zero waiting lists.\n\"To help to achieve this, we will work to end doctor and nurse shortages. All frontline NHS and social care staff to pay zero basic rate tax for three years.\n\"This will help retain existing staff and attract many who have left to return. End training caps for all UK medical students.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_hertsmere_hertsmere-offers-grants-to-celebrate-the-kings-coronation/content_32.html": "Community groups and voluntary organisations in Hertsmere are being encouraged to apply for a grant of up to £500 for events taking place on the weekend of the Coronation.\nHertsmere Borough Council want as many residents as possible to be involved.\nNational celebrations for the Coronation are set to take place between Saturday, May 6 and Monday, May 8.\nAmong the events which could be supported are a street party, a Coronation Big Lunch, or a get-together with your community group.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_profiles_welcome-to-south-west-hertfordshire-branch/content_54.html": "Welcome to the South West Hertfordshire Branch of Reform UK. I am Your Chairman Keith Steers. Here at the South West Hertfordshire Branch we are very active. We are currently starting our campaign for getting our perspective councilors into Hertfordshire County Council on the 1st May. 2025. We look forward to meeting you and representing you. But we cannot do this without you. MAKE SURE YOU ARE REGISTERED TO VOTE. and MAKE SURE YOU VOTE. Meet the Team. South Oxhey and Eastbury. (Taylor Smith ) Abbots Langley. (Gavin Casey) Rickmansworth West. (Dane Clarke) Croxley. (George Moss) Rickmansworth East and Oxhey (Sonja Flynn) Three Rivers Rural (Melvyn Clifford)\nDeputy Chair (Shelly) Shailja Shah Secretary. Alison Wall Treasurer Melvyn Clifford. Member. Steph Lowther.\nWe will shortly be uploading an introduction from each of your prospective Councilors. You can follow us on Facebook at Reform UK Southwest Hertfordshire. or Email us at",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_wat-branch-team/content_63.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nBranch Team\nAdd\nGroup by\nNone\nImage\nFull Name\nPosition\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_north-east-herts_north-east-herts-candidate-vow-to-protect-the-nhs-and-save-health-services/content_40.html": "Reform UK candidate Steve Adelantado said: \"While being committed to healthcare still free at the point of delivery, our healthcare needs major reforms to improve results and enjoy zero waiting lists.\n\"To help to achieve this, we will work to end doctor and nurse shortages. All frontline NHS and social care staff to pay zero basic rate tax for three years.\n\"This will help retain existing staff and attract many who have left to return. End training caps for all UK medical students.\n\"Write off student fees pro rata per year over 10 years of NHS service for all doctors, nurses and medical staff.\n\"Improve efficiency. We will cut Waste and unnecessary managers. Operating theatres must be open on weekends. Rotas must be planned further in advance.\n\"Nail down better prices using economies of scale. Review all NHS Private Finance Contracts for significant savings potential. Charge those who fail to attend medical appointments without notice.\n\"Cut A&E waiting times with a campaign of 'Pharmacy First, GP Second, A&E Last'. We will offer tax incentives for new pharmacies and those who employ more staff to assist in relieving pressure on A&E Excess\n\"We will commission a \"Deaths and Vaccine Harms Public Inquiry\". Excess deaths are nearly as high as they were during the Covid pandemic. Young people are over-represented. We must discover why.\n\"On a personal note, I will investigate what measures can be taken to make better use of Royston Hospital, so as to best serve the residents of Royston and surrounding villages.\n\"It seems to me to be a waste that that such an ideally located facility is not being used to it`s fullest potential. I will fight to increase the differing services provided there.\"",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_policies_healthcare/content_38.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nPolicies\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_policies_justice/content_56.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nPolicies\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_hemel-hempstead_questions-asked-over-tory-candidate-s-involvement-in-alleged-furlough-scandal/content_22.html": "Last year, Guido reported on the stand-off over at the Hemel Hempstead Conservative Association, with former agent Kevin Drew taking Association Chair Mark Woods to Watford Employment Tribunal after Woods allegedly suspended Drew for whistleblowing on furlough fraud. After hundreds of thousands spent on legal costs, the Tories coughed up and settled to avoid a public hearing…\nNow questions are being asked of those involved in what local sources call the “cover-up” of the furlough fraud allegation. A whistleblower sent evidence of the alleged fraud – seen by Guido – to Noel Willcox, Reform’s PPC for Hemel Hempstead. Mark Woods told former agent Drew to work from home “to get access to the government’s 80% of salary support” in March 2020, the furlough continuing for around 18 months. Outgoing MP Mike Penning and Andrew Williams, member of Executive Council of HHCA and now parachuted into the seat as the Tory PPC, were made aware of the evidence. The Interim Report made by the HHCA executive council in 2021 was seen by both Penning and Williams, though they never responded to the sub-committee. Local sources are now questioning why they didn’t act or seek to properly investigate the claims…\nNoel Willcox tells Guido:\n“I have exposed this wrongdoing based on the facts available. In my opinion there is prima facie evidence to consider criminal charges against individual members of Hemel Hempstead Council Authority. Again, in my opinion, the evidence meets the Crown Prosecution Service criteria for investigating a case: ” there is a realistic prospect of conviction and that it is in the public interest”. The Right Honorable Mike Penning needs to explain what action he took in respect of this scandal together with the Conservative Candidate Andrew Williams who at the time was the leader of Dacorum Borough Council. Serious questions need to be asked on behalf of the local taxpayers regarding the money spent on their behalf by our elected officials.”",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_login/content_6.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nEmail\n*\nPassword\n*\nShow\nShow Password\nRemember me\nLog in\nForgot your password?\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted_tring/content_42.html": "Thursday 27th February 2025\nThe results were as follows:\nLib Dems: 287 votes (42.3%)\nTories: 166 votes (24.7%)\nReform: 136 votes (20.2%)\nGreens: 80 votes (11.9%)\nTotal votes 671 (17.2% turnout)\nWe are polling at 27% nationally, so fractionally over 20% in a strong Lib Dem area where we haven’t campaigned locally before is a decent result.\nBy way of comparison, we got 7.8% in the July 2024 general election, so we've substantially increased our vote.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/http_reformuk-herts_uk_herts-wards_watford/content_82.html": "There are no articles in this category. If subcategories display on this page, they may have articles.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_profiles_noel-wilcox/content_46.html": "Noel is committed to fighting for the rights of people. His passion for politics and dedication to improving the lives of those in his community drive him to work tirelessly towards a better future for all. Join him in the fight for a brighter tomorrow.\nHe's a man whose resilience, determination, and commitment have shaped him into a prominent figure in both military and political circles. Noel's trajectory from growing up on a council estate to becoming a respected military veteran and later a passionate political advocate is a testament to his unwavering spirit and dedication to making a difference.\nNoel's a testament to the fact that you don't have to be in the House of Parliament or be a lawyer to make real change in this country. Here are two major issues that he's turning the dial on...\nULEZ (Ultra Low Emission Zones) - He stood up to Sadiq Khan's unlawful LEZ charges when they tried to shake his scaffolding company down for £11,000! Noel fought it all the way to the courtroom where they found Khan's ULEZ signs to be unlawful! In spite of this court ruling, Khan continues to rip off those travelling in and out of London, so Noel's taking the fight to Transport for London, and raising funds to take them to court and win everyone's money back.\nCMS (Child Maintenance Service) - Noel’s been holding the Child Maintenance Service to account over disgraceful overcharging, profiteering, creating false debts,\npunitive enforcement, fraud and, sadly, driving people to suicide. This is no joke. What Noel’s been investing is probably one of the most cold hearted and cruel scandals facing this country as he's uncovered evidence indicating a staggering £3.8 billion discrepancy in the system!\nNoel's no lawyer, he's no career politician, he's just a man who loves this country and hates injustice. He refuses to stand by and watch, while hard working people in Britain are suffering because of corrupt systems. Know this - he will fight for you in Hemel Hempstead - all the way!",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_adrian-steeples/content_67.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nAdrian Steeples\nWebsite\nAdrian+Steeples\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_john-burmicz/content_73.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nJohn Burmicz\nWebsite\nhttps://reformuk-herts.uk/herts-wards/hertford\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_hemel-hempstead/content_2.html": "Noel's a testament to the fact that you don't have to be in the House of Parliament or be a lawyer to make real change in this country. Here are two major issues that he's turning the dial on... Sadiq Khan the notorious London Mayor's wicked money making 'ULEZ' scam and the evils of the Government's Child Maintenance Service.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted_tring_tring-by-election-result/content_39.html": "Thursday 27th February 2025\nThe results were as follows:\nLib Dems: 287 votes (42.3%)\nTories: 166 votes (24.7%)\nReform: 136 votes (20.2%)\nGreens: 80 votes (11.9%)\nTotal votes 671 (17.2% turnout)\nWe are polling at 27% nationally, so fractionally over 20% in a strong Lib Dem area where we haven’t campaigned locally before is a decent result.\nBy way of comparison, we got 7.8% in the July 2024 general election, so we've substantially increased our vote.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_policies_reform-uk-law-order-policy/content_36.html": "We must adopt a zero tolerance approach to crime and antisocial behaviour. This starts at the ground level. Common sense dictates more police on the streets will help prevent crime and help catch criminals.\nIncrease police numbers in the community, with officers on the beat, engaging with the local people. Ensure there is more visible policing with a focus on combating violent crime, robbery and burglary rather than enforcing restrictions on free speech or policing tweets.\nTarget the menace of County Lines drug dealers, gangs and the growth of knife crime.\nOur police need much better technology to help them when they are on the streets. Some of what they currently use is archaic. This can substantially reduce bureaucracy and paperwork.\nReform our courts and justice system to work faster and smarter.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted_hertfordshire-county-council-buying-new-offices-despite-having-to-save-42-million/content_17.html": "Hertfordshire County Council councillors have approved a motion on the 15th January to purchase New offices in Hemel Hempsted for a multi million pound deal and at the same meeting they were presented with budget plans that will require £42m of savings.\nFinancial details relating to the potential freehold purchase were circulated to councillors privately and these were not made public at the meeting.\nCouncillor Bob Deering told members of the cabinet that the purchase was expected to achieve 'savings' and the property was “an important location” for the council that had recently come onto the market and they had negotiated what they believed to be “a good price”. He also said advice from consultants suggesting that by purchasing the building the council would achieve savings.\nAt present the HCC rents The Meadowside House premises, in Apsley at a cost of approx £825k a year and is used by more than 1000 staff.\nCllr Phil Bibby pointed to the financial savings. He said: “Looking at the figures, whichever way you cut it, there is a business case for us actually taking the freehold and saving on the rent in the long term. I am quite in favour of this proposal.”\nThe decision will not be subject to usual ‘call-in’ procedures, that allow councillors to request that a decision is reconsidered. This was said to be because the council would be likely to suffer “financial prejudice” from a delay in implementing the decision. But leader of the council Councillor Richard Roberts said opposition party leaders had been made aware of the proposal and that there was cross-party support.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_stevenage/content_4.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nStevenage\nReformUK Stevenage: Spreading the Word\nAll geared up and ready to go spreading the ReformUK word around Stevenage on a cold winter's day.\nRead more …\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted_lib-dem-council-to-cut-free-on-street-parking-in-harpenden/content_14.html": "The Lib Dem run St Albans District Council is planning to drastically increase parking charges across Harpenden town centre. The council also plans to cut free on-street parking in Harpenden and Redbourn. This will make short shopping more difficult and expensive if you have to use the car park or pay at the meter.\nUnder the councils proposals free time limited parking bays on Harpenden High Street will become chargeable.\nResidents of Redbourn face not only having to pay for their formerly time-limited free bays, but also axing of their free High street car park.\nSome tarrifs will increase by up to 60%. For example, the Sunday charge for Amenbury Lane car park rises from £1.50 to £2.50.\nThis is going to damage the High Street traders even driving shoppers out of town\nTeresa Heritage, District and County Councillor for Harpenden added,\nThese changes will have a negative effect on both residents and local businesses. I simply don't understand why the council is introducing them.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_hb-branch-team_form_8_5/content_47.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nHarpenden & Berkhamsted Branch Team\nBranch Team\nImages should be max 400px wide\ncreated\nid\nConstituency\nHarpenden and Berkhamsted\nImage\nDelete\nFirst Name\nLast Name\nFull Name\nPhilip Wells\nPosition\nChairman\nSave\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_policies_net-zero/content_51.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nPolicies\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_policies_defence-policy/content_37.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nPolicies\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_b-branch-team_form_8/content_45.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nBranch Team\nBranch Team\nImages should be max 400px wide\ncreated\nid\nConstituency\nImage\nFirst Name\nLast Name\nFull Name\nPosition\nSave\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_wat-branch-team_form_8/content_70.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nBranch Team\nBranch Team\nImages should be max 400px wide\ncreated\nid\nConstituency\nImage\nFirst Name\nLast Name\nFull Name\nPosition\nSave\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_profiles_darren-selkus/content_35.html": "Had enough of the two party system and politicians that say one thing and do another ?\nI live in Hertsmere and am very happy to have been appointed our Reform UK Spokesperson.\nThe next General Election is 1 year away and I look forward to challenging Oliver Dowden MP and holding not only the Conservative Government but all of the Westminster establishment to account.\nWithout Reform UK there is no democracy and no choice. There’s little difference in policy between the Conservatives and Labour. Only Reform UK believes in a small State where we have more control over our own lives. Only Reform UK will end the Net Zero insanity that makes us poorer, less competitive and just exports CO2 emissions to other countries. Only Reform UK will reduce taxes and accelerate growth. Only Reform UK wants to control immigration and will radically reform our public services, including the NHS, to make them fit for purpose.\nIf you want change you have to change your vote.\nI’m not a politician and to be honest don’t want to be one. BUT we need change and I’m committed to making it happen.\nI’m a British Army veteran, CEO of the UV Group Plc and married with two kids and two dogs. This experience makes up for any inexperience in politics and better to represent and fight for the people of Hertsmere.\nUntil 2019 I had little interest in politics but became engaged after the result of the 2016 was ignored. I joined the Brexit Party and was selected as the Prospective Parliamentary Candidate for Epping Forest.\nThe fight is now to Change Politics For Good and what I’m here to do.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_hb-branch-team/content_7.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nHarpenden & Berkhamsted Branch Team\nBranch Team\nAdd\nGroup by\nNone\nImage\nFull Name\nPosition\nHarpenden and Berkhamsted\n( 1 )\nNo records\nPhilip Wells\nChairman\nEdit\nView\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_sitemap/content_16.html": "Main Menu\n- Home\n- Hertfordshire Targeted for 20mph Zone Blitz!\n- Hertfordshire County Council responds to Government's proposals for devolution and local government reform\n- Reform candidate ‘sacked’ by housing association for reposting ‘racist’ Matt cartoon\n- Hertfordshire County Council buying NEW Offices despite having to save £42 Million\n- Herts County Council Draft Budget for 2025\n- We’ve hit our £28,000 target to fully fund Saba Poursaeedi’s legal fight for free speech!\n- Hertfordshire's Social Care and Children’s Care\n- Rupert Lowe: British farming should be a global success story\n- Time for Change? - Time for Reform?\n- Get Involved\n- Contact\n- Your Area\n- Policies\n- Login\n- Events",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/content_1.html": "🎉We did it! Thanks to your incredible generosity, we’ve hit our £28,000 target to fully fund Saba Poursaeedi’s legal fight for free speech!\nFeatured\nWe have published our draft budget for the next financial year. The Integrated Plan outlines how we will spend more than £1.1 billion on public services that touch the lives of all residents at every milestone, while also working to protect people in Hertfordshire who need the most support.\nFeatured\nHertfordshire County Council councillors have approved a motion on the 15th January to purchase New offices in Hemel Hempsted for a multi million pound deal and at the same meeting they were presented with budget plans that will require £42m of savings.\nPolitical parties must be honest with the public. Only factual information will be provided by Harpenden and Berkhamsted Reform; where possible, with links to verify it.\nWhat are Stealth Taxes?\nSt Albans Lib Dem run District Council leaders have decided to axe Senior Citizens' parking permits for the vast majority of Harpenden's pensioners. Only those receiving benefits will keep their permits.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_sw-branch-team/content_11.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nBranch Team\nAdd\nGroup by\nNone\nImage\nFull Name\nPosition\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_profiles_john-dowdle/content_33.html": "I have taken an interest in matters political since the very early 1980s. My first experience of being involved in a general election was in 1983. Since then, I have gained a BA Honours degree in Government and Politics and remained politically active in various ways. I subsequently went on to work as a College Lecturer in Politics and Business Studies in an FE College in Harrow. While there, I also gained a further Master of Arts (MA) degree in Government and Politics, as well as a teacher-training qualification: the Certificate in Education (Post-Compulsory Education) – i.e. to teach at Further and Higher Education level. I also worked as a GCE Advanced Supplementary (AS) and Advanced (A) Level Examiner in Politics for the University of London Board.\nI was elected to serve as a Councillor in Watford Central Ward between 1995 and 1999. During that time, I chaired their Grants Committee and held a number of Vice-Chair positions on a number of other council committees. I additionally served on the boards and management committees of a number of local community, social and charitable organisations.\nI took early retirement in 1997 and decided not to stand for re-election as a Councillor in 1999 so that I could spend more time with my wife.\nMy wife unexpectedly died in 2001, which left me considerably uncertain as to what I should be doing with my life. I ended up taking on a role of Manager of a local community centre for 9 years and Chair of Governors of a local primary school for 4 years. I was Chair of Watford Area Arts Forum for 6 years and became a Life Fellow of the Royal Society of Arts.\nSince then, I have gradually re-entered political engagement by joining the Reform UK Party as a member and election candidate.\nThe reason I decided to join Reform UK was because I liked their policies – especially national ownership of public utilities.\nI also believe strongly in the concept of democracy and I further believe that the stale old LibLabCon parties have betrayed the 2016 mandate the people of the United Kingdom gave to them to take the UK out of the European Union.\nAs the successor party to UKIP and the Brexit Party, Reform UK now offers the people of Great Britain and Northern Ireland an opportunity to have their voices listened to for the very first time in the history of our country.\nThis is why Reform UK is absolutely committed to reforming the UK national electoral system, reforming the cronyism of the second parliamentary chamber (usually known by the title of House of Lords) and reforming the system of national governance and administration such that popularly elected government ministers will henceforth have the power to command recalcitrant civil servants to do as they are told by elected ministers.\nWith Reform UK, the clue is in the name.\nWe want to see root and branch reform of the rotten and corrupt system of politics and governance within our United Kingdom. We offer an absolutely historic choice to all of our people to be able to vote for – and achieve – real and meaningful change in the UK. We WILL get Brexit done properly and we WILL change our system of elections and governance FOR THE BETTER.\nI am honoured to be acting in the Role of Chairman of Watford Constituency Reform UK Party.\nWe welcome all forms of support and any and all new members who wish to join us in our historic quest.\nJohn L. Dowdle\nI can be contacted by email on",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_policies_immigration-policy/content_61.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nPolicies\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_welwyn-hatfield_protected-status-for-garden-cities/content_23.html": "Giving Welwyn Garden City (and Letchworth Garden City) protected status to prevent building up the immediate area and to preserve their distinct character and aesthetic. Development in the area must not go beyond a certain height and buildings must remain spaced out for there to still be plenty of public garden.\nFurther developments can be satisfied, NOT by building up existing garden cities, but by building new garden cities elsewhere in Hertfordshire. We must preserve the principles of Ebenezer Howard or decrease its value as a place to live.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_david-johnson/content_77.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\ndavid johnson\nWebsite\ndavid+johnson\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_steve-adelantado/content_78.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nSteve Adelantado\nWebsite\nhttps://reformuk-herts.uk/north-east-herts/herts-wards\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_watford/content_24.html": "There are no articles in this category. If subcategories display on this page, they may have articles.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_david-rogers/content_76.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nDavid Rogers\nWebsite\nDavid+Rogers\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_hemel-hempstead_noel-wilcox-exposing-child-maintenance-support/content_44.html": "Noel’s been holding the Child Maintenance Service to account over disgraceful overcharging, profiteering, creating false debts, punitive enforcement, fraud and, sadly, driving people to suicide.\nThis is no joke!\nWhat Noel’s been investing is probably one of the most cold hearted and cruel scandals facing this country as he's uncovered evidence indicating a staggering £3.8 billion discrepancy in the system!\n@jemmah4723\nWhat a well informed guest. He has uncovered something huge here. The family court and CMS are a disgrace and have blood on their hands with what they put parents through.\n@Junit50legend\nGreat interview. Always the same story the ex stops you seeing her kid for no reason but it suits them. They ring CSA so they can get money out of you. You try get access to your child and fail miserably because the system is against you. This guys talks alot of sense. James please try get an advocate from Fathers 4 justice on the podcast.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_peter-hopper/content_66.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nPeter Hopper\nWebsite\nhttps://reformuk-herts.uk/herts-wards/stevenage\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_noel-wilcox/content_72.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nNoel Wilcox\nWebsite\nHttps://reformuk-herts.uk/herts-wards/hemel-hempstead\nContact Form\n*\nRequired field\nName\n*\nEmail\n*\nSubject\n*\nMessage\n*\nPrivacy Note\n*\nPrivacy Note\nBy submitting this form you agree to the Privacy Policy of this website and the storing of the submitted information.\nSend Email\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep_darren-selkus/content_68.html": "Darren Selkus\nContact Form\nMiscellaneous Information\nHad enough of the two party system and politicians that say one thing and do another ?\nI live in Hertsmere and am very happy to have been appointed our Reform UK Spokesperson.\nThe next General Election is 1 year away and I look forward to challenging Oliver Dowden MP and holding not only the Conservative Government but all of the Westminster establishment to account.\nWithout Reform UK there is no democracy and no choice. There’s little difference in policy between the Conservatives and Labour. Only Reform UK believes in a small State where we have more control over our own lives. Only Reform UK will end the Net Zero insanity that makes us poorer, less competitive and just exports CO2 emissions to other countries. Only Reform UK will reduce taxes and accelerate growth. Only Reform UK wants to control immigration and will radically reform our public services, including the NHS, to make them fit for purpose.\nIf you want change you have to change your vote.\nI’m not a politician and to be honest don’t want to be one. BUT we need change and I’m committed to making it happen.\nI’m a British Army veteran, CEO of the UV Group Plc and married with two kids and two dogs. This experience makes up for any inexperience in politics and better to represent and fight for the people of Hertsmere.\nUntil 2019 I had little interest in politics but became engaged after the result of the 2016 was ignored. I joined the Brexit Party and was selected as the Prospective Parliamentary Candidate for Epping Forest.\nThe fight is now to Change Politics For Good and what I’m here to do.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_stevenage_reformuk-stevenage-spreading-the-word/content_21.html": "All geared up and ready to go spreading the ReformUK word around Stevenage on a cold winter's day.\nThe enthusiastic team set about their business and meeting people on their doorsteps. Wonderful and warm receptions from the householders.\nWith a chill in the air this 26th January and warmth in their hearts, the team canvassed the area meeting people and dropping leaflets explaining all about why ReformUK has the momentum in politics.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_profiles_phillip-wells/content_41.html": "I’m recently retired, and have avoided any involvement in politics for the bulk of my life. However, a once great country is steadily being ruined by the self-serving political elites that run the Conservative and Labour parties. I joined Reform to do something concrete about it.\nFor the first half of my career I worked in metals manufacture, often in specialist areas such as tungsten or catalyst production. I have run departments, factories and a small company. Due to the steadily falling size of that industry, I moved into IT, where I’ve worked for a large multi-national software company and the world’s leading cyber security company. Unlike many of our politicians, who studied Philosophy, Politics and Economics at university, then tried to get elected as an MP as soon as possible, I’ve lived and worked in the real world – not inhabited the Westminster bubble. Reform stands for practical, real-world solutions, and not gesture politics from politicians who are insulated from the worst effects of the damage they cause. I loathe political spin with a passion, and believe in being honest with voters. There are hard choices ahead, and economic pain. As a country, we can no longer afford to pretend those problems don’t exist – like Labour and the Tories do. We must address them urgently, and I firmly believe Reform’s policies are the best way to do that.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/http_reformuk-herts_uk_herts-wards_south-west-herts/content_81.html": "There are no articles in this category. If subcategories display on this page, they may have articles.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_broxbourne_reform-uk-gains-ground-in-broxbourne-with-two-conservative-defections/content_19.html": "In a significant political shift within Hertfordshire's local government, two Conservative councillors have defected to Reform UK, marking a new chapter for the borough.\nGiles Hall, who has served as the Conservative Councillor for Flamstead End in Broxbourne since 2018, announced his defection to Reform UK on Sunday, February 2, 2025. This move makes Hall the first ever Reform UK Councillor within any borough in Hertfordshire.\nExpressing his disillusionment with the Conservative Party, Hall stated, “I have decided to leave the Conservative Party as now more than ever I believe it no longer represents conservative values... I believe the future must be with Reform UK.”\nFollowing closely, Siobhan Monaghan, the ward councillor for Cheshunt South & Theobalds, also announced her defection to Reform UK on Monday, February 3, 2025, becoming the second councillor in Hertfordshire to join the party within just 24 hours. Monaghan shared her reasons, saying, “I have become increasingly frustrated to see what is happening to our country and its people both at a local and national level. Only Reform UK have stepped forward and given us a clear path to change.”\nHamish Haddow, the Reform UK Broxbourne Branch Chair and Hertfordshire County Organiser, celebrated these developments. \"This is an exciting time for Reform UK and Broxbourne,\" Haddow declared. He further praised both Hall and Monaghan for their commitment to their communities and their alignment with Reform UK's vision. \"Broxbourne is now blessed with two Reform UK Councillors, and with this addition, we can begin to make a real difference,\" he added, emphasizing the urgent need for reform in the region.\nThese defections reflect a broader national sentiment of seeking new political pathways amidst dissatisfaction with traditional parties. Both councillors have expressed a strong belief in Reform UK's potential to better serve the residents of Broxbourne by addressing key issues like crime, migration, military investment, and leveraging Brexit benefits. This development signals a dynamic shift in local politics, indicating a growing appetite for change and new representation in Broxbourne, Hertfordshire.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_component_tags_tag_saba/content_50.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nEnter Part of Title\nFilter\nClear\nDisplay #\n5\n10\n15\n20\n25\n30\n50\n100\nAll\nSaba Poursaeedi\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted_harpenden-farmer-targeted-by-fly-tippers-almost-every-day-calls-for-more-police-power-to-give-firmer-punish/content_10.html": "A Harpenden farmer being targeted by fly-tippers \"almost every day\" is calling for the police to have \"more power\" to hand out more substantial punishments for those responsible. Will Dickinson, a sixth-generation farmer, from Harpenden, said the illegal dumping is impacting himself and other farmers financially, and it is also harming the environment and ruining the countryside in the Hertfordshire town.\nThe National Farmers’ Union (NFU) has long campaigned for more action to tackle the issue of fly-tipping. The NFU approximates that at least two thirds of farmers have been impacted by fly-tipping and the clear-up costs the industry tens of millions of pounds a year.\nThere is also a big strain on the public purse as local authorities and the Environment Agency deal with rubbish dumped on public land. Dumped rubbish also causes disrupts wildlife and pollutes land and watercourses.\nMr Dickinson, who runs an arable farm, said: “Fly-tipping is as bad now as it has ever been. It’s happening here almost every day. We’ve had all sorts of things dumped - from green waste, to nappies to bathroom suites.\n“We’ve even had asbestos left on the fields, meaning we’ve been unable to harvest areas of land, which is a huge inconvenience and cost to the business. This is one of the very few crimes where the victim has to pay the costs.”\nHe added: “It is legally the responsibility of the landowner to pay for removing the rubbish. Those who do get caught often receive a small fine when the landowner, the victim, has to pay out much more to clear up the mess.\n“Fortunately the local police sergeant here is hot on it and the district council has done a lot of work to try to tackle fly-tipping. But they need more power and the NFU is continuing to make our case with decision makers.”\nThis comes after it was reported earlier this year that fly-tipping cases across the country had fallen marginally. However, the figure - which is over a million incidents reported - is much higher than those recorded in 2018/2019 and 2019/2020, and part of a concerning overall trend.\nThis prompted the NFU to emphasise their call for immediate action to tackle fly-tipping on farmland. This includes making it simple for members of the public to reduce and recycle waste, and appropriately punish offenders who are caught dumping waste illegally with stronger fines.\nThe NFU also demand a consistent approach across the country where police, government agencies and local authorities are working more closely together to tackle the problem. The NFU believes the entire system needs to tackle fly-tipping at the source, from packaging design, recycling, landfill tax and tip opening hours, to make it simpler for the public to reduce, re-use and recycle waste.\nThey add that fair penalties should act as a deterrent to potential offenders - as well as more frequent enforcement measures - which are key to addressing the crime. A spokesperson for Hertfordshire Constabulary said: “We continue to work with farmers who are affected by fly-tipping, and have increased patrols in affected areas as a result.\n“We are working extremely closely with the council fly-tipping team and assist them with the installation of preventative measures, including cameras. When a fly tip is reported or found, we ensure we are looking for evidence and anything we find we pass to the relevant team. Both the police and council are doing everything they can to prevent and detect fly-tipping.\n“Fly tipping is illegal, and if you see it in action please call the police on 999 and report it as a crime in progress. You can also report all fly-tipping to your local council, whether your saw it in progress or not. For more information, please check the council’s SCRAP campaign (Let's SCRAP fly tipping | Hertfordshire County Council).”",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_herts-wards_south-west-herts/content_3.html": "There are no articles in this category. If subcategories display on this page, they may have articles.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_profiles/content_59.html": "Dear fellow residents of Tring.\nMy name is Andy White. I live in Tring with my wife and three children and a car with over 200,00 miles on the clock.\nIt's a privilege to stand for ReformUK as a councillor for our loved town of Tring.\nMy ambition is to unite our community under a shared vision of fairness, progress, and opportunity for all, whether you’re a lifelong local, a new arrival, a small business owner, or someone striving to make your mark, I believe that our strength lies in unity. ReformUK stands for genuine cross-roads in local politics that listens to your concerns, values your ideas.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_get-involved/content_25.html": "We are looking for supporters like you\n- Join our 'Hertfordshire gang'\n- Come to our local events and discussions\n- Deliver leaflets for your local candidate. They will be very very grateful for your support\n- Door Knocking - The most valuable activity you can volunteer for. Talking to people is critical to\nour success and the more good people we have knocking on doors for us, the better. - Street Stalls - Sited in busy areas, stalls are a great way to help us to spread our message.\n- Display a window poster or have a house board up outside your home.\n- We also have a variety of admin tasks in need of volunteers.\nHowever you help us it will be very much appreciated.\nBe a part of history, be part of the change you want to see, get involved today.",
  "https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted/https_reformuk-herts_uk_ward-rep/content_62.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nContacts,\nName\nDetails\nHamish Haddow\nAndrew White\nDavid Rogers\nKevin\ndavid johnson\nAdrian Steeples\nDavid\nCharlotte Yendall\nRoy Farrier\nThomas Holdsworth\nBroxbourne\nSaba Poursaeedi\nHarpenden & Berkhampsted\nNoel Wilcox\nHemel Hempstead\nJohn Burmicz\nHertford & Stortford\nDarren Selkus\nHertsmere\nSteve Adelantado\nNorth East Herts\nKeith Steers\nSouth West Herts\nJohn Dowdle\nSt Albans\nPeter Hopper\nStevenage\nEleanor Jackson\nWatford\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents"
}