{
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_2024_11_18_are-north-lincolnshire-councils-own-carbon-emissions-really-on-a-pathway-to-reach-net-zero-in-2030/content_14.html": "7th January 2023\nThere are significant problems with the Council’s plan to reach their target of Net Zero in 2030. Among them are the number of council-owned buildings that are now heated using biomass boilers with wood pellets or wood chip as fuel, replacing the previous gas boilers.\nBiomass\nBiomass boilers are claimed by the council to be carbon neutral, thereby reducing overall council CO2 emissions, but an increasing number of studies and countries are coming to the conclusion that biomass sourced from wood is not carbon neutral on any meaningful timescale.\nIn the council’s document ‘Planning for Renewable Energy Development’, it says:\n“Biomass is the combustion of wood and other plant materials in a stove or boiler to produce heat which can be used to generate electricity or other processes. Although biomass combustion gives off carbon dioxide, this represents release of the gas that was absorbed when the plant material grew, and thus biomass fuels are regarded as carbon neutral.”\nIn reality, compared to allowing woodland to grow, cutting it for bioenergy increases carbon dioxide emissions and worsens global warming for at least 50 years and possibly over 100 years depending on forest composition and climatic zone – time we do not have to reach net-zero emissions and avoid the worst harms from climate change. Claims of using only saw-mill waste in wood pellets have been widely shown to be untrue such as in the recent Drax powerstation investigation by BBC’s Panorama.\nEven Kwasi-Kwartang, a man not widely admired for his grip on numbers, believes that wood pellet biomass is not a sustainable energy resource. It appears that it is only a matter of time before subsidies for biomass heating systems will be removed.\nthe council’s own CARBON REDUCTION TARGETS\nThe council has set itself a CO2 reduction target of -25% by 2021 for its own yearly emissions, but even if this target is met, due its unaccounted-for biomass emissions, North Lincs Green Party research estimates that in reality, the reduction in yearly emissions is only half of this, a mere -13%:\nTarget Reduction: -4,500 tonnes CO2 (-25%)\nPlus unaccounted Biomass Emissions: +2,200 tonnes CO2 (+12%)\nEquals Actual Reduction of: -2,383 tonnes CO2 (-13%)\nEven recent claims by the leader of the council on Facebook Live that use of wood pellet biomass helps to reduce reliance on importing energy from countries such as Russia holds no water. There are similar supply problems and cost increases associated with wood pellets as we have seen with natural gas – why? – because as for gas, a large amount was imported from Russia!\nwhat do North Lincs Greens say?\nWe call for the current council policy that treats wood bioenergy as a carbon-neutral energy source to end. The carbon dioxide emitted from burning biomass pellets should be counted in the same way as emissions from all other fuels: fully, at the point of combustion and accounted for in the council’s own carbon emissions.\nNo new wood-fueled biomass heating systems should be installed and existing biomass systems replaced at the earliest opportunity. Existing low-carbon technologies such as energy efficiency, solar PV and air or ground source heat pumps should be used instead.\nFull details, including calculations used are attached as a PDF here.",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_tag_green-party-scunthorpe/content_17.html": "Introducing Greens in Scunthorpe 16 February 2025 / 16 February 2025 by Mark Bannister Wondered what The Green Party stand for? Wondered what The Green Party can do at the local level? Come and meet us! Everyone welcome. Please come along and pass this message on if you can. Read more » green party meeting scunthorpe green party scunthorpe mothin ali scunthorpe greens",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_contact/content_16.html": "Skip to content\nSkip to footer\nNorth Lincolnshire\nMenu\nNews\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nContact Us\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_tag_mothin-ali/content_8.html": "Introducing Greens in Scunthorpe 16 February 2025 / 16 February 2025 by Mark Bannister Wondered what The Green Party stand for? Wondered what The Green Party can do at the local level? Come and meet us! Everyone welcome. Please come along and pass this message on if you can. Read more » green party meeting scunthorpe green party scunthorpe mothin ali scunthorpe greens",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_news/content_18.html": "Introducing Greens in Scunthorpe 16 February 2025 / 16 February 2025 by Mark Bannister Wondered what The Green Party stand for? Wondered what The Green Party can do at the local level? Come and meet us! Everyone welcome. Please come along and pass this message on if you can. Read more » green party meeting scunthorpe green party scunthorpe mothin ali scunthorpe greens\nBarton Newsletter Nov 2024 – A Green Win! 18 November 2024 / 22 November 2024 by Mark Bannister 19th Nov 2024 You may remember from our previous newsletter that we were holding Anglian Water to account for sewage dumping into both Barton Haven and the outfall into the Humber SSSI with no plans to improve infrastructure. We found and exposed the appalling extent of sewage dumping into the SSSI and within the town […] Read more »\nStop the Sewage Dumping! 18 November 2024 / 19 November 2024 by Mark Bannister 29 September 2023 Recent research by North Lincs Green Party has uncovered the full extent of sewage dumping in our area. The top two Anglian Water ‘storm overflow’ events into the Humber both happened to be in North Lincolnshire and were at the following Sewage Treatment Works: Barton-upon-Humber: 1,420 hours duration over 2021; 111 times […] Read more »\nMay 2023 Election results 18 November 2024 / 19 November 2024 by Mark Bannister 29 September 2023 Thank you! Neil, Carol and Amie would like to thank the hundreds of Barton residents who voted for them at the May elections for North Lincs Council and Barton Town Council. Neil said “Despite missing out on the third North Lincs Council seat by just 65 votes, the election showed everyone the […] Read more »\nBarton Newsletter Jan 2023 18 November 2024 / 19 November 2024 by Mark Bannister 2nd Feb 2023 Working hard for a better environment Download the full 2-page newsletter as a pdf here. Read more »\nHow Green Is the Flixborough ‘Green Energy Park’ incinerator? 18 November 2024 / 19 November 2024 by Mark Bannister 11th February 2023 The Planning Inspectorate is currently looking at a proposal for a large facility – the ‘Green Energy Park’ at Flixborough – a waste incinerator with add-ons to make use of the heat and ash generated. But how green is the ‘Green Energy Park’? North Lincs Green Party research has found that: 1. […] Read more »\nVoter ID Requirement 18 November 2024 / 19 November 2024 by Mark Bannister 10 January 2023 Local elections, including Town and Parish elections, will be held on 4 May 2023. Please be aware that, for the first time, residents will need to show photographic ID to vote at polling stations at this year’s local elections, as well as for future UK general elections. Firstly, if you have […] Read more »\nAre North Lincolnshire Council’s OWN Carbon Emissions Really on a Pathway to Reach Net Zero in 2030? 18 November 2024 / 19 November 2024 by Mark Bannister There are significant problems with the council's plan to reach their target of net zero emissions by 2030 Read more »",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_2025_02_16_introducing-greens-in-scunthorpe/content_7.html": "Wondered what The Green Party stand for?\nWondered what The Green Party can do at the local level?\nCome and meet us!\nEveryone welcome. Please come along and pass this message on if you can.\nWondered what The Green Party stand for?\nWondered what The Green Party can do at the local level?\nCome and meet us!\nEveryone welcome. Please come along and pass this message on if you can.",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_tag_green-party-meeting-scunthorpe/content_5.html": "Introducing Greens in Scunthorpe 16 February 2025 / 16 February 2025 by Mark Bannister Wondered what The Green Party stand for? Wondered what The Green Party can do at the local level? Come and meet us! Everyone welcome. Please come along and pass this message on if you can. Read more » green party meeting scunthorpe green party scunthorpe mothin ali scunthorpe greens",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_2024_11_18_may-2023-elections/content_6.html": "29 September 2023\nThank you!\nNeil, Carol and Amie would like to thank the hundreds of Barton residents who voted for them at the May elections for North Lincs Council and Barton Town Council.\nNeil said “Despite missing out on the third North Lincs Council seat by just 65 votes, the election showed everyone the Barton residents care deeply about the environment and want to see action to improve it”.\nCarol added “With three Greens now on the Town Council we can start delivering on the priorities for the town”.\nAmie Commented “I am delighted to join Neil and Carol on the Town Council and excited about working with residents to improve the local environment over the next four years.”\nDownload the full election results for all wards as a pdf here.",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_donate/content_19.html": "We’re powered by people, not big business\nYour donation will help us get Greens elected.\nThe Green Party is funded through donations by individuals like you. We don’t take donations from businesses that are trying to sway our politics. Politics is about people, and delivering a society that puts them first. Can you donate to help us get Greens elected?",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_2024_11_18_voter-id-requirement/content_12.html": "10 January 2023\nLocal elections, including Town and Parish elections, will be held on 4 May 2023.\nPlease be aware that, for the first time, residents will need to show photographic ID to vote at polling stations at this year’s local elections, as well as for future UK general elections.\nFirstly, if you have not already done so, register to vote online here.\nIf you are already registered to vote, you still need to have an acceptable form of ID to enable you to vote at a polling station. You do not need this if you are registered for a postal vote. Find a list of accepted forms of photo ID here, or go to the council website here.\nIf you don’t have any of these accepted forms of photo ID, or no longer look like the photograph on your ID, or the name on your photo ID is different to your name on the electoral register, then other alternatives are:\n- Apply for free ID online at the Government Voter Authority Certificate website or by completing a paper form (see below). This free ID will be known as a Voter Authority Certificate. Note that a photograph will be needed for the Voter Authority Certificate.\nOR\n- Apply for a postal vote online, details here, or by completing a paper form (see below). Note that a postal vote does not require a photograph, only a signature, so may be the simplest option.\nTo obtain a paper form through the post for you to complete and post back to apply for either a Voter Authority Certificate, or for a postal vote, contact the council. We are awaiting confirmation, but believe the correct contact details for both forms are:\nThe Elections Office on elections@northlincs.gov.uk or by calling 01724 296245 and a form will be posted out to you.\nPlease act soon so that you can make your vote count on 4th May.",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_tag_scunthorpe-greens/content_11.html": "Introducing Greens in Scunthorpe 16 February 2025 / 16 February 2025 by Mark Bannister Wondered what The Green Party stand for? Wondered what The Green Party can do at the local level? Come and meet us! Everyone welcome. Please come along and pass this message on if you can. Read more » green party meeting scunthorpe green party scunthorpe mothin ali scunthorpe greens",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_author_mark-bannister/content_4.html": "16 February 2025 / 16 February 2025 by Mark Bannister\nWondered what The Green Party stand for? Wondered what The Green Party can do at the local level? Come and meet us! Everyone welcome. Please come along and pass this message on if you can.\nRead more »\n18 November 2024 / 22 November 2024 by Mark Bannister\n19th Nov 2024 You may remember from our previous newsletter that we were holding Anglian Water to account for sewage dumping into both Barton Haven and the outfall into the Humber SSSI with no plans to improve infrastructure. We found and exposed the appalling extent of sewage dumping into the SSSI and within the town […]\n18 November 2024 / 19 November 2024 by Mark Bannister\n29 September 2023 Recent research by North Lincs Green Party has uncovered the full extent of sewage dumping in our area. The top two Anglian Water ‘storm overflow’ events into the Humber both happened to be in North Lincolnshire and were at the following Sewage Treatment Works: Barton-upon-Humber: 1,420 hours duration over 2021; 111 times […]\n29 September 2023 Thank you! Neil, Carol and Amie would like to thank the hundreds of Barton residents who voted for them at the May elections for North Lincs Council and Barton Town Council. Neil said “Despite missing out on the third North Lincs Council seat by just 65 votes, the election showed everyone the […]\n2nd Feb 2023 Working hard for a better environment Download the full 2-page newsletter as a pdf here.\n11th February 2023 The Planning Inspectorate is currently looking at a proposal for a large facility – the ‘Green Energy Park’ at Flixborough – a waste incinerator with add-ons to make use of the heat and ash generated. But how green is the ‘Green Energy Park’? North Lincs Green Party research has found that: 1. […]\n10 January 2023 Local elections, including Town and Parish elections, will be held on 4 May 2023. Please be aware that, for the first time, residents will need to show photographic ID to vote at polling stations at this year’s local elections, as well as for future UK general elections. Firstly, if you have […]\nThere are significant problems with the council's plan to reach their target of net zero emissions by 2030",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_people/content_9.html": "Your town councillors\ncouncillor neil jacques\nBarton Town Council\nNeil has recently retired from over 30 years public service in local government in Museums and the Arts. He was re-elected to Barton Town Council in May 2023. He was a Green Party councillor on Glanford Borough and Barton Town Council in the 1990s and has been a Governor at two local schools for 20 years.\nA keen gardener and allotment holder, he’s passionate about protecting the natural environment for future generations. He strongly believes we must balance environmental protection with social justice and economic fairness, to ensure a future for the common good – for the majority, not just the few served by all the other political parties.\ncouncillor carol thornton\nBarton Town Council\nCarol was re-elected to Barton Town Council in May 2023. She is now retired but worked in Community Development, and agreed to stand because so many people asked her about problems she thought she would be in a position to help them out. Carol wanted to put the Green point of view when matters such as planning were being debated. Greens don’t like waste and are in favour of conservation and helping those who need it.\ncouncillor Amie alissa watson\nBarton Town Council\nAmie was elected to Barton Town Council in May 2023. She works as an environmental consultant across North Lincolnshire; is Community Fridge Coordinator and Community Food Coop Founder. She also runs Warm Spaces Food Clubs. Amie aims to keep climate change, environmental issues and the protection of nature high on the agenda.\nYour Local Officers\ncarol thornton\nCo-ordinator\nContact: coordinator@northlincs.greenparty.org.uk\nneil jacques\nChair, Nominating Officer & Local Party Contact\nContact: nlgparty@gmail.com\njenny haynes\nTreasurer & Internal Elections Officer\nContact: nlgparty@gmail.com\nmembership\nMembership Secretary\nContact: membership@northlincs.greenparty.org.uk\nmark bannister\nWebsite Officer\nContact: mbanni15@gmail.com\nalan robinson\nNewsletter Officer & Second PPERA Officer\nContact: alan@crosskeysassociates.com\nsocial media\nSocial Media Officer\nContact: nlgparty@gmail.com\nAnn hindley\nArea Coordinator Isle of Axholme\nContact: nlgparty@gmail.com\nrichard willis\nArea Coordinator Scunthorpe\nContact: nlgparty@gmail.com\nvacant\nVarious Roles\nContact: nlgparty@gmail.com",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_2024_11_18_barton-newsletter-nov-dec-2024/content_3.html": "19th Nov 2024\nYou may remember from our previous newsletter that we were holding Anglian Water to account for sewage dumping into both Barton Haven and the outfall into the Humber SSSI with no plans to improve infrastructure. We found and exposed the appalling extent of sewage dumping into the SSSI and within the town itself.\nIt was pointed out to Anglian Water that we believed this went well beyond their legal ability to discharge in ‘exceptional circumstances’ and that there were other cases where legal action was being taken.\nWell, we are pleased to announce that hard work and persistence pays off. Although hope can be risky, ….sometimes you really do win (with thanks to David Graeber):\nGreens welcome Anglian Water’s U-turn and their promise to stop dumping sewage.\nFor this story and all other Barton news, download the full 2-page newsletter as a pdf here.\nFull details of our research into the sewage dumping that we exposed here.",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_category_local-news/content_13.html": "16 February 2025 / 16 February 2025 by Mark Bannister\nWondered what The Green Party stand for? Wondered what The Green Party can do at the local level? Come and meet us! Everyone welcome. Please come along and pass this message on if you can.\nRead more »\n18 November 2024 / 22 November 2024 by Mark Bannister\n19th Nov 2024 You may remember from our previous newsletter that we were holding Anglian Water to account for sewage dumping into both Barton Haven and the outfall into the Humber SSSI with no plans to improve infrastructure. We found and exposed the appalling extent of sewage dumping into the SSSI and within the town […]\n18 November 2024 / 19 November 2024 by Mark Bannister\n29 September 2023 Recent research by North Lincs Green Party has uncovered the full extent of sewage dumping in our area. The top two Anglian Water ‘storm overflow’ events into the Humber both happened to be in North Lincolnshire and were at the following Sewage Treatment Works: Barton-upon-Humber: 1,420 hours duration over 2021; 111 times […]\n29 September 2023 Thank you! Neil, Carol and Amie would like to thank the hundreds of Barton residents who voted for them at the May elections for North Lincs Council and Barton Town Council. Neil said “Despite missing out on the third North Lincs Council seat by just 65 votes, the election showed everyone the […]\n2nd Feb 2023 Working hard for a better environment Download the full 2-page newsletter as a pdf here.\n11th February 2023 The Planning Inspectorate is currently looking at a proposal for a large facility – the ‘Green Energy Park’ at Flixborough – a waste incinerator with add-ons to make use of the heat and ash generated. But how green is the ‘Green Energy Park’? North Lincs Green Party research has found that: 1. […]\n10 January 2023 Local elections, including Town and Parish elections, will be held on 4 May 2023. Please be aware that, for the first time, residents will need to show photographic ID to vote at polling stations at this year’s local elections, as well as for future UK general elections. Firstly, if you have […]\nThere are significant problems with the council's plan to reach their target of net zero emissions by 2030",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_2024_11_18_how-green-is-the-flixborough-green-energy-park-incinerator/content_10.html": "11th February 2023\nThe Planning Inspectorate is currently looking at a proposal for a large facility – the ‘Green Energy Park’ at Flixborough – a waste incinerator with add-ons to make use of the heat and ash generated. But how green is the ‘Green Energy Park’?\nNorth Lincs Green Party research has found that:\n1. In the applicant’s own statement, the actual emissions are enormous, making it North Lincolnshire’s 6th largest emitter.\n2. The proposal claims it will create electrical power from the heat generated by burning the waste, thereby lowering its impact, but ignores the fact that any new power generation today is likely to be by clean renewables such as wind or solar power with near-zero emissions.\n3. Any carbon capture and storage that may happen in the future is limited to only 1% of emissions, making claims of a ‘Green Energy Park’ a nonsense. ‘Greenwash Energy Park’ would be a more fitting description.\n4. Too many incinerators in the UK results in less recycling of waste, as when more waste is burnt, the profits for the owners increase. There are enough incinerators in the UK already.\n5. The majority of waste will be brought in by road with all the associated emissions and noise for local residents. Rail will only be used later if an operator can be found and if it is cheaper than by road.\nIs North Lincolnshire Council for or Against the Incinerator?\nThere appears to be conflicting information on whether the political leadership within the council is for or against the new incinerator. The leader of the council claims to be against it if sited at Flixborough, but the applicant claims to be in talks with the council about sale of council-owned land for the development there.\nWhat Does North Lincs Green Party Say?\nNorth Lincs Green Party opposes the use of incineration of waste whether it is at Flixborough or the South Humber bank for the following reasons:\n1. It relies on a continuous stream of waste to be produced to feed it, taking the focus away from reducing waste, reusing unwanted items and materials and recycling. If the proposed incinerator at Flixborough is built, the resulting over-capacity of incinerators in the UK will only make this worse.\n2. This proposal relies on the unproven technology of carbon capture to make it greener, but the amounts proposed to be captured and stored are tiny, making it little more than ‘greenwash’.\n3. North Lincolnshire’s CO2 emissions will significantly increase as a result of this new facility instead of the required reduction of more than 14% each year to meet targets to limit climate change.\nMore detailed information is given here.",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk/content_1.html": "REAL HOPE. REAL CHANGE.\nThe Green Party is growing fast. We now represent people in Westminster and in a record number of local councils across the country.\nHere in North Lincolnshire, we have activists across the county and three hard-working Green councillors on Barton town council. But we have far higher ambitions:\n- We are on the brink of delivering the first Green councillors on North Lincolnshire Council.\n- An exciting new Green group in Scunthorpe is forming.\nWe’re working on local issues; to improve the lives of all people in North Lincolnshire, and to improve our local environment.\nGet involved with us today so that we can achieve so much more for North Lincolnshire.\nWant to hear about the work we’re doing?\nNews\nFind out what we’ve been up to, about issues in your area, and see the work we’ve done in the past.\n- Introducing Greens in Scunthorpe\n- Barton Newsletter Nov 2024 – A Green Win!\n- Stop the Sewage Dumping!\n- May 2023 Election results\n- Barton Newsletter Jan 2023\nUpcoming Events\nGet involved to help get Greens elected. A Green Councillor can make a world of difference to your local area.\n- No upcoming events",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_2024_11_18_barton-newsletter-jan-2023/content_2.html": "18 November 2024 / 19 November 2024 by Mark Bannister\n2nd Feb 2023\nWorking hard for a better environment\nDownload the full 2-page newsletter as a pdf here.",
  "https_northlincs_greenparty_org_uk_/https_northlincs_greenparty_org_uk_2024_11_18_stop-the-sewage-dumping/content_15.html": "29 September 2023\nRecent research by North Lincs Green Party has uncovered the full extent of sewage dumping in our area.\nThe top two Anglian Water ‘storm overflow’ events into the Humber both happened to be in North Lincolnshire and were at the following Sewage Treatment Works:\nBarton-upon-Humber: 1,420 hours duration over 2021; 111 times per year\nWinteringham: 3,020 hours duration over 2021; 136 times per year\nYou would be forgiven for thinking this must surely be some kind of mistake, but no, you read that right. Equivalent to over 4 months of constant raw sewage overflow at Winteringham and 2 months of constant raw sewage overflow at Barton. Both incredible and appalling in equal measure.\nThere is a long-term plan for upgrading Anglian Water infrastructure (2018). Shockingly, neither Winteringham or Barton appear on it and Anglian Water confirmed to us there were no plans to do so.\nWhat do North Lincs Greens Say?\nWe say this is completely unacceptable to both North Lincolnshire residents and the Humber SSSI into which the raw sewage, microplastics and other pollutants enter. We demand action:\nFrom Anglian Water:\nAdd both Winteringham and Barton-upon-Humber Water Recycling Centres and Pumping Stations to the list of infrastructure that is in need of urgent upgrade.\nFunding for retrofit SuDS solutions (Sustainable Drainage Systems) such as ‘smart’ residential water butts.\nFrom North Lincolnshire Council:\nRetrofit SuDS on NLC car parks, roads and properties such as schools and leisure centres. This will reduce yearly charges paid by North Lincolnshire Council to Anglian Water to process this water. It will also reduce carbon emissions allocated to NLC that were previously required for the processing of this water run-off.\nFind out more by downloading this pdf report here."
}