{
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies_north-cornwall_fishing/content_15.html": "Fishing Industry in North Cornwall\nTop 5 Reasons Why You Should Care About UK Fishing Industry\n- UK Government has ceded fishing rights, our sovereign nautical territory and our fish to the European Union (EU).\n- UK fishing could be worth up to £6Billion and provide a significant boost to jobs and our economy.\n- For every one job at sea, another 8 high paid jobs are needed on shore.\n- Of the total quota of fish processed and consumed within the EU 80% are fished from UK waters.\n- UK Government has issued at least 130 “free of charge” licenses to France. UK fishing boats must pay between £80k - £100k for a fishing license. This is a blatant slap in the face for UK fisherman from a Conservative government that has consistently been anti UK fishing since 1973.\nSupporting Cornish Fishing\nThe fishing industry in the UK has been utterly decimated since Ted Heath’s Conservative government gave away our fishing rights more than 40 years ago when we joined the European Union on 1 January 1973.\nThe United Kingdom is an island that is surrounded by some of the richest fishing grounds in the world. This abundance is extremely lucrative and this is why the European Union (EU) is interested in exploiting our sovereign waters.\nTime and time again, UK Government has let down our coastal communities by sacrificing our fishing industry to other national service industries such as banking and finance. By denying those communities reasonable access and quotas to our own sovereign waters, coastal communities which once thrived due to the fishing industry have been left deserted, hopeless and depressed.\nWith the current government policies of sacrificing our natural resources to overseas interests, not only are we sleepwalking into more resource crisis but also risking our own national food security.\nFish around our coastlines are an asset worth billions of pounds per year to our national economy. This asset is owned by each and every UK citizen. Can you remember ever being asked whether you were happy with giving our assets and wealth away to third parties, I certainly can’t?\nCurrently, there are 186 coastal constituencies in the UK. Interestingly, during Brexit, all 186 MPs representing coastal constituents voted for the disastrous “oven ready” Brexit deal that continued to cede fishing access and rights from UK fishing industry to the EU.\nReform UK strongly believes that our own national resources must be used, first and foremost, to secure the prosperity and well-being of our nation.\nMission Statement\nBringing our fishing industry back to the people of the UK is long over due. If elected as your MP for Reform UK, I will commit to investigating what can be done, if anything, to encourage expansion of commercial fishing in Newquay, Bossiney and Boscastle.\nOn a national level, I will work to support our Reform UK colleagues to make the changes necessary to bring our fishing wealth back to the UK.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies_north-cornwall_cdbc/content_6.html": "Central Bank Digital Currency (CDBC)\nYou may be familiar with or heard of digital currency. Bitcoin is an example of a digital currency that has been around for many years.\nA CDBC is (like Bitcoin) also a form of digital currency. However, this is where the similarities end.\nUnlike Bitcoin which uses a de-centralised model (i.e. no one controls Bitcoin) , CDBCs are centralised in nature. Centralised means that it is controlled by a central authority (probably the Bank of England).\nWhy Centralised Currency Can Be Bad For You\nWith a CDBC it will be possible for Governments to easily mess around with your money. For example, a CDBC will allow UK GOV to easily:\n-\nIssue CDBCs that can only be spent on specific goods or services. Like meat? Well your love for real meat might not fit in with UK GOV climate policies and therefore it will be possible to stop you buying meat.\n-\nCDBCs are programmable and can be set with an expiry date. You’d better keep a diary of when you need to spend your CDBCs by.\n-\nIf UK GOV (or one of its powerful sponsors) doesn’t like what you said online about it or one of its controversial policies, it is possible to easily revoke your CDBCs thus leaving you without any ability to pay bills for basic necessities such as rent, food, heat, clothing etc.\nUK Gov Currently Exploring CDBCs\nReferences:\nMy View on CDBCs\nI do not believe that CDBC is a good thing for our democracy or our individual freedom to choose how we transact for goods and services and with whom.\nAs such, I will strongly oppose any measures to introduce CDBCs to the United Kingdom.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies_north-cornwall_town-centres/content_10.html": "Supporting Cornwall Towns\nNorth Cornwall has a lot to offer in terms of beautiful landscapes and beaches. It also has some of the most attractive and diverse town centres with a wonderful selection of shops and attractions ranging from the staple national brands through to artisan and creative boutique family run businesses.\nSadly, in town centres across Cornwall, it is true than many businesses are struggling to stay afloat. This is due to many issues such as the rising cost of living and increasing costs for rent, energy, staff and so forth.\nWhat is needed for these businesses to survive and thrive is more customers coming through the door. This is not a difficult concept to grasp but it seems to have been a challenge to implement by many local authorities over many years.\nTo encourage more customers to visit these struggling businesses, we need to focus attention on how to attract more people to in our town centres. As successful plan will include looking at public transport together with improving the parking situation in terms of availability and affordability.\nIf we can make the prospect of visiting our town centres desirable and affordable, then we will encourage more people to visit, shop and enjoy our wonderful Cornish town centres.\nRight now, our town centres are under threat and businesses are closing. No one wants to see our town centres made up of boarded up shop fronts. Let’s take some positive action now to ensure that our towns are around in the future for our children to enjoy.\nMission Statement\nIf elected as your MP for North Cornwall, I will prioritise getting our town centres into a better position.\nTo set expectations, this is not an easy task and there are many years of neglect and under investment to be reversed. However, with the right level of commitment, I do believe that it is possible to do a lot better to support our wonderful and hard working business owners in our town centres.\nTown centres in North Cornwall deserve to thrive. Thriving town centres in North Cornwall will be positive for local communities as well as boosting the economy via increased tourism.\nFirst 100 Days\nMy commitment to North Cornwall for the first 100 days in office will be to ensure that town centres are prioritised to initially ensure stability and stop the ongoing decline in town centres through business closures.\nOnce we have a solid direction on sustainable town centres, it will then be possible to consider what measures can be taken to promote growth and prosperity within our town centres.\nThe plan\n- Identify key stakeholders in improving town centres, business owners, parking companies, local authorities, public transport providers etc.\n- Initial consultation with key stake holders.\n- Create a sustainable set of achievable objectives based on initial consultation with stake holders.\n- Work with and support stake holders in creating a working group of dedicated individuals with an interest in moving forward with implementing the short and medium term plans for sustainability and growth of foot fall to our town centres.\n- My ongoing support in any way needed to ensure that The Plan maintains momentum over the coming years to secure our town centres for future generations to enjoy.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies_north-cornwall_farming-farmers-movement-cornwall/content_14.html": "Agricultural Reform Bill Proposals\nAbout Farmers Movement Cornwall\nFacebook group Farmers Movement Cornwall states:\nWe stand in solidarity with the wider UK and European farmer protest movements who oppose green policy overreach and globalist attacks on the farming sector which threaten both national food security and the livelihoods of farming families. The hardworking, tax paying people of this £16 Billion annual turnover industry have been pushed too far for too long ENOUGH IS ENOUGH! The time has come to organise and stand together to demand change. A comprehensive AGRICULTURAL REFORM BILL proposed by a well organised farmers protest movement which has the support of related industries and the general public is how to achieve this. This group aims to connect people and ideas together to achieve the above stated aims so please join and share the group with everyone you know within the county. Please keep posts within the context of the groups aims. NO FARMERS NO FOOD NO FUTURE!\nThe following proposals are provided courtesy of farmer pete.\ni) the strengthening of protections for farmers within Farm Business Tenancies. Over 30% of agricultural land in England and Wales is in some form of farm business tenancy so the importance of good regulation around tenancies cannot be underestimated. Not only are significant amounts of farmers affected by tenancy conditions but the sector provides a vital role in that it matches those without sufficient capital who want to farm to those with sufficient capital who do not wish or are unable to farm. This is an essential form of liquidity within the agricultural economy. All farm business tenancies should become formal to assure tenants of their rights. We propose to increase the minimum term of farm business tenancies to 7 years with a minimum 3 year notice to cease. Landlords who do not offer minimum 7 yr rental terms will be penalised by not being able to claim agricultural property relief on their assets for inheritance tax purposes. Landlords will no longer have the right to take land out of tenancies for other land management schemes without tenant consent. Tenants should be granted full rights to engage in farm diversification and fair representation must be guaranteed for the tenant to challenge any decision by the landlord to deny permission.\nii) the prevention of foreign ownership of farmland. British farmland is a natural asset for the national good of the British people and it must remain that way, its preservation and necessity should never be overlooked therefore prevention of foreign corporate or private ownership should be prohibited.\niii) the maximisation of British produce procurement in public food supply contracts. Public institutions such as schools, hospitals and prisons etc should be legally obliged to purchase British produce not to a certain quota level but whenever it’s available. Derogation should only be allowed for dishes of specific ingredient provenance or for religious faith.\niv) the creation of tax and business rate breaks for farm shops and small producers. This would support beneficial diversification enterprise and help farmers and growers to be competitive in the retail space. Furthermore it would encourage consumers to buy direct and by doing so improve food supply chain resilience in the UK.\nv) the prohibition of loss leading sales tactics on any fresh produce by supermarkets. Give legal powers to the groceries code adjudicator to prevent this type of marketing activity which undermines the public perception of the real cost of fresh produce. To be clear, these regulations would not prevent produce nearing its best before date from being sold at reduced prices, it would apply to in date produce knowingly being sold at below profitable retail value by large supermarkets under a ‘loss leading’ marketing policy.\nvi) the improvement of subsidy support for woodland wildlife corridor creation. There is a clear benefit to woodland creation in certain circumstances and although this would need to be tightly regulated so as to not endanger food security we support this form of stewardship. The benefits to wildlife and to run-off and soil erosion prevention on land adjacent to waterways is undeniable as is the enhancement to the aesthetic appeal of the countryside and there are instances where the creation of small ‘connective or protective’ areas of woodland are justified on a cost benefit analysis favouring long term farm system sustainability. However there are matters which do need to addressed with regard to the financial impacts on farm profitability caused by woodland creation. Capital funding should cover all costs of planting, fencing and early years management of new woodland and subsidy schemes should compensate for the loss of forward income and devaluation of land. We call for a review of the subsidy and grant schemes relating to woodland planting so that all these matters can be considered and that all parties gain from this beneficial form of environmental development. We propose that full forward loss of income from such schemes be factored into annually recurring subsidy payments and that full agricultural land sale value be retained on any new parcels converted to woodland in order to preserve full loan to asset value potential for farmers.\nvii) the promotion of bio fuel crop production on marginal or flood prone land. Independent energy security is also of vital national interest therefore bio fuel production is a good second best option to food production in flood plain and other at risk areas and we would like to see improved subsidy and commercial support for this sector.\nviii) The continuation of research and development into regenerative farming practices. Farming techniques are continually evolving and we can farm in ways which enhance long term food system security without compromising on yield or our self sufficient food security. For example the use of deep rooted herbal leys which offer more deluge rain protection and drought resistance to the soil should be encouraged and subsidy should cover the 30% extra cost. Funding levels for research into the development and evaluation of such weather resistant crops and practices should be reviewed to ensure they are fit for purpose within a new climate change policy framework based on the significantly less costly ‘adaption to change’ approach rather than the one presently centred on a grossly expensive ‘prevention by net zero CO2 reduction’.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies_national/content_8.html": "less than 1 minute read\nReform UK - North Cornwall\nPlease see Reform UK website for national policies.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies_north-cornwall_coast-sewerage/content_18.html": "Supporting Clean Beaches in North Cornwall\nNorth Cornwall is home to some of the worlds most beautiful beaches. Millions of people annually make the effort to visit our county to enjoy the beaches and ocean in our area. Visitors to our county bring in millions of pounds and support our tourism industry.\nSadly, we have an ongoing problem in the form of unplanned sewerage discharges into the sea in North Cornwall. This problem has been around for many years and threatens not only our beautiful beaches but also the health of local residents and our tourist visitors. It has not been enough of a priority for local politicians and authorities to get much done to make a positive impact.\nMission Statement\nBy committing to deal with the sewerage issue, my aims are as follows:\n- Reduce the health risks of swimming in our local sea for locals and visitors.\n- Improve the local economy through improved sustainability of local tourism.\nFirst 100 Days\nIf elected as Reform UK MP for North Cornwall, within the first 100 days in office, I would create a plan to deal with unplanned sewerage discharges in North Cornwall.\nThe plan\nWith the right level of commitment, I do believe that the problem of sewerage discharge into our oceans in North Cornwall can be solved. To this end, the general approach would be:\n- Identify key stakeholders. e.g. Local council, local parish, water authorities, activists and charity groups.\n- Work with stakeholders to create a vision statement of what we would like to see for the area in terms of reasonable, quantifiable and measurable results for improving sewerage issues to our beaches and ocean.\n- Working with stakeholders, create a fiscally sustainable and sensible plan for how this project can be funded, the investment aims and opportunities as well as a declaration of environmental responsibility. We can, with the right messaging, position North Cornwall as being one of the cleanest areas in the UK to visit for tourism.\nAt the end of the 100 days, I would have an initial draft of a workable plan in place and report back to constituents. At any time in the first 100 days and for a period afterwards, I would welcome constituents input to the draft plan.\nSewerage Discharge\nKey Facts\nSurfers Against Sewerage issued the following data:\n- Over the course of 2020 and 2021, sewage has been dumped into the ocean and rivers around the UK more than 770,000 times. That’s almost 6 million hours of sewage flooding our beaches and river banks that many of us surf, bathe and play in.\n- Since October 2021, a total of 9,216 sewage pollution alerts for locations included in the Safer Seas & Rivers Service, 2,053 of which were during the 2022 bathing season alone.\n- Over 39% of sickness case studies reported to us correlate to sewage discharge alerts. And 63% of cases that were reported to a doctor were attributed to poor water quality.\nThe link between sewage pollution and illness is clear. Over the last 12 months, SaS received 720 sickness reports, highlighting when and where people have been getting sick after playing in the water. Almost 70% of people reported suffering from stomach upsets (gastroenteritis) and 1 in every 15 cases reported multiple illnesses.\nWorryingly, it was found that over 400 reports of sickness were from official bathing waters classified as ‘excellent’.\nDry Spills in North Cornwall\nSewerage overflows have been designed to operate with an emergency release valve system to be used in exceptional circumstances to reduce the risk of sewerage backing up into local homes. Rules exist as to when these valves for emergency sewerage discharge to our oceans can be activated. The rules as defined by The Urban Waste Water Treatment Regulations only allow sewerage overflows to be discharged in the event of ‘unusually heavy rainfall’. However, government has admitted that sewerage overflows are being used substantially beyond their intended purposes and it these spills that are described as “Dry Spills”.\nAccording to SaS, Porthtowan beach has a bathing water classification of ‘Excellent’ but experienced at least one dry spill event in 2022.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies_north-cornwall_wef/content_9.html": "Say No to The World Economic Forum\nThe World Economic Forum (WEF) is an unelected body of wealthy and influential individuals that believe they know what is best for the rest of humanity.\nWith representatives from decision makers in big business, finance and politics, the WEF steers policies and finance that affects all of our lives. These decisions and the consequences are made without our consent and generally without political debate or scrutiny.\nSome examples of significant impacts on our lives as a direct result of WEF driving policies are:\n- Net Zero. Increased taxation and energy prices for us all in order to meet objectives stated in Agenda 2030 together with the relentless push us all to buy expensive Electric Vehicles (EVs).\n- The Great Reset. “You will own nothing and be happy”\nThe WEF is the exact opposite of democracy and is accountable to no one. It might be suggested that the WEF is a prime example of what happens when there is no democratic oversight or accountability in that many describe the WEF in terms that include:\n- Technocracy\n- Tyranny\nKlaus Schwab\nThere is much written about Klaus Schwab, the founder of WEF. There is sufficient cause for concern that Mr. Schwab has been directly, and via his WEF, been involved in the capture of democratic structures and institutions.\nMany of our own members of parliament are known to be actively associated with WEF and Mr. Schwab.\nTop 5 Reasons Why We Care About WEF Influence in North Cornwall\n- As expressed in the 2016 EU referendum, North Cornwall wants its freedom and autonomy from centralist big governance. This includes federated organisations such as the EU but also from globalist unelected bodies such as the WEF.\n- One of North Cornwall’s significant industries is farming. Farmers want to be left alone to work to create food, dairy and meat produce to sustain us all. The last thing that farmers need or want is yet more legislation and boxes to tick particularly where this originates from opaque, unaccountable globalist elite forums.\n- WEF policies include various suggestions that would restrict travel and mobility such as “15 minute cities” and the progressive pushing of personal powered transportation out of the reach of many of our hard working population (e.g. think expensive EVs and the removal of Petrol and diesel cars by 2030s). This will be disastrous for Cornwall in terms of its tourist industry and associated businesses.\n- WEF not only drives policies on its “green” obsession but also is a major influencer in creating investment products (via BlackRock ESG funds) that will restrict inbound investment to Cornwall based on an arbitrary set of criteria determined by WEF and other unaccountable globalist institutions.\n- The objectives of the WEF (e.g. centralist control of issues ranging from your finances, freedoms and health) do not necessarily align with the freedoms that every UK citizen is entitled to as a birthright of living in a free democracy. This is as true for North Cornwall as it is for each and every citizen of the UK.\nMy Position on WEF\nI do not support and refuse to be associated with WEF. It is also Reform UK policy to have nothing to do with WEF. As your parliamentary candidate, if elected, I would identify and strongly work to remove any existing WEF influence to North Cornwall and would be accountable to my constituents to do so.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_contact/content_19.html": "Contact Reform UK (North Cornwall)\nWe operate normal office hours (Mon-Fri 0900-1700) and will aim to respond to your inquiry within 2 working days.\nWe operate normal office hours (Mon-Fri 0900-1700) and will aim to respond to your inquiry within 2 working days.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies/content_3.html": "Skip to primary navigation\nSkip to content\nSkip to footer\nReform UK - North Cornwall\nPolicies\nCandidate\nSign up\nToggle search\nToggle menu\nReform UK Policies\nless than 1 minute read\nHome\n/\nReform UK Policies\nToggle Menu\nReform UK National Policies\nPosition Statements (North Cornwall)\nCoastline Sewarage\nTown Centres\nFarming\nFarming (Reform Proposals)\nFishing\nTourism\nBrexit\nWorld Economic Forum (WEF)\nClimate Change\nDigital IDs\nDigital Currency (CDBC)\nReform UK - North Cornwall\nPolicies\nNational\nNorth Cornwall\nEnter your search term...",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies_north-cornwall_digital-ids/content_11.html": "Digital Identification (ID)\nDigital identity verification for all citizens of the United Kingdom is a\npossiblity currently being considered by UK Gov.\nReform UK will put an immediate halt to this clear and unacceptable\nattack on our individual rights as soveriegn citizens.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_north-cornwall/content_7.html": "North Cornwall Policies Coastline Sewerage Town Centers Farming Farming Reform Proposals Fishing Tourism Brexit World Economic Forum (WEF) Climate Change Digital IDs Digital Currency (CDBC)",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com/content_1.html": "Cornwall and Britain is broken. None of our public services work any more. In 2024, we have the highest taxes in 70 years and yet public services continue to get worse by the day.\nCornwall and Britain is broken. None of our public services work any more. In 2024, we have the highest taxes in 70 years and yet public services continue to get worse by the day.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies_north-cornwall_farming/content_4.html": "Supporting Cornish Farming\nThe future for British agriculture can be bright if the seize the opportunities of the UK being able to chart its own course on the global market. Sadly, opportunities are being squandered through official red tape and bureaucratic over reach.\nFarmers in Cornwall just want to be able to be productive by raising healthy livestock, growing good crops and provide good stewardship for the land.\nLife has always been challenging for farmers - this is part of the industry. Unpredictable events such as weather, crop blight, and animal disease pandemics add to what is already a tough life with long hours. Add on to this extra burdens from the last few years including rising input costs, supply chain issues, rising inflation, difficulties in securing workers and increasing levels of red tape and unelected globalist agendas (e.g. Agenda 2030) being forced on our farmers by UK Government implementing ‘Green’ measures that no one voted for.\nIndeed, it appears that our UK farmers are under tremendous and unwanted pressure that is affecting not only their ability and desire to contribute towards national food security but is also taking a toll on mental health.\nAs an example, see Moors plan leaves Cornwall farm families fearing for their livelihoods. Stories such as this are heartbreaking and completely unacceptable. It is understandable that farmers feel angry and let down by a political system that seems more interested in its own virtue signalling that in serving the interests of farmers and the wider community.\nThere is some hope. In The Netherlands, Farmers have had some success in pushing back against Governmental policies that are damaging for the industry. In the UK, we can achieve similar results at the regional and national levels by voting for parties that are sympathetic to the aims of our local and national farmers.\nPersonal Statement\nAlthough not in the farming industry, throughout my adult life, I have had friends in the farming community. As a fellow industrialist, I can empathise with many of the difficulties that farmers experience in dealing with red tape and well meaning (if somewhat over zealous) regulations imposed on us all.\nMy view on regulations is that the need for regulation must be balanced with the needs of business to get on with the job of being productive. Productive businesses help local, national and global economies to flourish and, in turn, help our societies to thrive, prosper and deliver the resources to support our collective social responsibilities. Top down regulation and authoritarianism has never worked and is ultimately self defeating in its aims.\nI fully support the desires and needs of farmers to be generally be left alone and only supported where support is required and asked for.\nI am aware that, in 2016, many of the North Cornwall farming community voted to leave the European Union in the belief that and independent United Kingdom would be able to free itself of regulations and the so called “level playing field” commitments described in Mrs May’s terrible Brexit deal (draft). Due to the way that Brexit has (or perhaps not) been delivered by UK Government, UK farmers find themselves, in some cases, in a worse situation than before Brexit and with an increased burden being placed on them by the likes of DEFRA. Brexit, as it is currently implemented in Johnson’s “Oven Ready” deal with the European Union is not working for farmers or for the United Kingdom. Brexit needs to be finished and done right if we are to make the most of the opportunities that being an independent, sovereign nation offers us.\nWith the right will and representation in Government, we can start to shift things in the right direction for farmers. Dutch Farmers have shown us that anything is possible even in the face of what appear to be overwhelmingly powerful and well funded forces. We too, in North Cornwall, can achieve great things.\nIf elected, I very much look forward to working with the farming community of North Cornwall to secure the type of industry that we hoped that we were getting when we voted to leave the European Union.\nMission Statement\nIf elected as your MP for North Cornwall, I will represent the interests of Farmers in North Cornwall to the best of my ability. My mission will be to lobby for the removal of as much red tape as possible. I will also seek to delay with a view to ultimately reverse the World Economic Forum policies that are doing vast damage to our farming industry and placing our national food security at risk.\nFirst 100 Days\nThe plan\n- Identify passionate Farmers in North Cornwall willing and able to work with me to create policy.\n- Create draft policy statements that are created and endorsed by local farmers.\n- Meet with local officials to see where we are on local policies. Compare desired farmers policies to actual and create a consultation report based on the differences.\nThese initial steps will, I believe, be achievable within the first 100 days. Moving on from there, I would follow these issues up at a national and Governmental department level with the appropriate levels by asking for a wide ranging debate on moving this forward.\nWhilst I can’t promise to change things overnight, I will be firmly on the side of local and national farming interests in my term in office. My undertaking is to do the best that I can.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies_north-cornwall_climate-change/content_13.html": "An Honest Debate on Climate Change\nIt is important to be able to debate and discuss issues such as climate change, rather than face the smears and cancellation threats that spread throughout public life.\nReform UK fully accepts that climate change is real, after all it has happened for millions of years based on multiple factors completely outside human control or influence. Warming has of course taken place over the last approximately 150 years, with signs over recent years that it is now leveling off. Humans have had an impact on this global warming,though scientists disagree as to how much. Those who think that getting to Net Zero will stop climate change are in fact just denying reality. Even the IPCC’s latest assessment report admits that if we get to Net Zero, it would take another 200-1,000 years before sea levels stopped rising (hardly definitive in timing but clearly a long way off!). So we would be better to adapt, by spending far less money more wisely, for example on sea level defences where needed. This is more sensible than wasting trillions of pounds trying to stop climate change, when it has always changed and always will change.\nThere is plenty of climate good news that you will not hear on mainstream news outlets who wish to preach doom and gloom such as:\n- The Great Barrier Reef has seen coral cover return to record levels just five years after the consensus of climate experts said it was permanently damaged beyond recovery.\n- Extreme weather events have always occurred, but thanks to human adaptation and ingenuity, result in some 96% fewer deaths per year than 100 years ago.\n- The earth has increased in greenery over the last 30 years, partly thanks to higher CO2 levels. CO2 is a natural fertiliser, which is essential to plant life via photosynthesis, and without plants humans could not exist!\n- The Arctic sea ice cover has increased since a low point in 2012 and is very close to 30 year average levels.\n- Overall sea ice cover in Antarctica has not declined in recent decades.\n- Polar bear numbers in the Arctic are increasing, not decreasing.\nUltra Low Emission Zones (ULEZ)\nReform UK does not support ULEZ. As your elected parliamentary representative, I will strongly oppose ULEZ both within North Cornwall and nationally.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_candidate/content_12.html": "Your Parliamentary Candidate for North Cornwall - Rowland O’Connor\nI am not a career politician and have no desire or incentive to become one.\nMy political home has traditionally been the Conservative Party for many decades. In 2019, I voted Conservative and donated to the local election fighting fund. However, in the light of the shock and horror of what’s happened since 2019, I will never vote for or support the Conservative Party again. The Conservative Party has abandoned my values and beliefs as it shifts(is dragged by ‘one nation’ liberal Tory MPs) towards being ‘Labour 2.0’ and blatantly and obviously being complicit in forming the undemocratic uni party blob. The Conservative Party has failed its members, donors and our United Kingdom. As Labour 2.0, where is the opposition in Parliamentary process?\nMy family and I have lived in North Cornwall since 2008. It is our home and it is worth fighting for.\nI am a graduate in engineering and have had a broad range of experience in senior leadership positions in engineering, software, consulting, retail, investment banking and manufacturing. In 2010 I started a business here in North Cornwall which, in 2020, it was am immense privilege for our company to receive the Queens Award for innovation for creating the worlds first cloud based pre-fraud solution based on email address data.\nMy career has been diverse. As well as my achievements in the business world, I have been a SCUBA instructor working in the industry for many years. It was my priviledge to have taught BBC wildlife presenter Iolo Williams to dive and to cerify him as a PADI diver.\nI am standing to be your MP for North Cornwall because I could see the incompetence and the lack of leadership from our Parliamentary MPs during COVID. The incompetence is still costing our children, communities and businesses dearly and it can never happen again. To take action, I decided to join Reform UK to offer a choice other than the legacy two party system.\nI believe in preserving our freedoms and having honest, intelligent MPs and councillors. We need to restore faith in our local and national politics.\nAs a local businessman I have decided to stand up for the politically lost in North Cornwall and try to save our country from ruin before it’s too late.\nFundamentally, I believe that our sovereign rights as individuals to make our own decisions is paramount to government or state intervention and mandates. Our government and local authorities exist to serve us, the citizens of the United Kingdom and not the other way around as many in authority seem to believe.\nThe other tired old political parties will continue to ignore your views and let you down. The election is no different. So let’s send Westminster a clear message and vote Reform UK this time around.\nI promise to:\n-\nProtect national borders from illegal migration. Pick up migrants out of boats and take them back to France.\n-\nDeal with the cost of living crisis - raise the minimum tax threshold to £20,000. Scrap the VAT on energy bills. Lower fuel duty by 20p per litre. Scrap environmental levies.\n-\nImmediate deportation for foreign criminals. Deport foreign nationals immediately after their prison sentence ends. Withdraw citizenship from immigrants who commit significant crime.\n-\nCancel Net Zero saving us up to £1 trillion. Invest in more sustainable, natural alternatives to promote the environment.\n-\nSupport local farmers by cutting imports, ending net zero quotas and preserving farm land for food.\n-\nImplement Brexit properly which includes taking back full fishing rights and cutting red tape originally set out by the EU.\nFor more information, view my leaflet online",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_privacy-policy/content_5.html": "Reform UK(North Cornwall Consituency) Privacy Policy\nreformuk-northcornwall.com has a commitment to your privacy and the protection of your information. Personal information is information that would identify you, or from which you can be identified. It is important to us to protect your personal information. We don’t give it away or sell it and we have systems in place to protect it.\nCollection\nWe collect personal information about you when you give it to us, usually when you complete one of our forms, whether hard copy or online. We don’t collect your information from anywhere or anyone else.\nWe may also use ‘cookies’ so that you can customize our web pages or so that you do not have to keep filling in your details repeatedly. If you want to find out more about ‘cookies’ and how they work, we suggest that you look up Wikipedia.\nUse\nWe use your personal information to provide you with our services and in an effort to tailor your experience of our products and services specifically for you.\nDisclosure\nWe don’t give away or sell your personal information. We will disclose your personal information if we are legally compelled to. Your personal information has been collected by a business and if that business is ever sold in the future, your personal information may be passed to the new owner.\nWe might use another provider to deliver our products or services to you. If they need your personal information to complete that delivery we will require them to use your information only for that purpose and then destroy it.\nLinks and Public Forums\nWe have no control over the information accessed through links from our site. You use links at your own risk.\nIf you post your personal information in a membership blog or public forum, we have no control over how it is used and no responsibility to protect it for you.\nEmails\nIf you have received a mailing from us then your email address is either listed with us as someone who has expressly shared this address for the purpose of receiving information in the future (“opt-in”), or you have previously purchased or expressed interest in our products or services.\nWe will never share, sell, or rent individual personal information with anyone without your advance permission or unless ordered by a court of law. Information submitted to us is only available to employees managing this information for purposes of contacting you or sending you emails based on your request for information and to contracted service providers for purposes of providing services relating to our communications with you.\nEach email sent contains an easy, automated way for you to cease receiving email from us, or to change your details. If you wish to do this, simply follow the instructions at the end of any email.\nUpdate\nYou can update your details by contacting us.\nFeedback or Complaints\nLet us know if you have a problem or feedback by contacting us. We will take action to fix any problems, within reason. We will update this policy from time to time to meet our legal obligations.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_feed_xml/content_2.html": "Jekyll2024-09-09T15:24:27+01:00https://www.reformuk-northcornwall.com/feed.xmlReform UK - North CornwallReform UK is a political party that believes in true Conservative values. This is the website for the North Cornwall branch.Rowland O'ConnorHello and introduction2023-08-12T00:00:00+01:002023-08-12T00:00:00+01:00https://www.reformuk-northcornwall.com/local/general/2023/08/12/helloHello and welcome to everyone in North Cornwall.\nMy name is Rowland O’Connor and I am your local spokesperson for the North\nCornwall consituency.\nTo see more about me, my values, beliefs see my bio",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies_north-cornwall_brexit/content_17.html": "Make The Most of Brexit for North Cornwall\nMany people that voted for Brexit in 2016 believe that Brexit has not been delivered.\nTop 5 Reasons Why We Care About a Real Brexit in North Cornwall\n- North Cornwall voted to leave the European Union (EU) in 2016 with a vote share of more than 60%.\n- Farming is a significant industry in North Cornwall. Hard working farmers need reductions in red tape that has its origins in anti competitive EU legislation designed to “level the playing field” across all EU nations.\n- EU imposed employment law is still in force making it harder and more expensive for businesses in North Cornwall to find, hire and retain staff. This is a particular problem in the important hospitality and tourist sectors in our county.\n- The Brexit deal that the UK agreed with the EU turns its back on the UK fishing industry. Cornwall cares about its fishing industry.\n- By freeing ourselves from the shackles of over done EU regulation, North Cornwall businesses and residents can seize the opportunities of being happy and productive to serve the needs of both the visitors and local businesses.\nMy Position on Brexit\nIf elected as your parliamentary representative, I will work with my colleagues in Reform UK to seek out support from other MPs who also believe that the existing Brexit in Name Only (BRiNO) is not good enough for the hard working, decent people of the UK who simply wish to be left alone, unburdened from rules and laws made in Brussels that have no value to their lives of livelihoods and indeed end up costing us all more in taxation and wasting needless time in compliance issues that serve no one except the EU.",
  "https_www_reformuk-northcornwall_com_/https_www_reformuk-northcornwall_com_policies_north-cornwall_tourism/content_16.html": "Supporting Cornish Tourism\nTourism is the biggest economic sector in Cornwall. It is a vital source of employment and income for the region.\nInteresting facts about tourism in Cornwall:\n- It accounts for at least one in five jobs in Cornwall.\n- Over four million people every year come to Cornwall for tourism.\n- Growth in tourism to Cornwall is projected to grow at 3.8 percent per year through to 2025.\nHowever, Cornwall can do better and make more of its tourism industry. To help our County to not only survive but to also thrive, there are some challenges that we need to recognise:\nTop 5 Challenges for Cornwall Tourism in 2023\n- Reducing pool of skilled and unskilled workers makes recruitment difficult.\n- Increasing number of ‘hard to fill’ posts, particularly in catering.\n- Transport issues result in problems for local residents getting to places of employment.\n- Lack of child care provision is a problem for some local residents wishing to go to work.\n- Lack of opportunity for training and further education is a problem for local residents as well as a possible barrier for attracting skilled workers from areas outside of Cornwall.\nLocal and national authorities can and must help to provide the environment and conditions to support the tourism industry in North Cornwall.\nMission Statement\nAs your MP for North Cornwall, I will place a priority on lobbying for measures to support tourism in North Cornwall. This will include:\n- Identification and removal of as much ‘red tape’ as possible. ‘Red tape’ is unhelpful to most businesses.\n- Make sure that any existing support (e.g. access to possible grants and loans ) is better publicised to those who will benefit from access to support (i.e. employers and workers).\n- See what can be done from national government to prioritise allocation of support funding to Cornwall for better transport, child care and further education."
}