{
  "https_www_claudinerussell_com_/https_www_claudinerussell_com/content_1.html": "Marden and Yalding Ward at Maidstone Borough Council\nKCC Candidate for Cranbrook Division\nClaudine Russell\nYour Conservative Party Councillor representing\nMarden and Yalding Ward\nStanding in the 1st May 2025 Elections for Kent County Council in Cranbrook Division\nHi, thank you for visiting my page. I hope this website can tell you a bit more about me, what I do in my role as your Maidstone Borough Councillor and why I want to stand to be a Kent County Councillor for the Cranbrook Division. I also have a Facebook page which I update frequently with useful links, events and more information about how I am representing the residents of my ward.\nSearch on Facebook for : claudinerussell\nor click the link button below.\nAs well as representing residents of my current ward in Marden, Yalding, Collier Street, Nettlestead, Hunton, Laddingford, Chainhurst and Benover I also work on the following Maidstone Borough Council Committees:\n* Leader of the Opposition\n*Full Council\n*Chair of Overview and Scrutiny Committee\n* Planning and Healthier, Stronger Communities Committee\n* Substitute member Planning Committee\n*Substitute member Licensing Committee\nContact Me\nThank you for your interest in Claudine Russell. If you have a question, concern, or would simply like to get in touch, please complete the form below.\nSubscribe to my Newsletter\nOccasional Newsletter produced by Claudine Russell to keep you updated with my work.\nSent straight to your email - no spam.",
  "https_www_claudinerussell_com_/https_www_claudinerussell_com_usefullinks/content_5.html": "top of page\nMarden and Yalding Ward at Maidstone Borough Council\nKCC Candidate for Cranbrook Division\nLinks to other websites for advice and online reporting that I hope you might find useful...\nbottom of page\nMarden and Yalding Ward at Maidstone Borough Council\nKCC Candidate for Cranbrook Division",
  "https_www_claudinerussell_com_/https_www_claudinerussell_com_outandabout/content_8.html": "top of page\nMarden and Yalding Ward at Maidstone Borough Council\nKCC Candidate for Cranbrook Division\nElected as Marden and Yalding Ward Councillor\n7th May 2021\nFlag Raising Ceremony at Brenchley Gardens\nVisiting Yalding and Laddingford FC at The Kintons, Yalding\nMaidstone Fusion Street Festival\nTaking two of my constituents to the Mayors afternoon tea party at The Town Hall.\nThe Mayors river cruise along the River Medway\nYalding Church Fete\nYalding Parish Picnic\nMarden Parish Council Open morning\nMarden village litter pick\nKent Police, Violence against Woman and Girls engagement meeting.\nRemembrance Sunday Parade in Maidstone Town Centre\nVisit to Maidstone Borough Council depot\nPlanting trees on Tree Charter Day\nAttended Marden at Christmas and Yalding Yuletide\nMaidstone Borough Council and Cohesion Plus Chinese New Year street festival\nbottom of page",
  "https_www_claudinerussell_com_/https_www_claudinerussell_com_whatido/content_6.html": "Marden and Yalding Ward at Maidstone Borough Council\nKCC Candidate for Cranbrook Division\nWhat I do\nAs a Borough Councillor my role is to represent and help the residents of my Ward.\nIf I were lucky enough to be elected as a County Councillor my role would be to help the residents of my division and aid the transition towards a unitary authority.\nI regularly speak to residents and I encourage residents to contact me via my email claudinerussell@maidstone.gov.uk\nI also regularly attend Parish council meetings in my Ward :\nMarden Parish Council\nYalding Parish Council\nNettlestead Parish Council\nCollier Street Parish Council\nI have started to attend Parish council meetings in the Cranbrook Division and have so far attended :\nCranbrook Parish Council\nHawkhurst Parish Council\nGoudhurst Parish Council\nFrittenden Parish Council\nWorking for my community\nSo far I have been assisting and helping residents with issues such as:\nLiasing with Housing Providers to help residents with issues.\nSpeaking at Maidstone Borough Council Planning Committee.\nAssisting residents to combat anti-social issues with the help of the MBC Community Protection Team.\nHighlighting issues with development to the MBC Planning Enforcement Team.\nHelping residents to report and clear fly-tipping.\nRepresent my ward residents at any committee as a ward councillor and speak on their behalf.\nHelp with missed bin collections.\nWork with external partners such as the Environment Agency on issues affecting my ward.\nRegular contact and liaising with the Kent Police Community Support Officer (PCSO) on issues affecting my ward.\nand much more...\nMaidstone Borough Council Committee meetings\nI currently lead the Conservative Group at Maidstone Borough Council, I sit on various committees, I chair Overview and Scrutiny holding the administration to account and I give our group response to the Leaders Speech at Full Council\nIn this role, as well as representing my ward, I am involved in the discussions and voting on decisions which affect all areas in the Borough of Maidstone.\nI also regularly attend Councillor training and briefing meetings\nAs a councillor I attend many training courses to further my knowledge and ensure that I am up to date, notably:\nPlanning training sessions\nLicensing training sessions\nLocal plan Review workshops\nAccounts Briefings\nLeadership training with the Local Government Association\nIn addition to meetings with outside bodies such as the Environment Agency etc.",
  "https_www_claudinerussell_com_/https_www_claudinerussell_com_news/content_4.html": "top of page\nMarden and Yalding Ward at Maidstone Borough Council\nKCC Candidate for Cranbrook Division\nIn the Media\nStories and Headlines\nArticle from the KentOnline\n23 February, 2021\nFrom Protest to Power?\nHousing campaigner Claudine Russell to stand for Conservatives on Maidstone Council.\nThe leader of the Marden Planning Opposition Group, which successfully convinced Maidstone council to drop plans for a 2,000 garden village in Marden, has decided to go into politics.\nClaudine Russell is to stand for the Conservatives at the borough council elections on May 6 contesting Marden and Yalding ward...... read the full article by clicking the link button below\nbottom of page",
  "https_www_claudinerussell_com_/https_www_claudinerussell_com_testimonials/content_7.html": "Marden and Yalding Ward at Maidstone Borough Council\nKCC Candidate for Cranbrook Division\nTestimonials\n\"Claudine Russell is a phenomenal champion for the Kentish countryside. She's been fighting for years to get the infrastructure our area badly needs, and against overdevelopment.\nWhether its saving Weald schooling or getting police officers back out on our streets, she knows what matters most in Cranbrook and the villages around it.\"\nKatie Lam MP\n‘‘Claudine is a fantastic and formidable campaigner who always has the best interests of her community in Marden and Yalding at heart.\nShe was the driving force behind the extremely successful campaign to protect Marden from the totally inappropriate plans to impose 2000 houses on the village. It was my privilege to work with her on this campaign where I observed her truly remarkable persistence, determination and ability to influence decision makers.\nI can think of nobody better than Claudine to stand up for the interests of the people of Marden and Yalding on Maidstone Borough Council.’’",
  "https_www_claudinerussell_com_/https_www_claudinerussell_com_howtovote/content_2.html": "Marden and Yalding Ward at Maidstone Borough Council\nKCC Candidate for Cranbrook Division\nAre you ready?\nHave you registered to vote?\nDo you want to Postal Vote this year?\nIts very simple to register to vote.\nPlease follow the link below.\nIt only takes 5 minutes.\nPerhaps you would prefer a Postal vote this year?\nPlease follow link below to the Maidstone Borough Council postal vote application page.\nWhere and how to vote\nPlease follow link below for more information and where to find your local Polling Station.\nWhy is it important to vote in this particular local election?\nThese elections are the last time that you will elect anyone to Kent County Council as we move towards unitary authorities. I would love the chance to be that person, to represent you to the best of my ability and to make sure that our area is well positioned to make the best of the new arrangements.\nThis election isn't about the bins (that's currently a district function), it is about you, the residents and making sure that your views are heard loud and clear, about the lack of infrastructure, about the overdevelopment of our beautiful countryside and about the way that local representatives work for you. I love the Weald, I live in the Weald, I farm the Weald and I've fought for the Weald. I would love it if you would place your faith in me to fight for your voice and the voice of our Weald to be heard in the last term at County Hall. It would be the honour of my life to serve you.",
  "https_www_claudinerussell_com_/https_www_claudinerussell_com_about-me/content_3.html": "Marden and Yalding Ward at Maidstone Borough Council\nKCC Candidate for Cranbrook Division\nAbout Me\nI live and work on our family livestock farm in the beautiful Weald of Kent with my husband Tristan and our two teenage children. I built and run a horse livery that provides local jobs including apprenticeships.\nI have a degree in Earth Sciences and have worked in both the private and the public sector and have amassed a variety of transferrable skills. I work as an Environmental Advisor part time for the private sector.\nI love farming and rural life and am passionate about British Food, the quality of our farming here in Britain and the value of food security. We must seek to preserve our rural identity, our sustainable farming methods and our high standards.\nFamily Life\nI am married to Tristan (a farmer) and have lived on the family farm just outside of Marden for 18 years. The farm has a rich history and has been in my husbands family since 1866! We have two children, Evie and George.\nTristan is really more a “farmer builder” than a farmer (that’s what the kids call him) and he built the horse livery that I now manage on the farm. I employ local people and take on apprentices from time to time to train. I really enjoy combining my love of the outdoors with family time and my own special interest of riding horses and providing them with the best care.\nTristan and I applied for and got Higher Level Stewardship for the farm working with Natural England and have now been managing the farm to maximise environmental benefits and educational access since 2009."
}