{
  "https_onikegollo_com/https_onikegollo_com_privacy-policy/content_2.html": "Privacy Policy\nOur contact details\nName: Onike Gollo\nAddress: 48 Leslie Park CM0 8SZ\nE-mail:\nThe type of personal information we collect\nWe currently collect and process the following types of information from those who fill out our supporter form:\n- Name\n- Contact number\n- Postcode\nHow we get the personal information and why we have it\nThe personal information we process is provided to us directly by you for one of the following reasons:\n- Register you as a supporter of Onike Gollo’s campaign;\n- Inform and engage you about the campaign;\n- Inform and engage you with any other campaigns and movements that share the values, principles and aims of Onike’s campaign (including, but not limited, to other Labour Party elections);\n- Answer your queries and respond to your questions and/or complaints.\nHow we store your personal information\nYour information is securely stored.\nWe keep the information you provide for as long as reasonably necessary to fulfil the purposes we collected it for. We will then dispose your information by securely deleting it.\nYour data protection rights\nUnder data protection law, you have rights including:\n- Your right of access – You have the right to ask us for copies of your personal information.\n- Your right to rectification – You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete.\n- Your right to erasure – You have the right to ask us to erase your personal information in certain circumstances.\n- Your right to restriction of processing – You have the right to ask us to restrict the processing of your personal information in certain circumstances.\n- Your right to object to processing – You have the the right to object to the processing of your personal information in certain circumstances.\n- Your right to data portability – You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances.\nYou are not required to pay any charge for exercising your rights. If you make a request, we have one month to respond to you.\nPlease contact us at ogollolabour@gmail.com if you wish to make a request.\nHow to complain\nIf you have any concerns about our use of your personal information, you can make a complaint to us at ogollolabour@gmail.com.\nYou can also complain to the ICO if you are unhappy with how we have used your data.\nThe ICO’s address:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nICO website: https://www.ico.org.uk",
  "https_onikegollo_com/https_onikegollo_com/content_1.html": "Onike Gollo\nfor Maldon\nOnike Gollo\nfor Maldon\nIt's time for change in Maldon constituency\nFor 14 long years the Conservative government has squandered our nation’s potential, stymied economic growth and mismanaged our coffers. In our area, our NHS is at breaking point and our hospital faces closure. The affordable houses we need aren’t being built. Our roads are crumbling and public transport is lacking, sewage is polluting our rivers and our coastline, and families and local businesses are struggling with the cost of living and impact of inflation.\nIt’s time to rediscover ambition, to bring hope where there is weariness and herald a new dawn for our local area, for our region, and for Britain.\nA Labour government will get the economy growing and securing jobs for the future. Labour will clean up privately owned water companies. A Labour government will invest in better education, in a modern childcare system with breakfast clubs in every primary school to give children a better start. A Labour Government will put an end to the waste and the chaos that define today’s transport networks. After 14 years, Britain deserves a change.\nAbout me\nI feel incredibly privileged to be your Labour candidate for Maldon. Essex is my home and I am deeply invested in its future, and the future of Britain.\nSince graduating from the London School of Economics, I have had a successful professional career at a FTSE 100 company, while raising a young family. I am passionate about the transformative power of education and have held a number of non-executive and advisory positions, volunteering at a local Essex school and art charities. I ask for the opportunity to serve the people of Maldon constituency.\nI want us to build a country that cares for its working people and is run by a competent and compassionate government that is eager to serve the public, a government that presides over a thriving economy and gives us all a fair chance in life.\nMy priorities for Maldon\n- Delivering economic stability for families and businesses\nWe need to end the chaos and decline of Tory rule and provide economy stability and security for local families and businesses. Labour will put economic stability first, back British business and make work pay. - Investing in our NHS\nAcross the country, hospitals are crumbling and closing after 14 years of Tory mismanagement. Labour will get the NHS back on its feet and make it fit for the future - Cleaning up our rivers and coast\nLabour will block bonuses for failing water bosses, introduce severe and dramatic fines so that water companies can’t ignore illegal sewage dumping, and bring in criminal charges for repeat offenders. - Putting more neighbourhood police on our streets\nLabour will put 13,000 extra neighbourhood police and PCSOs on the beat and give every community a named officer they can get in touch with. - Fixing our rail and bus networks\nLabour will get Britain moving again by allowing communities to take back control of local bus services, speeding up bus franchising, and supporting public ownership of bus companies and passenger rail.\nLabour’s Missions for Britain\nWhether you see yourself as a Labour voter, or have never voted Labour before for – now is your chance to vote for the change that our region and our country needs.\nEconomic Stability & Growth – grow the economy on secure foundations\nThe British economy has been growing at the slowest rate for two centuries under the Tories. The result is the biggest fall in living standards in a generation. People are working harder than ever but too often for less reward. Labour’s first step for change in the economy is to deliver economic stability so we can grow our economy and keep taxes, inflation and mortgages as low as possible. Growing the economy on secure foundations will be the number one mission of the next Labour government. That is the route to making working people better off.\nNHS – get the NHS back on track\nThe NHS is on its knees. Waiting lists are now at almost 8 million. Ambulances don’t come when you need them. Dentistry is in crisis. The 8 am scramble for a GP appointment is the final straw for many patients. Waiting times for cancer patients have got worse every year since the Conservatives came to power in 2010. The waiting list for community mental health care in England hit 1.2 million last year. As a first step for change in the NHS, Labour will cut NHS waiting times with 40,000 more evening and weekend appointments each week, paid for by cracking down on tax avoidance and non-doms.\nSafe Streets – take back our streets and restore faith in our justice system\nOver the past 14 years, levels of violent crime have climbed, anti-social behaviour increasingly blights our communities, and confidence in our criminal justice system has collapsed. Too often, people fear that when things go wrong, no one will come and nothing will be done. That is the Tories’ abysmal record on crime and justice – criminals laughing at the law and victims paying the price. As a first step for change in community safety, Labour will crack down on anti-social behaviour, with more neighbourhood police paid for by ending wasteful contracts, tough new penalties for offenders, and a new network of youth hubs.\nClean, Secure Energy – provide clean, affordable, homegrown power\nMore than 60% of families say that are still worried about paying their energy bills, following sky-rocketing costs. Britain’s energy supply is not in British hands and we’re dangerously dependent on importing oil and gas from unstable international markets. We need to take control of our energy system. As a first step for change in our energy system, Labour will set up Great British Energy – a publicly-owned clean power company, to cut bills for good and boost energy security, paid for by a windfall tax on oil and gas giants.\nOpportunity for All – break down barriers to opportunity\nAfter 14 years of Tory rule, our young people are being failed. Childcare and early learning is increasingly inaccessible or unaffordable for too many families, meaning many children arrive at school not ready to learn. Young people are leaving school without developing core English and maths skills, while creative subjects and skills development are being squeezed out. Our schools face teacher shortages, a staff retention crisis, and crumbling classrooms. Where you are born and how wealthy your parents are too often determines where you end up. As a first step to break down the barriers to opportunity, Labour will recruit 6,500 new teachers in key subjects to set children up for life, work and the future, paid for by ending tax breaks for private schools."
}