{
  "https_kazrizvi_com_/https_kazrizvi_com_about_php/content_2.html": "About\nFAMILY LIFE\nKaz was born and raised in London. His parents moved from South East Asia in 1981 like many others in search of a better life here in the UK.\nHe grew up watching his doctor-father and self-made entrepreneur mother work tirelessly serving their local community whilst making ends meet to provide his 2 older sister’s and younger brother a better and brighter future.\nKaz is married to his loving & supporting wife who is also a GP and together they have a little boy.\nEDUCATION\nAfter proudly attending state primary & secondary schools in Redbridge, Ilford, Kaz applied to study Medicine at the prestigious Barts & The London Medical School, Queen Mary University of London, where he was delighted to be offered a place at his dream institution, based in the heart of East London.\nWhilst at Medical School, Kaz maintained his passion for politics, regularly attending events, going out campaigning and networking with people from different walks of life.\nAWARD WINNING DOCTOR\nAfter completing Medical School, Kaz begun his career as a Doctor in the NHS. As a Junior Doctor he was honoured with multiple awards including the Merit Awards for Clinical Excellence as an FY1 and Teaching Excellence as an FY2 by NHS Health Education. Following this, he embarked on his lifelong ambition of becoming a General Practitioner and completed his GP Training in North London.\nKaz and his wife bravely served the NHS with distinction throughout the entirety of the COVID-19 pandemic, despite having close colleagues and family members sadly succumb to the virus during the first and second waves.\nHe currently works as a GP Partner in Greater London, Essex and GP Trainer- supervising the next generation of GP’s from the Ilford VTS. Kaz has spoken at numerous regional, national and international medical conferences.\nPOLITICAL CAREER\nKaz was elected as the District Councillor for the ward of Chigwell Village with a whopping 70% vote share in the 2021 Local Elections. Serving the residents of Chigwell Village, he has worked with his Conservative colleagues at Epping Forest District Council to ensure that the region’s historic Greenbelt is protected, Council Tax is kept the lowest in Essex and the council has responded accordingly to the recent COVID-19 Pandemic and Cost of Living Crisis.\nIn May 2023, he was selected as the Chairman of the Plans South Sub-Committee and he is also a representative on the Joint Health Overview & Scrutiny Committee (JHOSC) for Outer North East London, carefully scrutinising decisions being made at King George’s & Queens Hospital (BHRUT) as well as Whipps Cross Hospital (Barts Health).\nHe was re-elected in May 2024 from the new ward of Chigwell with Lambourne with a 26% increase in his vote share. He is currently on the EFDC Cabinet and is the Portfolio Holder for Community Health & Wellbeing.\nSOCIAL\nOutside of work and politics, Kaz is an avid sportsman, with a keen interest in Cricket and Football. He had the honour of captaining the Men’s XI Cricket team during his time at Medical School. He won numerous trophies such as the UH Cup and ULU Vase. He also played Football at University and managed to win the UH Vase Trophy.\nHe graduated University with Men’s Colours Awards from both RHCC and SBLH FC. Kaz loves travelling with his wife and together they have been able to visit some of the most beautiful countries in the world.",
  "https_kazrizvi_com_/https_kazrizvi_com_joinus_php/content_3.html": "Contact\nLet us know how you’d like to come on board, and we will get in touch with you soon.\nDoor Knocking, Phone Calling, Social Media, Fundraising\nLet us know how you’d like to come on board, and we will get in touch with you soon.\nDoor Knocking, Phone Calling, Social Media, Fundraising",
  "https_kazrizvi_com_/https_kazrizvi_com_index_php/content_5.html": "MBBS BSc MRCGP MFMLM FRSPHConservative Parliamentary Candidate for Ilford North Kaz is a GP Partner & Councillor",
  "https_kazrizvi_com_/https_kazrizvi_com_gallery_php/content_4.html": "Cllr (Dr) Kaz Rizvi\nHome\nAbout\nGallery\nJoin Us\nGallery",
  "https_kazrizvi_com_/https_kazrizvi_com/content_1.html": "MBBS BSc MRCGP MFMLM FRSPHConservative Parliamentary Candidate for Ilford North Kaz is a GP Partner & Councillor"
}