{
  "https_www_samiahersi_uk_/https_www_samiahersi_uk_news_samia-crime-and-safety/content_11.html": "Many residents and businesses have been in touch abut rising crime and anti-social behaviour. Tackling this is a personal priority for Samia and the Conservative Government.\nSamia attended the first in person meeting of the National Convention in her capacity as Chairman of the Stratford and Bow Conservative Association. The conference included important updates including reforming the candidates process, reviewing the party's constitution, and campaigning.",
  "https_www_samiahersi_uk_/https_www_samiahersi_uk/content_1.html": "Latest News Samia attends the National Conservative Convention Conference Samia attended the first in person meeting of the National Convention in her… Samia reelected as Chairman of Stratford and Bow Conservative Association The Stratford and Bow Conservative Association had its first Annual General… Samia reflects on general election result I am honoured to have stood for Parliament in the 2024 general election for the…\nSamia attends the National Conservative Convention Conference Samia attended the first in person meeting of the National Convention in her…\nSamia reelected as Chairman of Stratford and Bow Conservative Association The Stratford and Bow Conservative Association had its first Annual General…\nSamia reflects on general election result I am honoured to have stood for Parliament in the 2024 general election for the…",
  "https_www_samiahersi_uk_/https_www_samiahersi_uk_news_10-downing-street-inspiring-women-reception/content_8.html": "Samia attended 10 Downing Street's Inspiring Women Reception hosted by Chief Secretary to the Treasury Rt Hon Laura Trott MP, alongside her nominee, Jan Prendergast, former Lord Mayor of Westminster and Maida Vale Councillor. Fellow Parliamentary Candidates, MPs and women across the country who work tirelessly to support their local community.\nJan has supported many people across Queen's Park and Maida Vale through the opening of the new North Paddington Youth Centre, building new homes in Maida Vale and her efforts fundraising for the Friends of St Mary's Hospital.",
  "https_www_samiahersi_uk_/https_www_samiahersi_uk_accessibility/content_7.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_samiahersi_uk_/https_www_samiahersi_uk_news_category_Westminster-News/content_6.html": "Samia attends the National Conservative Convention Conference 16th March 2025 Samia attended the first in person meeting of the National Convention in her capacity as Chairman of the Stratford and Bow Conservative Association. The... Westminster News\nSamia reelected as Chairman of Stratford and Bow Conservative Association 18th November 2024 The Stratford and Bow Conservative Association had its first Annual General Meeting (AGM) following its Special General Meeting (SGM) founding the Association... Westminster News\nSamia reflects on general election result 12th July 2024 I am honoured to have stood for Parliament in the 2024 general election for the Conservative Party in Queen's Park and Maida Vale. The election was a difficult... Westminster News\nSamia joins Patchwork Foundation's general election hustings 24th June 2024 Samia joined the Patchwork Foundation's general election hustings representing the Conservative Party and answering young people's questions on housing... Westminster News\nSamia speaks on I Have A Voice panel 6th June 2024 Samia spoke on a panel in Westminster as the Conservative Parliamentary Candidate for Queen's Park and Maida Vale, alongside other political party candidates... Local NewsWestminster News\n10 Downing Street Inspiring Women Reception 21st May 2024 Samia attended 10 Downing Street's Inspiring Women Reception hosted by Chief Secretary to the Treasury Rt Hon Laura Trott MP, alongside her nominee, Jan... Local NewsWestminster News\nSamia welcomes Education Secretary Gillian Keegan to Little Venice 14th May 2024 Samia welcomed Education Secretary Gillian Keegan and her husband Michael Keegan to Little Venice to fundraise for the Queen's Park and Maida Vale (QPMV)... Local NewsWestminster News\nSamia welcomes millions more Conservative Government funding to support children with SEND across Queen's Park and Maida Vale 26th March 2024 • Every child deserves the chance to succeed in life, which is why the Conservative Government has increased the high-needs budget by over 60 per cent since... Local NewsWestminster News\nSamia welcomes Party Chairman Richard Holden MP to Maida Vale 21st March 2024 Samia welcomed Conservative Party Chairman Richard Holden MP to Maida Vale with West Central London Assembly Member Tony Devenish. Samia, Richard and Tony spoke... Local NewsWestminster News",
  "https_www_samiahersi_uk_/https_www_samiahersi_uk_news_samia-attends-national-conservative-convention-conference/content_5.html": "Samia attended the first in person meeting of the National Convention in her capacity as Chairman of the Stratford and Bow Conservative Association. The conference included important updates including reforming the candidates process, reviewing the party's constitution, and campaigning.",
  "https_www_samiahersi_uk_/https_www_samiahersi_uk_about-samia/content_4.html": "About Samia\nSamia is a Conservative Party activist based in London and an Association Chairman. Samia is the daughter of Somali immigrants. Her father was a refugee who fled the civil war in Somalia. He was a bus driver and her mother was a cleaner.\nFrom a young age, Samia's parents instilled in her the values of hard work, aspiration, and personal responsibility to achieve a better life for herself and others.\nAfter she graduated from University, Samia worked in schools across London for an education charity, IntoUniversity, and its partner charity, The Clement James Centre. She was supporting children and young people in schools across London to aspire and achieve.\nSamia previously worked as a Parliamentary Researcher for Rt Hon. Gillian Keegan, former Education Secretary and Member of Parliament for Chichester. She stood in the 2024 General Election as the Conservative Parliamentary Candidate for Queen's Park and Maida Vale.\nSamia now works for a trade association in the City of London working on general insurance, climate change, regulation and investment. She is the founding Chairman of the Stratford and Bow Conservative Association and is vice chair of the school board for a secondary school in East London.",
  "https_www_samiahersi_uk_/https_www_samiahersi_uk_news_samia-visits-marylebone-project/content_9.html": "Ahead of the election Samia, alongside other candidates, was invited to visit the Marylebone Project and hear about their work with women facing homelessness. The Marylebone Project is a lifeline in our community providing a safe space for women to access the support they need.\nSamia has signed the Homeless Link pledge to champion the needs of people experience, and at risk of homelessness, to help end it for good.",
  "https_www_samiahersi_uk_/https_www_samiahersi_uk_news_samia-attends-queens-park-community-council-10th-anniversary-celebrations/content_10.html": "Samia attended Queen's Park Community Council 10th Anniversary celebrations at the Happy Hub on Third Avenue. Did you know that Queen's Park Community Council is the only parish council in London?\nSamia attended Queen's Park Community Council 10th Anniversary celebrations at the Happy Hub on Third Avenue. Did you know that Queen's Park Community Council is the only parish council in London?",
  "https_www_samiahersi_uk_/https_www_samiahersi_uk_news/content_3.html": "Samia attends the National Conservative Convention Conference Sunday, 16 March, 2025 Samia attended the first in person meeting of the National Convention in her capacity as Chairman of the Stratford and Bow Conservative Association. The conference included important updates including reforming the candidates process, reviewing the party's constitution, and campaigning. Westminster News\nSamia reelected as Chairman of Stratford and Bow Conservative Association 18th November 2024 The Stratford and Bow Conservative Association had its first Annual General Meeting (AGM) following its Special General Meeting (SGM) founding the Association... Westminster News\nSamia reflects on general election result 12th July 2024 I am honoured to have stood for Parliament in the 2024 general election for the Conservative Party in Queen's Park and Maida Vale. The election was a difficult... Westminster News\nSamia joins Unloc's Changemaker general election event 26th June 2024 Samia joined Unloc's Changemaker general election event at the City of Westminster College Maida Vale campus. Samia met with young people across Queen's Park... Local News\nSamia joins Patchwork Foundation's general election hustings 24th June 2024 Samia joined the Patchwork Foundation's general election hustings representing the Conservative Party and answering young people's questions on housing... Westminster News\nSamia visits the Marylebone Project 6th June 2024 Ahead of the election Samia, alongside other candidates, was invited to visit the Marylebone Project and hear about their work with women facing homelessness... Local News\nSamia speaks on I Have A Voice panel 6th June 2024 Samia spoke on a panel in Westminster as the Conservative Parliamentary Candidate for Queen's Park and Maida Vale, alongside other political party candidates... Local NewsWestminster News\nSamia attends Queen's Park Community Council 10th Anniversary celebrations 25th May 2024 Samia attended Queen's Park Community Council 10th Anniversary celebrations at the Happy Hub on Third Avenue. Did you know that Queen's Park Community Council... Local News\n10 Downing Street Inspiring Women Reception 21st May 2024 Samia attended 10 Downing Street's Inspiring Women Reception hosted by Chief Secretary to the Treasury Rt Hon Laura Trott MP, alongside her nominee, Jan... Local NewsWestminster News",
  "https_www_samiahersi_uk_/https_www_samiahersi_uk_cookies/content_2.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S"
}