{
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_press-release-summer-2021/content_14.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_anti-poverty-news/content_19.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nby Josh pizzuto-pomaco\nEVENING EXPRESS, 27 JUNE 2017\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_press%20release%20170425/content_17.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nTLC's Foodbank operation is part of a National network of Foodbanks called the Trussell Trust. Below is the latest press release from the Trussell Trust.\nPRESS RELEASE 25th April 2017 - The Trussell Trust\nFoodbank Use Continues to rise as new report highlights growing impact of Universal Credit rollout on foodbanks\nKey recommendations from the report:\nRecent positive engagement between The Department for Work and Pensions and The Trussell Trust at a national level is welcome. However, more information about the shape and form of Universal Support locally, particularly ahead of full UC rollout in an area, would bring clarity to foodbanks.\nA reduction of the six week waiting period for Universal Credit would make a significant difference to people’s ability to cope with no income. The ‘waiting period’, the time before the assessment period begins, could be reduced first.\nMore flexibility in the administration of Universal Credit is needed to support people moving onto the new system. For example, more support for people applying online who are unfamiliar with digital technology, and support to improve people’s ability to move into work and stay in work.\nResponding to today’s report, David McAuley, Chief Executive of The Trussell Trust said,\n“The move to simplify an often complex welfare system is a welcome one but any large reform can have unforeseen consequences. Foodbanks see first-hand how changes to the welfare system affect people on the ground, and so can offer an early warning to decision-makers. We are sharing our early observations with the Department for Work and Pensions to ensure any adverse side effects Universal Credit can have on people are addressed before full rollout is completed. We have been heartened by Secretary of State Damian Green’s willingness to engage, his department’s work to pilot improvements, and the recent changes to the Universal Credit taper rate which mean people moving into work will keep more of their earnings. We hope our insights can inform efforts to make sure the values on which Universal Credit is built are delivered in practice. To stop UK hunger we must make sure the welfare system really does work for everyone.”\nThe Trussell Trust is calling for help from the public to make sure people in crisis get the support they need. To make a donation to The Trussell Trust or find out how to help a local foodbank, please visit www.trusselltrust.org\nEnds\nNotes to Editor\nEarly Warnings: Universal Credit and Foodbanks can be accessed by clicking on the link.\nContact:\nSpokespeople, foodbank visits, regional breakdowns and, where possible, client case studies, available on request.\nPlease contact The Trussell Trust media team on 020 3137 3699 / press@trusselltrust.org. Out of hours call 07789 642 727.\nThe Trussell Trust:\nThe Trussell Trust is an anti-poverty charity that runs a network of over 420 foodbanks across the UK.\nTrussell Trust foodbanks provide three days’ nutritionally balanced food and support to people in crisis in the UK, and many foodbanks offer free additional services, like money advice and budget cookery courses as part of the charity’s ‘More Than Food’ approach, to build resilience and help prevent people needing referral to a foodbank again. Foodbank volunteers are also trained to signpost people to other agencies and services able to help resolve the underlying cause of the crisis.\nEveryone who comes to a Trussell Trust foodbank is referred by a professional such as a social worker, health visitor or schools liaison officer. Over 30,000 frontline professionals refer people to Trussell Trust foodbanks, and 50 percent are statutory agencies.\nOver 90 percent of food given out by Trussell Trust foodbanks is donated by the public. In 2016-17, 11,175 tonnes of food were given to people in crisis.\nThe Trussell Trust is a charity motivated by Christian principles. For more on The Trussell Trust visit trusselltrust.org\n*Trussell Trust foodbank statistics:\nTrussell Trust statistics are collected using an online data collection system into which foodbanks enter the data from each foodbank voucher. The system records numbers given three day emergency food supplies. The Trussell Trust is measuring volume – the number of people to whom it has given three days’ food supply (containing enough food for 10 meals). The Trussell Trust has consistently measured figures in this way and reports them at the middle and end of each financial year. Trussell Trust figures clearly state that we are counting the number of people to whom three days’ food has been given, but these are not necessarily unique people. Our data system is beginning to capture numbers of unique foodbank users on a national scale, and whilst it is too early to accurately use this figure, detailed evidence collected from a range of foodbanks indicates that on average, people needed 2 foodbank referrals in one year, leading us to estimate that approximately 591,477 people are likely to have been unique users.\nTrussell Trust data collection seeks to comply with ONS guidance. The Trussell Trust receives technical advice from a former senior government statistician, and has consulted with a range of statisticians ahead of publication.\n‘Benefit delays’ refer to people not receiving benefits to which they are entitled on time, this category can also include problems with processing new claims, or any other time-lags in people receiving their welfare payments.\n‘Benefit changes’ refers to the problems resulting from a change in people’s welfare payments, for example, people having their benefits stopped whilst they are reassessed. This can also include a sanction.\n‘Low income’ refers to anyone who is struggling to get by on a low income. This could be people in work, or people on benefits, for whom a small crisis e.g. boiler breaking down or having to buy school uniform etc, can be enough to mean that they cannot afford food.\nTrussell Trust figures cannot be used to fully explain the scale of the food poverty across the UK, because our figures only relate to Trussell Trust foodbanks and not to the hundreds of other independent food aid providers. There is no official data on other food aid projects, but estimates suggest that there are likely to be the same number again of non-Trussell Trust foodbank style projects in the UK.\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_early%20warnings%20universal%20credit/content_18.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nEarly Warnings : Universal Credit and Foodbanks\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_Gallery2/content_15.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nGALLERY 2 - IN THE NEWS\n\"Let's hope politicians at every level of government are listening to Richard Brooks when he says people need a hand up not just a hand out.\"\nEvening Express\nFormer Open Champion and European Ryder Cup team vice-captain Paul Lawrie OBE today pledged his support for the work of Trussell Trust Aberdeen South Foodbank TLC.\nRichard and the TLC team met Paul in the run up to the Aberdeen Standard Investments Scottish Open (Sept 2020)\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_aberdeen-bus-gate/content_10.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nRichard Brooks turning up the volume\nof North East voices on local and national issues\nI\nSince the start of 2024, Cllr Brooks has raised concerns on the legitimacy of the Experimental Order that has alienated the people of Aberdeen and the business community, drastically effecting the local economy with centre businesses closing due to the drop in revenue attributed to the bus gate situation. Over 12,000 people have raised objections to the bus gates, but the SNP-led administration has yet to listen.\nRichard Brooks turning up the volume\nof North East voices on local and national issues\nRichard Brooks turning up the volume\nof North East voices on local and national issues\nOnce again, Aberdeen is faced with chaotic decisions from the SNP-led administration, leaving nothing positive for the citizens and businesses in the centre. Although Richard Brooks brought an amendment to support the 11,000-backed Common Sense Compromise on the use of Bus gates, the SNP would not listen. In an effort to save face and mitigate the headlines, they rejected calls from the Conservatives for immediate action to save City businesses, preferring to defer and delay urgent decisions that could actually see some retailers go under.\nIn conflicted messaging, the bus companies report an increase in passengers using the buses since new incentives accompanied the implementation of the bus-gates. However, footfall in the city centre is dramatically down, begging the question as to where are all the extra bus passengers going?\nRichard Brooks has been consistent in backing our city business economy, and is pushing for action not just words. \"After all, whats the point in having improved bus travel when the destination has nothing left to offer.\" Richard says that he is, \"turning the volume up on our city voices so that Aberdeen does not turn into a ghost town.\"\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org/content_1.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_press-release-autumn-2020/content_4.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\n“I am delighted to help Richard and Amy, and the work of TLC, which is already making a real difference to peoples lives in the North East”\nPaul Lawrie OBE\nDuring the COVID lockdown it was necessary to use personal cars to pick up and distribute food. When Paul heard about this, he set up a 12 month lease agreement with Morrison Motors and handed the keys over to TLC. Through this act of kindness, approxiately 1000 meals were delivered to those in need, isolated and vulnerable during the 5 days leading up to Christmas 2020.\nSince then approximately 100 meals a week have been distributed across aberdeenshire and kincardineshire.\nTogether we have done more!\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_press%20release%20170620/content_7.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nPRESS RELEASE 170620\nTLC HELP IN CRISIS FOODBANK CFINE BY GIVING THEM 1.5 TONNE OF FOOD\nOn the 22nd of June, following an emergency meeting of Aberdeen Social Action Charity TLC, it was decided that TLC would donate 1.5 tonnes of food to the troubled CFINE foodbank.\nTLC, who have been operating since 2002, have 50 partners drawn from voluntary and community groups, schools, council departments, faith based groups and public sector staff. They have food banks operating from Torry, Tullos and Garthdee.\nTLC Chairman Rick Brooks said, \"Last year Instant Neighbour supplied 4000 food parcels, whilst CFINE reported that they provided 10,000 food parcels. This year the need has been far greater than anyone anticipated.\"\nIn the last four weeks TLC have given out almost one tonne of food as demand across the city increases.\nRick Brooks went on to say, \"The first quarter results for this year show that the need has doubled compared to the same period last year. However, through the generosity of the customers in Garthdee Sainsbury's and the Langstacht Tesco's we still have enough food to meet our ongoing demand. We are sharing our food with CFINE in the hope that together we can continue to help those suffering from food depravation across our city.\"\nLast year TLC, who have run community projects for fifteen years, gave out over 9 tonne of food. Whilst working primarily in Aberdeen South, TLC have had requests from all over the city. In response to social and economic challenges, TLC run school breakfast clubs (Kaimhill Primary School) and are about to partner with the Garthdee Parish Church with the \"Make Lunch : Lunch and Learn\" scheme, giving free meals to children during the school holidays.\nTLC Chairman Rick Brooks concluded, \"Aberdeen has been good to many of us over the years. Most people in need require a hand-up, not simply a hand-out. Through good relationships, and active partnerships we are make a substantial and sustainable difference. We can all help each other give something back to this great city. TLC helping CFINE is just one such example.\"\nEND\nNotes to the Editor:\nTLC is an Aberdeen based Social Action charity formed in 2002 by Rick and Amy Brooks to initiate engagement between local business and local communities with the aim of helping those in short-term crisis, be it with food deprivation and social isolation.\nTLC is a registered charity TLC SCIO, SC042674.\nTLC Foodbanks operate in partnership with the National Foodbank network, theTrussell Trust.\nTLC is grateful to all the business and business people that help, support, and/or sponsor our activities including Citrus Mix (Danny Cowie); Christ Central Church; Sainsburys, Asda, Tesco, Harlaw Academy, Inchgarth Community Centre, and various Lord Provosts, Councillors and MPs over the years.\nTLC was awarded a Spirit of the Community Awards for Garthdee in 2016.\nFurther response can be sought through Chairman Rick Brooks 07595 221 068 and/or Operations manager, Tim McIlroy 07542 049898.\nTLC use RichardBrooks.org to collate and distribute their research, data and press releases\nLatest NATIONAL foodbank statistics can be found here.\nLatest LOCAL foodbank statistics can be found here.\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_anti-poverty/content_12.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nEVENING EXPRESS, 27 JUNE 2017\nRichard turning the volume up again on Scotland's Child Poverty\nIt is totally unacceptable that nearly a quarter of all Scotland's Children live in poverty.\n8000 children in Aberdeen live in deprivation and food poverty.\nThat is 20% of our population. With an SNP-led Scotland having the worst child poverty in Europe for most of the last decade, what is this SNP-led administration going to do? I will not let them get away with doing nothing!\nProtection for women and children in the same-sex facilities debate\nA Notice of Motion was brought by the Conservative Party (M.Kusznir) instructing officers to develop a separate or single-sex space policy for Aberdeen City Council that ensures the protection of single-sex spaces in Council owned buildings.Debates following the proposed Gender Recognition (Scotland) Bill informs our need to act now to ensure single sex spaces are protected for the safety of our women and children. Despite my petitioning, and an hour of debate, the SNP chose to sit on their hands and voted to do absolutely NOTHING for the people of Aberdeen!\nEvening Express, 27 June 2017\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_press-release-autumn-2021/content_8.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_news/content_2.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nRichard Brooks turning up the volume\nof North East voices on local and national issues\nOpposition cross-party concensus: Cllr Tissera the subject of the 'New Scot' taunt, shouldered by Aberdeen Labour Group Leader Cllr Malik and Aberdeen Conservative Group Leader Cllr Brooks\nRichard Brooks turning up the volume\nof North East voices on local and national issues\nRichard Brooks turning up the volume\nof North East voices on local and national issues\nOnce again, Aberdeen is faced with chaotic decisions from the SNP-led administration, leaving nothing positive for the citizens and businesses in the centre. Although Richard Brooks brought an amendment to support the 11,000-backed Common Sense Compromise on the use of Bus gates, the SNP would not listen. In an effort to save face and mitigate the headlines, they rejected calls from the Conservatives for immediate action to save City businesses, preferring to defer and delay urgent decisions that could actually see some retailers go under.\nIn conflicted messaging, the bus companies report an increase in passengers using the buses since new incentives accompanied the implementation of the bus-gates. However, footfall in the city centre is dramatically down, begging the question as to where are all the extra bus passengers going?\nRichard Brooks has been consistent in backing our city business economy, and is pushing for action not just words. \"After all, whats the point in having improved bus travel when the destination has nothing left to offer.\" Richard says that he is, \"turning the volume up on our city voices so that Aberdeen does not turn into a ghost town.\"\nThank you for almost 7000 votes for Richard\nthat is an exceptional turnout, thank you.\nBut here's one of the funnier reports from the 2024 General Election by the \"Biased-Beano\" (actually the Courier. Must have been a slow news day!)\nRichard Selected to represent his childhood home\nin Arbroath & Broughty Ferry\nIt is a great privilege to be able to represent one of the areas I grew up in. As a school boy I went to Ladyloan School in Arbroath, had a fleeting attendance at Arbroath High, captained my house team, regularly went to see the Lichties football team play, walked the cliffs, fished the harbour wall; scored my first goal, had my first date, and got my first summer job; Lunan Bay and the Broughty Ferry were part of various day trips.\nWe have had years of an SNP led council, an SNP led government, and all we see is decline. In Scotland only the Tories can reverse this, because we bring investment not independence nonsense:\nWhere is the Investment in Arbrouth, Carnoustie, Broughty Ferry and the surrounding areas. Its being spent on camper vans, failed ferries, failed gender recognition bill, failed bottle return scheme and failed independence campaigns, and you're told 'its Westminsters fault!' Come on, get a grip SNP!\nTo be selected to represent the Conservatives in Arbroath and Broughty Ferry is an honour.\nIve always been straight:\nShambolic SNP Scottish Government's underfunding of PoliceScotland leaves Aberdeen needing to close community police stations, but the SNP do not want you to hear that!\nAn amendment was proposed on the 23rd January 2024, asking for Police Scotland to bring a report explaining why there is a proposal to close police stations across Aberdeen. Whilst the SNP's response was that the Police need to step up and \"operate in a more efficient manner\", Cllr Richard Brooks wanted to give them an opportunity to tell the people of Aberdeen that it is due to the substantial resource cuts to Police Scotland from the SNP national government. Aberdeen City Council's SNP-led administration desperately didnt want this to happen and again opposed giving Police Scotland any opportunity to clarify the matter. This is typical devious SNP tactics to stop the public knowing what is REALLY going on! Do not vote for the SNP again please!\nETZ St Fitticks - Richard Brooks left to pick-up the pieces for the people of Torry and Cove, amending the SNP-led Administation Motion; as the Labour Party miss the point completely, almost leaving the community with absolutely nothing!\nIf all you are interested in is political point scoring, the people of Aberdeen and the Northeast will lose out. The Labour party can never be trusted to get it right, and once again they nearly lost it all with a stupid, self serving amendment, leaving Richard with no choice but to take back ground for the Aberdeen South community by fusing the ability for the community to receive benefits parallel to any leasing of land...this FIRSTLY being brought to committee to be agreed before the lease is realised.\nThis is a massive win for the Communities effected by the ETZ development; which was only made possible by Richard arguing for the community and intervening while Labour grasped at fresh air and floundered in unprecedented manor. Only the Conservatives have the acumen to get the best deal for people of our City.\nWhilst the SNP administration fell silent, Cllr Richard Brooks raises concerns not readily reported in the Committee papers. Having done the hard work of finding and following links, and actually reading the Care Inspectorate reports, he challenges Officers over Child Safety once again, having firstly raised concern over Kingsford last year when a child escaped to the streets and was missing from the ELC setting for several minutes without staff being aware.\nAug/Sept 2023 - SNP fall silent as Richard Brooks raises concernes over Aberdeen North/South child security\nMay 2023 - SNP silent as Richard Brooks speaks up for Aberdeen South\nparents\nOnce again, Richard was left with no alternative but to raise the concerns of local parents over the findings of the School Care Inspectorate report, which detailed hygiene issues, hungry children, poor recording of medication; and staff addressing children in such a manner as to leave them confused and upset, impacting on their confidence and self-esteem. “Kirkhill parents are rightly concerned; but simply put, no one else seemed prepared to raise their voice on the parents behalf today. It’s the same in every meeting: no one but the Scottish Conservatives are speaking up for people in Aberdeen South”\nCameron Roy Reported in the P&J:\nCouncil Budget 2023 - SNP/LibDems are cutting the heart out of Aberdeen\nAn Embarrassment to the City of Aberdeen: The SNP budget - propped up by the spineless Lib Dems giving them a majority vote to cut libraries, to close swimming pools, to cut nursery schools, to reduce warm spaces, to take away funding from Sistema’s Big Noise Torry, to rip the heart out of our communities as we recover from a pandemic, fight the challenges of a cost of living crisis and high energy bills caused by the war in Ukraine. It’s shocking and its embarrassing that 12 months on, the SNP gravy train is already ruining our City. They talk about a light at the end of the tunnel, but its an oncoming SNP gravy train ready to drive over the peoples wishes. Please don’t ever vote SNP again!!\nJanuary 2023 - Fighting for our Teachers in Scotland\nWinter 2022 - Taking urgent action to secure the safety of our children\nAs Group Deputy Leader and Education Spokesperson for the Conservative party, Richard has taken an active role in making sure our schools get as much support from the SNP led administration as possible. In November 2022, Richard had reason to raise an urgent motion with regard to an incident where a child went missing from Kingsford nursery for 25 minutes before the alarm was raised. Through this motion Richard made an urgent call to ensure a repeat of this episode could not happen again anywhere in the city.\nExerts from the P&J online, November 7, 2022 by Lottie Hood:\nSummer 2022 Championing the Energy Industry in the Northeast\nIn a meeting with Rishi Sunak, Richard highlighted the growing concerns of his constuents and that of the whole of the North East and asked if the minister would continue to speak up for the energy sector. The SNP/Green Scottish Government appear to be making no sense to the region, or the nation on this and the SNP MP for Aberdeen South has been confusingly out-of-touch and silent in representing some 120,000 people in his area that work in the sector. Rishi reassured Richard that Oil and Gas has an increasingly important role to play in the energy security of the UK , and was important for sustained economic growth across the region as Scotland, and the rest of the UK, recover from the aftermath of the pandemic.\nMay 2022 Richard is Elected !\nKincorth Nigg & Cove\nCouncillors (L to R):\nBrooks (Conservative)\nNicol (SNP)\nRadley (SNP)\nThomson (Labour)\nSpring 2022 local elections\nIn an effort to give a louder voice to the communities he represents across the city, Richard has thrown his hat into the ring to become a councillor on the Southside of the city. An area predominently misrepresented by the SNP in local and national governments, Richard is seeking a somewhat improbable election as a Conservative and Unionist candidate for Kincorth, Nigg and Cove.\nWinter 2021 Richard interviewed by STV News\nSTV news reporter Haley Bouma asked to interviewed Richard as a leading authority on addressing social depravation in the North East, in the week leading up to Christmas.\nAn edited version for the evening news is HERE.\nFor those that dont know, Under the current national regime, Scotland has the worst child poverty statistics in Europe, the worst drug death rate in Europe, and we are the heart desease central of Europe. This is unacceptable and cannot continue. Richard will use whatever means appropriate to see these statistics reversed.\nWinter 2021 TLC win Scottish Charity of the Year look HERE.\nAutumn 2021 Cllr Douglas Lumsden MSP Supports TLC's work across the North East.\nFor more information, look HERE\nSummer 2021 TLC publically commended in Scottish Parliament look HERE\nAutumn 2020 Former Golf Champion Supports the work of TLC during the COVID lockdown.\nFor more information, look HERE\nSPRING 2019 TLC TO OPEN ANOTHER FOODBANK CENTRE IN KINCORTH. For more information, look HERE\nSEPTEMBER 2018 RICHARD SETS UP A PARTNERSHIP WITH ABERDEEN FOOTBALL CLUB COMMUNITY TRUST.\nFor more information, look HERE\nJUNE 2017 TLC PARTNERS TRUSSELL TRUST LAUNCH OXFORD UNIVERSITY STUDY ON\nFOODBANK USE. For more information, look HERE\nJUNE 2017 TLC TO HELP IN CRISIS FOODBANK CFINE WITH 1.5TONNE OF FOOD\nFor more information, look HERE\nJUNE 2017 FIRST 6 WEEKS RESULTS SHOW FOODBANK USAGE DOUBLED\nFor more information, look HERE\nTogether we can do more!\nTribal politics has never been Richard's 'thing'. Good policies and good performance in the communities that make up Aberdeen is what he is looking for. We hope that the information here will help you articulate an opinion, and more importantly join him in his quest to see communities and social cultures transformed and enhanced for the vulnerable and isolated. The impossible goal he strives for is the elimination of social depravity in his communities across the North East of Scotland.\nIN YOUR COMMUNITY\nSince 2002/2003 Richard has been actively involved in trying to give people a hand-up rather than merely a hand-out. Having worked with George Bain at Aberdeen night Shelter in the early 2000's Richard realised that it wasn't just the people that needed to experience change, but the society and culture they were exposed to. Since then, he has been involved in many projects to see transformation across the city.\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_press%20release%20180907/content_11.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nPRESS RELEASE 180907\nTLC AND ABERDEEN FOOTBALL CLUB\nCOMMUNITY TRUST PARTNERSHIP ANNOUNCED\nSocial Action group TLC, who run youth groups, breakfast clubs, community groups and foodbanks have teamed up with Aberdeen Football Club Community Trust (AFCCT) to provide facilities for charities, groups, and families that would ordinarily not have the opportunity to watch a football match in a coroporate hospitality box. One of the families using it this week was a single parent family who were able to invite their friends for a 'one of a kind' experience. Ingrid Akindileni said, \"This is a wonderful experience. I cannot thank Richard Brooks, TLC and Aberdeen Football Club [Community Trust] enough for doing this for us.\"\nTLC Chairman Rick Brooks said, \"We are delighted to jointly sponsor this opportunity with AFCCT for the 2018/19 season. No one can truly measure the way this will affect the communities we work into. I serve and support some of my city's poorest and most vulnerable people and families. To have the opportunity to work with AFCCT and offer this facility is a winner for all involved.\"\nAFCCT Chief Executive Ally Prockter said, \"We are delighted to be sponsoring the main stand box with TLC, as this partenrship enables us to give support to many of our own participants as well as other organisations.\"\nTLC, who have been operating since 2002, have 50 partners drawn from voluntary and community groups, schools, council departments, faith based groups and public sector staff. They have outreach and engagement projects across Aberdeen, and in particular in the South of the city.\nTLC have run community projects for seventeen years, including primary school breakfast clubs, youth outreach groups, community clean-up groups, befriending groups and foodbanks. Over the years they have touched more than 100,000 lives. They have an ongoing partnership with Aberdeen Football Club Community Trust, sponsoring a corporate box at Pittodrie. The TLC foodbanks are run in Partnership with the Trussell Trust.\nEND\nNotes to the Editor:\nTLC is an Aberdeen based Social Action charity formed in 2002 by Rick and Amy Brooks to initiate engagement between local business and local communities with the aim of helping those in short-term crisis and social isolation.\nTLC is not just a Foodbank organisation. It is a Social Action Charity working in Children and Youth engagement projects with schools, football clubs, and community groups. It currently runs one youth engagement project, two school breakfast clubs and three foodbanks.\nTLC is a registered charity TLC SCIO, SC042674.\nTLC Foodbanks operate in partnership with the National Foodbank network, the Trussell Trust.\nTLC is grateful to all the business and business people that help, support, and/or sponsor our activities including Citrus Mix (Danny Cowie); Christ Central Church; Sainsburys, Asda, Tesco, Harlaw Academy, and the Lord Provost, Councillors MSPs and MPs over the years.\nFurther response can be sought through Chairman Rick Brooks 07595 221 068 and/or Operations officer, Tim McIlroy 07542 049898.\nTLC use RichardBrooks.org to collate and distribute their research, data and press releases\nLatest NATIONAL foodbank statistics can be found here.\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_gallery/content_3.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nSo much more can be done to transform our communities if we work together. Local councillors, community leaders, MPs and MSPs from all political parties have joined Richard in seeing positive change come to communities in Aberdeen.\nFrom Garthdee, Tullos and Torry to Union Square and Bucksburn, projects have started up. If you have an ideas, or you would like to be involved please drop him a line.\nYou can not buy it. It cannot be demanded or taken. It isn't a commodity that is easily handled. Its near-on impossible to replace it.\nBut you can choose it!\nLoving your neighbour is a choice.\nWhen you choose to love your community, wonderful things start to happen: You find family. A family who are there to support you through the hard times and to celebrate with you through the successes.\nEverywhere Richard and Amy go, their main message is love. It changes everything! Join them today.\nWhen one community suffers, our city suffers. Several relationship have been formed across the city so that when there is a need we can surely partner together to help.\n\"the world doesn't need any more spectators and commentators, it needs more 'doers' \"\nIn recent times the Community Food Initiative North East (CFINE) Foodbank hit a food crisis; a local school needed help to run a summer fayre; new students were struggling .... By partnering with various organisations and businesses across the city a remedy was found.\n\"We are immensely grateful for what you have done for us\"\nDave Summers, CEO, CFINE\nWe have worked with various organisations to get food out during the COVID19 Pandemic. Paul Lawrie Golf Centre provided TLC with a delivery van\n\"Delighted to support the great work being done by TLC Aberdeen.\"\nPaul Lawrie, former Open Champion\n\"By the strength of our common endeavour, we achieve more than we achieve alone so as to create for each of us the means to realise our true and full potential, and for all of us a community in which power, wealth and opportunity are afforded and managed by the people for the people. The objective is for the individual to fulfil their potential and ambition. My role is as the enabler of this, not the controller of it, aiming not to limit that ambition or those goals, but to open up their possibility to all. This is real community, and it is not constrained by old geographical lines.\"\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_bio/content_5.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nRichard was elected to Aberdeen City Council in May 2022, and is now the Conservative Group Leader; he is also the former Conservative Parliamentary candidate for Arbroath & Broughty Ferry.\nBorn in Devonport, Plymouth; Richard went on to live in Arbroath, attending primary and secondary level schools before joining the Civil Service as an engineering apprentice, and has gone on to spend over 25 years in the North East of Scotland (working mainly in Aberdeen's Oil and Gas sector), and being the founding member of a mulit-national award winning anti-poverty charity, recognised as the first Food bank in Scotland.\nA former shipyard worker, Richard worked his way from the shopfloor through to senior management, gaining degrees in Law, Politics, Science and Divinity. Today he is a director, and engineering manager in a multi-national energy-sector company.\nHis ongoing interest in social action and social justice led him to study law, starting the anti-poverty charity TLC in June 2002, believed to be the first exclusive food bank in Scotland. Richard continues to be aware of the deprivation across Scotland often neighbouring great wealth, which fuels his national-commitment to seeing long-term solutions, and his north east commitment to see near-term change.\nHis efforts have been relentless in alleviating deprivation and social isolation throughout the last 20+ years, and through the double-national award-winning work of TLC, he has now seen over 100,000 people reached across the north east, a work that he and his wife Amy have been commended for at Holyrood on two seperate ocassions.\nElections and a close view of local & national goverment.\nIn May 2022, against a challenging post-COVID backdrop, Richard ran and was duly elected as a Conservative and Unionist Councillor in Aberdeen South (Kincorth, Nigg and Cove).\nSince then, Richard has seen firsthand that the SNP do not listen to the people. In cities like Aberdeen they have introduced bus gates, LEZ, Visitor Levy (Tourist Tax) driving local economies into the ground; and here, rendering Aberdeen city centre a barren shadow of its former self. They have closed swimming pools, libraries and attempted to defund major 3rd sector organisations. And now nationally, the SNP are presiding over the highest child poverty in Europe, the highest drug related deaths in Europe, the highest number of food banks per capita in the UK, the lowest resourced police force in the UK, the worst educational attainment in the UK, a failing Scottish NHS, a failed Gender Recognition Bill, a failed Deposit Return Scheme, unworkable Hate Crime legislation ... you could say \"everything they touch goes wrong\" They are leaving a legacy of millions of pounds wasted (and thousands of pounds missing).\nToday Richard is turning your volume up across the North East, holding the SNPs feet to the fire until they are willing to hear the people's voices and take approriate action; No amount of spin can save the SNP now - they are a chaotic party creating disaster and dysfunction both locally in the North East and across our once great country.\nWHY POLITICS? Not just another Politician : Through every challenge and success, Richard has worked with people of all generations and vocations to see positive change happen. Much of this has rightly been under the radar and without a political agenda. However, there are hundreds of thousands of people out there that need to be heard now. Richard is using politics as the megaphone to get your voice heard.\nAt election time, its not simply about their political colours, \"I'd ask you to notice the difference between the promises of many who say they will do lots, and the few who have already done it for years.\"\nFor the sake of your town, city and region, select the one who has already delivered and has a proven record of doing it time and time again!\n\"If you want to have something youve never had before, you have to do something youve never done before\"\n- Bill Wilson Metro World Child\n#VOTE4RichardBrooks\nName | Richard J Brooks |\nDate of birth | July 10th |\nLocation | North East Scotland |\nrbrooks@aberdeencity.gov.uk rick@richardbrooks.org | |\nPhone | 01224 067 911 |\nQualifications | B.Div(Hons), M.Sc(Eng) M.Res(Politics) LLM (Law) English and Scottish Universities. |\nInterests and Experience | Anti-Poverty action; Economic Development and Transformation; Social Action/Justice; Energy Transition & Energy Security; Education and Lifelong Learning. |\nPet hates | Inequality, Racism, Homophobia, Exclusion and Dishonesty; |\nHobbies | Music: Once wrote a Eurochart #2 (UCB playlist) Football: avid supporter of Scottish Football: Cove Rangers & Arbroath; elsewhere Plymouth Argyle & Sunderland; and eduction/research |\nAffiliations | Burgess of the Guild, City of Aberdeen Aberdeen University General Council Board Chartered Engineer (Engineering Council), Chartered Physicist, (Institute of Physics) Chartered Marine Engineer (IMarEST) Member of the Institute of Government & Policy |\nCredibility and Action through a genuine Voice for the People | CREDIBILITY : Performance not just Promises When Richard has promised in the past, it has been fulfilled. Too many politicians make promises they never fulfil - dont let them get away with it! Let's not lean our whole life on the promises of others. Let's measure what politicians have done already... for many of them it's nothing but talk! There are too many that have been ejected, dejected and rejected by today's society. Richard continues to work hard to narrow the chasm between those who have and those who have not. Most people do not want a hand-out, they simply need a hand-up. This is both Richard's historical achievements and continued goal. |\nACTION : Listening and Acting History has recorded that Richard has not just listened to the people, he has fought and brought change. Richard continues to push for more: more social and economical changes in both the North East and the nation, as the opportunities afford themselves through community and politial projects. | |\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_foodbank%20statistics/content_13.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nIn an effort to keep the \"finger on the pulse\" in our communities, RichardBrooks.org in conjunction with TLC, publish research, facts and figures. TLC receive referrals from fifty agencies including Aberdeen City Council (Welfare, Social Work, Criminal Justice team, etc), Medical Practices and Medical Groups (Peterculter, Torry, etc). Founded in 2002 by Richard and Amy Brooks, TLC has helped tens of thousands of people throughout Aberdeen and the Shire dealing with food poverty and social deprivation; loneliness and isolation by provision and education, inclusion and community. For more information, or if you would like to commission a study, please drop us a line.\nSUMMARY REPORT (APRIL 1, 2017 - MAY 13, 2017)\nDuring the same period in 2016 the total number of food parcels requested was 174. This is therefore an increase of exactly 100%\nThe reasons for using the TLC foodbanks are various. The known top four causes amongst the 348 users for the period April 1st to May 13th are:\n- 98 people unable to buy food due to debt;\n- 96 people affected by Low Income;\n- 61 people affected by changes to their benefits;\n- 31 people affected by delays in receiving their benefits.\nThe two major age groups reached by the TLC foodbank are:\n- 164 people aged 25-64 yrs;\n- 83 Children aged 5-11 yrs.\nSingle Parent families make up the majority of the users at circa 39%\n2016-2017 PAST YEAR SUMMARY\nDuring 2016 - 2017, 9.23 tonnes of food was distributed across the city. Whilst TLC is primarily an Aberdeen South Foodbank in partnership with the Trussell Trust, it does see many clients from the North of the city. It is worth noting that - although we have no means of verifying these statistics - the charity, Instant Neighbour reported that they had distributed 4000 for parcels in 2016, where as the network of smaller food banks known collectively as CFINE reported giving out 10,000 food parcels in 2016. It is therefore reasonable to conclude that Aberdeen is seeing some of the worst food poverty in its recent history.\n___________________________________________________________________________________\nTLC RESPONSE: Latest with 5-11 year olds\nThe figures for children of age 5-11 is the largest adolescent group in need. Therefore, TLC has been piloting two ways of alleviating this situation, starting in Aberdeen South.\nIn January 2017, TLC introduced a school breakfast club, increasing from once to twice a week in March. In communication with the local school, TLC were made aware of families who would benefit from their children being given free breakfast. We wish to thank Asda for their ongoing support with this, including providing a staff volunteer.\nWe have been asked, \"But what will happen in the holidays?\"\nThere appears to be a challenge for families on low/no income during School holidays. Children who normally obtain free lunches at school are struggling to have enough provision at home for lunch during the holiday period.\nHaving been made aware of this situation TLC will be piloting a children's \"Make Lunch: Lunch and Learn\" in June where lunch will be provided to children, whilst reaffirming social behaviours/education. This will be piloted in the South of the city, in conjunction with the Garthdee Parish Church and will be achieved from their church kitchen, using their cafe facilities.\nIf you would like to be involved or contribute/sponsor the event please drop us a line at info@RichardBrooks.org .\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_press%20release%20190104/content_6.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nPRESS RELEASE 190104\nTLC OPEN ANOTHER DISTRIBUTION SITE IN KINCORTH\nIn 2019, Aberdeen's biggest Foodbank, TLC, will open its doors to the community of Kincorth.\nTLC, who have been operating since 2002, have 50 partners drawn from voluntary and community groups, schools, council departments, faith based groups and public sector staff. They have foodbank distribution centres operating in Torry and Garthdee.\nTLC Chairman Rick Brooks said, \"Last year we supplied food to Instant Neighbour and CFINE as well as providing for our two main distribution sites in Torry and Garthdee. We have been engaging with the community regularly thoughout 2018 and with the help of South St. Nicholas Kincorth Church, we will officially open in 2019, operating once a week on tuesday afternoons from 1pm until 4pm.\"\nReverend Eddie McKenna said, \"We are working with TLC because the need across my community is a growing concern. This will make huge difference to our area.\"\nThroughout 2018, the major crisis that led to foodbank usages was dominated by the 'low income' category. Other factors such as debt, and benefit changes have also caused people to visit one of the TLC foodbanks. TLC gave out over 13 tonne of food in 2018, a 40 % rise on the previous year.\nRick Brooks went on to say, \"We work primarily in the South of the city. Our Operations Officer, Tim McIlroy is doing a great job in reaching this community, making a real difference to those suffering from food depravation. We have over 30 volunteers, without whom we would never be able to operate. I am sincerely grateful that people generously come with their time and talents, and the people of Aberdeen give through our supermarket partners Tesco and Sainsburys.\"\nTLC have run community projects for seventeen years, including primary school breakfast clubs, youth outreach groups, community clean-up groups, befriending groups and foodbanks. Over the years they have touched more than 100,000 lives. They have an ongoing partnership with Aberdeen Football Club Community Trust, sponsoring a corporate box at Pittodrie. The TLC foodbanks are run in Partnership with the Trussell Trust.\nEND\nNotes to the Editor:\nTLC is an Aberdeen based Social Action charity formed in 2002 by Rick and Amy Brooks to initiate engagement between local business and local communities with the aim of helping those in short-term crisis and social isolation.\nTLC is not just a Foodbank organisation. It is a Social Action Charity working in Children and Youth engagement projects with schools, football clubs, and community groups. It currently runs one youth engagement project, two school breakfast clubs and three foodbanks.\nTLC is a registered charity TLC SCIO, SC042674.\nTLC Foodbanks operate in partnership with the National Foodbank network, the Trussell Trust.\nTLC is grateful to all the business and business people that help, support, and/or sponsor our activities including Citrus Mix (Danny Cowie); Christ Central Church; Sainsburys, Asda, Tesco, Harlaw Academy, and the Lord Provost, Councillors MSPs and MPs over the years.\nFurther response can be sought through Chairman Rick Brooks 07595 221 068 and/or Operations officer, Tim McIlroy 07542 049898.\nTLC use RichardBrooks.org to collate and distribute their research, data and press releases\nLatest NATIONAL foodbank statistics can be found here.\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_council-news/content_9.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nRichard Brooks is Aberdeen City Conservative Group Leader. As an elected member of Aberdeen City Council he has been appointed to the following committees:\nRichard is proactively holding the SNP/LibDem coalition-led Aberdeen City Council Administation accountable. This page is a record of some of the items that Richard has debated and strongly defended, and the changes that he has led in improving the city.\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN",
  "https_www_richardbrooks_org_/https_www_richardbrooks_org_community/content_16.html": "A VOICE FOR ABERDEEN - A VOICE FOR THE NORTH EAST\nRichard has spent a number of years speaking up for those who cannot speak for themselves, young and old alike. As well as his work with Call-it-Out, and his strong stance against community bullying (either verbally, psychologically, or physically), Richard has been invited to speak at various forums on diversity and inclusion.\nWhy not join the conversation with him on 22nd July 2021.\nTogether we can do much more!\nRegister for FREE here: https://lnkd.in/dwHz7Fm\nMore can be done together than apart. Through partnership with others Richard has managed to see many projects rise-up and remain sustainable. Other projects have purposely been for a set period of time. What ever the need, he is convinced that pooling ideas & resources is the starting point\nCommunity Involvement sometimes needs to see Partnership & Vision\nBucksburn\nThe Mums and Toddler's group, Bundles of Joy is a joint initiative with TLC, Christ Central Church, Aberdeen City Council and the Beacon Community Centre.\nKaimhill Summer Fayre\nDep. head got in touch as there was a shortage of bodies to run all the stalls at the school sumer fall That was 2014! Every year TLC help with this fair, and Richard and his colleague Tim are now infamous for \"the stocks\" where you get to sponge your favourite teacher.\nGarthdee Community Clean-up\nParks and pitches, and in particular an unused, overgrown space that used to be three tennis courts were revamped. Hours of chopping back trees, weeding, treating surfaces, re-netting and re-lining has seen this once forgotten space back on the map. This was done in partnership with the Inchgarth Community Centre and TLC.\nFrom 2002 Richard has been involved in various outreach projects to the poor and vulnerable in the Northeast. In 2010 TLC decided to look for a permanent home to house their operations. Initially, Inchgarth Community Centre generously let TLC use their facility as most of the work was in the South of the city, but within two years they had outgrown that space in terms of users and food storage. Through partnership with then SNP Cllr Gordon Townson and Danny Cowie at Citrus Mix, Richard was able to move the main foodbank operation to Citrus House. In 2015 the TLC Torry Foodbank was officially opened to the public, followed quickly by the opening of the TLC Foodbank at the Deeside Family Centre and the addition of the Union Square storage facility. Today, that partnership extends to so many other groups, not least the Robertson Trust, Shell UKE, Paul Lawrie Golf Centre, etc.\nWith around 100 people being fed through these outlets every week, the work of TLC has providing an invaluable service to the Northeast, now extending down to Dundee....\n....but its not just a hand-out, its a hand-up, as many users have taken advantage and benefitted from signposting to other agencies in our area.\nHelping your city, community and neighbourhood doesn't always take you starting something new. If it's already happening, join it!\nRichard has helped raise money for Aberdeen Football Club Community Trust (AFCCT), got involved in the 2017 pilot of AFCCT's Walking Football which has become hugely successful (Pictured front row. The only time he had the ball!)\nHelping raise money for Kaimhill, Broomhill, Airyhall School, St Johns Ambulance, 'Compassion', 'Cash for Kids', 'Children with Leukemia', 'Macmillan' and many many more. If its happening already, Richard maybe able to help. Maybe you need a hand-up rather than a hand-out. Maybe you have a great community project that Richard may be able to help. He can't be everywhere at once, but if you don't ask you will never know.\n#BackBrooks\n© 2024 Copyright. RichardBrooks.org | Promoted by J Bennett on behalf of Richard Brooks, both of East Balmirmer, Arbroath, DD11 2PN"
}