{
  "https_www_jamessmalledwards_com_/https_www_jamessmalledwards_com_privacy-policy/content_2.html": "We respect your privacy and are committed to protecting your personal data. This privacy policy will inform you as to how we look after your personal data when you visit our website (regardless of where you visit it from) and tell you about your privacy rights and how the law protects you.\n1. WHO WE ARE AND HOW TO CONTACT US\nJames Small-Edwards for West Central is the controller and responsible for your personal data (referred to as “we“, “us” or “our” in this privacy policy).\nIf you have any questions about this privacy policy or any concerns or complaints about how your data has been processed, please contact us at [email protected].\n2. PURPOSE OF THIS PRIVACY POLICY\nThis privacy policy aims to give you information on how we collect and process your personal data through:\nBy collecting such data, we will be able to inform you about relevant developments that relate to the Campaign and what you can do to help the Campaign as it progresses.\nIn order to advance the Campaign, we may share your data with other campaigns and movements that share the values, principles and aims of James Small-Edwards for West Central (including, but not limited, to other Labour Party elections) and which are supportive of our objectives. This will only be done in limited circumstances where we are satisfied that there is a lawful basis to permit such a transfer to take place.\nThis website is not intended for children and we do not knowingly collect data relating to children.\nIt is important that you read this privacy policy, together with any other privacy policy or fair processing policy we may provide on specific occasions when we are collecting or processing personal data about you. We want you to be fully aware of how and why we are using your data.\nThis privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\n3. THE DATA WE COLLECT ABOUT YOU\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data). We may collect, use, store and transfer different kinds of personal data about you which we have grouped together as follows:\nWe also collect, use and share aggregated data such as statistical or demographic data for any purpose. Aggregated data could be derived from your personal data but is not considered personal data in law as this data will not directly or indirectly reveal your identity. For example, we may aggregate your usage data to calculate the percentage of users accessing a specific website feature. However, if we combine or connect aggregated data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this privacy policy.\n4. HOW WE COLLECT YOUR PERSONAL DATA\nWe use different methods to collect data from and about you.\nProvided by you – directly\nYou may give us your name and contact details by filling in forms or by corresponding with us by post, phone, email or otherwise.\nThis also includes personal data you provide when you register as a supporter of the Campaign, subscribe to any mailing lists, give feedback and/or contact us directly via such forms, email, telephone or similar mediums.\n5. HOW WE USE YOUR PERSONAL DATA\nThe uses\nWe will only use your personal data when the law allows us to. We will use your personal data in the following circumstances:\nThe legal bases\n6. WHEN WE WILL SHARE YOUR DATA\nWe will never sell your personal data to any other organisation and we will not share your personal data unless it is obvious that this is what we are going to do (such as the signing of a petition). We may share your data:\n7. WHEN YOUR DATA MAY BE USED FOR MARKETING\nOur Marketing\nYou will receive marketing communications (i.e. communications promoting the Campaign and/or individuals related to it) from us if you have requested information from us and/or you have subscribed to receiving that marketing.\nRight to object/Opting-out\nYou can ask us to stop sending you marketing messages at any time by contacting us at [email protected].\nYou have a right to opt-out of your data being used for direct marketing.\nIf we process your data on the basis of “legitimate interests” or “a task carried out in the public interest”, then you have the right to object to us using your data in that way. This right is not absolute and we may continue to process your data if we can demonstrate compelling legitimate grounds for the processing.\nWhere you opt-out of receiving these marketing messages, this will not apply to personal data provided to us as a result of other engagement or transactions with us (so, for example, if you opt-out of receiving messages from us – this will not cause us to change the way we use data you have provided for processing donation payments).\n8. COOKIES\nA cookie is a tiny text file that is stored on users’ machines (computers, tablets or mobile devices). We may use cookies in order to tailor your experience on our site according to the preferences you have specified. You can set your browser to refuse all or some browser cookies, or to alert you when websites set or access cookies. If you disable or refuse cookies, please note that some parts of this website may become inaccessible or not function properly.\n9. CHANGE OF PURPOSE\nWe will only use your personal data for the purposes for which we collected it, unless we reasonably consider that we need to use it for another reason and that reason is compatible with the original purposes (as set out in this privacy policy). If you wish to get an explanation as to how the processing for the new purpose is compatible with the original purpose, please contact us. If we need to use your personal data for an unrelated purpose, we will notify you and we will explain the legal basis which allows us to do so.\n10. CHANGES TO THE PRIVACY POLICY\nWe keep our privacy policy under regular review and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website.\n11. THIRD-PARTY LINKS\nThis website may include links to third-party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\n12. INTERNATIONAL TRANSFERS\nIn order to process your personal data for the purposes outlined in this Privacy Policy, we may need to transfer your data to countries or jurisdictions outside the European Economic Area (EEA). In each case, we ensure that our suppliers provide adequate protection for the rights of data individuals in connection with the transfer of their personal data. Currently, we expect all suppliers to use a standard contractual clause approved by the European Union or be part of the Privacy Shield scheme in the United States.\n13. DATA SECURITY\nWe have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. In addition, we limit access to your personal data to those employees, agents, contractors and other third parties who have a business need to know. They will only process your personal data on our instructions and they are subject to a duty of confidentiality. We will notify you and any applicable regulator of a breach where we are legally required to do so.\n14. HOW LONG WE WILL HOLD YOUR PERSONAL DATA FOR\nWe will only retain your personal data for as long as reasonably necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, regulatory, tax, accounting or reporting requirements. We may retain your personal data for a longer period in the event of a complaint or if we reasonably believe there is a prospect of litigation in respect to our relationship with you.\nTo determine the appropriate retention period for personal data, we consider the amount, nature and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal, regulatory, tax, accounting or other requirements.\n15. YOUR LEGAL RIGHTS\nAs a data subject, you have a number of rights in relation to your personal data. Below, we have described the various rights that you have, as well as how you can exercise them.\nRight of access\nYou may, at any time, request access to the personal data that we hold which relates to you (you may have heard of this right being described as a “subject access request“).\nWe follow the ICO’s “Subject Access Code of Practice” when dealing with requests for access to personal data. You can read this code by visiting https://ico.org.uk/media/for-organisations/documents/2014223/subject-access-code-of-practice.pdf.\nPlease note that this right entitles you to receive a copy of the personal data that we hold about you in order to enable you to check that it is correct and to ensure that we are processing that personal data lawfully. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to or contain your personal data.\nYou can exercise this right at any time by contacting us at [email protected] and telling us that you are making a subject access request. You do not have to fill in a specific form to make this kind of request.\nYour right to rectification and erasure\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (you may have heard of this right described as the “right to be forgotten“).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is right. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase, we will tell you what that reason is at the time we respond to your request.\nYou can exercise this right at any time by contacting us at [email protected] and telling us that you are making a request to have your personal data rectified or erased and on what basis you are making that request. If you want us to replace inaccurate data with new data, you should tell us what that new data is. You do not have to fill in a specific form to make this kind of request.\nYour right to restrict processing\nWhere we process your personal data on the basis of a legitimate interest (see the sections of this privacy policy which explain how and why we use your information), you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data: (a) if you dispute the accuracy of that personal data and want us to verify that data’s accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; or (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nPlease note that if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it. You can exercise this right at any time by contacting us at [email protected] and telling us that you are making a request to have us stop processing the relevant aspect of your personal data and describing which of the above conditions you believe is relevant to that request. You do not have to fill in a specific form to make this kind of request.\nYour right to portability\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nBecause of the kind of the nature of our work do and the systems that we use, we do not envisage this right being particularly relevant to the majority of individuals with whom we interact. However, if you wish to transfer your data from us to a third party, we are happy to consider such requests in good faith.\nYour right to stop receiving communications\nAs noted above, where we send you email marketing communications (or other regulated electronic messages) you have the right to opt-out at any time. You can do this by using the ‘unsubscribe’ link that appears in the footer of each communication (or the equivalent mechanism in those communications).\nAlternatively, if for any reason you cannot use those links, or if you would prefer to contact us directly – you can unsubscribe by contacting us at [email protected] and telling us which communications you would like us to stop sending you.\nYour right to object to automated decision making and profiling\nYou have the right to be informed about the existence of any automated decision making and profiling of your personal data, and where appropriate, be provided with meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing that affects you.\nExercising your rights\nWhen you write to us making a request to exercise your rights, we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help us to verify your identity. This is a security measure to ensure that personal data is not disclosed to any person who has no right to receive it. We may also contact you to ask you for further information in relation to your request to speed up our response.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be, the faster and more efficiently we can deal with your request. If you do not provide us with sufficient information, then we may delay actioning your request until you have provided us with additional information (and where this is the case, we will tell you).\nYou will not usually have to pay a fee to access your personal data (or to exercise any of the other rights). However, we may charge a reasonable fee if your request is clearly unfounded, repetitive or excessive. Alternatively, we could refuse to comply with your request in these circumstances.\nWe try to respond to all legitimate requests within one (1) month. However, it could take us longer than a month if your request is particularly complex or if you have made a number of requests. In this case, we will notify you of this and keep you updated.\n16. RIGHT TO LODGE A COMPLAINT\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom.\nThe contact details for the ICO are:\nLast updated: 30/09/2023",
  "https_www_jamessmalledwards_com_/https_www_jamessmalledwards_com/content_1.html": "James brings a very special combination of passion and intellect and offers the much needed insights of his generation to refresh and revive our politics. He is well equipped to make a significant contribution to London-wide Government.\nJames is a talented councillor who has the values, work ethic and policy knowledge to be an excellent Assembly Member for West Central. He has my full support.\nFirst working in my office and now as a councillor, I’ve seen James’ talents first hand. He would make an excellent Assembly Member and he has my full endorsement.\nJames has proved himself to be an effective campaigner and an energetic councillor. He would make a fantastic Assembly Member for West Central and he has my full support.\nJames has been brilliant in Westminster and I have no doubt he would bring that same energy and determination to the London Assembly.\nMy name is James Small-Edwards and I’m standing to be our London Assembly Member for West Central. I was born and bred in this area and have lived here my entire life. This community means everything to me.\nMy spur to get more involved in politics came during the pandemic when I was a key worker at a local food bank. Whilst we provided vital support at that difficult time by delivering thousands of meals right across West Central, I felt frustrated that in modern Britain food banks had to exist at all. Their continued existence — alongside Brexit, our crumbling hospitals and the cost of living crisis — is a damning verdict on 14 years of Conservative government.\nBut it does not have to be this way. This is the most marginal seat on the London Assembly. So if you want an Assembly Member who will stand up to Tory divisiveness and champion a safe, clean and green West Central, then I’d be honoured to have your support on May 2nd.\npay rise for\nlocal careworkers\ncouncil homes\nby 2026\nsecured for\ncost of living\nchildren eligible for\nfree school meals\na week supported with\nfood aid during Covid\nto support local\nhigh streets\ncharging\npoints introduced\nreopened after\nclosure\nThere are things that I will do to make this happen\nBrexit, the pandemic and Liz Truss' mini-budget have hugely damaged West Central's economy. I will advocate for closer ties to the EU to help our businesses thrive and push for more support for local high streets.\nWest Central has some of the highest property costs not just in the UK, but in the world. I will back more social and truly affordable housing to stem this crisis.\nI support the New Met for London plan which has a focus on local community policing. We also need to address the causes of crime by reducing inequality and increasing youth club provision.\nThe climate crisis is the greatest issue of our age and for our generation. I will promote active travel, champion the expansion in EV charging points and back measures to clean London’s toxic air.\nThe Tories have reneged on their promise to rebuild or refurbish St Mary's, Charing Cross and Hammersmith hospitals by 2030. I will campaign for them to get the funding they urgently need.\nTomorrow from 10am, #AssemblyPlanning will ask guests how policies are set and decisions are made around the delivery of tall buildings in London. Find out more: https://www.london.gov.uk/who-we-are/what-london-assembly-does/london-assembly-press-releases/are-high-rise-housing-policies-working-london\nThere are only a few days left to take part in #AssemblyHousing's survey on leasehold charges in London, closing Friday. Don't miss out on your chance to share your experiences with the Committee. https://survey.alchemer.eu/s3/90779503/5094431e0ad2\nI recently questioned @MayorofLondon on the Government’s Planning changes.\nPlanning reform is key to unlocking growth and building the homes Londoners need 📈🏠\nOn this day 80 years ago, the Nazi concentration camp at Auschwitz was liberated.\nOn Holocaust Memorial Day, we reflect on the horrors that the Jewish people experienced and commemorate those who lost their lives.\nToday it was announced that the @metpoliceuk have been moved out of special measures. This is testament to the hard work of @SadiqKhan, the Commissioner and all those who have made progress in improving performance and rebuilding public trust.\nSee my full statement below👇\nBrilliant to visit @ImperialCollege with @JSmallEdwards and @StephenCowan.\nFrom climate innovation to green entrepreneurship and world-leading air quality research, Imperial is driving the solutions needed to create a fairer, greener London.\nFind out more ➡️…\nTomorrow from 10am, #AssemblyHousing will ask guests about how local authorities, voluntary and community sector organisations, and others provide housing to support women leaving prison. Find out more: https://www.london.gov.uk/who-we-are/what-london-assembly-does/london-assembly-press-releases/difficulty-finding-secure-homes-women-leaving-prison\nGreat to visit the many exciting projects happening at @WCIDLondon alongside @metecoban92 and @StephenCowan ♻️🥼\nAsk me a question, offer your support, and keep up to date with my campaign\nPromoted by Connor Jones\non behalf of James Small-Edwards at\n4G Shirland Mews, London, W9 3DY.\nPrivacy Policy"
}