{
  "https_www_rosiewrighting_com_/https_www_rosiewrighting_com/content_1.html": "WHY I'M STANDING\nThe entire Kettering constituency is my home. Growing up in Geddington and attending schools in Kettering and Rothwell, our town's unique character and community make me proud to be from Kettering. Now, I want to represent the people of Kettering who deserve better.\nI have volunteered with our most vulnerable at well-being cafes, food banks, and holiday clubs, and it is clear the Tories have only looked after themselves, and the people of Kettering are more in need than ever. These experiences have driven my passion and desire to rebuild our town and create an environment for our community to thrive.\nMy career is in the retail sector, which I chose to pursue when I was 16, working on the shop floor in Kettering Town Centre. Today, I work in the head office of a large retailer. I will bring my understanding of UK supply chains and the retail market to parliament. I can rebuild our high streets across the A6 towns and fight for Kettering, Rothwell, and Desborough to have town centres that reflect their unique characters and support local businesses. I have the knowledge and experience to turn our towns & villages around.\nMY PRIORITIES FOR KETTERING\nTHE COST OF LIVING CRISIS\nWhen volunteering for our most vulnerable in our Kettering-based food banks and wellbeing cafes, I have seen first-hand how let down our community has been. As your MP, it will be my priority to support local people through the cost-of-living crisis through boosting our local economy, building affordable housing, and funding local services that support the most vulnerable.\nOUR TOWNS AND HIGH STREETS\nMy career in the retail industry started in Kettering Town Centre, working on the shop floor. Over the last 13 years of this Tory government, seeing how much the high streets in the A6 towns have been neglected has been heartbreaking. I will lessen the reliance on large retailers to occupy our high streets and help build an economy where local businesses can thrive. If selected, I will fight to bring Kettering’s cultural and leisure facilities back, starting by supporting the reopening of the gallery and museum.\nINCREASE ACCESS TO NHS GPS & DENTISTS\nI will work to take immediate action to cut waiting lists by providing a funding to help the NHS beat the backlog in Kettering, with extra clinics at evenings and weekends. It’s our mission to get the NHS back on its feet and fit for the future. I will also work to deal with the immediate crisis in NHS dentistry across Kettering, currently I hear people travelling to Bedford and further to see an NHS dentist. People are pulling their own teeth out with pliers because they can’t get an NHS dentist. That’s why Labour will get more dentists into the Kettering community and make sure that everyone who needs an NHS dentist can get one.\nGREEN LOCAL WORKFORCE\nWith Kettering's prime location we need to be on the map for the green jobs of the future. Good jobs with decent wages and with pride in the work that we are doing that’s what Labour’s Green Prosperity Plan is all about: investing alongside business in the opportunities that the future holds. As your MP I will put Kettering at the heart of Labour’s Green Economy to bring good green jobs to our towns."
}