{
  "http_theresecoffey_co_uk_/http_theresecoffey_co_uk_eadt-column-9th-february-2022/content_8.html": "\"I’m delighted that Suffolk is one of just nine areas across the country being trusted to take on a lot more power and responsibility as part of the government’s detailed Levelling Up plan unveiled last week. Well done to Cllr Matthew Hicks and other Suffolk leaders who have worked hard on the proposal. The invitation to agree a new County Deal will also come with more money locally which has already been pump primed by Suffolk becoming an Education Investment Area. Importantly this extra government money will include retention payments to keep the best teachers and specific support for SEND children and their families. There will also be a laser-like focus on skills helping to support adults with free, flexible training and the expansion of skills bootcamps.\nTalking of skills, I welcome the announcement from the Energy Secretary that £100 million of government funding is being made available to support the continued development of Sizewell C. Nuclear power as a low carbon energy source is a key strand of the government’s plan to achieve net-zero by 2050. And whilst there are various matters still to be decided in the planning application - will also be of huge benefit locally - with high-quality jobs and economic gain. I’m pleased to see the recent investment EDF have made at Suffolk New College, which will mean local people will be able to take advantage of the opportunities throughout construction and operation.\nFinally, the energy regulator OFGEM has announced that the energy price cap will rise in April. Without action, this would be very tough for millions of families. So, the government are stepping in with a £350 Energy Bills Rebate. The first part of the scheme spreads the extra costs of this year’s price increase over time. In October every household will receive a £200 discount on their electricity bills. People will then have five years to repay that discount in equal instalments of £40 a year. We'll also provide more help to those who need it most by discounting Council Tax bills by £150 in April. Providing the discount to households in Bands A to D. Around 80% of all homes in England. East Suffolk Council will also get a discretionary fund to help lower income households in higher Council Tax bands.\"",
  "http_theresecoffey_co_uk_/http_theresecoffey_co_uk_cdn-cgi_l_email-protection/content_11.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_theresecoffey_co_uk_/http_theresecoffey_co_uk_east-suffolk-extra-column-5th-november-2021/content_9.html": "\"It was great to be on the frontbench in Parliament last week as the Chancellor delivered a budget to fund world-class public services, back business and help working families with the cost of living. As Secretary of State for Work & Pensions, I’ve been working closely with the Chancellor on key elements of the budget – including reducing the Universal Credit taper rate from 63% to 55% - meaning people will keep more of what they earn. The Taper Rate means that if people work more hours, their support is withdrawn at a steady rate – rather than being taken away all at once, as it was under Jobseeker’s Allowance. The rate is currently 63%, so for every extra £1 someone earns, their Universal Credit is reduced by 63p. From the 1st of December that will be cut to 55p. It might not sound like a lot, but it will make a huge difference. For example, a single mother of two, renting, and working full-time on the National Living Wage will be better off by around £1,200. And a couple, renting a home with their two children, one working full-time, the other working part-time will be better off, every single year, by £1,800. This is a £2bn tax cut for the lowest paid workers in the country. Rewarding work and helping with the cost of living.\nTalking of money, the government has now introduced the Nuclear Energy (Financing) Bill, which could be used for the delivery of Sizewell C. Under the existing mechanism, developers have to finance the construction of a nuclear project and only begin receiving revenue when the station starts generating electricity. This has led to the cancellation of recent potential projects.\nThe new funding model, however, will ensure that new nuclear can be financed by British pension funds and institutional investors, spreading the cost. This will reduce our reliance on overseas developers and lower costs for consumers. This is a tried and tested method. I remember when I was a DEFRA minister, we used it to finance the Thames Tideway Water project. So, it has successfully funded other big infrastructure projects and is crucial to enable us to provide continuous, low carbon electricity.\nFinally, I was delighted that the community pub company in Westhall will receive £96,600 from government to save the Racehorse Inn. I backed their bid with a supportive letter to the Department of Levelling Up, Housing and Communities. The money will help reopen the pub as a community enterprise – ensuring its continued role as a valued village facility. Well done to local resident, Christopher Punt and all the committee for producing such a convincing business plan. Cheers.\"",
  "http_theresecoffey_co_uk_/http_theresecoffey_co_uk_east-suffolk-extra-column-11th-february-2022/content_10.html": "\"The lack of NHS dental provision has become an increasing issue here in East Suffolk, especially in Leiston with some people telling me they have had to travel as far away as Colchester or Lowestoft to get an appointment. I’ve been constantly pressing the case on behalf of patients, lobbying Ministers and NHS bosses. I’m really pleased, therefore, that an additional £50m has now been made available to boost capacity in NHS dentistry. Under the scheme, 350,000 extra appointments will be offered including outside of normal hours to treat people in the early morning, evenings and at weekends. I have already written to local NHS Commissioners encouraging them to make an urgent bid for our share of the money, which should really help boost capacity in our part of Suffolk. In the meantime, well done to East Suffolk councillor, Russ Rainger, for coordinating the use of local councillor grants to secure the services of the Dentaid mobile surgery in the town.\nWhilst there are various matters still to be decided as part of the planning application, I welcome the announcement from the Energy Secretary that £100 million of government funding is being made available to support the continued development of Sizewell C. Nuclear power as a low carbon energy source is a key strand of the government’s plan to achieve net-zero by 2050. There will also be of huge benefit locally with high-quality jobs and economic gain. I’m pleased to see the recent investment EDF have made at Suffolk New College, which will mean local people will be able to take advantage of the opportunities throughout the construction phase and during operation.\nTalking of opportunities, it’s great news that Suffolk will become an Education Investment Area as part of the government’s detailed Levelling Up plan. Importantly this extra investment will include retention payments to keep the best teachers and specific support for SEND children and their families. There will also be a laser-like focus on skills helping to support adults with free, flexible training and the expansion of skills bootcamps. Music to the ears of your Secretary of State for Work.\"",
  "http_theresecoffey_co_uk_/http_theresecoffey_co_uk/content_1.html": "I'm Dame Thérèse Coffey. Welcome to my website.\nI was previously an MP and minister in the UK government, including my time as Deputy Prime Minister and Cabinet Minister in the departments for Work and Pensions, Health and Social Care, and Environment, Food and Rural Affairs.\nThis website will contain my contribution and thoughts to issues that I have championed and continue to champion. It also has an archive of my time as MP for Suffolk Coastal.",
  "http_theresecoffey_co_uk_/http_theresecoffey_co_uk_east-suffolk-extra-column-21st-may-2021/content_4.html": "\"Following the huge success of the vaccine rollout, step three in the easing of lockdown restrictions kicked in this week as we step cautiously along the roadmap to recovery. As well as bringing families together, this is great news for our tourist and hospitality industry here in Suffolk, which is raring to fully get going as the summer approaches.\nThank you to everyone who voted in the local elections recently. I was delighted that so many people put their trust in Conservatives right across the country but especially here in Suffolk, where I will support Cllr Matthew Hicks in delivering their manifesto. Of the 12 County Councillors that serve Suffolk Coastal constituency, 10 were elected from my party but as ever I will work with all councillors in the interests of the people and communities. Locally, we need to continue to progress on levelling up with good opportunities for everyone, particularly our young people.\nAs Secretary of State for Work & Pensions, helping our younger generation get a leg up on the employment ladder is something that I’ve been concentrating on. Our fully funded Kickstart programme is helping thousands of 16 to 24-year olds with six-month work placements that not only provide pay but experience, skills and confidence. Every day for the past six-weeks, more than 260 young people have begun a Kickstart job – more than 16,500 in total. Overall, nearly 200,000 jobs have been approved. Thanks to the confidence the British people have shown in this government, day by day, jab by jab and job by job we’re building back better from the coronavirus pandemic.\nFinally, I was pleased the make a verbal submission this week at the beginning of the Sizewell C planning application hearing. EDF have recently made some significant changes to their application, much of which I welcome. However, our environmental regulators need sufficient time to assess the details to make sure they’re satisfied with the changes. I’ve, therefore, formally requested an extension to the hearing, if needed, to ensure every aspect of EDF’s application is thoroughly examined.\"",
  "http_theresecoffey_co_uk_/http_theresecoffey_co_uk_about-therese/content_3.html": "Having first been elected as an MP in 2010 and re-elected in 2015, 2017 and 2019. Thérèse was not successful in the 2024 election.\nThérèse is a former Deputy Prime Minister and has served at Cabinet level as the Secretary of State for the Environment, Food and Rural Affairs, for Health & Social Care and Work & Pensions. She is also a former Environment Minister, Deputy Leader of the House, Government Whip and Parliamentary Private Secretary. On entering Parliament, she was first a member of the Culture, Olympics, Media and Sports Committee. In the last few months of the last Parliament, Thérèse joined the Treasury and Energy Select Committees.\nThérèse has campaigned on stopping the A14 toll, improving NHS experience for patients and better broadband. Ongoing priorities include ensuring energy infrastructure is put in the right place, a fairer share of funding, Sizewell C, Felixstowe Port, preventing coastal and estuary erosion, off gas grid consumers, rail improvements, agriculture and improving skills and education.\nThérèse grew up in the North West and after graduating from UCL with a PhD in Chemistry, joined the international company Mars. Qualified as a chartered management accountant, she became Finance Director for a UK subsidiary and has also worked at the BBC. Outside politics, she enjoys watching football (supporting Liverpool FC though is delighted Ipswich Town has been promoted to the Premier League), gardening, is a CAMRA member, a National Trust member, and enjoys music, especially Muse and karaoke.",
  "http_theresecoffey_co_uk_/http_theresecoffey_co_uk_campaigns/content_5.html": "Mobile Phone Signal & Broadband I’ve launched a mobile phone signal and broadband survey to identify any remaining not spots in Suffolk Coastal. Feedback from residents will enable me to work...\nPETITION TO KEEP OPEN LEISTON BRANCH OF BARCLAYS BANK Barclays Bank recently announced it would be closing its Leiston branch in May. This was the last bank in Leiston and the last branch of Barclays in Suffolk...\nOnshore Energy Connections along the Suffolk Coast Tackling climate change is one of the top priorities for the Government. The UK was the first G7 country to legislate for net-zero by 2050 and the Energy White...\nOnshore Energy Connections along the Suffolk Coast Tacking climate change is one of the top priorities for the Government. The UK was the first G7 country to legislate for net-zero by 2050 and the Energy White...\nOcean Protection Thank you for contacting me about the world’s oceans. As Environment Minister, I worked on this issue and I can assure you that the Government is working hard...",
  "http_theresecoffey_co_uk_/http_theresecoffey_co_uk_eadt-column-11th-august-2021/content_7.html": "\"Good luck to all our young people who are receiving their exam results this summer, based on teacher assessments rather than formal exams. For those who did not quite get what they hoped for, advice and support is available via the national helpline on 0800 100900. Whilst many students are thinking about Further Education or University there is a great choice of advanced level apprenticeships too. For more details on apprenticeships, you can look at www.apprenticeships.org or via www.thesource.me.uk. My thanks go to the teachers, staff and governors in our local schools for helping our young people at this critical stage of their lives as well as their parents. Sticking with the education theme, it was confirmed last week that over 40,000 UK students will be able to study and work abroad thanks to the government’s new £110m Turing Scheme. As part of the new global scheme, Canada, Japan and the United States are amongst over 150 international destinations where UK students will be funded to take up work and study placements – alongside popular European countries like Germany and France. A great opportunity for Suffolk students.\nI was pleased to launch the National Disability Strategy last month with the Prime Minister and Justin Tomlinson MP, Minister for Disabled People. One of the key themes coming through from our listening exercise with disabled people was the feeling of isolation and lack of inclusion, especially socially. This cross-government strategy will cover many interactions but I was pleased to see that improving access to the coastal footpath is a key commitment. In the Landguard Nature Reserve in Felixstowe, there is a great boardwalk which makes it easier for people to access and an extra benefit of protecting the shingle from disruption. I look forward to more opportunities to improve access for all.\nI’m also delighted to report that over 90,000 households in rural Suffolk will benefit from top-of-the-range broadband connections as part of the government’s £5bn Project Gigabit investment. The work to connect these hard-to-reach properties is due to commence in February 2022 providing faster, more reliable internet connections to more residents in Suffolk Coastal.\nFinally, my ongoing thanks to you all for getting the vaccination. We are well on our way to recovery and everyone who can get a jab will help us get there even quicker. We are extending the vaccine availability to 16 and 17 year olds. I hope these young people take it up too. Over 75% of adults in East Suffolk already have got their second jab.\"",
  "http_theresecoffey_co_uk_/http_theresecoffey_co_uk_privacy/content_2.html": "This document outlines how Thérèse Coffey processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Thérèse Coffey\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Thérèse Coffey.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Thérèse Coffey, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Thérèse Coffey via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_theresecoffey_co_uk_/http_theresecoffey_co_uk_east-suffolk-extra-column-30th-july-2021/content_6.html": "“Last week, building on the great progress made on vaccinations, including the extra second doses deployed in the last month, step 4 on the roadmap to recovery came into effect with a majority of the coronavirus restrictions coming to an end. We know that this delta variant is more transmissible but the vaccine in most cases is defeating the virus and hospitalisation is significantly reduced. We should though take it steady. While a lot of the legal restrictions will come to an end, I think people will have developed a lot of good habits that will endure and will be situation specific. On a crowded train, I will probably put a mask on. Going into a pub, I would be happy to not have to book way ahead and be able to order a drink at the bar, though table service has been a blessing. In my time as a Suffolk MP, I have found that folk have usually got the balance right and are sensitive to their neighbours and communities. It is that personal responsibility that we must all take on as we learn to live with Covid. I want to reiterate my huge thanks to all those who have helped make the vaccination programme a huge success. Even now though, there are some people who think they don’t need to get the jab. Please do step forward, so we don’t end up stepping backwards.\nWith less than 100 days until the COP26 global climate conference takes place here in the UK, I was delighted to attend the launch of Katch Taxis. A new on-demand electric transport service for passengers travelling between the train station in Campsea Ashe and Wickham Market. The service is available seven days a week and can be booked via the Katch App. My thanks to Cllr Alexander Nicoll who has done a fantastic job in pulling this entire project together. It’s great news that we’ve now got this new facility, not only for local people, but to welcome visitors from other parts of the UK to this very special part of the country.\nFinally, before they broke up for the summer holiday, I wrote to every school in Suffolk Coastal advertising the Our Planet Schools Pack, encouraging them to get involved and engage in conversations with pupils about tackling climate change. There’ll also be a virtual Children’s Parliament taking place on the eve of the COP26 summit with 650 primary school pupils representing each constituency in the UK. Debating their views. If your son or daughter wishes to represent Suffolk Coastal then please email me at [email protected].”"
}