{
  "https_tonyosy_org_/https_tonyosy_org_privacy-policy/content_3.html": "Copyright © 2024 www.tonyosy.org - All Rights Reserved.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_tonyosy_org_/https_tonyosy_org/content_1.html": "Vote for independence\nWelcome! I'm Tony Osy, the first parliamentary candidate for African Scots For Alba (AFSA), running for the Glasgow South West Constituency with the Alba Party. Explore the site to learn more about me, my campaign, and my vision for Glasgow South West.\nYour candidate knows the value of being connected. That's why he's running for this position. Help them help you. Vote for independence\nYour candidate has been part of this community for many years, working tirelessly to make it a better place.\nYour candidate needs your support to win this race. You can help us achieve our goals by flyering, spreading the word, and donating.\nThe date is approaching fast and we’re making preparations. Don’t miss out!\nDaysDays\nHrsHours\nMinsMinutes\nSecsSeconds\nSign up to receive updates from the candidate on the trail!\nCopyright © 2024 www.tonyosy.org - All Rights Reserved.",
  "https_tonyosy_org_/https_tonyosy_org_your-candidate/content_2.html": "My name is Tony Osy an African Scot , an Environmental Civil Engineer, a political campaigner, human rights and community activist, an actor/scriptwriter and a community development officer supporting and helping vulnerable people to live a happy and independent life. It is my passion and most fulfilling feeling to see smiles on the faces of others.\nI support people living in poverty or at risk of poverty or destitution. I believe and stand for protecting and maintaining the gender based rights of women as set out in the equality act 2010. I believe in protecting single gender spaces and I will ensure that single gender spaces are guaranteed in our schools, leisure services, support services and commissioned services.\nHelp us campaign today!\nCopyright © 2024 www.tonyosy.org - All Rights Reserved."
}