{
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_59009466/content_2.html": "Hi Michael. Well my economics differ from Reform in that they are neoliberals and Thatcherites, and I am more to the left. I have a lot in common with Reform but not on this, I also like to be responsible for my own actions and answerable to nobody, and I know there is a real taste for independent candidates in the area. Also at the time I decided Farage was nowhere to be seen, which made them less appealing. I'm very surprised they ended up not fielding anyone, but I will endeavour to represent their much needed social views, and hopefully attract their voters.\nI think if you get in contact with them and get a different type of endorsement where you still remain independent that would be a good idea while still letting them know your independence. But it’s up to you, I think I’ll have to vote for you because I will no longer vote for the uniparty. Or an economic migrant named Neil Hudson!\nWhy did you not run under reform. Which I just found out the PPC for reform dropped out probably to aid Neil Hudson of Cumbria.\nHi Michael. Well my economics differ from Reform in that they are neoliberals and Thatcherites, and I am more to the left. I have a lot in common with Reform but not on this, I also like to be responsible for my own actions and answerable to nobody, and I know there is a real taste for independent candidates in the area. Also at the time I decided Farage was nowhere to be seen, which made them less appealing. I'm very surprised they ended up not fielding anyone, but I will endeavour to represent their much needed social views, and hopefully attract their voters.\nYes, my feelings about Reform as well, and that of many fellow SDP members like me.\nI think if you get in contact with them and get a different type of endorsement where you still remain independent that would be a good idea while still letting them know your independence. But it’s up to you, I think I’ll have to vote for you because I will no longer vote for the uniparty. Or an economic migrant named Neil Hudson!\nThe word has gone out to local Reformers that I'm their man. Can't be done officially, of course.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_59549829/content_11.html": "The latter, but I do have personal positions and was asked about one. Clearly what I say, even if I win, will not change the situation between two old opponents. Same goes for Ukraine, there needs to be a settlement and an end to the carnage, but I am in no position to achieve one.\nThanks for sharing your view point. My comment was intended for Mr Hunt as I don’t understand how your position - regardless what it is - has any relevance to this election. I feel the topic is being used for political point scoring rather than actually achieve anything. Nonetheless I appreciate your candid answer and wish you good luck at the elections.\nWhy is this of any relevance to the people of Epping Forest? Are we interested in virtue signalling politics, or actual, local issues?\nThe latter, but I do have personal positions and was asked about one. Clearly what I say, even if I win, will not change the situation between two old opponents. Same goes for Ukraine, there needs to be a settlement and an end to the carnage, but I am in no position to achieve one.\nThanks for sharing your view point. My comment was intended for Mr Hunt as I don’t understand how your position - regardless what it is - has any relevance to this election. I feel the topic is being used for political point scoring rather than actually achieve anything. Nonetheless I appreciate your candid answer and wish you good luck at the elections.\nThanks Echa. Yeah I did know it was directed at Mike, but I wanted to respond anyway :)",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_60748866/content_9.html": "Well we do have to fund things properly as well. This has not been happening. When you then bring in a million people a year, no public service can properly function, something has to give. With the NHS, we should be training our own people to do those jobs, and I would bring back the bursary to help nurses train. We should also be getti…\nWell we do have to fund things properly as well. This has not been happening. When you then bring in a million people a year, no public service can properly function, something has to give. With the NHS, we should be training our own people to do those jobs, and I would bring back the bursary to help nurses train. We should also be getting skill-based immigration for the health service while we take the time to train British workers. So immigration is not the only issue affecting public services by any means. There has been a bad culture towards them for ages.\nImmigration as a whole is a net loss economically. This is because a lot of migrants and their families are dependent on the state, or are unskilled and not bringing much revenue in. But aside of economics it has cultural effects as well, which also concern me. Overall, in these numbers - unlike pre-1997 levels - immigration has been a disaster. All I want is it back to sensible levels, and for our country to preserve its norms and its culture.\nWell we do have to fund things properly as well. This has not been happening. When you then bring in a million people a year, no public service can properly function, something has to give. With the NHS, we should be training our own people to do those jobs, and I would bring back the bursary to help nurses train. We should also be getting skill-based immigration for the health service while we take the time to train British workers. So immigration is not the only issue affecting public services by any means. There has been a bad culture towards them for ages.\nImmigration as a whole is a net loss economically. This is because a lot of migrants and their families are dependent on the state, or are unskilled and not bringing much revenue in. But aside of economics it has cultural effects as well, which also concern me. Overall, in these numbers - unlike pre-1997 levels - immigration has been a disaster. All I want is it back to sensible levels, and for our country to preserve its norms and its culture.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_58195531/content_14.html": "Ed Pond: Independent Politics\nSubscribe\nSign in\nShare this comment\nMarcos\nJun 4\nGood for you. I agree with virtually every word you have said.\nCopy link\nFacebook\nEmail\nNotes\nMore\n30 Comments\n⭠ Return to thread\nMarcos\nJun 4\nGood for you. I agree with virtually every word you have said.\nExpand full comment\nReply (1)\nShare\nEd Pond\nJun 4\nAuthor\nThanks Marcos!\nExpand full comment\nReply\nShare\nShare\nCopy link\nFacebook\nEmail\nNotes\nMore\nThis site requires JavaScript to run correctly. Please\nturn on JavaScript\nor unblock scripts\nGood for you. I agree with virtually every word you have said.\nThanks Marcos!",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for/content_1.html": "Ed Pond: An Independent Voice for Epping Forest\nAfter years of opining and backroom work, I intend to stand for the General Election and here's why\nSince its creation in 1974, Epping Forest constituency has been represented by a Conservative MP. The closest it ever came to changing was in 1997 when Labour had its famous landslide. Now there is not much difference between the Conservatives and Labour in terms of policy - and great public dissatisfaction with both - I feel Epping Forest needs a change of approach. Indeed, the whole country needs one.\nNational parties do not ultimately represent the interests of local residents. They have to go along with party policy, and councillors and MPs are obliged to vote with the whip. If they disobey it too often they are deselected at the next election. An independent is not so constrained.\nThe appeal of independents is demonstrated by the success of independent groups in Epping Forest District Council (EFDC) and Essex County Council. The Loughton Residents Association (LRA) and one other independent control all of the EFDC seats for Loughton. They also hold all the town council and one of Loughton's county council seats. The opposition in the county council is made up of LRA and other independents (and smaller parties).\nPrimarily the LRA focus on opposing excessive building developments in the town, and are a real thorn in the Conservative council's side. In recent years, as part of EFDC's town plan, there were deeply unpopular proposals to build large housing units on a green area in the north of Loughton. The LRA managed to help prevent this, leading to a revised town plan with significantly fewer developments in Loughton. The people of Loughton and its wildlife could continue to enjoy the space. We do have a housing crisis, but the ways in which local councils, developers and the government go about addressing it are heavy-handed and often do not address the problem properly. Often the new builds are not affordable, good enough quality, or accompanied by the required supporting infrastructure.\nI am not affiliated with the LRA, and nor could I be, because their constitution forbids holding public positions on national politics. This is partly why they have never fielded a Parliamentary candidate - the other being that they only represent Loughton and it would be unfair on the other towns in the constituency. As an MP I would of course align with the LRA on certain things, especially planning issues, but we would be completely separate. I would help the whole constituency express the local concerns that have underpinned the LRA's success in Loughton. All of Epping Forest - Buckhurst Hill, Epping, Chigwell, Theydon Bois, Waltham Abbey, and the villages in between - needs a local person to protect its communities from overdevelopment and party dogma.\nI have plenty of experience in politics. I've been involved with both main parties and some smaller parties to see what was possible, but none of them were for me. I have been part of campaigns such as the EU referendum. I stood as an independent in Waltham Forest in the 2022 local elections. As with most people, my political views have developed over the years, and vary from policy to policy. I feel this has strengthened me and made me quite objective. I never go along with something because it is what I am 'supposed' to believe in order to stay within a particular political camp.\nI have to put my cards on the table about my views. It is not possible for me to be impartial on important national issues, but I always try to be fair and to consider different viewpoints. Politics, after all, must involve compromise as well as healthy disagreement.\nWhat, then, do I believe? I am what could be considered left of centre on economic matters. I am pro free-market but think the state should regulate it to keep it as fair as possible. I think key public services and utilities should be publicly owned, because the private sector is more concerned with profit than quality of service and thus cannot be trusted. At the very least these services should remain in British hands rather than being owned by foreign firms and having the profits leave the country. I am also keen on generous public spending. It needs to be paid for, of course, but we cannot allow an austerity agenda to cut back on vital services. Things like policing, border security, health and education do not come cheap, and their value is priceless. When the money is tight, we need to cut down on government waste elsewhere, and come up with revenue-making initiatives (not just more taxes or borrowing). Notice that there is always money for projects that the government or political class want to pursue, however trivial.\nSocially I am more conservative. I believe mass immigration has been disastrous for the country, damaging the social fabric and not involving enough integration. It has compressed wages, worsened worker conditions and been a drag on our public services. These services are supposed to be for the British people, not for the whole world. Immigration at these massive levels has also increased job competition and demand for housing. Our young people are now at a real disadvantage, and are struggling to afford homes. Moderate, limited levels of immigration (especially of high-skilled workers) can be a a good thing, helping the economy and workforce to stay dynamic - but the numbers must be brought down significantly and controlled.\nWhere the asylum crisis is concerned, I believe we need to get a lot tougher. 'Irregular' migrants are coming across the Channel in unprecedented numbers. Common sense would suggest many of them are economic migrants with no need for asylum, who want to exploit our generosity. Many come from countries where there is no obvious war or repression, such as Albania. The UK needs to assert itself within the international framework, which does have caveats about how people can apply for asylum. I advocate humane detention of asylum claimants while their claims are assessed. We also should pursue offshore processing in safe third countries or remote British territories (although the poorly handled Rwanda scheme should be scrapped). Neither of these things are prohibited by the current framework. If our country still cannot enforce its borders we must consider leaving the framework, undesirable though that may be. We are a compassionate country that should help people in genuine need, but we have no obligation to bogus claimants, and the current vast numbers mean we have to take deterrent measures.\nI campaigned for the country to leave the EU, and I still support our independence from it. My main reason was sovereignty. I felt the UK needed to have full control over its domestic policies, and that elected British governments of any political persuasion needed to have that power. British voters could not vote to remove the EU Commission like they could their own governments. The elected European Parliament only had secondary legislative function (like our House of Lords) and was toothless. Our current system has its flaws, but at least now it is more accountable to the electorate. The tariff free deal we secured with the EU has been generally successful, although the issues of Northern Ireland and fishing waters have been poorly handled. The government has been sluggish in reviewing and removing the EU laws still enshrined within our system. Labour of course oppose this as they were against the decision in the first place and are looking for ways to bring us closer to Brussels.\nImmigration was another big reason for me to support Leave, because I felt unlimited free movement was damaging our society in the ways I describe earlier. Unfortunately the Tory governments since have failed to understand those popular sentiments, and with their poorly enforced points system have accelerated immigration to record highs (750,000 net in 2022). This simply has to stop.\nFor those who will now dismiss me as a right wing populist, bear in mind that both mass immigration and freedom of movement within the EU are exactly what the large corporations want. Both serve to increase profits and lower the pay, conditions and opportunities for the people of individual nations. Mass immigration drags on the welfare state and at the current levels threatens its very existence. It is also bad for the countries we are poaching workers such as medical staff from. The main parties are lobbied, supported and funded by big business - and that is why we see no reversal on immigration. I will not be owned by anybody. I will call it as I see it.\nMy social conservatism also extends to the 'gender debate' and 'critical race theory'. Although I support free adults changing (as they see it) their gender or sex if they want to, I am against risking women's rights, privacy and safety to accommodate them (which changing the current laws would do). I'm also against infringements on free speech as part of the radical trans agenda. With 'critical race theory', a far-left academic movement from America which has colonised our culture, I reject its worldview. In a nutshell it views everything through the prism of race, and frames white people as aggressors with their supposed innate prejudices the root of all social problems. It pushes 'positive discrimination' or 'equity' over equality before the law, attacks British heritage and is extremely divisive. Race is no longer an issue in this country, nor should it be.\nOne of the major problems currently affecting the UK is energy supply. Second to extended Covid lockdowns it was the main factor that caused the current inflation crisis. High demand after unlocking, combined with the war in Ukraine and shortcomings in energy policy for decades, led to prices of oil, gas and electricity surging. Production and transportation costs then affected manufacturers and retailers, and they pushed the costs onto the consumer, which is why prices rose. Although not much can be done about the past lockdowns or (by us) the war, energy policy can be altered to bring down inflation and prevent such crises in the future.\nThe obsession with 'Net Zero' means that fossil fuel use is diminished in favour of renewable energy sources. However, the technology is not yet up to dealing with our needs, and renewable energy is generally more expensive than fossil fuels. 'Green levies' are applied to customers' bills to subsidise renewable energy development, increasing our bills by as much as 25%. A large proportion of electricity is still generated by burning gas, with wind turbines coming second. This means anything that uses electricity, such as the 'environmentally friendly' electric car, is partly powered by gas. Electric vehicles are also much pricier than petrol ones, and have highly polluting batteries.\n'Net Zero' means domestic extraction of gas and oil is ruled out in favour of importing it, which means we just push the production emissions onto other countries, as well as risking the security of our supply. Russia was providing many European countries with gas and oil, and this hampered their responses to Putin’s invasion of Ukraine, demonstrating how unwise it is to rely on foreign powers for energy. You never know who will become hostile. The UK was not as affected by this, but we are still beholden to Qatar, Saudi Arabia and others. Producers can also set the prices to extortionate levels for political reasons.\nMy answer then is to extract more of our own gas and oil, from the North Sea, Irish Sea and also by 'fracking' shale gas - which could at least be trialled. Prices should then come down with the increased supply, we won't have to rely on others, and we can export to other nations. We also need to build more nuclear power stations, which both parties have failed to do. The Conservatives have struggled to build even one, and Labour left it until the last days of Gordon Brown to plan a mass rollout. Nick Clegg famously said in 2013 that power stations would take too long to develop, so we shouldn't build any. The whole political class has been negligent on the matter.\nI believe it is almost certainly the case that manmade pollution has caused global warming and climate change. However we do not know how this compares to previous global events over millions of years and I question whether it is a 'climate crisis'. I also recognise that our society needs a huge amount of energy to run, from the computers that increasingly factor in our lives, to life support machines, streetlights and the railways. Our needs simply have to be met, and if full reliance on renewable energy isn't practical, we must continue to use fossil fuels. Of course we should invest in developing renewable sources with a view to switching over when the technology is right - but that doesn't solve our problem right now, namely the soaring bills and supply struggling to meet demand.\nGreat changes also needed within the Civil Service. We have seen in recent years how our supposed 'Rolls Royce' of civil services is in fact obstructive, partial and incompetent. If they disagree with what the elected government is asking of them, they seem to drag their heels and come up with all sorts of reasons it can't be done. If ministers try to act assertively with them, they allege bullying and try to engineer their exit from office. This has become most apparent with the Brexit process and the Channel crisis.\nOf course the Conservative government has also been incompetent, but when relying on this institution they don't stand a chance. It is thought by many that during Tony Blair's tenure, key positions began to be filled with those politically sympathetic to the centre left position. A bias towards that position started to be taught in the education system so a whole new generation of professional graduates would have the desirable opinions. Some Civil Servants have expressed their political views in public, sat on the boards of political groups and one even tried to stand in an election.\nThis trend culminated when the Labour Party hired the senior civil servant Sue Gray as their chief advisor in questionable circumstances. Gray had been proceeding over serious investigations that found against Boris Johnson, and would not say when she was first approached by Labour, despite it appearing this happened months before she resigned. A civil servant is required to do so before discussing new employment. Indeed, she resigned only after the story broke. In a coincidental turn, her son later won a candidacy for Labour for the next General Election. For all we know a quid pro quo had been existing between her and Labour for years.\nI would support much stricter enforcement of impartiality rules for civil servants, with significant punishment for infractions. I would also advocate penalties for poor performance, and perhaps some incentives for good performance. It must be possible for those who repeatedly don't deliver or are negligent to be fired, without their gold-plated pension. Something else we could look at is allowing elected governments to bring their own people in to manage departments, as American Presidents do. Parties campaign on policies, and the public vote them into government to deliver these. If the policies are then blocked by an unelected technocratic body that 'knows best', it makes a farce out of democracy.\nThis has been a general overview of my beliefs and what I see are the most important issues facing our country. I will be writing more detailed articles on policy in the run up to the election. In Parliament I would not shirk from addressing these major issues head on, and working with other parties and figures who are serious about solving them. The current system and orthodoxies have steered us into dire straits, and it is down to ordinary people to stand and navigate us out of them.\nWhy did you not run under reform. Which I just found out the PPC for reform dropped out probably to aid Neil Hudson of Cumbria.\nI wish you all the very best, Ed. I shall certainly be voting for you.\nRoger.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_60736437/content_20.html": "Hello Ed. I'm curious about how you would back up that immigration is as big an issue as the media makes it out to be. The NHS Confederation (see below) suggest that immigration is a net positive for NHS given the struggle to fill vacancies. Although the immigration figures do seem high, how is it that despite this the NHS struggles to f…\nHello Ed. I'm curious about how you would back up that immigration is as big an issue as the media makes it out to be. The NHS Confederation (see below) suggest that immigration is a net positive for NHS given the struggle to fill vacancies. Although the immigration figures do seem high, how is it that despite this the NHS struggles to fill tens of thousands of vacancies? Is it really an immigration problem or an underlying issue of inequality where social services are just not able to provide sufficient financial security to those employed?\nApologies for being verbose but I would really appreciate a take on this, I can't get a clear or balanced answer from anyone.\nWell we do have to fund things properly as well. This has not been happening. When you then bring in a million people a year, no public service can properly function, something has to give. With the NHS, we should be training our own people to do those jobs, and I would bring back the bursary to help nurses train. We should also be getting skill-based immigration for the health service while we take the time to train British workers. So immigration is not the only issue affecting public services by any means. There has been a bad culture towards them for ages.\nImmigration as a whole is a net loss economically. This is because a lot of migrants and their families are dependent on the state, or are unskilled and not bringing much revenue in. But aside of economics it has cultural effects as well, which also concern me. Overall, in these numbers - unlike pre-1997 levels - immigration has been a disaster. All I want is it back to sensible levels, and for our country to preserve its norms and its culture.\nHello Ed. I'm curious about how you would back up that immigration is as big an issue as the media makes it out to be. The NHS Confederation (see below) suggest that immigration is a net positive for NHS given the struggle to fill vacancies. Although the immigration figures do seem high, how is it that despite this the NHS struggles to fill tens of thousands of vacancies? Is it really an immigration problem or an underlying issue of inequality where social services are just not able to provide sufficient financial security to those employed?\nApologies for being verbose but I would really appreciate a take on this, I can't get a clear or balanced answer from anyone.\nhttps://www.nhsconfed.org/articles/immigration-harming-nhs\nWell we do have to fund things properly as well. This has not been happening. When you then bring in a million people a year, no public service can properly function, something has to give. With the NHS, we should be training our own people to do those jobs, and I would bring back the bursary to help nurses train. We should also be getting skill-based immigration for the health service while we take the time to train British workers. So immigration is not the only issue affecting public services by any means. There has been a bad culture towards them for ages.\nImmigration as a whole is a net loss economically. This is because a lot of migrants and their families are dependent on the state, or are unskilled and not bringing much revenue in. But aside of economics it has cultural effects as well, which also concern me. Overall, in these numbers - unlike pre-1997 levels - immigration has been a disaster. All I want is it back to sensible levels, and for our country to preserve its norms and its culture.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_60577135/content_16.html": "Hamas have threatened to continue its 7th October attacks until every Israeli is iradiicated from Israel which only occupies 0.09% of the Middle East. Biden’s latest policy on arms supply has been given more impetus to Hamas. I cannot imagine any other country in the World allowing such atrocities to happen in their Countries. Hamas are …\nHamas have threatened to continue its 7th October attacks until every Israeli is iradiicated from Israel which only occupies 0.09% of the Middle East. Biden’s latest policy on arms supply has been given more impetus to Hamas. I cannot imagine any other country in the World allowing such atrocities to happen in their Countries. Hamas are using their people to strengthen support. They have no regard for human life. They are stealing all the aid supplied , mostly by Israel. This war will continue unless other Countries support Israel to destroy Hamas not the Palestinian people. Hamas leaders live in Qatar and are billionaires whilst their people suffer from lack of infrastructure . They were losing popularity of their own people and they used their atrocities in Israel to increase their popularity. Their propaganda is winning. Ed, what do you say to all of this.\nHamas absolutely have to go. This current situation is down to their cowardly and degenerate attacks on innocent civilians. They should let all the hostages go if they really want this to stop, but they don't care about the catastrophe happening to their own people. That said, I do want to see a resolution to this tragedy and the Palestinian innocents given the aid and respite they need. July 7th does not allow carte blanche to Israel, although they did have to respond robustly as I've said.\nHamas have threatened to continue its 7th October attacks until every Israeli is iradiicated from Israel which only occupies 0.09% of the Middle East. Biden’s latest policy on arms supply has been given more impetus to Hamas. I cannot imagine any other country in the World allowing such atrocities to happen in their Countries. Hamas are using their people to strengthen support. They have no regard for human life. They are stealing all the aid supplied , mostly by Israel. This war will continue unless other Countries support Israel to destroy Hamas not the Palestinian people. Hamas leaders live in Qatar and are billionaires whilst their people suffer from lack of infrastructure . They were losing popularity of their own people and they used their atrocities in Israel to increase their popularity. Their propaganda is winning. Ed, what do you say to all of this.\nHamas absolutely have to go. This current situation is down to their cowardly and degenerate attacks on innocent civilians. They should let all the hostages go if they really want this to stop, but they don't care about the catastrophe happening to their own people. That said, I do want to see a resolution to this tragedy and the Palestinian innocents given the aid and respite they need. July 7th does not allow carte blanche to Israel, although they did have to respond robustly as I've said.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_60749842/content_24.html": "Yes of course. It needs much better funding and management. We also need a system which encourages people to be the best they can be and get into work or community activities if they can, giving them the required support to achieve this. There does need to be caution taken against any kind of fraud, which of course is another aspect of fairness.\nYes of course. It needs much better funding and management. We also need a system which encourages people to be the best they can be and get into work or community activities if they can, giving them the required support to achieve this. There does need to be caution taken against any kind of fraud, which of course is another aspect of fairness.\nYes of course. It needs much better funding and management. We also need a system which encourages people to be the best they can be and get into work or community activities if they can, giving them the required support to achieve this. There does need to be caution taken against any kind of fraud, which of course is another aspect of fairness.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_58973019/content_6.html": "I wish you all the very best, Ed. I shall certainly be voting for you.\nRoger.\nMany thanks, Roger. Let's see how many I get!\nI wish you all the very best, Ed. I shall certainly be voting for you.\nRoger.\nMany thanks, Roger. Let's see how many I get!",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_60917199/content_25.html": "Ed Pond: Independent Politics\nSubscribe\nSign in\nShare this comment\nIvan Kinsman\nJul 4\nYes, my feelings about Reform as well, and that of many fellow SDP members like me.\nCopy link\nFacebook\nEmail\nNotes\nMore\n30 Comments\n⭠ Return to thread\nIvan Kinsman\nJul 4\nYes, my feelings about Reform as well, and that of many fellow SDP members like me.\nExpand full comment\nReply\nShare\nShare\nCopy link\nFacebook\nEmail\nNotes\nMore\nThis site requires JavaScript to run correctly. Please\nturn on JavaScript\nor unblock scripts\nYes, my feelings about Reform as well, and that of many fellow SDP members like me.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_60725583/content_19.html": "Hi Ben. As far as I can tell the controversy is quite overblown. The supposed 'earthquakes' caused by it are tiny (like a big bag of sugar hitting the floor). It also is done with great success in other places, such as the USA. Therefore it would at least be worth trying at a small level to see it these problems manifest. which I am fairly confident they won't. Of course everything needs full scrutiny and caution - nuclear also. But my feeling is that the anti-fossil fuel lobby have tried to demonise the process simply because they don't want any more fossil fuels extracted.\nCould you elaborate on why you think fracking shale gas should be trialled given the controversy surrounding it?\nHi Ben. As far as I can tell the controversy is quite overblown. The supposed 'earthquakes' caused by it are tiny (like a big bag of sugar hitting the floor). It also is done with great success in other places, such as the USA. Therefore it would at least be worth trying at a small level to see it these problems manifest. which I am fairly confident they won't. Of course everything needs full scrutiny and caution - nuclear also. But my feeling is that the anti-fossil fuel lobby have tried to demonise the process simply because they don't want any more fossil fuels extracted.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_58992490/content_33.html": "Ed Pond: Independent Politics\nSubscribe\nSign in\nShare this comment\nEd Pond\nJun 13\nMany thanks, Roger. Let's see how many I get!\nCopy link\nFacebook\nEmail\nNotes\nMore\n30 Comments\n⭠ Return to thread\nEd Pond\nJun 13\nAuthor\nMany thanks, Roger. Let's see how many I get!\nExpand full comment\nReply\nShare\nShare\nCopy link\nFacebook\nEmail\nNotes\nMore\nThis site requires JavaScript to run correctly. Please\nturn on JavaScript\nor unblock scripts\nMany thanks, Roger. Let's see how many I get!",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_59552023/content_17.html": "The latter, but I do have personal positions and was asked about one. Clearly what I say, even if I win, will not change the situation between two old opponents. Same goes for Ukraine, there needs to be a settlement and an end to the carnage, but I am in no position to achieve one.\nThe latter, but I do have personal positions and was asked about one. Clearly what I say, even if I win, will not change the situation between two old opponents. Same goes for Ukraine, there needs to be a settlement and an end to the carnage, but I am in no position to achieve one.\nThanks for sharing your view point. My comment was intended for Mr Hunt as I don’t understand how your position - regardless what it is - has any relevance to this election. I feel the topic is being used for political point scoring rather than actually achieve anything. Nonetheless I appreciate your candid answer and wish you good luck at the elections.\nThe latter, but I do have personal positions and was asked about one. Clearly what I say, even if I win, will not change the situation between two old opponents. Same goes for Ukraine, there needs to be a settlement and an end to the carnage, but I am in no position to achieve one.\nThanks for sharing your view point. My comment was intended for Mr Hunt as I don’t understand how your position - regardless what it is - has any relevance to this election. I feel the topic is being used for political point scoring rather than actually achieve anything. Nonetheless I appreciate your candid answer and wish you good luck at the elections.\nThanks Echa. Yeah I did know it was directed at Mike, but I wanted to respond anyway :)",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_58514252/content_30.html": "I am totally against yet another ‘ imported candidate’ standing in what is perceived as a safe Tory seat. Supporting a ‘local’ person who will fight for OUR interests as against towing the party line makes the most sense. What ever your view, do cast your vote. Do not assume the outcome is already decided.\nI am totally against yet another ‘ imported candidate’ standing in what is perceived as a safe Tory seat. Supporting a ‘local’ person who will fight for OUR interests as against towing the party line makes the most sense. What ever your view, do cast your vote. Do not assume the outcome is already decided.\nI am totally against yet another ‘ imported candidate’ standing in what is perceived as a safe Tory seat. Supporting a ‘local’ person who will fight for OUR interests as against towing the party line makes the most sense. What ever your view, do cast your vote. Do not assume the outcome is already decided.\nThanks Michael!",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_58514572/content_26.html": "Ed Pond: Independent Politics\nSubscribe\nSign in\nShare this comment\nEd Pond\nJun 8\nThanks Michael!\nCopy link\nFacebook\nEmail\nNotes\nMore\n30 Comments\n⭠ Return to thread\nEd Pond\nJun 8\nAuthor\nThanks Michael!\nExpand full comment\nReply\nShare\nShare\nCopy link\nFacebook\nEmail\nNotes\nMore\nThis site requires JavaScript to run correctly. Please\nturn on JavaScript\nor unblock scripts\nThanks Michael!",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_58228242/content_8.html": "For balance, I disagree with almost every view you hold. Thanks for sharing though.\nOK, that's allowed! Thanks for reading.\nFor balance, I disagree with almost every view you hold. Thanks for sharing though.\nOK, that's allowed! Thanks for reading.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_58522978/content_10.html": "Do your best to get your name out there Ed. I think you have a genuinely popular platform on which to stand and a historic opportunity to challenge the status quo in Epping Forest. You've won my vote. Best of luck.\nDo your best to get your name out there Ed. I think you have a genuinely popular platform on which to stand and a historic opportunity to challenge the status quo in Epping Forest. You've won my vote. Best of luck.\nDo your best to get your name out there Ed. I think you have a genuinely popular platform on which to stand and a historic opportunity to challenge the status quo in Epping Forest. You've won my vote. Best of luck.\nThanks very much Dan - yes, I am trying to speak to as many residents as possible.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_59331744/content_5.html": "So much said Ed with no mention of the ongoing Israel war on Palestine. What is your stance on this ongoing conflict and what is your plan should you win in this constituency?\nSo much said Ed with no mention of the ongoing Israel war on Palestine. What is your stance on this ongoing conflict and what is your plan should you win in this constituency?\nOn one hand my focus is much closer to home, and British problems. That said I do have a position.\nMy position is that Israel had to respond to the Hamas attacks, but that it's gone too far now. Civilians need safe zones to go to and aid supplies. There should be a ceasefire until at least this is secured.\nHamas has caused this catastrophe by its reckless actions - something Fatah and others have pointed out - and thus it should be removed by the Palestinian people (easier said than done). There should be a two state solution and economic development of Gaza to prevent radicalisation of young men by offering them opportunity.\nI could not deliver this as a lowly MP, but I would make these points for whoever was listening in Parliament and the government.\nHamas have threatened to continue its 7th October attacks until every Israeli is iradiicated from Israel which only occupies 0.09% of the Middle East. Biden’s latest policy on arms supply has been given more impetus to Hamas. I cannot imagine any other country in the World allowing such atrocities to happen in their Countries. Hamas are using their people to strengthen support. They have no regard for human life. They are stealing all the aid supplied , mostly by Israel. This war will continue unless other Countries support Israel to destroy Hamas not the Palestinian people. Hamas leaders live in Qatar and are billionaires whilst their people suffer from lack of infrastructure . They were losing popularity of their own people and they used their atrocities in Israel to increase their popularity. Their propaganda is winning. Ed, what do you say to all of this.\nHamas absolutely have to go. This current situation is down to their cowardly and degenerate attacks on innocent civilians. They should let all the hostages go if they really want this to stop, but they don't care about the catastrophe happening to their own people. That said, I do want to see a resolution to this tragedy and the Palestinian innocents given the aid and respite they need. July 7th does not allow carte blanche to Israel, although they did have to respond robustly as I've said.\nThe latter, but I do have personal positions and was asked about one. Clearly what I say, even if I win, will not change the situation between two old opponents. Same goes for Ukraine, there needs to be a settlement and an end to the carnage, but I am in no position to achieve one.\nThanks for sharing your view point. My comment was intended for Mr Hunt as I don’t understand how your position - regardless what it is - has any relevance to this election. I feel the topic is being used for political point scoring rather than actually achieve anything. Nonetheless I appreciate your candid answer and wish you good luck at the elections.\nSo much said Ed with no mention of the ongoing Israel war on Palestine. What is your stance on this ongoing conflict and what is your plan should you win in this constituency?\nOn one hand my focus is much closer to home, and British problems. That said I do have a position.\nMy position is that Israel had to respond to the Hamas attacks, but that it's gone too far now. Civilians need safe zones to go to and aid supplies. There should be a ceasefire until at least this is secured.\nHamas has caused this catastrophe by its reckless actions - something Fatah and others have pointed out - and thus it should be removed by the Palestinian people (easier said than done). There should be a two state solution and economic development of Gaza to prevent radicalisation of young men by offering them opportunity.\nI could not deliver this as a lowly MP, but I would make these points for whoever was listening in Parliament and the government.\nHamas have threatened to continue its 7th October attacks until every Israeli is iradiicated from Israel which only occupies 0.09% of the Middle East. Biden’s latest policy on arms supply has been given more impetus to Hamas. I cannot imagine any other country in the World allowing such atrocities to happen in their Countries. Hamas are using their people to strengthen support. They have no regard for human life. They are stealing all the aid supplied , mostly by Israel. This war will continue unless other Countries support Israel to destroy Hamas not the Palestinian people. Hamas leaders live in Qatar and are billionaires whilst their people suffer from lack of infrastructure . They were losing popularity of their own people and they used their atrocities in Israel to increase their popularity. Their propaganda is winning. Ed, what do you say to all of this.\nHamas absolutely have to go. This current situation is down to their cowardly and degenerate attacks on innocent civilians. They should let all the hostages go if they really want this to stop, but they don't care about the catastrophe happening to their own people. That said, I do want to see a resolution to this tragedy and the Palestinian innocents given the aid and respite they need. July 7th does not allow carte blanche to Israel, although they did have to respond robustly as I've said.\nWhy is this of any relevance to the people of Epping Forest? Are we interested in virtue signalling politics, or actual, local issues?\nThe latter, but I do have personal positions and was asked about one. Clearly what I say, even if I win, will not change the situation between two old opponents. Same goes for Ukraine, there needs to be a settlement and an end to the carnage, but I am in no position to achieve one.\nThanks for sharing your view point. My comment was intended for Mr Hunt as I don’t understand how your position - regardless what it is - has any relevance to this election. I feel the topic is being used for political point scoring rather than actually achieve anything. Nonetheless I appreciate your candid answer and wish you good luck at the elections.\nThanks Echa. Yeah I did know it was directed at Mike, but I wanted to respond anyway :)",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_60749282/content_23.html": "Hi Ben. As far as I can tell the controversy is quite overblown. The supposed 'earthquakes' caused by it are tiny (like a big bag of sugar hitting the floor). It also is done with great success in other places, such as the USA. Therefore it would at least be worth trying at a small level to see it these problems manifest. which I am fair…\nHi Ben. As far as I can tell the controversy is quite overblown. The supposed 'earthquakes' caused by it are tiny (like a big bag of sugar hitting the floor). It also is done with great success in other places, such as the USA. Therefore it would at least be worth trying at a small level to see it these problems manifest. which I am fairly confident they won't. Of course everything needs full scrutiny and caution - nuclear also. But my feeling is that the anti-fossil fuel lobby have tried to demonise the process simply because they don't want any more fossil fuels extracted.\nHi Ben. As far as I can tell the controversy is quite overblown. The supposed 'earthquakes' caused by it are tiny (like a big bag of sugar hitting the floor). It also is done with great success in other places, such as the USA. Therefore it would at least be worth trying at a small level to see it these problems manifest. which I am fairly confident they won't. Of course everything needs full scrutiny and caution - nuclear also. But my feeling is that the anti-fossil fuel lobby have tried to demonise the process simply because they don't want any more fossil fuels extracted.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_59028906/content_27.html": "Hi Michael. Well my economics differ from Reform in that they are neoliberals and Thatcherites, and I am more to the left. I have a lot in common with Reform but not on this, I also like to be responsible for my own actions and answerable to nobody, and I know there is a real taste for independent candidates in the area. Also at the time…\nHi Michael. Well my economics differ from Reform in that they are neoliberals and Thatcherites, and I am more to the left. I have a lot in common with Reform but not on this, I also like to be responsible for my own actions and answerable to nobody, and I know there is a real taste for independent candidates in the area. Also at the time I decided Farage was nowhere to be seen, which made them less appealing. I'm very surprised they ended up not fielding anyone, but I will endeavour to represent their much needed social views, and hopefully attract their voters.\nI think if you get in contact with them and get a different type of endorsement where you still remain independent that would be a good idea while still letting them know your independence. But it’s up to you, I think I’ll have to vote for you because I will no longer vote for the uniparty. Or an economic migrant named Neil Hudson!\nHi Michael. Well my economics differ from Reform in that they are neoliberals and Thatcherites, and I am more to the left. I have a lot in common with Reform but not on this, I also like to be responsible for my own actions and answerable to nobody, and I know there is a real taste for independent candidates in the area. Also at the time I decided Farage was nowhere to be seen, which made them less appealing. I'm very surprised they ended up not fielding anyone, but I will endeavour to represent their much needed social views, and hopefully attract their voters.\nYes, my feelings about Reform as well, and that of many fellow SDP members like me.\nI think if you get in contact with them and get a different type of endorsement where you still remain independent that would be a good idea while still letting them know your independence. But it’s up to you, I think I’ll have to vote for you because I will no longer vote for the uniparty. Or an economic migrant named Neil Hudson!\nThe word has gone out to local Reformers that I'm their man. Can't be done officially, of course.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_59030122/content_3.html": "I think if you get in contact with them and get a different type of endorsement where you still remain independent that would be a good idea while still letting them know your independence. But it’s up to you, I think I’ll have to vote for you because I will no longer vote for the uniparty. Or an economic migrant named Neil Hudson!\nI think if you get in contact with them and get a different type of endorsement where you still remain independent that would be a good idea while still letting them know your independence. But it’s up to you, I think I’ll have to vote for you because I will no longer vote for the uniparty. Or an economic migrant named Neil Hudson!\nI think if you get in contact with them and get a different type of endorsement where you still remain independent that would be a good idea while still letting them know your independence. But it’s up to you, I think I’ll have to vote for you because I will no longer vote for the uniparty. Or an economic migrant named Neil Hudson!\nThe word has gone out to local Reformers that I'm their man. Can't be done officially, of course.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_59121619/content_15.html": "Ed Pond: Independent Politics\nSubscribe\nSign in\nShare this comment\nEd Pond\nJun 15\nThe word has gone out to local Reformers that I'm their man. Can't be done officially, of course.\nCopy link\nFacebook\nEmail\nNotes\nMore\n30 Comments\n⭠ Return to thread\nEd Pond\nJun 15\nAuthor\nThe word has gone out to local Reformers that I'm their man. Can't be done officially, of course.\nExpand full comment\nReply\nShare\nShare\nCopy link\nFacebook\nEmail\nNotes\nMore\nThis site requires JavaScript to run correctly. Please\nturn on JavaScript\nor unblock scripts\nThe word has gone out to local Reformers that I'm their man. Can't be done officially, of course.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_58195658/content_18.html": "Ed Pond: Independent Politics\nSubscribe\nSign in\nShare this comment\nEd Pond\nJun 4\nThanks Marcos!\nCopy link\nFacebook\nEmail\nNotes\nMore\n30 Comments\n⭠ Return to thread\nEd Pond\nJun 4\nAuthor\nThanks Marcos!\nExpand full comment\nReply\nShare\nShare\nCopy link\nFacebook\nEmail\nNotes\nMore\nThis site requires JavaScript to run correctly. Please\nturn on JavaScript\nor unblock scripts\nThanks Marcos!",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_60584122/content_12.html": "Yes of course. It needs much better funding and management. We also need a system which encourages people to be the best they can be and get into work or community activities if they can, giving them the required support to achieve this. There does need to be caution taken against any kind of fraud, which of course is another aspect of fairness.\nHi Ed, Do you believe in a fair welfare system to help our vulnerable and disabled?\nYes of course. It needs much better funding and management. We also need a system which encourages people to be the best they can be and get into work or community activities if they can, giving them the required support to achieve this. There does need to be caution taken against any kind of fraud, which of course is another aspect of fairness.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comments/content_4.html": "Hi Michael. Well my economics differ from Reform in that they are neoliberals and Thatcherites, and I am more to the left. I have a lot in common with Reform but not on this, I also like to be responsible for my own actions and answerable to nobody, and I know there is a real taste for independent candidates in the area. Also at the time I decided Farage was nowhere to be seen, which made them less appealing. I'm very surprised they ended up not fielding anyone, but I will endeavour to represent their much needed social views, and hopefully attract their voters.\nI think if you get in contact with them and get a different type of endorsement where you still remain independent that would be a good idea while still letting them know your independence. But it’s up to you, I think I’ll have to vote for you because I will no longer vote for the uniparty. Or an economic migrant named Neil Hudson!\nI am totally against yet another ‘ imported candidate’ standing in what is perceived as a safe Tory seat. Supporting a ‘local’ person who will fight for OUR interests as against towing the party line makes the most sense. What ever your view, do cast your vote. Do not assume the outcome is already decided.\nHello Ed, I have just read your piece on immigration and believe it is very well thought through. I have reposted it on various social media platforms:\nHello Ed. I'm curious about how you would back up that immigration is as big an issue as the media makes it out to be. The NHS Confederation (see below) suggest that immigration is a net positive for NHS given the struggle to fill vacancies. Although the immigration figures do seem high, how is it that despite this the NHS struggles to fill tens of thousands of vacancies? Is it really an immigration problem or an underlying issue of inequality where social services are just not able to provide sufficient financial security to those employed?\nApologies for being verbose but I would really appreciate a take on this, I can't get a clear or balanced answer from anyone.\nWell we do have to fund things properly as well. This has not been happening. When you then bring in a million people a year, no public service can properly function, something has to give. With the NHS, we should be training our own people to do those jobs, and I would bring back the bursary to help nurses train. We should also be getting skill-based immigration for the health service while we take the time to train British workers. So immigration is not the only issue affecting public services by any means. There has been a bad culture towards them for ages.\nImmigration as a whole is a net loss economically. This is because a lot of migrants and their families are dependent on the state, or are unskilled and not bringing much revenue in. But aside of economics it has cultural effects as well, which also concern me. Overall, in these numbers - unlike pre-1997 levels - immigration has been a disaster. All I want is it back to sensible levels, and for our country to preserve its norms and its culture.\nHi Ben. As far as I can tell the controversy is quite overblown. The supposed 'earthquakes' caused by it are tiny (like a big bag of sugar hitting the floor). It also is done with great success in other places, such as the USA. Therefore it would at least be worth trying at a small level to see it these problems manifest. which I am fairly confident they won't. Of course everything needs full scrutiny and caution - nuclear also. But my feeling is that the anti-fossil fuel lobby have tried to demonise the process simply because they don't want any more fossil fuels extracted.\nYes of course. It needs much better funding and management. We also need a system which encourages people to be the best they can be and get into work or community activities if they can, giving them the required support to achieve this. There does need to be caution taken against any kind of fraud, which of course is another aspect of fairness.\nSo much said Ed with no mention of the ongoing Israel war on Palestine. What is your stance on this ongoing conflict and what is your plan should you win in this constituency?\nOn one hand my focus is much closer to home, and British problems. That said I do have a position.\nMy position is that Israel had to respond to the Hamas attacks, but that it's gone too far now. Civilians need safe zones to go to and aid supplies. There should be a ceasefire until at least this is secured.\nHamas has caused this catastrophe by its reckless actions - something Fatah and others have pointed out - and thus it should be removed by the Palestinian people (easier said than done). There should be a two state solution and economic development of Gaza to prevent radicalisation of young men by offering them opportunity.\nI could not deliver this as a lowly MP, but I would make these points for whoever was listening in Parliament and the government.\nHamas have threatened to continue its 7th October attacks until every Israeli is iradiicated from Israel which only occupies 0.09% of the Middle East. Biden’s latest policy on arms supply has been given more impetus to Hamas. I cannot imagine any other country in the World allowing such atrocities to happen in their Countries. Hamas are using their people to strengthen support. They have no regard for human life. They are stealing all the aid supplied , mostly by Israel. This war will continue unless other Countries support Israel to destroy Hamas not the Palestinian people. Hamas leaders live in Qatar and are billionaires whilst their people suffer from lack of infrastructure . They were losing popularity of their own people and they used their atrocities in Israel to increase their popularity. Their propaganda is winning. Ed, what do you say to all of this.\nHamas absolutely have to go. This current situation is down to their cowardly and degenerate attacks on innocent civilians. They should let all the hostages go if they really want this to stop, but they don't care about the catastrophe happening to their own people. That said, I do want to see a resolution to this tragedy and the Palestinian innocents given the aid and respite they need. July 7th does not allow carte blanche to Israel, although they did have to respond robustly as I've said.\nThe latter, but I do have personal positions and was asked about one. Clearly what I say, even if I win, will not change the situation between two old opponents. Same goes for Ukraine, there needs to be a settlement and an end to the carnage, but I am in no position to achieve one.\nThanks for sharing your view point. My comment was intended for Mr Hunt as I don’t understand how your position - regardless what it is - has any relevance to this election. I feel the topic is being used for political point scoring rather than actually achieve anything. Nonetheless I appreciate your candid answer and wish you good luck at the elections.\nDo your best to get your name out there Ed. I think you have a genuinely popular platform on which to stand and a historic opportunity to challenge the status quo in Epping Forest. You've won my vote. Best of luck.\nWhy did you not run under reform. Which I just found out the PPC for reform dropped out probably to aid Neil Hudson of Cumbria.\nHi Michael. Well my economics differ from Reform in that they are neoliberals and Thatcherites, and I am more to the left. I have a lot in common with Reform but not on this, I also like to be responsible for my own actions and answerable to nobody, and I know there is a real taste for independent candidates in the area. Also at the time I decided Farage was nowhere to be seen, which made them less appealing. I'm very surprised they ended up not fielding anyone, but I will endeavour to represent their much needed social views, and hopefully attract their voters.\nYes, my feelings about Reform as well, and that of many fellow SDP members like me.\nI think if you get in contact with them and get a different type of endorsement where you still remain independent that would be a good idea while still letting them know your independence. But it’s up to you, I think I’ll have to vote for you because I will no longer vote for the uniparty. Or an economic migrant named Neil Hudson!\nThe word has gone out to local Reformers that I'm their man. Can't be done officially, of course.\nI wish you all the very best, Ed. I shall certainly be voting for you.\nRoger.\nMany thanks, Roger. Let's see how many I get!\nI am totally against yet another ‘ imported candidate’ standing in what is perceived as a safe Tory seat. Supporting a ‘local’ person who will fight for OUR interests as against towing the party line makes the most sense. What ever your view, do cast your vote. Do not assume the outcome is already decided.\nThanks Michael!\nHello Ed, I have just read your piece on immigration and believe it is very well thought through. I have reposted it on various social media platforms:\nhttps://sdp.org.uk/sdptalk/migrant-crisis-solutions-ed-pond/\nHello Ed. I'm curious about how you would back up that immigration is as big an issue as the media makes it out to be. The NHS Confederation (see below) suggest that immigration is a net positive for NHS given the struggle to fill vacancies. Although the immigration figures do seem high, how is it that despite this the NHS struggles to fill tens of thousands of vacancies? Is it really an immigration problem or an underlying issue of inequality where social services are just not able to provide sufficient financial security to those employed?\nApologies for being verbose but I would really appreciate a take on this, I can't get a clear or balanced answer from anyone.\nhttps://www.nhsconfed.org/articles/immigration-harming-nhs\nWell we do have to fund things properly as well. This has not been happening. When you then bring in a million people a year, no public service can properly function, something has to give. With the NHS, we should be training our own people to do those jobs, and I would bring back the bursary to help nurses train. We should also be getting skill-based immigration for the health service while we take the time to train British workers. So immigration is not the only issue affecting public services by any means. There has been a bad culture towards them for ages.\nImmigration as a whole is a net loss economically. This is because a lot of migrants and their families are dependent on the state, or are unskilled and not bringing much revenue in. But aside of economics it has cultural effects as well, which also concern me. Overall, in these numbers - unlike pre-1997 levels - immigration has been a disaster. All I want is it back to sensible levels, and for our country to preserve its norms and its culture.\nCould you elaborate on why you think fracking shale gas should be trialled given the controversy surrounding it?\nHi Ben. As far as I can tell the controversy is quite overblown. The supposed 'earthquakes' caused by it are tiny (like a big bag of sugar hitting the floor). It also is done with great success in other places, such as the USA. Therefore it would at least be worth trying at a small level to see it these problems manifest. which I am fairly confident they won't. Of course everything needs full scrutiny and caution - nuclear also. But my feeling is that the anti-fossil fuel lobby have tried to demonise the process simply because they don't want any more fossil fuels extracted.\nHi Ed, Do you believe in a fair welfare system to help our vulnerable and disabled?\nYes of course. It needs much better funding and management. We also need a system which encourages people to be the best they can be and get into work or community activities if they can, giving them the required support to achieve this. There does need to be caution taken against any kind of fraud, which of course is another aspect of fairness.\nSo much said Ed with no mention of the ongoing Israel war on Palestine. What is your stance on this ongoing conflict and what is your plan should you win in this constituency?\nOn one hand my focus is much closer to home, and British problems. That said I do have a position.\nMy position is that Israel had to respond to the Hamas attacks, but that it's gone too far now. Civilians need safe zones to go to and aid supplies. There should be a ceasefire until at least this is secured.\nHamas has caused this catastrophe by its reckless actions - something Fatah and others have pointed out - and thus it should be removed by the Palestinian people (easier said than done). There should be a two state solution and economic development of Gaza to prevent radicalisation of young men by offering them opportunity.\nI could not deliver this as a lowly MP, but I would make these points for whoever was listening in Parliament and the government.\nHamas have threatened to continue its 7th October attacks until every Israeli is iradiicated from Israel which only occupies 0.09% of the Middle East. Biden’s latest policy on arms supply has been given more impetus to Hamas. I cannot imagine any other country in the World allowing such atrocities to happen in their Countries. Hamas are using their people to strengthen support. They have no regard for human life. They are stealing all the aid supplied , mostly by Israel. This war will continue unless other Countries support Israel to destroy Hamas not the Palestinian people. Hamas leaders live in Qatar and are billionaires whilst their people suffer from lack of infrastructure . They were losing popularity of their own people and they used their atrocities in Israel to increase their popularity. Their propaganda is winning. Ed, what do you say to all of this.\nHamas absolutely have to go. This current situation is down to their cowardly and degenerate attacks on innocent civilians. They should let all the hostages go if they really want this to stop, but they don't care about the catastrophe happening to their own people. That said, I do want to see a resolution to this tragedy and the Palestinian innocents given the aid and respite they need. July 7th does not allow carte blanche to Israel, although they did have to respond robustly as I've said.\nWhy is this of any relevance to the people of Epping Forest? Are we interested in virtue signalling politics, or actual, local issues?\nThe latter, but I do have personal positions and was asked about one. Clearly what I say, even if I win, will not change the situation between two old opponents. Same goes for Ukraine, there needs to be a settlement and an end to the carnage, but I am in no position to achieve one.\nThanks for sharing your view point. My comment was intended for Mr Hunt as I don’t understand how your position - regardless what it is - has any relevance to this election. I feel the topic is being used for political point scoring rather than actually achieve anything. Nonetheless I appreciate your candid answer and wish you good luck at the elections.\nThanks Echa. Yeah I did know it was directed at Mike, but I wanted to respond anyway :)\nDo your best to get your name out there Ed. I think you have a genuinely popular platform on which to stand and a historic opportunity to challenge the status quo in Epping Forest. You've won my vote. Best of luck.\nThanks very much Dan - yes, I am trying to speak to as many residents as possible.\nFor balance, I disagree with almost every view you hold. Thanks for sharing though.\nOK, that's allowed! Thanks for reading.\nGood for you. I agree with virtually every word you have said.\nThanks Marcos!",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_60916948/content_13.html": "Hello Ed, I have just read your piece on immigration and believe it is very well thought through. I have reposted it on various social media platforms:\nHello Ed, I have just read your piece on immigration and believe it is very well thought through. I have reposted it on various social media platforms:\nHello Ed, I have just read your piece on immigration and believe it is very well thought through. I have reposted it on various social media platforms:\nhttps://sdp.org.uk/sdptalk/migrant-crisis-solutions-ed-pond/",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_60582680/content_22.html": "Hamas absolutely have to go. This current situation is down to their cowardly and degenerate attacks on innocent civilians. They should let all the hostages go if they really want this to stop, but they don't care about the catastrophe happening to their own people. That said, I do want to see a resolution to this tragedy and the Palesti…\nHamas absolutely have to go. This current situation is down to their cowardly and degenerate attacks on innocent civilians. They should let all the hostages go if they really want this to stop, but they don't care about the catastrophe happening to their own people. That said, I do want to see a resolution to this tragedy and the Palestinian innocents given the aid and respite they need. July 7th does not allow carte blanche to Israel, although they did have to respond robustly as I've said.\nHamas absolutely have to go. This current situation is down to their cowardly and degenerate attacks on innocent civilians. They should let all the hostages go if they really want this to stop, but they don't care about the catastrophe happening to their own people. That said, I do want to see a resolution to this tragedy and the Palestinian innocents given the aid and respite they need. July 7th does not allow carte blanche to Israel, although they did have to respond robustly as I've said.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_59731640/content_31.html": "Ed Pond: Independent Politics\nSubscribe\nSign in\nShare this comment\nEd Pond\nJun 22\nThanks Echa. Yeah I did know it was directed at Mike, but I wanted to respond anyway :)\nCopy link\nFacebook\nEmail\nNotes\nMore\n30 Comments\n⭠ Return to thread\nEd Pond\nJun 22\nAuthor\nThanks Echa. Yeah I did know it was directed at Mike, but I wanted to respond anyway :)\nExpand full comment\nReply\nShare\nShare\nCopy link\nFacebook\nEmail\nNotes\nMore\nThis site requires JavaScript to run correctly. Please\nturn on JavaScript\nor unblock scripts\nThanks Echa. Yeah I did know it was directed at Mike, but I wanted to respond anyway :)",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_58229466/content_32.html": "Ed Pond: Independent Politics\nSubscribe\nSign in\nShare this comment\nEd Pond\nJun 5\nOK, that's allowed! Thanks for reading.\nCopy link\nFacebook\nEmail\nNotes\nMore\n30 Comments\n⭠ Return to thread\nEd Pond\nJun 5\nAuthor\nOK, that's allowed! Thanks for reading.\nExpand full comment\nReply\nShare\nShare\nCopy link\nFacebook\nEmail\nNotes\nMore\nThis site requires JavaScript to run correctly. Please\nturn on JavaScript\nor unblock scripts\nOK, that's allowed! Thanks for reading.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_59333136/content_28.html": "On one hand my focus is much closer to home, and British problems. That said I do have a position.\nMy position is that Israel had to respond to the Hamas attacks, but that it's gone too far now. Civilians need safe zones to go to and aid supplies. There should be a ceasefire until at least this is secured.\nOn one hand my focus is much closer to home, and British problems. That said I do have a position.\nMy position is that Israel had to respond to the Hamas attacks, but that it's gone too far now. Civilians need safe zones to go to and aid supplies. There should be a ceasefire until at least this is secured.\nHamas has caused this catastrophe by its reckless actions - something Fatah and others have pointed out - and thus it should be removed by the Palestinian people (easier said than done). There should be a two state solution and economic development of Gaza to prevent radicalisation of young men by offering them opportunity.\nI could not deliver this as a lowly MP, but I would make these points for whoever was listening in Parliament and the government.\nHamas have threatened to continue its 7th October attacks until every Israeli is iradiicated from Israel which only occupies 0.09% of the Middle East. Biden’s latest policy on arms supply has been given more impetus to Hamas. I cannot imagine any other country in the World allowing such atrocities to happen in their Countries. Hamas are using their people to strengthen support. They have no regard for human life. They are stealing all the aid supplied , mostly by Israel. This war will continue unless other Countries support Israel to destroy Hamas not the Palestinian people. Hamas leaders live in Qatar and are billionaires whilst their people suffer from lack of infrastructure . They were losing popularity of their own people and they used their atrocities in Israel to increase their popularity. Their propaganda is winning. Ed, what do you say to all of this.\nHamas absolutely have to go. This current situation is down to their cowardly and degenerate attacks on innocent civilians. They should let all the hostages go if they really want this to stop, but they don't care about the catastrophe happening to their own people. That said, I do want to see a resolution to this tragedy and the Palestinian innocents given the aid and respite they need. July 7th does not allow carte blanche to Israel, although they did have to respond robustly as I've said.\nOn one hand my focus is much closer to home, and British problems. That said I do have a position.\nMy position is that Israel had to respond to the Hamas attacks, but that it's gone too far now. Civilians need safe zones to go to and aid supplies. There should be a ceasefire until at least this is secured.\nHamas has caused this catastrophe by its reckless actions - something Fatah and others have pointed out - and thus it should be removed by the Palestinian people (easier said than done). There should be a two state solution and economic development of Gaza to prevent radicalisation of young men by offering them opportunity.\nI could not deliver this as a lowly MP, but I would make these points for whoever was listening in Parliament and the government.\nHamas have threatened to continue its 7th October attacks until every Israeli is iradiicated from Israel which only occupies 0.09% of the Middle East. Biden’s latest policy on arms supply has been given more impetus to Hamas. I cannot imagine any other country in the World allowing such atrocities to happen in their Countries. Hamas are using their people to strengthen support. They have no regard for human life. They are stealing all the aid supplied , mostly by Israel. This war will continue unless other Countries support Israel to destroy Hamas not the Palestinian people. Hamas leaders live in Qatar and are billionaires whilst their people suffer from lack of infrastructure . They were losing popularity of their own people and they used their atrocities in Israel to increase their popularity. Their propaganda is winning. Ed, what do you say to all of this.\nHamas absolutely have to go. This current situation is down to their cowardly and degenerate attacks on innocent civilians. They should let all the hostages go if they really want this to stop, but they don't care about the catastrophe happening to their own people. That said, I do want to see a resolution to this tragedy and the Palestinian innocents given the aid and respite they need. July 7th does not allow carte blanche to Israel, although they did have to respond robustly as I've said.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com/content_29.html": "Ed Pond: Independent Politics\nArticles on politics and news on my campaigns.\nLaunched 2 years ago\nSubscribe\nBy subscribing, I agree to Substack’s\nTerms of Use\nand acknowledge its\nInformation Collection Notice\nand\nPrivacy Policy\nNo thanks\nThis site requires JavaScript to run correctly. Please\nturn on JavaScript\nor unblock scripts",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_58523969/content_7.html": "Ed Pond: Independent Politics\nSubscribe\nSign in\nShare this comment\nEd Pond\nJun 8\nThanks very much Dan - yes, I am trying to speak to as many residents as possible.\nCopy link\nFacebook\nEmail\nNotes\nMore\n30 Comments\n⭠ Return to thread\nEd Pond\nJun 8\nAuthor\nThanks very much Dan - yes, I am trying to speak to as many residents as possible.\nExpand full comment\nReply\nShare\nShare\nCopy link\nFacebook\nEmail\nNotes\nMore\nThis site requires JavaScript to run correctly. Please\nturn on JavaScript\nor unblock scripts\nThanks very much Dan - yes, I am trying to speak to as many residents as possible.",
  "https_edpond_substack_com_p_ed-pond-an-independent-voice-for/https_edpond_substack_com_p_ed-pond-an-independent-voice-for_comment_59704070/content_21.html": "Thanks for sharing your view point. My comment was intended for Mr Hunt as I don’t understand how your position - regardless what it is - has any relevance to this election. I feel the topic is being used for political point scoring rather than actually achieve anything. Nonetheless I appreciate your candid answer and wish you good luck at the elections.\nThanks for sharing your view point. My comment was intended for Mr Hunt as I don’t understand how your position - regardless what it is - has any relevance to this election. I feel the topic is being used for political point scoring rather than actually achieve anything. Nonetheless I appreciate your candid answer and wish you good luck at the elections.\nThanks for sharing your view point. My comment was intended for Mr Hunt as I don’t understand how your position - regardless what it is - has any relevance to this election. I feel the topic is being used for political point scoring rather than actually achieve anything. Nonetheless I appreciate your candid answer and wish you good luck at the elections.\nThanks Echa. Yeah I did know it was directed at Mike, but I wanted to respond anyway :)"
}