{
  "https_www_nathanedmunds_uk_/https_www_nathanedmunds_uk_about-rss/content_7.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_nathanedmunds_uk_/https_www_nathanedmunds_uk_news_out-campaigning-new-inn/content_2.html": "Your local Torfaen and Monmouthshire Conservatives joined forces today in New Inn to campaig for a Better NHS in Wales 🏥\nIt is wrong that patients in Wales wait longer for operations than those in England.\nAfter 26 years in charge, the Welsh Labour Government has had plenty of time to sort this out, but they have failed to deliver the health service that we deserve.\n#FixWales #WelshConservatives",
  "https_www_nathanedmunds_uk_/https_www_nathanedmunds_uk_news/content_8.html": "Fix Our Economy Survey Friday, 7 March, 2025 After 26 years of Labour, Wales’s economy is broken. They’ve backed policies like default 20mph, higher business rates, and new taxes, instead of jobs and businesses. Take our survey and back our plan to Fix Wales.. Click Here to Take Our Survey Senedd News\nOut Campaigning in New Inn 18th January 2025 Your local Torfaen and Monmouthshire Conservatives joined forces today in New Inn to campaig for a Better NHS in Wales 🏥 It is wrong that patients in Wales wait... Local News\nLabour Won't Stand up to Dangerous Child Abusers 10th January 2025 Do you think there should be an inquiry into Grooming Gangs? Nick Thomas-Symonds doesn't. MPs rejected the amendment to the Children's Wellbeing Bill by 364 to... Westminster News\nOut Campaigning in Monmouthshire 16th November 2024 Great to be out on the doorsteps in Gilwern this morning with the Monmouthshire Conservatives team, talking about Labour’s unbelievable and damaging budget. 🥀... Local News\nNew Leader Elected 4th November 2024 Kemi Badenoch has been elected as the new leader of the Conservative Party, beating Robert Jenrick by 12,418 votes. Badenoch got 53,806 votes to Jenrick’s 41... Westminster News\nHospital Waiting List Tops 800,000 for First Time 24th October 2024 Hospital waiting times have passed the 800,000 mark for the first time, hitting record levels in Wales again. The total number of patient pathways rose to 800... Senedd News\nLabour and Plaid Vote Against Scrapping Default 20mph Speed Limits 26th September 2024 This month marks one year since the Labour Welsh Government introduced default 20mph speed limits across Wales, the same 20mph speed limit that the Welsh... Senedd News\nLabour Cut Winter Fuel Payments 10th September 2024 Responding to Labour MPs voting to cut Winter Fuel Payments, Andrew RT Davies MS, Leader of the Welsh Conservatives, said: Wales will remember what Labour has... Westminster News\n‘SERIOUS CONCERNS’ AT GRANGE MORTUARY AFTER WRONG BODY MIX-UPS 6th September 2024 Assessors found “evidence of active ongoing risks and significant areas of concern” at a hospital mortuary, five months after the wrong bodies were released to... Local News\nWelsh Conservatives Oppose Senedd Reforms 4th September 2024 The first draft of the new ‘super constituencies’ has now been released , ahead of the expanded Senedd in 2026. A short reminder: Labour, Plaid Cymru and the... Senedd News",
  "https_www_nathanedmunds_uk_/https_www_nathanedmunds_uk_news_out-campaigning-monmouthshire/content_6.html": "Great to be out on the doorsteps in Gilwern this morning with the Monmouthshire Conservatives team, talking about Labour’s unbelievable and damaging budget.\n🥀 £25bn tax on jobs\n🥀 Winter Fuel Payments scrapped\n🥀 Family farms destroyed\nOnly Welsh Conservatives have a positive alternative and will fight for your interests in Wales 🏴🇬🇧",
  "https_www_nathanedmunds_uk_/https_www_nathanedmunds_uk_campaigns/content_5.html": "Save our local pubs Labour's War on Pubs Will Close Your Local Labour's pub tax hike will force landlords to raise prices or shut their doors for good. £1,000s extra in business...\nStop the grooming gangs It's time to get justice for victims. The only way to expose those who turned a blind eye to the grooming gangs is by holding a full inquiry, so sign our...\nStop the Family Farm Tax Labour have broken their promise to British farmers with the Family Farm Tax. Labour's Family Farm Tax will stop farms being passed to the next generation...\nPetition: Common sense immigration rules Our country is not a hotel, it is our home. This is our plan for immigration. We think: Newcomers should wait 10 years, instead of 5, before they can apply to...",
  "https_www_nathanedmunds_uk_/https_www_nathanedmunds_uk_contact/content_3.html": "Skip to main content\nMain navigation\nHome\nAbout Nathan\nNews\nCampaigns\nContact\nContact\nLeave this field blank\n[email protected]\nNathan on Facebook\nNathan on Twitter\nNathan on Instagram\nNathan on LinkedIn\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_nathanedmunds_uk_/https_www_nathanedmunds_uk_campaigns_stopthegroominggangs/content_10.html": "It's time to get justice for victims.\nThe only way to expose those who turned a blind eye to the grooming gangs is by holding a full inquiry, so sign our petition.\nAdd your name and sign the petition to demand a full inquiry into the grooming gangs and those who turned a blind eye to them. This petition will be presented to the Labour Party by the next summer recess. We will use your contact details to update you about crime-related issues.",
  "https_www_nathanedmunds_uk_/https_www_nathanedmunds_uk_cdn-cgi_l_email-protection/content_4.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_nathanedmunds_uk_/https_www_nathanedmunds_uk_events_feed/content_9.html": null,
  "https_www_nathanedmunds_uk_/https_www_nathanedmunds_uk/content_1.html": "Campaigns\nFind me on Facebook\nFind me on X\nFind me on Instagram\nTorfaen\nAm I your candidate?\nEnter your postcode to confirm that Nathan Edmunds is your candidate.\nI'm Nathan, the Welsh Conservatives parliamentary candidate for Torfaen in 2024. I stood because I wanted to help make our corner of Wales a better place. Here, you can find my news and campaigns, as well as more about me. I'm here to help, so please don't hesitate to get in touch.\nEnter your postcode to confirm that Nathan Edmunds is your candidate."
}