{
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_january-newsletter/content_20.html": "It’s been a busy year, but I’ve loved having the opportunity to get to work on the issues that matter most to us.\nIt remains the greatest honour to serve as our MP, and I’m looking forward to working with and delivering for our community in 2025.\nHere’s some of the highlights:",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_latest-column-express-and-echo/content_31.html": "A Busy Month of Progress and Action in Exmouth & Exeter East\nSince being elected, my team and I have worked hard to address the thousands of emails and letters we’ve received from residents across Exmouth and Exeter East. It’s been incredibly rewarding to help local families navigate their concerns, and we’re grateful to be able to provide support in times of need.\nOne of the most fulfilling parts of my role has been meeting with businesses and organizations throughout the constituency.\nA central focus of my work this month has been tackling the urgent issue of waterway and coastline pollution. Our region’s beaches and waters are vital to both the environment and our local economy, and I am committed to pushing for cleaner, safer water.\nLast week, I held an important meeting with South West Water (SWW) and the Environment Agency, where we were briefed on the current state of sewage in our area. The meeting was productive, and SWW outlined their long-term plans to upgrade the sewerage network. This is a significant step forward, but the work doesn’t stop here.\nI’ve also requested a meeting with the Water Minister and the CEO of South West Water to apply further governmental pressure on ensuring these vital improvements are made. This will help keep both local and national authorities informed on progress and hold SWW accountable for delivering on their promises.\nThere’s a lot of work still to be done, but my team and I are committed to driving positive change in Exmouth and Exeter East, and I’ll continue to work hard for our community.\nMy campaign to clean up our waterways and coastline has been central - Devon Live",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_banking-hub-campaign-paper-survey-copies-now-available-across-local-villages/content_30.html": "David Reed, MP for Exmouth and Exeter East, has taken the next step in his campaign to secure a Banking Hub for the communities of Budleigh Salterton, East Budleigh, Otterton, and the surrounding area.\nThe campaign, launched several weeks ago, has already received a strong response online, with residents from across the constituency backing David’s call for better access to face-to-face banking services. The next phase of the campaign now includes paper copies of the survey, available for those who prefer to respond in person.\n“I’ve been really encouraged by the number of people who have already responded to the online survey. It’s clear that residents across our towns and villages feel strongly about the need for a local Banking Hub.\nBut not everyone is online—and that’s exactly why we’ve now made paper copies available at key locations in each community. I want everyone to have the chance to have their say.”\nPaper surveys are now available at the following locations:\n- Budleigh Salterton Information Centre\n- East Budleigh Community Shop\n- Otterton Village Hall\nThe campaign comes in response to the increasing number of bank branch closures in rural and coastal communities, which have left many people—particularly older residents and small businesses—without easy access to essential banking services.\nYou can still complete the online version of the survey here",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_exmouth-dinosaur-and-geology-day-2025/content_8.html": "I loved getting along to the Exmouth Dinosaur & Geology Day last week.\nSo much effort went into bringing the event together, and it was great to see everyone having fun.\nMassive thanks go to Liz Oram for being the star organiser. As a volunteer she’s put in a massive amount of time and effort to give Exmouth a brilliant and memorable experience.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_campaigns_building-more-infrastructure-support-local-homes/content_26.html": "Ensuring that local people are prioritised and have access to affordable homes. If this means building more homes, we must also deliver crucial infrastructure to support this such as the Dinan Way extension.\nEnsuring that local people are prioritised and have access to affordable homes. If this means building more homes, we must also deliver crucial infrastructure to support this such as the Dinan Way extension.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_about-david-reed/content_5.html": "David Reed is the Conservative Member of Parliament for Exmouth & Exeter East.\nDavid has a deep connection to Exmouth & Exeter East, and continually speaks out in Parliament to bring about positive change for the long-term for everyone in the constituency. With multiple previous generations of his family hailing from East Budleigh, David feels a sense of duty to help preserve what’s best about our home, and to enhance and improve it wherever it’s needed.\nRecently, David has had the privilege of being appointed Shadow Parliamentary Private Secretary For Defence.\nDavid entered the political environment with 15 years of relevant professional and academic experience. David started his career in the Royal Marines and the Special Forces Support Group and served in multiple conflict zones around the world over a seven-year career. Alongside frontline service, David was a parachutist on the Royal Navy Parachute Display Team, and he won a place on the Team GB Wingsuit Skydiving Squad.\nSince leaving the Royal Marines, David has been awarded a First-Class Bachelor’s degree in Business, and a Master’s degree in International Security.\nDavid has previously led large teams and budgets at the cutting edge of cyberspace development in the public and private sector, as well as running his own company. David also held a senior managerial position in the defence firm, BAE Systems Digital Intelligence.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_about-rss/content_9.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_category_Reports/content_7.html": "Exmouth and Budleigh Salterton Water Summit 10th April 2025 David hosted an important meeting last night with representatives from South West Water, the Environment Agency, Clinton Devon Estates and ESCAPE... Reports",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_successful-pensioners-advice-fair/content_24.html": "I had the pleasure of hosting a fantastic Pensioners' Advice Fair today, where I met some wonderful local people and organisations dedicated to supporting our older residents. The event saw an excellent turnout, highlighting the real need for accessible advice and guidance on key issues affecting pensioners in our community.\nFrom financial support and healthcare to social opportunities and local services, the fair provided a valuable platform for attendees to connect with experts and find the help they need. It was great to see so many people engaging with the organisations present and taking away useful information to support their well-being and independence.\nI’m incredibly grateful to everyone who contributed to making the event such a success.\nGiven the positive response, I am excited to host many more events like this in the coming years, covering a range of important topics to benefit people across Exmouth and Exeter East. My aim is to ensure that our community continues to have access to the support and resources it needs to thrive.\nThank you again to all who joined us—I look forward to seeing you at the next one!",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_david-reed-mp-discusses-key-national-issues-bbcs-any-questions/content_12.html": "Last night, I had the pleasure of joining the panel on BBC Radio 4’s Any Questions?—a show that brings together a range of voices to discuss the most pressing issues facing our country. It was an engaging and thought-provoking experience, and I thoroughly enjoyed the lively debate that unfolded.\nThe show was packed with pertinent questions from the audience, which covered a variety of critical topics. We discussed everything from the challenges facing British steel, the impact of US and Chinese tariffs on our economy, to the ongoing issues in farming. One of the most important conversations centred on housing for young people, a topic I’m particularly passionate about given the rising difficulty for many to get on the property ladder.\nIf you’d like to hear the full discussion and get a sense of the insightful perspectives shared on the show, you can listen to the episode here.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_map-locations/content_3.html": "Skip to main content\nDavid Reed MP\nExmouth & Exeter East\nMain navigation\nHome\nMy Plan for Exmouth & Exeter East\nNews\nIn Parliament\nContact Me\nBanking Hub Campaign\nDavid Reed MP\nExmouth & Exeter East\nMy Map",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_category_Local-News/content_4.html": "Banking Hub Campaign with Paper Survey Copies Now Available Across Local Villages 30th April 2025 David Reed, MP for Exmouth and Exeter East, has taken the next step in his campaign to secure a Banking Hub for the communities of Budleigh Salterton, East... Local News\nExmouth Centre Stage Performance - Guys and Dolls 19th April 2025 Massive congratulations to everyone involved in the Centre Stage performance of Guys and Dolls It was a real pleasure to join you all for the final performance... Local News\nExmouth Dinosaur and Geology Day 2025 19th April 2025 I loved getting along to the Exmouth Dinosaur & Geology Day last week. So much effort went into bringing the event together, and it was great to see everyone... Local News\nDavid Reed MP Discusses Key National Issues on BBC’s \"Any Questions\" 12th April 2025 Last night, I had the pleasure of joining the panel on BBC Radio 4’s Any Questions?—a show that brings together a range of voices to discuss the most pressing... Local News\nBicton College rated Outstanding by OFSTED! 17th March 2025 Following my recent visit to Bicton College, I’m delighted to see their hard work and dedication recognised in their latest Ofsted report. The college has been... Local News\nSt Peter's school visit 24th January 2025 After receiving 1000 letters from the students of St Peter's School in Exeter highlighting their concerns for mental health in young people, I paid them a visit... Local News\nKemi's visit to East Devon 24th January 2025 It was a real pleasure to host Kemi Badenoch at Landram Bay Holiday Park. Together, we listened to several local business leaders about the pressures they are... Local News\nSt Peters School 1000 letters concerning young peoples mental health. 24th January 2025 Just before Christmas I received from St Peter's Secondary School, one thousand letters from their students. It was eye-opening to read about the challenges... Local News\nWater Bill 23rd January 2025 Before being elected to Parliament, I made the cast iron commitment to everyone in Exmouth & Exeter East that I would do whatever it takes to force South West... Local News",
  "https_www_davidreed_uk_/https_www_davidreed_uk_cookies/content_6.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_davidreed_uk_/https_www_davidreed_uk_campaigns_improving-access-local-health-and-social-care/content_25.html": "Fighting to improve access to local GP surgeries, NHS dentistry and social care services. Ensuring that we can see a medical professional when we need to.\nFighting to improve access to local GP surgeries, NHS dentistry and social care services. Ensuring that we can see a medical professional when we need to.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_exmouth-centre-stage-performance-guys-and-dolls/content_23.html": "Massive congratulations to everyone involved in the Centre Stage performance of Guys and Dolls\nIt was a real pleasure to join you all for the final performance on Saturday evening- you were all electric!\nThe acting, music, choreography, costumes and stage scenes were all flawless, and you all captivated the audience throughout.\nSo proud to have the opportunity to celebrate the people that make our community so great.\nWell done, and looking forward to the next production!",
  "https_www_davidreed_uk_/https_www_davidreed_uk_contact/content_16.html": "Skip to main content\nDavid Reed MP\nExmouth & Exeter East\nMain navigation\nHome\nMy Plan for Exmouth & Exeter East\nNews\nIn Parliament\nContact Me\nBanking Hub Campaign\nDavid Reed MP\nExmouth & Exeter East\nContact\nLeave this field blank\nDavid Reed MP Constituency Office\n01395 493213\n[email protected]\nFacebook\nTwitter\nInstagram\nLinkedIn\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news/content_11.html": "Banking Hub Campaign with Paper Survey Copies Now Available Across Local Villages Wednesday, 30 April, 2025 David Reed, MP for Exmouth and Exeter East, has taken the next step in his campaign to secure a Banking Hub for the communities of Budleigh Salterton, East Budleigh, Otterton, and the surrounding area. The campaign, launched several weeks ago, has already received a strong response online, with residents from across the constituency backing David’s call for better access to face-to-face banking... Local News\nMy Latest Newsletter 28th April 2025 My Spring Newsletter is now available! In this edition, I’m sharing updates on my work in Parliament and the ongoing efforts to support our community here at... Newsletters\nExmouth Centre Stage Performance - Guys and Dolls 19th April 2025 Massive congratulations to everyone involved in the Centre Stage performance of Guys and Dolls It was a real pleasure to join you all for the final performance... Local News\nExmouth Dinosaur and Geology Day 2025 19th April 2025 I loved getting along to the Exmouth Dinosaur & Geology Day last week. So much effort went into bringing the event together, and it was great to see everyone... Local News\nDavid Reed MP Discusses Key National Issues on BBC’s \"Any Questions\" 12th April 2025 Last night, I had the pleasure of joining the panel on BBC Radio 4’s Any Questions?—a show that brings together a range of voices to discuss the most pressing... Local News\nExmouth and Budleigh Salterton Water Summit 10th April 2025 David hosted an important meeting last night with representatives from South West Water, the Environment Agency, Clinton Devon Estates and ESCAPE... Reports\nHouse building and the Local Plan 26th March 2025 \"Change is inevitable, but it must be managed responsibly. While we must adapt to modern times, we should preserve our collective past, which gives us a sense... Articles\nMy visit to the Met Office 21st March 2025 I had a great visit to the Met Office on Friday, and I just want to say a massive thank you to Professor Penny Endersby and her whole team for hosting me... Articles\nChallenging the Government Over Farming Policy U-Turns and Lack of Engagement 20th March 2025 David Reed has called on the Government to urgently address the sudden withdrawal of the Sustainable Farming Incentive (SFI) scheme and to explain why DEFRA... Articles\nBicton College rated Outstanding by OFSTED! 17th March 2025 Following my recent visit to Bicton College, I’m delighted to see their hard work and dedication recognised in their latest Ofsted report. The college has been... Local News",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_st-peters-school-visit/content_27.html": "After receiving 1000 letters from the students of St Peter's School in Exeter highlighting their concerns for mental health in young people, I paid them a visit to thank them for writing to me and detail out my plans and how I can support them.\nWe showed them a clip from Prime Minister Questions where I asked the Prime Minister what this government are going to do to support our young people.\nIt was great to tell them directly that I will be getting straight to work to see what can be done to improve the situation both locally and nationally.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_my-latest-newsletter/content_2.html": "My Spring Newsletter is now available!\nIn this edition, I’m sharing updates on my work in Parliament and the ongoing efforts to support our community here at home:\nhttps://sh1.sendinblue.com/acxbcu87lxpfe.html?t=1745847686171\nIf you would like to sign up to my newsletter you can do so on the left hand side of this page.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_category_Newsletters/content_17.html": "My Latest Newsletter 28th April 2025 My Spring Newsletter is now available! In this edition, I’m sharing updates on my work in Parliament and the ongoing efforts to support our community here at... Newsletters\nJanuary Newsletter 7th January 2025 It’s been a busy year, but I’ve loved having the opportunity to get to work on the issues that matter most to us. It remains the greatest honour to serve as our... Newsletters",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_kemis-visit-east-devon/content_14.html": "It was a real pleasure to host Kemi Badenoch at Landram Bay Holiday Park.\nTogether, we listened to several local business leaders about the pressures they are facing after the recent budget, and Kemi laid out a positive and pragmatic view of where we need to go as a country.\nI'm looking forward to working with Kemi to ensure that Devon voices are heard loud and clear by this new Labour government.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_exmouth-and-budleigh-salterton-water-summit/content_29.html": "David hosted an important meeting last night with representatives from South West Water, the Environment Agency, Clinton Devon Estates and ESCAPE representatives from Budleigh Salterton and Exmouth, as well as Town, District, and County Councillor from every political party. The meeting focused on ongoing pollution problems in Exmouth and Budleigh Salterton, the efforts to address these issues, and the planned works for the future to improve water quality and infrastructure.\nThis second water summit built on a similar meeting held in October 2024, the aim of the meeting was to get all the interested parties on the same page regarding water pollution and what is being done about it. Councillors were given information to share with residents on upcoming projects and expected improvements.\n\"Our communities in Exmouth and Budleigh Salterton have long suffered from inadequate water infrastructure, leading to pollution and environmental degradation. This meeting was a critical step toward ensuring that South West Water are held accountable for their commitments and to their customers. We must see tangible improvements that protect our environment and public health.\"\nKey outcomes from the meeting included:\n- Pollution Prevention and Mitigation: South West Water and the Environment Agency provided updates on measures being implemented to tackle pollution in both Exmouth and Budleigh Salterton, including ongoing efforts to reduce wastewater overflow incidents and improve coastal water quality.\n- Planned Infrastructure Improvements: South West Water outlined the future plans for upgrading local water infrastructure, with specific focus on improving wastewater treatment systems and enhancing flood prevention measures.\n- Flooding and Drainage Systems: Efforts to mitigate flooding risks, particularly in the coastal and low-lying areas, were discussed, with plans to upgrade drainage infrastructure to protect local communities from future flooding.\n- Community Engagement and Updates: Local councillors were briefed on all ongoing projects and provided with materials to share with the community, ensuring that residents are kept up to date with the latest developments.",
  "https_www_davidreed_uk_/https_www_davidreed_uk/content_1.html": "I have the honour of being your MP for Exmouth and Exeter East. As a former Royal Marines Commando, public service remains a cornerstone of my life. Here you can find out more about my work and campaigns, how to get in touch and how to get involved with supporting your local area.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_banking-hub-campaign/content_10.html": "Like many of you, I am deeply frustrated by the continued closure of bank branches across our communities. The recent announcement that Santander will be closing its Exmouth branch is yet another blow, leaving even more people without access to in-person banking. With the temporary closure of Budleigh Salterton’s Post Office, I know many residents are rightly concerned about the future of local banking and access to cash.\nThat’s why I’m pushing for new banking hubs in Budleigh Salterton—shared spaces where multiple banks operate under one roof, ensuring people can still access essential banking services face-to-face. We’ve already seen how well this works in Sidmouth, where a banking hub is providing vital services to residents and businesses.\nTo make this happen, I need your support. The more people who back this proposal, the stronger the case we can present. I’ve already raised the issue with the Post Office and will continue working with key stakeholders to get banking hubs set up in Budleigh, with the hope of being able to expand into other locations if successful.\nIf you want to bring back local banking, please take a moment to complete my short survey and have your say.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_category_Articles/content_21.html": "House building and the Local Plan 26th March 2025 \"Change is inevitable, but it must be managed responsibly. While we must adapt to modern times, we should preserve our collective past, which gives us a sense... Articles\nMy visit to the Met Office 21st March 2025 I had a great visit to the Met Office on Friday, and I just want to say a massive thank you to Professor Penny Endersby and her whole team for hosting me... Articles\nChallenging the Government Over Farming Policy U-Turns and Lack of Engagement 20th March 2025 David Reed has called on the Government to urgently address the sudden withdrawal of the Sustainable Farming Incentive (SFI) scheme and to explain why DEFRA... Articles\nSuccessful Pensioners' Advice Fair 14th March 2025 I had the pleasure of hosting a fantastic Pensioners' Advice Fair today, where I met some wonderful local people and organisations dedicated to supporting our... Articles\nLatest column for Express and Echo 11th November 2024 A Busy Month of Progress and Action in Exmouth & Exeter East Since being elected, my team and I have worked hard to address the thousands of emails and letters... Articles",
  "https_www_davidreed_uk_/https_www_davidreed_uk_cdn-cgi_l_email-protection/content_15.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_parliament/content_13.html": "Tweet Here, you can see David's speeches and appearances in Parliament (provided by theyworkforyou):-\nEnergy Grid Resilience | Commons debates Recent events in Spain and Portugal highlight the wide range of challenges facing power grids, and we have heard many in previous questions.\nCybersecurity: Departmental Coordination | Cabinet Office | Written Answers To ask the Minister for the Cabinet Office, what discussions he has had with the Secretary of State for (a) the Home Department and (b) Scie\nCybersecurity | Home Office | Written Answers To ask the Secretary of State for the Home Department, what estimate her Department has made of the potential impact of limitations on enhan\nCybersecurity: Artificial Intelligence | Home Office | Written Answers To ask the Secretary of State for the Home Department, what steps her Department has taken to assess the impact of the barriers imposed by t\nBritish Steel | Commons debates There is consensus across this House that producing steel in the UK is completely necessary—that is undeniable.\nBritish Steel | Commons debates There is consensus across this House that producing steel in the UK is completely necessary—that is undeniable.\nBirmingham: Waste Collection | Commons debates Could the Minister—or the Pied Piper, as he is quickly becoming known—clear up the record, please?\nBirmingham: Waste Collection | Commons debates Could the Minister—or the Pied Piper, as he is quickly becoming known—clear up the record, please?",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_challenging-government-over-farming-policy-u-turns-and-lack-engagement/content_18.html": "David Reed has called on the Government to urgently address the sudden withdrawal of the Sustainable Farming Incentive (SFI) scheme and to explain why DEFRA Ministers have failed to engage with Devon’s farming community.\nDuring today’s DEFRA Questions, David Reed criticised Ministers for repeatedly ignoring his attempts to secure a meeting between Devon’s farmers and the Secretary of State. Since early December, he has sent multiple letters and invitations requesting a discussion on how changes to Agricultural Property Relief (APR) and Business Property Relief (BPR) will affect farmers in the region. Yet, despite repeated requests, no meeting has been arranged.\n\"I am starting to feel like DEFRA Ministers are purposefully ignoring me and Devon’s farming community. I have given the Secretary of State since early December to answer my letters and my invitations to meet with Devon’s farming community, in order to explain how changes to Agricultural Property Relief and Business Property Relief are going to affect them. At the last DEFRA Questions, I called out the Secretary of State for not replying to any of my requests. The Minister for Food, Farming and Fisheries replied from the Dispatch Box that:\n‘I would love to meet farmers in Devon, so I am happy to add him to the list for my grand tour across the country to reassure people that there is a strong plan to ensure that farmers have a viable future.’—[Official Report, 6 February 2025; Vol. 761, c. 909.]\nSo far, those platitudes have gone unrealised. With less than a month until these changes take effect, Devon’s farmers are still in the dark about how the changes are going to affect them. If this is how Ministers treat fellow MPs, is it any wonder that farmers up and down the country feel completely abandoned by this Labour Government?\"\nIn response to David Reed’s pressing question, DEFRA Minister Daniel Zeichner failed to provide any meaningful reassurance, instead offering a dismissive remark that he had visited Devon before and would do so again—while suggesting that fewer parliamentary questions from Conservative MPs would give him more time to engage with farmers.\n\"This response is completely inadequate,\" said David Reed. \"Farmers don’t need vague promises or deflection—they need clear answers. If this is how Ministers treat fellow MPs, is it any wonder that farmers up and down the country feel completely abandoned by this Labour Government?\"\nAlongside this failure to engage, the Government’s sudden withdrawal of the Sustainable Farming Incentive (SFI) scheme has left farmers across Devon in financial distress and uncertainty. David Reed has called on the Government to provide immediate clarity on financial support for affected farmers and what alternative measures will replace the scrapped scheme.\n\"Farmers in my constituency have spent thousands on agents’ fees preparing SFI applications—some due to submit them on the very day the scheme was scrapped, they have been left out of pocket and without a clear path forward. Farming requires long-term planning, and the Government’s approach is creating uncertainty at a time when we need stability in British agriculture.\"\nThe withdrawal of the SFI scheme follows concerns about the proposed changes to APR and BPR, which could see family farms burdened with significant Inheritance Tax (IHT) liabilities. Many fear this could lead to the forced sale of farmland, putting the future of rural businesses and food production at risk.\nDavid Reed is continuing to press for immediate financial support for farmers affected by the SFI withdrawal, as well as an urgent meeting between Ministers and Devon’s agricultural community to address these concerns.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_news_st-peters-school-1000-letters-concerning-young-peoples-mental-health/content_28.html": "Just before Christmas I received from St Peter's Secondary School, one thousand letters from their students.\nIt was eye-opening to read about the challenges they face with their mental health and the stories were harrowing and concerning.\nI am now committed to establish local solutions to give children across #ExmouthandExeterEast the care they need, and the tools to help forge resilience.\nAt Prime Minister's Questions, I asked the Prime Minister what the Government is doing to address this pressing issue nationally.\nSee his response here.\nI also visited the students to thank them for their letter and detail my plans to support them.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_campaigns_expanding-career-opportunities-backing-business-and-attracting-investment/content_22.html": "Making it easier for businesses to operate, attracting quality jobs and rewarding hard work in Exmouth & Exeter East by being the most pro-business candidate.\nMaking it easier for businesses to operate, attracting quality jobs and rewarding hard work in Exmouth & Exeter East by being the most pro-business candidate.",
  "https_www_davidreed_uk_/https_www_davidreed_uk_privacy/content_19.html": "This document outlines how David Reed processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is David Reed\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact David Reed.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of David Reed, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact David Reed via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S"
}