{
  "https_bengoldsborough_co_uk_/https_bengoldsborough_co_uk_bens-visits/content_7.html": "Ben Goldsborough for South Norfolk\nHouses of Parliament, Westminster, London, SW1A 0AA\nCopyright © 2022 Ben Goldsborough - All Rights Reserved. Privacy Policy\nPowered by\nWe use cookies to analyse website traffic and optimise your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_bengoldsborough_co_uk_/https_bengoldsborough_co_uk_behaviour-policy/content_2.html": "I am committed to fostering a respectful and constructive environment for all constituents and visitors engaging with my website and associated digital platforms. This policy outlines the standards of behaviour expected when interacting with this website, its contact forms, and any related online communications or in person.\nAll visitors are expected to communicate respectfully when engaging with this website, including when submitting inquiries or comments. Abuse, threats, or offensive language will not be tolerated.\nI understand that many constituents are often upset and angry about the issues they have raised. However, if that anger escalates into aggression towards my team, I consider that unacceptable. Any violence, threats, or abuse towards staff will not be tolerated.\nViolence is not restricted to acts of aggression that may result in physical harm. It also includes behaviour or language (whether verbal or written) that may cause staff to feel offended, afraid, threatened, or abused.\nUnacceptable language includes:\nThreats against my team will be taken very seriously. If at any point during a conversation staff feel scared or threatened, the interaction may be ended immediately.\nExcessive or persistent contact that impacts my office’s ability to assist other constituents may be deemed unreasonable. This includes:\nMy team have the right to carry out their duties free from harassment. Behaviours considered harassment include:\nA demand becomes unacceptable when it substantially impacts the work of my office. Examples include:\nContact becomes unacceptable when it prevents staff from assisting other constituents. Examples include:\nCopyright © 2022 Ben Goldsborough - All Rights Reserved.\nPrivacy Policy",
  "https_bengoldsborough_co_uk_/https_bengoldsborough_co_uk_contact-ben/content_4.html": "Please email Ben at ben.goldsborough.mp@parliament.uk\nWhen emailing please provide your full postal address & any reference numbers of casework that has previously been raised.\nPlease call 01603 570332 to speak to a member of my team in South Norfolk.\nIf pen and paper is your preferred way of getting in touch please write to:\nBen Goldsborough MP\nHouses of Parliament\nWestminster\nLondon\nSW1A 0AA\nRemember to include your full postal address in your letter so Ben can write back.\nCopyright © 2022 Ben Goldsborough - All Rights Reserved.\nPrivacy Policy",
  "https_bengoldsborough_co_uk_/https_bengoldsborough_co_uk_sign-up-to-ben%E2%80%99s-blog/content_3.html": "Sign up here for all the latest news and views from Ben Goldsborough MP.\nBen Goldsborough for South Norfolk\nHouses of Parliament, Westminster, London, SW1A 0AA\nCopyright © 2022 Ben Goldsborough - All Rights Reserved. Privacy Policy\nPowered by\nWe use cookies to analyse website traffic and optimise your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_bengoldsborough_co_uk_/https_bengoldsborough_co_uk_news/content_5.html": "Ben Goldsborough for South Norfolk\nHouses of Parliament, Westminster, London, SW1A 0AA\nCopyright © 2022 Ben Goldsborough - All Rights Reserved. Privacy Policy\nPowered by\nWe use cookies to analyse website traffic and optimise your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_bengoldsborough_co_uk_/https_bengoldsborough_co_uk_local-advice-surgeries/content_6.html": "Saturday 10th May 2025\n10am - 12 Noon, The Willow Centre, Willowcroft Way, Cringleford.\nWednesday 14th May 2025\nTime to be shared nearer the time.\nFriday 23rd May 2025\nTime and location to be shared nearer the time\nFriday 30th May 2025\nTime and location to be shared nearer the time\nFriday 6th June 2025\nTime and location to be shared nearer the time\nSaturday 14th June 2025\n10am - 12 Noon, Poringland Community Centre\nFriday 20th June 2025\nTime and location to be shared nearer the time\nSaturday 28th June 2025\nTime and location to be shared nearer the time\nFriday 4th July 2025\nTime and location to be shared nearer the time\nFriday 11th July 2025\nTime and location to be shared nearer the time\nDue to unforeseen circumstances, my advice surgeries may occasionally need to be rescheduled. If this happens, we will be in touch to inform you as early as possible and to arrange another meeting at a future date.\nCopyright © 2022 Ben Goldsborough - All Rights Reserved.\nPrivacy Policy",
  "https_bengoldsborough_co_uk_/https_bengoldsborough_co_uk/content_1.html": "Your Labour MP for South Norfolk\nI never intended to embark on this journey. University wasn’t for the likes of me. I was content to do as my mum had done and work in retail. From my first job on the deli counter in Budgens to my cashier role at Halfords I was happy.\nLike many we wish to represent, I was hopeful to climb up the ladder within Halfords and had some success. I became the youngest Deputy Store Manager in the East Anglian region.\nPutting in the graft and showing I could manage a team of people from all ages and backgrounds. But events caused this to change.\nThe financial crash of 2008 saw Halfords embark on a series of redundancies. This lived experience of worrying over the next paycheque and not knowing how much you will be relying on the kindness of others has spurred me on to do my best for those facing hardship via the Labour movement.\nBefore being elected as your Member of Parliament for South Norfolk, I was Head Associate of a consultancy company - responsible for supporting charities and thought leaders in getting their message across.\nMoreover, my involvement in organising fundraising events for a major international charity has underscored my determination to stand up for my the things that matter most to us. Working across sectors, I've learned first-hand how to secure funding and advocate for causes, such as defending freedom of expression globally.\nPreviously, I've collaborated with Labour MPs, assisting them in connecting with constituents through speechwriting, media engagement, and social media strategy. This experience has afforded me insights into driving change on national policy issues while strengthening MPs' positions within their constituencies.\nI previously worked alongside Sir David Hanson on the 'Freedom From Fear' campaign highlighted my capacity to effect change in Parliament by collaborating closely with colleagues and stakeholders. From drafting amendments to legislation to advocating for the protection of retail workers, I've demonstrated a commitment to driving meaningful legislative change.\nYou'll find me out and about walking my dog, Timo. He's a bit of a fluffball who just wants to be everyone's best mate. And when I'm not walking him I'll either be in the garden or trying my hand at a new baking recipe.\nCopyright © 2022 Ben Goldsborough - All Rights Reserved.\nPrivacy Policy"
}