{
  "https_oxfordindependent_co_uk_/https_oxfordindependent_co_uk_protect-our-nhs/content_3.html": "The NHS Is OURS!\nDavid Henwood continues to campaign against the selling or privatisation of the National Health Service (NHS) which we proudly call ours.\n“WE OWN IT”\nStanding outside the John Radcliffe Hospital, the main NHS facility for Oxfordshire, David said “I want to keep the NHS for us. I don’t want the United States buying into this precious product. We Own It!”\nDavid will continue to campaign to keep the much-loved Health Service open to the public, supporting our hero GPs, Doctors, Nurses and other care workers.",
  "https_oxfordindependent_co_uk_/https_oxfordindependent_co_uk_surgeries/content_2.html": "Want to speak to David about Issues that matter to you?\nCome along and visit David at one of his surgeries to discuss issues that matter to you.\nSurgeries take place on the first Saturday of every month, at both Cowley Centre (Templars Square Shopping Centre), and Rose Hill Community Centre.\nWe publish the dates of upcoming surgeries on this page, alongside their planned locations. Please check this page for updates to surgery timings and locations.\nUpcoming Surgeries in 2024\nJuly 2024\n6th July 2024: 11am – 14:00 (Cowley Centre)\n6th July 2024: 14:30 – 15:30 (Rose Hill Community Centre)\nAugust 2024\n3rd August 2024: 11am – 14:00 (Cowley Centre)\n3rd August 2024: 14:30 – 15:30 (Rose Hill Community Centre)\nSeptember 2024\n7th September 2024: 11am – 14:00 (Cowley Centre)\n7th September 2024: 11am – 14:00 (Rose Hill Community Centre)\nCan’t make it to the Surgeries, but want to speak to David?\nNo problem – you can always get in touch with David by clicking the ‘Contact’ button on the top of this page, and he will respond to you. We want to make your Independent candidate accessible to you – so we offer a number of ways to get in touch – in person, via Telephone, or via E-Mail.\nPast Surgeries in 2024\nJune 2024\n1st June 2024: 11am – 14:00 (Cowley Centre)\n1st June 2024: 14:30 – 15:30 (Rose Hill Community Centre)",
  "https_oxfordindependent_co_uk_/https_oxfordindependent_co_uk_save-the-cowley-chestnut-tree/content_8.html": "Are you passionate about the environment and The Cowley Chestnut Tree? Are you aware of the plans to fell this well-loved tree? Cllr David Henwood is battling the Oxford City Council to retain the tree.\nChestnut trees are now on the endangered list, and more must be done to preserve mature trees like this one that can adsorb 1 ton of carbon dioxide in their lifetime, and emit 260 lbs of oxygen a season.\nLocal residents are incensed public amenities have disappeared from the area in recent years, and now want to take a stand to protect this much valued chestnut tree.\nThis chestnut tree was originally planted by the Gibbons family that ran a bakery on the site approx 100 years ago, and this tree is the only surviving feature of ‘Old Cowley’ and should be protected by a Tree Preservation Order, for the prosperity and amenity of future generations.\nThank you to the nearly 2,000 people that have signed the petition to ‘Save The Cowley Chestnut Tree’. Along with local residents we were overwhelmed by the 200 people that visited our table at The Cowley Centre to sign the petition. Thank you.\nI am however, standing by my statement that unless the person who conducted the arborists report came from planet Kryton, or another alien planet that has X-Ray vision the ‘walkthough’ assessment at ground level, while the tree was in full leaf is a ‘best guess’ on the internal condition of the tree.\nThe report commissioned by Oxford City Council is quite specific in its claim and states the tree has ‘clear signs of extensive internal decay (page 10), but also states ‘No tissue samples were taken nor was any internal investigation of the subject trees undertaken’ (page 6). This last statement is key to my argument and my allegation that the evidence or lack or evidence is misleading, and can only be clarified by using a tomograph and resistograph test specifically designed to measure internal tree decay.\nI am told that I am in breach of the City Council’s Constitution, because my language does not demonstrate ‘respect to officers’. I respect all officers, however this decision to fell the chestnut tree is clearly flawed due to the lack of evidence. ‘No internal investigation of the trees was undertaken’.\nI have offered to protect officers and the city council’s integrity by paying for an independent assessment, an assessment that would meet British Standard BS5837:2012 by using a tomograph and resistograph to prove the presence of extensive internal decay. It may indeed be the case ‘extensive decay’ is present, but it yet to be proven.\nI have recently met officers to try to examine a pathway or compromise to facilitate a solution, should the tree prove to have ‘extensive internal decay’ I’ve suggested progressive pollarding or inviting local residents and descendants of the Gibbons family plant a replacement Horse Chestnut near the site of the original bakery. These compromises have been declined.\nOfficers also inform me that the proposed 5 mature trees that were to be planted on the grass verge in front of the new proposal have been refused permission by County Council, it is now clear the new planting scheme will not off-set the removal the current trees both in terms of visual amenity and carbon footprint. We really need to back to the drawing board on this one.\nI also in the process of organising a meeting with officers and local residents at the Venue in Cowley.\nThe full planting plan, arboricultural reports and Oxford Mail articles are attached below. These are public documents which you are entitled to read at your own leisure.",
  "https_oxfordindependent_co_uk_/https_oxfordindependent_co_uk_why-vote-david/content_7.html": "Vote Independent – Why?\nWhy should you vote David Henwood in this General Election?\n- Proven Track Record – David has successfully delivered in Oxford for over 14 years. His dedication and listening ear has gained the trust of thousands of residents in the city.\n- Passionate – David will make the changes that you want to see in your community. He knows what needs to change, and he’s happy to be at the front of these changes.\n- Inclusive – Over 60? Under 18? Don’t worry, David will support your views. He has been running workshops for teenagers and the elderly alike. His work with his school pupils has transformed lives.\n- Available – David will respond to your queries. He believes that every resident deserves a response. Not just a response, but an honest one.\n- Committed – David is committed to making positive changes in your community.\n- Clarity – It goes without saying that David believes that his residents should receive clarity. Hence the tagline Be Bold. Be Clear. Be Independent.\nIf you would like to support David during this election, you can do this in the following ways:\n- Vote David Henwood in the upcoming election.\n- Order a Garden Post – David will deliver and collect these free of charge. Contact us to get a garden post delivered to you.\n- Download Marketing Material – Visit our marketing page to download our graphics.\n- Deliver for David – Do you wish to help deliver leaflets in your neighbourhood? Read more here.\n- Sign up for the Mailing List – Sign up to the CowleyMatters mailing list to hear more about his proposed changes and how he will support your community.",
  "https_oxfordindependent_co_uk_/https_oxfordindependent_co_uk_manifesto/content_5.html": "The County Elections will be held on 1st May, there is a clear choice facing voters.\nWhy we must vote Independent in Oxford\nOver the past few years, Labour has increased pollution and congestion in the city with the delivery of their LTN scheme. Labour will create more division and hardship for residents with the introduction of bus gates, and a parking levy (£650) that will tax keyworkers like Doctors, Nurses, and teachers for parking at their place of employment. The proposed expansion of the ZEZ (Zero Emission Zone) will see further businesses shut up shop. These schemes are not Green and are not Fair.\nThe Oxford Local Plan fails to introduce any new employment sites, yet Labour wants to introduce thousands of new homes for jobs that don’t exist.\nConnectivity is key to economic growth. Oxford can grow only if it is properly connected.\nThe Alliance of Labour, the LibDems and Greens has devastated Oxford, it really is time to reverse some of these poor decisions, vote Independent.\n🚗 Vote Independent for our Transport & Connectivity:\nGood connectivity will ensure growth, and much needed housing in Oxford. Poor connectivity will threaten jobs, businesses and damage our environment.\nI will work to:\n- Improve connectivity by opposing the Labour endorsed LTN scheme, and campaign to remove the ANPR cameras\n- Campaign for new employment sites within the city to justify new housing programs ‘No Jobs, No Housing’.\n- Encourage cycling and walking infrastructure to encourage cycling and active lifestyles.\n- Oppose the Labour & LibDem bus gates, that will split and divide our city.\n- Oppose the Work Place Parking levy (WPL) that will charge keyworkers such as Doctors, nurses, teachers working on large employment\n- Support sensible school street schemes\n- Oppose the ZEZ expansion, Oxford’s air has improved under the current scheme\n🌎 Vote Independent for our Environment\nWe all need to do out bit for the environment and for our own future. A sensible deliverable approach where we all feel valued, will allow us all to participate. The Labour run council has done nothing to remove the raw sewage in our waterways, that has to change.\nI will work to:\n- Work with and encourage neigbouring authorities on a comprehensive programme of developing “green corridors of bio-diversity” within the city and beyond\n- Include a “cycling and walking score” for all new developments which also considers mobility for older residents.\n- Continue to oppose the Oxpens Bridge, and protect the Grandpoint Nature Park.\n- Introduce an award scheme for projects that improve the natural environment, and hold to account companies that pollute our waterways.\n💹 Vote Independent for our Economy\nWe need to protect our livelihoods. In Oxford the Education, IT and professional sectors are growing, but manufacturing and retail are in decline. New housing developments must be mirrored with new employment opportunities.\nI will work to:\n- Promote business clusters and start-up networks to create new jobs\n- Encourage new employment sites in the 2024 Oxford Local Plan\n- Abandon the Oxford Living Wage, as this serves as a cap with no opportunity for progression within the scheme\n- Work with local businesses and encourage a ‘business champion’ on both the city and county council\n👩⚕️ Vote Independent for our Health, Wellbeing and Education\nOur healthcare system is under great pressure, localising some forms of healthcare will help reduce that pressure. Large new developments must factor this into the planning stage.\nFor our Health, Wellbeing & Education, I will work to:\n- Campaign for localised healthcare.\n- Work with local business groups and organisers to reintroduce the Cowley Road carnival\n- Demand a proper living wage for apprentices, both in the public and private sector\n- Rated inadequate by OFSTED, I will work with the County Council to improve SEND provision including assessment turnarounds\n🏡 Vote Independent for our Housing\nOxford does have a housing need, Labour has adopted its own formula to calculate housing need at 1322, whereas neigbouring district councils and central government calculate it to be 762 units. I will support a standardised approach to calculating housing need.\nI will work to:\n- Support for sensible developments that bring added value to existing communities including Healthcare.\n- Encourage developments that can access good connectivity.\n- Encourage low carbon solutions in building and living practices.\n- Protect green spaces, and prioritise new builds on brownfield sites.\n- Campaign against developments that do not have good connectivity.",
  "https_oxfordindependent_co_uk_/https_oxfordindependent_co_uk_contact/content_4.html": "Your Local Candidate, here for you.\nWant to get in touch with David? You’ve come to the right place. Simply fill out the form below, or send David an e-mail (david [at] oxfordindependent.co.uk).\nPlease leave your name, e-mail address and message below and we’ll get in touch with you soon. If you do not have an e-mail address, please leave the field blank and put your contact telephone number in the ‘Message’ box alongside your message. For local area issues, it may be useful to put your home address (or affected address) in your message. We aim to respond to your message within 5 working days.",
  "https_oxfordindependent_co_uk_/https_oxfordindependent_co_uk/content_1.html": "CLLR DAVID HENWOOD\nIndependent Councillor for Rose Hill & Iffley\nParliamentary Candidate for Oxford East\nLeader of the Independent Oxford Alliance\nOn May 2nd 2024, David was elected your Independent councillor for Rose Hill and Iffley. The ward is home to Annelise Dodds and a former Labour stronghold.\nDavid’s work is driven by the views of his community and voters. He has a proven track record of delivering successful political motions for Oxford and surrounding areas.\nDavid is the City Council group leader of the Independent Oxford Alliance https://independentoxfordalliance.org/ He lives in Littlemore with his wife and two sons. He has served Oxford for over 13 years as both a city and parish councillor.\nLabour has ignored the views of the community, opting to work with the LibDems and Greens in the introduction of an LTN scheme that has divided our community, reduced emergency response times, penalised the less able and contributed to the rise in pollution where we live, play and learn. David opposes the scheme and the introduction of bus gates that will introduce further congestion in the city.\n“I will also oppose the county Councils parking levy for larger employers such as hospitals and schools, that will see key-workers pay an additional £600 to park their vehicle at their place of employment”.\nFor full details on regular surgeries, please visit our Surgeries page. This will list any upcoming surgeries, changes to schedules, and any content related.\nKeep a close eye on our website for updates, information and consultations from David. We regularly update this site with new information. Please get in touch today if you want to learn more.\nBe Bold. Be Clear. Be Independent.\nMy Views on Palestine\nAny sovereign nation has the right to defend itself, however, what we are seeing in Gaza is a military invasion kin to ethnic cleansing. The International community has been far too late in demanding an immediate ceasefire, and a withdrawal from Gaza.\nWhat is happening Gaza today, isn’t a pathway to peace or reconciliation. The British government should seek an immediate UN resolution to introduce UN peacekeepers and aid workers to protect the civilian population of Gaza.\nWe must accept Britain has been part of the problem, and that future aid packages pending Palestinian approval should also include British engineers to help build the infrastructure that Gaza needs.",
  "https_oxfordindependent_co_uk_/https_oxfordindependent_co_uk_low-traffic-neighbourhoods/content_6.html": "David Henwood has been continuously campaigning for the residents of Cowley’s views to have the LTNs (Low Traffic Neighbourhood) systems removed.\nWith the backing of over 3000 residents to date (February 2022), David continues to fight for the removal of LTNs and ANPR cameras in the area.\nAir Quality Monitors have also proven that the system is ineffective in reducing carbon emissions.\nSee and Sign David’s Petition to the council here.\nHolding the council to account\n- The official Council LTN consultation returned a decisive majority against the LTNs – over 73% objected or had concerns – as an Independent I am the only candidate that will campaign for the Labour & Lib Dem run Councils to respect the democratic results of the consultation.\n- As confirmed by the official LTN Council report, the LTNs have increased congestion, pollution & journey lengths due to mass traffic displacement – they are neither green or fair.\n- Demand local consultation over any alternative future proposals using local creativity and listening to all residents.\nPress Coverage\nPetition to remove Cowley LTNs receives over 2000 signatures\nCalls for review into road blocks after ambulance delayed getting to emergency\n- Oxford LTNs ‘poisoning the local community’ says Cowley campaigner who has rallied 3,000 against traffic scheme\n- U-turn over Oxford’s Low Traffic Neighbourhood plans after public backlash"
}