{
  "https_www_marietidball_com_/https_www_marietidball_com_privacy-notice_html/content_3.html": "Privacy Notice - Marie Tidball\nI am the MP for Penistone and Stocksbridge. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf and ask for views on local issues.\nAs a Labour MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy for details of what information they hold, why, and how they use and process that information.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nData collection and use\nThe office of Marie Tidball MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do so where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary in order to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, e-mail, phone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send e-mails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe option I provide in all communications.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the MP for Penistone and Stocksbridge, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary to resolve or otherwise complete your request, although I may retain a minimum amount of information about closed cases in the event that you contact me again for help.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for Penistone and Stocksbridge, or until you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nYour rights\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n• Obtain copies of the personal information I hold about you (known as a “subject access request”)\n• Request that I correct or update any personal information held about you\n• Ask that we erase or restrict the way in which I use your information\n• Request that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications from me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my Data Protection Officer:\nData Protection Officer, Office of Marie Tidball MP, House of Commons, London, SW1A 0AA\nmarie.tidball.mp@parliament.uk\nAlternatively, you have the right to complain to the Information Commissioner’s Office (the “ICO”) if you are not satisfied with the way I use your information. You can contact the ICO by writing to: Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, Cheshire SK9 5AF.",
  "https_www_marietidball_com_/https_www_marietidball_com_news_anotherthing/content_8.html": "Home\nNews\nGet in touch >\nNewsletter\nToggle menu\nanotherthing\nApril 21, 2025\nsomewherehere",
  "https_www_marietidball_com_/https_www_marietidball_com_news_anotherthing3/content_9.html": "Home\nNews\nGet in touch >\nNewsletter\nToggle menu\nanotherthing\nApril 21, 2025\nsomewherehere",
  "https_www_marietidball_com_/https_www_marietidball_com/content_1.html": "If you live in the Penistone and Stocksbridge area and have an issue you care about or a problem that needs addressing, please let Marie and her team know.",
  "https_www_marietidball_com_/https_www_marietidball_com_category_steel/content_7.html": "Home\nNews\nGet in touch >\nNewsletter\nToggle menu\nNews\nAll\nSomethingHere\nApril 21, 2025\n•\nsteel\nGovernment unveils more details on attacks inquiry\nApril 21, 2025\n•\nsteel\nanotherthing\nApril 21, 2025\n•\nsteel\nanotherthing\nApril 21, 2025\n•\nsteel\nbackpacks\nApril 19, 2025\n•\nsteel\n1",
  "https_www_marietidball_com_/https_www_marietidball_com_news/content_2.html": "Home\nNews\nGet in touch >\nNewsletter\nToggle menu\nNews\nAll\nSomethingHere\nApril 21, 2025\n•\nsteel\nGovernment unveils more details on attacks inquiry\nApril 21, 2025\n•\nsteel\nanotherthing\nApril 21, 2025\n•\nsteel\nanotherthing\nApril 21, 2025\n•\nsteel\nbackpacks\nApril 19, 2025\n•\nsteel\n1",
  "https_www_marietidball_com_/https_www_marietidball_com_news_attacks_inquiry/content_5.html": "More details on the judge-led public inquiry into the Nottingham attacks - which saw three people stabbed to death - have been announced in Parliament.\nBarnaby Webber, Grace O'Malley-Kumar and Ian Coates were killed by Valdo Calocane in the city on 13 June 2023.\nThe deaths have prompted widespread criticism from the victims' families over how authorities handled the case.\nOn Tuesday, Justice Secretary Shabana Mahmood said the inquiry would be chaired by Her Honour Deborah Taylor.\nShe said the statutory inquiry \"will have the power to compel witnesses\" and \"must be thorough in its assessment of the facts\".\nShe added the full terms of reference would be placed in the libraries of both Houses \"at the earliest opportunity\".\nCalocane, who had been diagnosed with paranoid schizophrenia before the attacks, was sentenced to a hospital order in January 2024 after admitting three counts of manslaughter on the grounds of diminished responsibility and three counts of attempted murder.\nAt the time, Mr Webber's mother Emma said \"true justice has not been served\".",
  "https_www_marietidball_com_/https_www_marietidball_com_news_pope/content_4.html": "Who will be the next pope? The decision could have a profound impact on the Catholic Church and the world's 1.4 billion baptised Roman Catholics.\nIt also promises to be a highly unpredictable and open process for a host of reasons.\nThe College of Cardinals will meet in conclave in the Sistine Chapel to debate and then vote for their preferred candidates until a single name prevails.\nWith 80% of the cardinals appointed by Pope Francis himself, they are not only electing a pope for the first time, but will offer a broad global perspective.\nFor the first time in history, fewer than half of those given a vote will be European.\nAnd although the college may be dominated by his appointments, they were not exclusively \"progressive\" or \"traditionalist\".\nFor those reasons, it is harder than ever to predict who will be elected the next Pope.\nCould the cardinals elect an African or an Asian Pope, or might they favour one of the old hands of the Vatican administration?\nHere is a selection of names being mentioned as Francis's potential successor, and we expect more to emerge in the coming days.\nPietro Parolin\nNationality: Italian",
  "https_www_marietidball_com_/https_www_marietidball_com_news_anotherthing1212/content_6.html": "Home\nNews\nGet in touch >\nNewsletter\nToggle menu\nbackpacks\nApril 19, 2025\nsomewherehere"
}