{
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_contact/content_14.html": "Skip to main content\nMain navigation\nHome\nAbout Julie\nQ&A\nNews\nContact\nForgotten estates\nSurveys\nContact\nLeave this field blank\n[email protected]\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by Julie Redmond on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_cookies/content_8.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk/content_1.html": "In Conversation with Save Our Edgware Campaign 24th April 2024 In Edgware, 25 tower blocks are being proposed for redevelopment. This large-scale construction lasting 10 years will impact the local infrastructure of Edgware... Local News Residents not consulted about road restrictions in Barnet 18th April 2024 This week, I have been speaking to the residents living around the Hocroft area (NW2) in Barnet. They are upset and annoyed at the new restriction to... Local News ☘️ Julie Redmond celebrates St Patrick's Day at the London Irish Centre with Susan Hall and Don Williams 19th March 2024 Celebrating St Patrick's Day in The London Irish Centre, Camden Square today was very important to me. Remembering my Irish dancing skills, listening to the... Local News Leave this field blank Stay informed on the latest news. Your email First name Last name Postcode Address ID Address 1\nIn Conversation with Save Our Edgware Campaign 24th April 2024 In Edgware, 25 tower blocks are being proposed for redevelopment. This large-scale construction lasting 10 years will impact the local infrastructure of Edgware... Local News\nResidents not consulted about road restrictions in Barnet 18th April 2024 This week, I have been speaking to the residents living around the Hocroft area (NW2) in Barnet. They are upset and annoyed at the new restriction to... Local News\n☘️ Julie Redmond celebrates St Patrick's Day at the London Irish Centre with Susan Hall and Don Williams 19th March 2024 Celebrating St Patrick's Day in The London Irish Centre, Camden Square today was very important to me. Remembering my Irish dancing skills, listening to the... Local News",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_category_Articles/content_20.html": "Julie Redmond Supported by Home Secretary James Cleverly, London Mayoral Candidate Susan Hall and Nickie Aiken MP 1st February 2024 Thursday 1st February, Julie Redmond was supported by the Home Secretary James Cleverly, London Mayoral Candidate Susan Hall and Nickie Aiken MP at CCHQ. The... Articles",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_accessibility/content_16.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_julie-redmond-celebrates-st-patricks-day-london-irish-centre-susan-hall-and-don-williams/content_4.html": "Celebrating St Patrick's Day in The London Irish Centre, Camden Square today was very important to me. Remembering my Irish dancing skills, listening to the bodhran and watching pints of Guinness being pulled. People are surprised when they hear I’m Irish and Conservative. My father’s family were originally English and Protestant, and my mother’s family was Irish and Catholic. I grew up in Southern Ireland during the troubles. Narrowly missing an explosion and injury on the way back from a holiday in Newry was a memorable but normal part of life at the time.\nI don’t like to be stereotyped. The Irish identity has historically been defined by anti-establishment and anti-British sentiment. However, I live in the here and now and recognise the complex relationship between the individual and the state that sat at the heart of many of Ireland's issues in the past.\nMy Conservatism is rooted in my Irish identity and my upbringing. It is where my independent spirit and willingness to challenge comes from. I am firmly committed to personal liberty and avoiding undue interference from the state. This desire for freedom is what led me to London in the first place.\nMy mother's family had been farmers. However, when I was growing up all that was left was a butcher's shop and petrol station. From these small businesses, I learned the power of hard work and free enterprise to drive prosperity and expand opportunities. They allowed my family to give me the best upbringing they could and inspired me to move on and start to shape my future.\nI love the diversity of my adopted city of London, but I firmly believe in the preservation of its cultural heritage and national identity. I value all perspectives and differences, but we need to set a baseline by which our culture is defined and then work hard for the harmonious integration of other perspectives within it. Change should be incremental, rather than radical. Progress is best achieved through organic evolution rather than abrupt upheaval. We need stability and continuity to protect our institutions and traditions from the unforeseen consequences of hasty reforms.\nIf you value something you have to be prepared to defend it, so I am a strong believer in national security and an assertive foreign policy to protect our country's interests. The war in Ukraine and the conflict between Gaza and Israel have shown how fragile peace is and how sometimes people must take action to protect it. Again, this is part of the story of Ireland that shaped me. On a domestic level, this translates into a deep belief in law and order to protect our communities and the businesses that trade and the people that live in them.\nHappy St Patrick's Day!",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_julie-redmond-visits-kays-kosher-supermarket-after-anti-semitic-attack/content_21.html": "On Monday 29th January, the staff and shoppers at Kay’s kosher supermarket in Golders Green were threatened by a man with a kitchen knife. This deliberate and anti-semitic attack was bravely de-escalated by the quick actions of staff members such as Bruno Teixeira, a Portuguese father-of-one, shopkeeper Evyatar Reitman, and Breno Camargo a 22 year old.\nAccording to Reitman, the attacker first approached the shop and demanded to know their position on Israel and Palestine. The attacker with his knife then attempted to attack those in the shop. The suspect was arrested by the Metropolitan police shortly after.\nI was privileged to meet the incredibly brave individuals who work at Kay's Kosher supermarket on Hamilton Road, who responded quickly to the incident last week. A huge thank you for taking the time to talk to me.\nIt is vital that authorities thoroughly investigate this act of hate and take measures to ensure the safety and well-being of everyone affected. Anti-semitism is unacceptable.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_category_Local-News/content_15.html": "In Conversation with Save Our Edgware Campaign 24th April 2024 In Edgware, 25 tower blocks are being proposed for redevelopment. This large-scale construction lasting 10 years will impact the local infrastructure of Edgware... Local News\nResidents not consulted about road restrictions in Barnet 18th April 2024 This week, I have been speaking to the residents living around the Hocroft area (NW2) in Barnet. They are upset and annoyed at the new restriction to... Local News\n☘️ Julie Redmond celebrates St Patrick's Day at the London Irish Centre with Susan Hall and Don Williams 19th March 2024 Celebrating St Patrick's Day in The London Irish Centre, Camden Square today was very important to me. Remembering my Irish dancing skills, listening to the... Local News\nJoin my campaign to save Edgware Birth Centre, Burnt Oak 18th March 2024 Hello I am Julie Redmond, the GLA candidate for Barnet and Camden. Recently, I discovered that the Edgware Birth Centre is under threat of closure. The... Local News\nMeet Julie Redmond 16th March 2024 Julie Redmond is your GLA candidate for Barnet and Camden! Like countless immigrants before me, I came to London 20 years ago seeking opportunity, excitement... Local News\nJoin Julie Redmond and Susan Hall in Camden to Celebrate St Patrick's Day 15th March 2024 Join Julie Redmond and Susan Hall in Camden this Sunday 17th at the Irish Centre in Camden. Starts at 2:15 PM. Local News\nJulie Redmond Against Camden Council's Proposed New Licensing Policy 6th March 2024 Speaking to residents in Primrose Hill, Camden Town Holborn and Bloomsbury about Camden council's new night time strategy. Residents are not happy. The view of... Local News\nJulie Redmond Visits Streets Kitchen at St Michael'S Church, Camden 22nd February 2024 It was great to finally meet the people who make Streets Kitchen happen at St Michael's Church in Camden this evening. Really interesting to hear future plans... Local News\nJulie Redmond Visits Kay's Kosher Supermarket After Anti-Semitic Attack 8th February 2024 On Monday 29th January, the staff and shoppers at Kay’s kosher supermarket in Golders Green were threatened by a man with a kitchen knife. This deliberate and... Local News",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_surveys/content_5.html": "Tweet I am keen to find out what your thoughts on various local issues in Barnet and Camden are, so that I can raise awareness to them.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_filter_tips/content_22.html": "Compose tips\nText Formats\nFiltered HTML\nAllowed HTML tags: <br> <p> <h2 class=\"heading-light-blue heading-light-blue-bg\" id> <h3 id> <cite> <dl> <dt> <dd> <a hreflang href class target=\"_blank\" id data-entity-type data-entity-uuid data-entity-substitution> <blockquote cite> <ul type class> <ol type start> <fn value text> <strong> <em> <u> <code> <li class> <img src alt height width data-entity-uuid data-entity-type> <span class> <footnotes-placeholder> <footnotes data-text data-value>\nThis site allows HTML content. While learning all of HTML may feel intimidating, learning how to use a very small number of the most basic HTML \"tags\" is very easy. This table provides examples for each tag that is enabled on this site.\nFor more information see the HTML Living Standard or use your favorite search engine to find other sites that explain HTML.\nTag Description You Type You Get By default line break tags are automatically added, so use this tag to add additional ones. Use of this tag is different because it is not used with an open/close pair like all the others. Use the extra \" /\" inside the tag to maintain XHTML 1.0 compatibility Text with <br />line break\nText with\nline breakBy default paragraph tags are automatically added, so use this tag to add additional ones. <p>Paragraph one.</p> <p>Paragraph two.</p>\nParagraph one.\nParagraph two.\nHeading <h2>Subtitle</h2>\nSubtitle\nHeading <h3>Subtitle three</h3>\nSubtitle three\nCited <cite>Cited</cite>\nCited Definition lists are similar to other HTML lists. <dl> begins the definition list, <dt> begins the definition term and <dd> begins the definition description. <dl> <dt>First term</dt> <dd>First definition</dd> <dt>Second term</dt> <dd>Second definition</dd> </dl>\n- First term\n- First definition\n- Second term\n- Second definition\nNo help provided for tag dt. No help provided for tag dd. Anchors are used to make links to other pages. <a href=\"https://www.julieredmond.uk\">Julie Redmond</a>\nJulie Redmond Block quoted <blockquote>Block quoted</blockquote>\nBlock quoted\nUnordered list - use the <li> to begin each list item <ul> <li>First item</li> <li>Second item</li> </ul>\n- First item\n- Second item\nOrdered list - use the <li> to begin each list item <ol> <li>First item</li> <li>Second item</li> </ol>\n- First item\n- Second item\nNo help provided for tag fn. Strong <strong>Strong</strong>\nStrong Emphasized <em>Emphasized</em>\nEmphasized Underlined <u>Underlined</u>\nUnderlined Coded text used to show programming source code <code>Coded</code>\nCoded\nNo help provided for tag li. No help provided for tag img. No help provided for tag span. No help provided for tag footnotes. No help provided for tag footnotes. Most unusual characters can be directly entered without any problems.\nIf you do encounter problems, try using HTML character entities. A common example looks like & for an ampersand & character. For a full list of entities see HTML's entities page. Some of the available characters include:\nCharacter Description You Type You Get Ampersand &\n& Greater than >\n> Less than <\n< Quotation mark \"\n\" - Web page addresses and email addresses turn into links automatically.\n- Lazy-loading is enabled for both <img> and <iframe> tags. If you want certain elements skip lazy-loading, add\nno-lazy\nclass name.\nFootnote\nAllowed HTML tags: <br> <p> <strong> <em> <u> <s> <sub> <sup> <a href>\n- Web page addresses and email addresses turn into links automatically.\nPlain text\n- No HTML tags allowed.\n- Lines and paragraphs are automatically recognized. The <br /> line break, <p> paragraph and </p> close paragraph tags are inserted automatically. If paragraphs are not recognized simply add a couple of blank lines.\n- Web page addresses and email addresses turn into links automatically.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_crime-survey-barnet-and-camden/content_13.html": "As we embark on a new year, let us hope that it will be filled with great possibilities for our community. However, as the year begins, we are confronted with the latest crime statistics, which indicate a troubling rise. During our conversations with shop owners on our High Street, they said they are experiencing daily burglaries and residents are beginning to feel less secure.\nIn light of these alarming circumstances, it is imperative that we come together to address crime in our community. If you can tell us quickly about your views on crime in Barnet and Camden we would be very grateful.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_julie-redmond-against-camden-councils-proposed-new-licensing-policy/content_23.html": "Speaking to residents in Primrose Hill, Camden Town Holborn and Bloomsbury about Camden council's new night time strategy.\nResidents are not happy. The view of the residents’ groups is that the changes proposed in Camden’s draft Statement of Licensing Policy would just allow venues to earn more money from the longer hours for sales of alcohol — adding to crime, disorder and noise nuisance.\nLike Westminster, Camden is in the process of promoting a new evening and night-time strategy, on the basis that the existing licensing policy is “not flexible enough.”\nHowever Camden’s idea of increased flexibility seems to have been mainly concentrated on extending liquor licence times and has come somewhat unstuck as a result. Fitzrovia News reported that Camden Council was forced to halt proposals for major changes to its Statement of Licensing Policy last month after receiving objections from the police, a housing association, and residents’ groups across the borough.\nThe updated policy would have extended the core hours (i.e. the default basis hours an establishment is permitted to serve alcohol) by between 30 mins and 2 hours (see table above). It was feared this would have led to longer opening hours generally and made it easier to get new licences in areas that are already saturated with them. The report on this policy was due to get approval to go out to consultation in February, but due to the weight of objections, it has been withdrawn for further consideration.\nIn letters published in the Camden New Journal, a coalition of resident groups said the policy change revealed “conflicts of interest of councillors who have built their political identities around promoting Camden’s night-time economy”.\n“Camden councillors are increasingly favouring commercial interests and later hours for alcohol consumption at the expense of the health and well-being of its resident population. This new licensing policy shows contempt for the residents of Camden and the communities we have built here.”",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_events_feed/content_24.html": null,
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_julie-redmond-visits-streets-kitchen-st-michaels-church-camden/content_27.html": "It was great to finally meet the people who make Streets Kitchen happen at St Michael's Church in Camden this evening. Really interesting to hear future plans and next steps to grow volunteering for the charity and how we can make the most impact.\nStreets Kitchen is a UK and Ireland grassroots group working to help the homeless community, providing daily outreaches with food, clothing and information that benefits our streets. I am looking forward to helping and using my skills.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_qa/content_11.html": "Julie answers key questions here!\n-\nCan you share a specific moment or experience that fuelled your passion for community involvement and public service?\nThere are numerous things which generated my interest in public service. However, the most important is probably my experience working as a public health nurse during Covid-19 pandemic, this brought me into close contact with the breadth of the community in our city and made me realise how little was being done to support normal Londoners living their day-to-day lives. I promised myself that something good would come from this experience and that promise has lead me here.\n-\nHow do you propose balancing the need for cleaner air with the concerns of residents and businesses affected by traffic measures?\nWe just need to face facts; the current solutions are not working but until we have more reliable EV charging infrastructure for electric vehicles we cannot keep pace with future plans, charging infrastructure should be a priority. We should also be reducing congestion so I will put far more investment into smart traffic management systems to ease flow periods and impose stricter controls on lane closures from construction to assist in the short-term while infrastructure catches up. I will champion the development of cycling infrastructure but in the right places and revisit the cycle lanes that are unfortunately impacting businesses and that can also limit accessibility for people with disabilities. I want to revisit the data for 20mph roads on main roads and dual carriageways. Pedestrian safety is a priority but London is grinding to a halt. We need to get London moving again!\n-\nAs a prospective London Assembly member, how do you plan to increase awareness among constituents about the role of the London Assembly and your responsibilities?\nI want to supercharge the GLA and encourage a greater pride in our city! For too long local government has been the preserve for the old and retired and while I am deeply grateful for their hard work and commitment, London deserves representation from a broader demographic. The GLA is a fundamentally misunderstood body and there needs to be much more awareness about it and its critical role in managing London. I would urge GLA members to work together, I hate the infighting and party politics, only then it will be possible to achieve a measure of consensus which will allow us to properly represent our amazing city.\n-\nHow do you see the role of local authorities and community engagement in tackling complex issues like drug addiction, crime, and homelessness?\nI have been working on crime-busting initiatives and outreach programmes and homelessness solutions. However, you use the right word when you say \"complex\", the interrelationship between societal problems reaches well beyond the public arena and deep into people’s private lives, families and backgrounds – the best the public sector can do is to try to join the dots between the various organisations and authorities that are trying to manage the problem to make sure the chances of people slipping through the net are reduced. However, to drive real change is going to take a lot more than simply public sector intervention, we need to protect our families, reinforce their values and get better at looking after our children, if we are to stop sowing the seeds of these ultimately destructive behaviours early on.\n-\nYou've been involved in community work and have highlighted concerns in Regents Park estates. What specific changes or improvements would you prioritise for these areas?\nThe Regents Park estates need investment as well as many other areas in Barnet and Camden. We all know local government has a limited budget but such is the pressing need I would be diverting cash from the GLA's sustainability initiatives to urgently improve the quality of housing and increase security and physical policing to control antisocial behaviour and crime too. Many Londoners live in fear trapped in their homes which is simultaneously damaging their health and until we see some of these basic human needs addressed, I am afraid the more lofty ambitions will need to take second place.\n-\nOutside of your political and professional life, what are your personal passions or hobbies?\nIn truth my political and charity work is all consuming and my work-life balance is pretty poor. When I do get a moment, I spend it with my son and husband. However, I enjoy going to Barry’s Bootcamp at Euston station, the physical activity stimulates many brain chemicals that make me happier and more relaxed. I also love visiting art exhibitions in places like Camden Art Centre and the theatre especially KILN theatre in Kilburn with friends.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_join-my-campaign-save-edgware-birth-centre-burnt-oak/content_25.html": "Hello I am Julie Redmond, the GLA candidate for Barnet and Camden. Recently, I discovered that the Edgware Birth Centre is under threat of closure. The consultation closed yesterday, but we still have time to stop the closure of the Birth Centre. We are also campaigning to stop the maternity service closures at the Royal Free in Hampstead and Whittington Hospital in Archway.\nFill in the form below:\nhttps://forms.gle/7iFmEKXP9JPjr7hBA",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_meet-julie-redmond/content_9.html": "Julie Redmond is your GLA candidate for Barnet and Camden!\nLike countless immigrants before me, I came to London 20 years ago seeking opportunity, excitement, and new experiences. I had trained as a A&E nurse in my native Ireland and continued my work here in a number of London hospitals and clinics including The Royal Free, Highgate Private and clinics on Haverstock Hill, Hampstead High Street, Finchley Road and Golders Green. When I was ready to settle down, I got married and I am now raising a family here.\nCommunities like Barnet and Camden are the reason I am in London. I love their rich history and fresh modernity. Their still, quiet, places and their noisy, vibrant ones. Their established communities and the welcome they extend to newcomers.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_feed/content_17.html": null,
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_julie-redmond-supported-home-secretary-james-cleverly-london-mayoral-candidate-susan-hall-and/content_26.html": "Thursday 1st February, Julie Redmond was supported by the Home Secretary James Cleverly, London Mayoral Candidate Susan Hall and Nickie Aiken MP at CCHQ. The room was filled with people there to support Julie's campaign to be elected to the London Assembly for Barnet and Camden.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_about-julie-redmond/content_3.html": "Like countless immigrants before me I came to London 20 years ago seeking opportunity, excitement, and new experiences. I had trained as a A&E nurse in my native Ireland and continued my work here in a number of London hospitals and clinics. When I was ready to settle down, I got married and I am now raising a family here. My husband grew up near Barking and my father in law worked in Barking since 1963 for Ilford Films.\nCommunities like Barking are the reason I am in London. I love their rich history and fresh modernity. Their still, quiet, places and their noisy, vibrant ones. Their established communities and the welcome they extend to newcomers.\nHowever, I am also aware of the complex and evolving challenges that all London residents are facing. Over the last twenty years, I have seen London change. I have seen its communities become more divided and I have seen its streets become dirtier and more dangerous. I have seen its schools and hospitals paralysed by strikes and its streets blocked by aspirational but impractical traffic measures. Following recent revelations of institutionalised racism, misogyny and homophobia, the Metropolitan Police is going to need to work hard to rebuild public trust. However, more worrying to me is the fact that 126 London Police Stations closed between 2010 and 2022. Is it any wonder our streets, parks and public spaces feel so unsafe and that those that commit crime feel so unchallenged.\nEventually I had seen enough. I decided that I had to use my skills and experience to give something back to the city that had welcomed me. I started to play an active part in the community and became a Council Health Champion and that led me to volunteer when the Covid-19 vaccine programme was rolled out. That experience profoundly changed me. I met countless ordinary Londoners and heard first hand how hard the lives of many had become. I saw how isolated older people felt living in communities where fear had replaced connection. I saw the challenges facing the ill and disabled in getting around London and accessing basic medical support. I saw poverty and need. These issues were everywhere and whilst the pandemic sharpened our focus on them, I knew they would remain long after the vaccines had been administered. I stood as a London Assembly candidate and I saw further poverty and deprivation when visiting people in their homes even in the centre of our great city. All of that has led me here. I am here because there is no other place, I think I should be.\nI am motivated by a deep sense of responsibility, passion, and dedication to serve the people of London. London is an amazing city and Barking is an amazing borough within it. However, this is not represented in the quality of life and availability of opportunity for many of the people that live and work here. This needs to change and I want to help make that change happen. I hope to unite the experiences and voices of all who were born here or have chosen to make it their home and drive impactful change in how Barking is run.\nFrom affordable housing, ULEZ and transportation to environmental sustainability and social equality, there are critical issues that require urgent attention. I am committed to working diligently with Barking residents to develop and implement policies that tackle these issues head-on. After my recent visits to St Margaret's Barking The Abbey Church and spoke to the Reverend Mark about Homelessness and the need for Foodbanks, visiting Hope Children's contact centre ,my meetings with the Met police and the NHS mental health support teams, listening to the frustration felt by resident groups over, CPZs, violent crimes and increase massing and site density of developments, I am only too aware that there really is a lot to do.\nIf ultimately, I am elected, I will take every opportunity to listen to residents and community organisations. I will work with them to create policies and implement initiatives that will uplift and empower the people of Barking and help deliver a happier, healthier, safer and fairer future for all.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_conversation-save-our-edgware-campaign/content_10.html": "In Edgware, 25 tower blocks are being proposed for redevelopment. This large-scale construction lasting 10 years will impact the local infrastructure of Edgware immensely.\nThousands of Edgware residents oppose this monstrous redevelopment plan for a number of reasons. The 25 tower blocks will make Edgware one of the highest density developments in the UK. There will be even greater pressure on the local GP services, local schools and with half of the blocks being 20 storeys or more - loss of light as well. Broadwalk shopping centre will also be demolished.\nAs your London Assembly candidate for Barnet and Camden, if elected, I will do everything that I can to oppose this overdevelopment. I have already spoken to many residents, as well as the representatives from the Save our Edgware campaign group. Recently, I answered some questions Save our Edgware proposed to candidates, and you can read my responses below or on the original website:\nQuestion 1: Please could you let us know your thoughts on the proposed TFL and Ballymore joint venture to develop Edgware Bus Garage, Edgware Bus Station and the Broadwalk Shopping Centre?\nAnswer: This development first came to my attention last year, when I visited The Broadwalk Centre with MP Matthew Offord and Conservative Edgware councillors on the 21st July and did a walkaround and spoke to residents and businesses. I was shocked to see the size and scale of this proposal and could see the future impact it would have on the residents living and working in Edgware. I was very concerned and worried.\nQuestion 2: What kind and scale of development do you think is appropriate for central Edgware?\nAnswer: One which fits in with the height of the existing buildings and that respects the architecture and the surrounding history and structures. A development that has thought about in detail how it will impact the daily lives of Edgware residents.\nQuestion 3: How would you support and represent the residents of Edgware if the majority object to the density and design of the development and the change of character and function of their town?\nAnswer: Edgware has a long proud history. The town centre is popular, busy, diverse and provides extensive shopping, cafés and restaurants and services for communities living in Edgware but also from further afield. I remember my first tour of Edgware visiting St Margarets church and Days Almes Houses, Stonegrove and observing a thriving and proud close-knit community. I would support the residents in their fight to reduce the size and scale of this development and ensure the developers, TFL and council had the Edgware residents’ best interests at heart and had frequent meetings with residents to discuss every stage of this development.\nQuestion 4: No details have been provided so far about how the present covered bus station will be replaced, how it will look or where precisely it will be located or how the bus service will function. We understand that some information will be provided when the outline planning application is made, but full details will only be provided at a later stage. What do you suggest would be appropriate for residents and passengers in terms of consultation and information provided in advance of the outline planning application?\nAnswer: I feel a meeting should take place with the developers, TFL and the community. Residents will have an opportunity to voice their thoughts, opinions, concerns and ideas. Continued communication is key and the developers and TFL must listen to residents.\nQuestion 5: Do you believe the development should even be given outline planning permission without?\n- There being existing and full fire safety protocols and regulations for an integral and core part of the development and the full approval of the London Fire Brigade. (In Edgware’s case, we are referring to the proposed underground electric bus garage, which at present London Fire Brigade have deemed as being not viable).\n- Clear and comprehensive information about how the present bus station will be replaced.\nAnswer: There should be full fire safety protocols. As a former A&E nurse who has worked with the Fire Brigade and looked after victims of fires, this is mandatory. As a London Assembly candidate working closely with LFB this is mandatory.\nResidents need to understand how the present bus station will be replaced before permission is granted.\nQuestion 6: Barnet’s Draft Local Plan (reg 19) permits the building of 2,317 housing units on ‘site 28’. Site 28 includes:\n- Edgware Station, platforms, railway tracks & sidings\n- Deans Brook, A grade II listed nature conservation area\n- The existing bus station and bus garage.\nThe area that is available for actual building development is 2.621 hectares. Site 28 would become one of the densest populated areas in the UK. Do you feel that the high density and the scale of proposed buildings would be in line with Edgware’s character and appropriate for the area?\nAnswer: Absolutely not.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_about-rss/content_6.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_cdn-cgi_l_email-protection/content_18.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_join-julie-redmond-and-susan-hall-camden-celebrate-st-patricks-day/content_19.html": "Tweet Friday, 15 March, 2024 Local News Join Julie Redmond and Susan Hall in Camden this Sunday 17th at the Irish Centre in Camden. Starts at 2:15 PM.\nIn Conversation with Save Our Edgware Campaign Wednesday, 24 April, 2024 In Edgware, 25 tower blocks are being proposed for redevelopment.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_privacy/content_2.html": "This document outlines how Julie Redmond processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Julie Redmond\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Julie Redmond.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Julie Redmond, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Julie Redmond via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news_residents-not-consulted-about-road-restrictions-barnet/content_12.html": "This week, I have been speaking to the residents living around the Hocroft area (NW2) in Barnet. They are upset and annoyed at the new restriction to Dershingham road (NW2). Monday to Friday from 8:15 - 9:15 am and 3 - 4 pm the street is a pedestrian and cycle zone.\nThis change has been made without any prior consultation or notice to the residents in the surroundings areas.\nOne resident, Danielle K said:\n'Unfortunately, the positioning and visibility of these signs are inadequate. Some residents were completely unaware of the presence of these signs until recently. Many people are anticipating fines. It has become apparent that Hocroft residents were not informed or consulted when changes were taking place to local infrastructure. Residents should be informed, and the absence of consultation for this critical decision is deeply concerning for me. The road closures is the potential for increased traffic and congestion in nearby areas specifically on Farm Avenue and Cricklewood Lane. These areas are already heavily burdened with traffic especially during rush hour, and the introduction of restricted roads may exacbrate this situation even further. For instance, with parents dropping children at the local school now forced to park in areas further away.'\nI want to know why Barnet and Camden council have not been consulting residents when making huge changes to the local infrastructure.\nSimilar uproar has been felt in other parts of Barnet and Camden. I have received numerous emails from countless residents who wanted to challenge the restriction to streets around St Luke’s Church of England School and St Margaret’s School in Frognal.",
  "https_www_julieredmond_uk_/https_www_julieredmond_uk_news/content_7.html": "In Conversation with Save Our Edgware Campaign Wednesday, 24 April, 2024 In Edgware, 25 tower blocks are being proposed for redevelopment. This large-scale construction lasting 10 years will impact the local infrastructure of Edgware immensely. Thousands of Edgware residents oppose this monstrous redevelopment plan for a number of reasons. The 25 tower blocks will make Edgware one of the highest density developments in the UK. There will be even greater pressure on the... Local News\nResidents not consulted about road restrictions in Barnet 18th April 2024 This week, I have been speaking to the residents living around the Hocroft area (NW2) in Barnet. They are upset and annoyed at the new restriction to... Local News\n☘️ Julie Redmond celebrates St Patrick's Day at the London Irish Centre with Susan Hall and Don Williams 19th March 2024 Celebrating St Patrick's Day in The London Irish Centre, Camden Square today was very important to me. Remembering my Irish dancing skills, listening to the... Local News\nJoin my campaign to save Edgware Birth Centre, Burnt Oak 18th March 2024 Hello I am Julie Redmond, the GLA candidate for Barnet and Camden. Recently, I discovered that the Edgware Birth Centre is under threat of closure. The... Local News\nMeet Julie Redmond 16th March 2024 Julie Redmond is your GLA candidate for Barnet and Camden! Like countless immigrants before me, I came to London 20 years ago seeking opportunity, excitement... Local News\nJoin Julie Redmond and Susan Hall in Camden to Celebrate St Patrick's Day 15th March 2024 Join Julie Redmond and Susan Hall in Camden this Sunday 17th at the Irish Centre in Camden. Starts at 2:15 PM. Local News\nJulie Redmond Against Camden Council's Proposed New Licensing Policy 6th March 2024 Speaking to residents in Primrose Hill, Camden Town Holborn and Bloomsbury about Camden council's new night time strategy. Residents are not happy. The view of... Local News\nJulie Redmond Visits Streets Kitchen at St Michael'S Church, Camden 22nd February 2024 It was great to finally meet the people who make Streets Kitchen happen at St Michael's Church in Camden this evening. Really interesting to hear future plans... Local News\nJulie Redmond Visits Kay's Kosher Supermarket After Anti-Semitic Attack 8th February 2024 On Monday 29th January, the staff and shoppers at Kay’s kosher supermarket in Golders Green were threatened by a man with a kitchen knife. This deliberate and... Local News\nJulie Redmond Supported by Home Secretary James Cleverly, London Mayoral Candidate Susan Hall and Nickie Aiken MP 1st February 2024 Thursday 1st February, Julie Redmond was supported by the Home Secretary James Cleverly, London Mayoral Candidate Susan Hall and Nickie Aiken MP at CCHQ. The... Articles"
}