{
  "https_www_brandongorman_co_uk_/https_www_brandongorman_co_uk/content_1.html": "top of page\nBRANDON GORMAN\nPromoting Change to better Caerphilly.\nABOUT ME\nThanks for stopping by, I'm Brandon. Just like many of you I'm a Caerphilly native. I was born at the then Caerphilly District and Miners Hospital to a working class family. My father a labourer turned college teacher and mother, a care assistant working at a local care home.\nI attended my local community school St Cenydd and currently work for the NHS.\nLET’S CONNECT\nbottom of page",
  "https_www_brandongorman_co_uk_/https_www_brandongorman_co_uk_blank-2/content_3.html": "top of page\nBRANDON GORMAN\nHome\nAbout\nContact\nMore\nUse tab to navigate through the menu items.\nLET’S CONNECT\nName\nEmail\nSubject\nMessage\nSubmit\nThanks for submitting!\nbottom of page",
  "https_www_brandongorman_co_uk_/https_www_brandongorman_co_uk_blank-1/content_2.html": "I grew up watching my parents work hard for our family and serve our local community with dedication. My dad a college teacher and my mum a care assistant at the local care home. I want to make that same difference to people as their local representative.\nI have been fortunate to enjoy a successful career so far. I work for the NHS providing business analysis and clinical application support.\nI attended my local community school, St Cenydd. I was lucky to be taken on as an apprentice and studied at the University of Wales Trinity Saint David. That experience changed my life and as a result I am passionate about ensuring everybody has access to a great education, and most importantly have access to quality apprenticeships. I have been on the school council when a pupil, and a member of the schools Eco Club.\nIn 2022 I stood as a candidate in the Caerphilly Council elections in my local ward of Penyrheol.\nABOUT ME\n2022 LOCAL ELECTIONS\nIt was an honour and a privilege and stand as a Welsh Conservative candidate for my local ward Penyrheol. Although, unelected the experience and opportunity to meet local residents and discuss their priorities and concerns was refreshing and reaffirmed the reason I wanted to stand.\nI want to say a big thank you to all those who voted for me, and voted Welsh Conservative for the first time. There is a clear appetite for change and I will continue to champion the vision and values we hold."
}