{
  "https_willstone4northswindon_co_uk_/https_willstone4northswindon_co_uk_contact-us/content_4.html": "I would love to hear from you so please get in touch!\nEmail: will.stone.mp@parliament.uk Follow me on Facebook, link below!\nCopyright © 2024 Will Stone for North Swindon - All Rights Reserved.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_willstone4northswindon_co_uk_/https_willstone4northswindon_co_uk_pledges/content_2.html": "Swindon North deserves an MP who puts the people first and works all year round. I promise you that I will always put the residents' needs before my own and will continue to work tirelessly for the people of Swindon.\nFor the past 12 years North Swindon has been underrepresented. I will do everything within my power to ensure the residents of Swindon North are heard nationally.\nThe Swindon North community is so important to me. I will continue to work alongside and support community organisations. I will also continue my community action days across Swindon North.",
  "https_willstone4northswindon_co_uk_/https_willstone4northswindon_co_uk_privacy-policy/content_3.html": "Copyright © 2024 Will Stone for North Swindon - All Rights Reserved.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_willstone4northswindon_co_uk_/https_willstone4northswindon_co_uk/content_1.html": "Support Will\nSwindon North's MP!\nSupport Will\nSwindon North's MP!\nSwindon North's MP!\nSwindon North's MP!\nI was born and raised in Swindon, I have lived in the town for 32 years. I grew up in the Pinehurst area and went to Headlands school.\nAfter leaving, I worked various jobs from factories to call centres, but it wasn't for me so I decided to take a leap and join the army in the 1st Battalion the rifles. I absolutely loved my time in the army but after 5 years I decided to leave to set up a small business in Swindon.\nIt was at this point that I got involved in politics and joined the Labour Party. After being heavily involved in local campaigning, I stood for parish council and then borough, winning both seats.\nI am so proud to be the local MP and represent the people of Swindon, I love working towards improving the residents' lives through community engagement and being active across Swindon North.\nSpeaking in support of our veterans"
}