{
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_news/content_3.html": "08 April 2025\nIn an article for PoliticsHome, I explore some of the issues relating to the Government's Planning and Infrastructure Bill.\n08 April 2025\nIn an article for PoliticsHome, I explore some of the issues relating to the Government's Planning and Infrastructure Bill.\n28 March 2025\nI spoke in favour of the Water (Private Member's) Bill at its first reading and shared views of North East Hertfordshire constituents relating to rising water bills. You can watch the full speech below.\n28 March 2025 I believe we need a welfare state that supports everyone in times of need, protects the most vulnerable, and upholds equality and dignity\nfor all.\nPeople with disabilities are already more likely to face destitution, and my constituents are genuinely frightened that the Government’s proposed disability benefit cuts will result in greater hardship and misery.\nThe Government’s own impact assessment has shown these measures will force 250,000 people into poverty – including 50,000 children. The Joseph Rowntree Foundation has attributed this figure to “sleight of hand” and suggested the real number is closer to 400,000.\nThe proposed changes could see certain households lose up to £10,000 a year on top of the cost-of-living pressures already impacting North East Hertfordshire families. This is morally wrong, and totally unacceptable. The Chancellor’s 11th hour decision to pile on further cuts has laid bare the purpose of this proposal. There is no moral case for these changes - the Government could implement positive measures to support people into work without imposing austerity measures.\nThese cuts are a crude measure designed to meet self-imposed fiscal rules– balancing the books on the backs of the vulnerable.\nI understand the Government must raise funds to support public services given the state of the economy we have inherited, but the Chancellor has other options.\nThere are a range of levers which can be pulled to raise funds – the Tories always chose those that hammered ordinary families. We must act differently.\nI urge the Government to ask those with the broadest shoulders to bear more of the burden, as the Prime Minister has said previously.\nIf the Government chooses to bring such harmful disability benefit cuts to Parliament, I will not vote to make my constituents poorer.\nI will vote against these proposals.",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_post_in-parliament-the-sunshine-bill/content_9.html": "In Parliament: The Sunshine Bill\n- jackdobsonsmith\n- Jan 17\n- 1 min read\n17 January 2025\nI spoke in favour of the New Homes (Solar Generation) Bill, dubbed the \"Sunshine Bill\" during a day of Private Members' Bills debates. You can watch the full speech below.",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_blank-1/content_11.html": "About Me\nA Labour Member of Parliament standing up for residents in North East Hertfordshire:\nIn 2024 I became the first Labour candidate to win the North East Hertfordshire seat since its establishment in 1997, having also been the first in more than 20 years to win a North Herts Council seat in my hometown of Royston two years earlier.\nSince then, I have made it my mission to fight every day for the change local residents want to see. I spend a lot of time talking to the people I represent and when energy prices became one of their top concerns as bills soared, I championed a motion in North Herts Council calling for urgent government action to insulate homes and tackle fuel poverty.\nAs a local councillor, I supported residents on a wide range of issues, from protecting and improving our parks to concerns about anti-social behaviour. I've successfully campaigned with residents to save vital bus services to Cambridge and often spend my weekends taking part in local community and charity events across the district.\nAn election winning Labour activist:\nI've been a Labour Party member all my adult life and first got involved in active campaigning as a student at university, when I was part of the team that helped Labour win Cambridge in 2015, coming from third place to beat the Lib Dems.\nFrom 2017 to 2018 I worked as an organiser for the Labour Party in Thurrock, learning how to coordinate every aspect of a successful election campaign. With a fantastic team of local activists I ran Thurrock Labour's 2018 local election campaign, which delivered their largest number of Labour gains since 1997.\nSince living in North Hertfordshire, I have campaigned with the brilliant Royston Labour team, securing two consecutive Labour gains from the Tories in the town. I've also spent a lot of time canvassing to support Labour candidates in Letchworth and Baldock, and helped organise activities in rural areas like Watton-at-Stone and Little Hadham.\nA charity campaigner:\nFor the last five years I have worked as a professional campaigner and policy expert in the charity sector, making the case for progressive policies to improve the lives of people across the country.\nIn 2019, I ran a flagship campaign for social care to be free at the point of use, like the NHS, ensuring that our loved ones have the dignity and support they deserve in older age. I know from the experience of my own family how important this is, and high quality social care for all continues to be one of my biggest passions.\nMost recently, I led an award-winning campaign team for CPRE, the countryside charity, fighting for a better future for rural towns and villages like those across North East Hertfordshire. Together we helped to defeat Liz Truss' plans to bring back fracking, stopped Boris Johnson's attempt to deregulate the planning system created by the Attlee Labour government, exposed the truth of the rural housing crisis, and mobilised tens of thousands of people across the country to call for better rural bus services.\nAn experienced communicator on the national stage:\nThroughout my career I have spent a lot of time arguing for the changes our country needs to see and which the Tories will never deliver. North East Hertfordshire needs a Labour candidate who has the experience to stand up to the Tories and the press and I have had plenty of experience.\nOver the years, I have faced off against Tory MPs whilst giving evidence in parliament and challenged their ideological obsession in the privatisation of public transport, stood up for bold policies in live media interviews, and delivered speeches in front of hundreds at conferences, summits, and campaign events.\nA committed trade unionist:\nI have been a member of trade unions since my first full time job and for me this is a defining aspect of my Labour politics.\nThere are a lot of young people struggling to pay bills and rent whilst working in the charity sector I have been part of for most of my professional career. Trade unions have a hugely important role to play in tackling this, and I have experienced this first hand as a workplace union rep for the last three years.\nAs a Community union rep I have represented my colleagues in tough negotiations to improve pay and conditions, especially during the cost of living crisis. My trade unionism has also taught me the importance of solidarity across all sectors of the economy, so in 2022 I was proud to move a successful motion calling for a just transition that delivers a fair deal for workers in at risk industries, like steel. Working closely with trade unions will always be important to me as your candidate.\nPhoto: Westmill Lakes near Ware © Julian Paren (cc-by-sa/2.0)",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_contact/content_4.html": "Contact\nPlease send all queries to Chris.Hinchliff.MP@parliament.uk\nConstituents need to include their full name and address in their initial correspondence.\nAlternatively, you can write to:\nChris Hinchliff MP\nHouse of Commons\nLondon\nSW1A 0AA\nThe constituency office can be reached on 01462 415153\nYou can also find me on Facebook, X and BlueSky.\nEmergency contacts\nIf you require emergency assistance or if someone is in immediate danger, please do not hesitate. In an emergency, always call 999.\nHere are some other helpful contacts in a crisis:\nNorth Herts Council Housing Team: For imminent housing emergencies, call 01462 474000. Out of hours, call 0300 777 0125.\nEast Herts Council Housing Team: For all housing emergencies, call 01279 655261.\nAdult Social Services: You can contact Adult Social Services at Hertfordshire County Council at any time, day or night, on 0300 123 4042.\nChildren’s Social Services: If you are a parent or adult worried a young person – call any time, including for out of hours support, on 0300 123 4043.\nSamaritans: If you are having a difficult time, struggling to cope or know someone who is you can reach the Samaritan helpline on 116 123, available 24 hours a day. You can find more information online here.\nMind Crisis Cafes: This charity offers crisis cafes for those experiencing a mental health crisis.\nYou can talk to Mind on 01923 256 391 and find out more online here.\nNHS Single Point of Access Mental Health Helpline: This is for Herts residents of all ages, including carers, GPs and other professionals. You can contact the 24/7 Single Point of Access (SPA) Mental Health Helpline team at any hour of the day or night, 365 days a year. The team provide support for residents experiencing a mental health crisis and need some mental health support. You can call on 0800 6444 101.\nSign up for updates from your Member of Parliament for North East Hertfordshire\nBy submitting your information, you're giving us permission to contact you. You may unsubscribe at any time.",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_oqa/content_6.html": "Every month, I host an online event for you to ask the questions you have on your mind. Whether you want to know my thoughts on an area of national policy, or my views on a local matter, register using the link below and ask me on the day.\nNext event: TBC Theme: TBC",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk/content_1.html": "top of page\nYour local champion\nFor too long decent, affordable homes, reliable public transport, and adequate provision for SEND children, have been absent in North East Hertfordshire.\nAs your Member of Parliament, I am working to secure the change we need.\nStanding up for the towns, villages and people of North East Hertfordshire in Parliament and beyond.\nWorking with multiple stakeholders to tackle the causes and symptoms of rural poverty across the constituency.\nSecuring a genuinely democratic planning system to deliver truly affordable housing while protecting the environment.\nSupporting the reform of our Special Educational Needs and Disabilities (SEND) system to deliver for children and parents.\nHolding the Government to account through my work on the Commons Environmental Audit Committee.\nSign up for updates from your Member of Parliament for North East Hertfordshire\nBy submitting your information, you're giving us permission to contact you. You may unsubscribe at any time.\nbottom of page",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_surgeries/content_2.html": "top of page\nSurgeries\nSurgeries frequently take place across the constituency.\nIf you are a constituent and would like to book a slot, please email\nChris.Hinchliff.MP@parliament.uk with your full name and address.\nComing up\nPast surgeries\nLetchworth GC\nThursday 24 April 2025\nOnline\nWednesday 16 April 2025\nBaldock\nFriday 21 March 2025\nBuntingford\nThursday 06 March 2025\nThundridge\nFriday 21 February 2025\nRoyston\nFriday 31 January 2025\nLetchworth GC\nSaturday 11 January 2025\nBaldock\nFriday 20 December 2024\nBaldock\nFriday 13 December 2024\nWatton-at-Stone\nThursday 05 December 2024\nTewin\nFriday 22 November 2024\nLetchworth GC\nThursday 14 November 2024\nLetchworth GC\nSaturday 09 November 2024\nRoyston\nFriday 25 October 2024\nBuntingford\nFriday 11 October 2024\nLittle Hadham\nSaturday 28 September 2024\nbottom of page",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_post_in-the-media-planning-deregulation-carries-serious-political-risks-for-labour/content_14.html": "In the Media: Planning deregulation carries serious political risks for Labour\n- jackdobsonsmith\n- Apr 8\n- 1 min read\n08 April 2025\nIn an article for PoliticsHome, I explore some of the issues relating to the Government's Planning and Infrastructure Bill.",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_post_in-the-media-pushing-for-solutions-on-the-climate-crisis/content_12.html": "In the Media: Pushing for solutions on the climate crisis\n- jackdobsonsmith\n- Mar 28\n- 1 min read\n28 March 2025\nIn my column for The Comet, I highlight some of the work I am doing to promote tackling the climate crisis and developing clean energy while preserving and enhancing nature.",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_post_in-parliament-the-climate-and-nature-bill/content_10.html": "In Parliament: The Climate and Nature BilljackdobsonsmithJan 241 min readUpdated: Jan 3124 January 2025 I intervened during the 2nd Reading of the Climate and Nature Bill. You can watch the full speech below.",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_post_in-parliament-the-water-private-member-s-bill/content_7.html": "In Parliament: The Water Bill\n- jackdobsonsmith\n- Mar 28\n- 1 min read\nUpdated: Apr 3\n28 March 2025\nI spoke in favour of the Water (Private Member's) Bill at its first reading and shared views of North East Hertfordshire constituents relating to rising water bills. You can watch the full speech below.",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_privacy-policy/content_5.html": "Privacy Policy\nI am the MP for the North East Hertfordshire constituency. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf and ask for views on local issues.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nMy responsible officer for data protection can be contacted at chris.hinchliff.mp@parliament.uk.\nData collection and use\nThe office of Chris Hinchliff MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary in order to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen registering with this website or by completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, phone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe option I provide in all communications.\nI will not use personal data for any automated decision making or profiling.\nSurveys\nIf you complete a survey I will never share your data nor will it be used for the purposes of political campaigning.\nWho I share your information with\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the MP for North East Hertfordshire, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary to resolve or otherwise complete your request, although I may retain a minimum amount of information about closed cases in the event that you contact me again for help.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for North East Hertfordshire, or you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nIP Addresses and Cookies\nThis site does not automatically capture or store personal information, other than logging the user’s IP Address or the location of your computer or network on the Internet, for systems administration and troubleshooting purposes. I also use IP addresses in the aggregate to track which pages people visit in order to improve the quality of the site.\nA cookie is a tiny text file that is stored on your computer. Cookies may be used in order to tailor your experience on this site according to the preferences you have specified. Cookies on this website do not contain personally identifiable information, other than your IP address, which itself is only very rarely enough to identify you as an individual.\nLabour members\nAs a Labour MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy (https://labour.org.uk/privacy-policy/ ) for details.\nYour rights\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n• Obtain copies of the personal information I hold about you (known as a “subject access request”)\n• Request that I correct or update any personal information held about you\n• Ask that we erase or restrict the way in which I use your information\n• Request that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications form me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my Data Protection Officer via chris.hinchliff.mp@parliament.uk.\nAlternatively you have right to raise any issues or concerns directly with the Information Commissioner’s Office.",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_post_statement-on-the-government-s-proposed-disability-benefit-cuts/content_8.html": "Statement: The Government's proposed disability benefit cuts\n- jackdobsonsmith\n- Mar 28\n- 2 min read\nUpdated: Apr 23\n28 March 2025 I believe we need a welfare state that supports everyone in times of need, protects the most vulnerable, and upholds equality and dignity\nfor all.\nPeople with disabilities are already more likely to face destitution, and my constituents are genuinely frightened that the Government’s proposed disability benefit cuts will result in greater hardship and misery.\nThe Government’s own impact assessment has shown these measures will force 250,000 people into poverty – including 50,000 children. The Joseph Rowntree Foundation has attributed this figure to “sleight of hand” and suggested the real number is closer to 400,000.\nThe proposed changes could see certain households lose up to £10,000 a year on top of the cost-of-living pressures already impacting North East Hertfordshire families. This is morally wrong, and totally unacceptable. The Chancellor’s 11th hour decision to pile on further cuts has laid bare the purpose of this proposal. There is no moral case for these changes - the Government could implement positive measures to support people into work without imposing austerity measures.\nThese cuts are a crude measure designed to meet self-imposed fiscal rules– balancing the books on the backs of the vulnerable.\nI understand the Government must raise funds to support public services given the state of the economy we have inherited, but the Chancellor has other options.\nThere are a range of levers which can be pulled to raise funds – the Tories always chose those that hammered ordinary families. We must act differently.\nI urge the Government to ask those with the broadest shoulders to bear more of the burden, as the Prime Minister has said previously.\nIf the Government chooses to bring such harmful disability benefit cuts to Parliament, I will not vote to make my constituents poorer.\nI will vote against these proposals.",
  "https_www_chrishinchliff_co_uk_/https_www_chrishinchliff_co_uk_post_in-parliament-highlighting-hugh-s-law-at-pmqs/content_13.html": "In Parliament: Highlighting Hugh's Law at PMQs\n- jackdobsonsmith\n- Dec 18, 2024\n- 1 min read\nUpdated: Jan 8\n18 December 2024\nDuring Prime Minister's Questions, I highlighted the case of my constituents Ceri and Frances Menai-Davis, and their campaign to ensure that every parent who must leave work to take care of a sick child in hospital gets the financial support that they need from day one. You can watch the full video clip below."
}