{
  "https_www_johannabaxter_scot_/https_www_johannabaxter_scot_privacy-policy/content_3.html": "Skip to content\nHome\nPriorities\nAbout\nGet Involved\nContact\nHome\nPriorities\nAbout\nGet Involved\nContact\nJoin Labour\nDonate\nPrivacy Policy\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_johannabaxter_scot_/https_www_johannabaxter_scot/content_1.html": "From Paisley, to Johnstone and Lochwinnoch, together, we can secure a brighter future for Paisley and Renfrewshire South.\nWith a working-class upbringing in Saltcoats I was the first in my family to go to university. I funded my way through by working in a call centre and stepped forward to become a union rep at 18.\nPeople often underestimated me but I‘ve never been daunted by the challenge of fighting for basic rights.\nI’ve since spent my entire working life in the trade union movement fighting for better rights for people at work. As Head of Local Government for UNISON Scotland, I’ve led negotiations for over 200,000 workers – putting more money directly into people’s pockets, through the best ever pay deals for our council workers.\nI’m an active campaigner and if elected I’ll fight your corner at every opportunity.\nOnly Labour’s Johanna Baxter can beat the SNP in Paisley and Renfrewshire South. Every donation to my campaign will help our fight for change here in Paisley and Renfrewshire South.\nOnly Labour’s Johanna Baxter can beat the Conservatives in Paisley and Renfrewshire South. Every donation to my campaign will help our fight for change here in Paisley and Renfrewshire South.\nPromoted by Greg Irwin on behalf of Johanna Baxter at 92 Causeyside Street, Paisley, PA1 1TX.",
  "https_www_johannabaxter_scot_/https_www_johannabaxter_scot_get-involved/content_2.html": "I’m building a team to win Paisley and Renfrewshire South for Labour and I’d love you to join us.\nThere are a variety of ways you can help, no matter what your skill set or availability.\nSpeaking to the residents is an important part of what we do, you could help us to understand the views and needs of the people of Paisley & Renfrewshire South\nWe are always looking to promote the work we do, and spread the word about our future plans. You could help us deliver leaflet with this information.\nWe also like to reach our to residents by phone. You could make these calls from home, with training available through Labour’s Dialogue system.\nPromoted by Greg Irwin on behalf of Johanna Baxter at 92 Causeyside Street, Paisley, PA1 1TX."
}