{
  "https_sallyhowell_info_/https_sallyhowell_info/content_1.html": "Independent District Councillor for Yaxley & Farcet\nI will be the voice of all residents, working with you to solve issues and develop the amazing community we have here. You will see from my personal voluntary record that great things have been achieved locally and I believe that as a District Councillor I can make an even more profound difference.\nI will support local initiatives to tackle climate change, including the launch of a local Climate Emergency Centre that will be focused on delivering tangible local projects to protect our environment.\nI will continue to support community initiatives in multiple ways. I don’t want to just signpost you to help and funding, I want to help make those introductions you need and develop local support networks where people can help and support each other. I have worked closely with officers at Huntingdonshire District Council over recent years to deliver projects such as a Youth Club, Employment Hub and Community Support Network.\nI will work with those who want to help people. I believe collaboration is better than conflict to get things done and that political infighting and point scoring does not help residents. As an independent councillor I can focus entirely on delivering for our communities and making decisions that are in the best interest of residents and not a political party.\nI will help build the economic development of the area, having already supported the establishment of a local educational academy and a mental health facility serving both parishes during the pandemic. I also hosted the Community Job Fair in 2021 and will hold more of these events to support local businesses and promote local employment opportunities.\nI was born in Holme and raised in Yaxley, spending much of my childhood at our family homes on Middletons Road and Hillcrest Avenue. I attended Yaxley Infant School, Yaxley CofE Junior School and then Stanground College.\nMy parents Bob and Heather Howell both lived and worked in the village, my Mum as a post lady and then a receptionist at the Doctor’s surgery and my Dad at various farms and as a delivery driver.\nI have lived most of my adult life in the local area and currently live in Farcet and work in Yaxley.\nI have been heavily involved in local community initiatives for around 15 years now, starting off as a Rainbow leader in Girlguiding, before progressing to the Brownies as an assistant leader and finally a district commissioner, overseeing local groups. I was also involved with helping to run the fireworks nights as part of the Group Scout Council.\nFollowing on from that I have been involved from the start with Yaxley Festival, an event which has gone on to inspire many other local community initiatives.\nSince the outset of the Covid-19 pandemic I have been co-leading the Yaxley and Farcet Support Network, which was formed by volunteers to help residents in our parishes and beyond. Our team has responded to 1800+ support requests with a 100% success rate.\nI run my own small business providing admin support to other business owners and am also involved in supporting various charities, community groups and social enterprises.\nJoint Founder & Co-ordinator\nTrustee\nVolunteer\nTeam member & Chair\nCo-ordinator\nJoint Organiser\nJoint Founder\nSupporter\nJoint Founder\nDirector\nTeam member\nQueens 90th Birthday\nJoint Organiser\nPlease click on the links below if you need any assistance with these topics.\nCreated by Sally Howell\nPromoted by Sally Howell C/O 6 Heron Court, Yaxley PE7 3AT\nCopyright © 2022 Sally Howell All rights reserved"
}