{
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_manifesto_2024__energy-efficient-buildings/content_62.html": "The buildings in which we live and work should be safe, comfortable, make minimum use of carbon-intensive materials, and be efficient to run. They will have to remain habitable in the face of increasingly extreme weather events. Wherever possible, existing buildings should be renovated rather than demolished and rebuilt, with appropriate retro-fitting which will not only reduce carbon emissions but also help to lift people out of fuel poverty. Measures are needed to mitigate the overheating of both old and new homes, and the public needs to understand the risks to health incurred at very high temperatures.\nNew developments must be linked to local services and low-carbon transport options to promote emission reductions across the region. “Net-zero building” must take into account the carbon costs of construction, the embodied carbon in building materials, and the loss of carbon stocks caused by the destruction of soils, vegetation or existing structures.\nGreen-led Councils would:\n- fund accessible, lower cost retro-fitting;\n- apply the relevant retro-fitting measures (such as insulation) to as many council homes as possible, rather than providing full refits for fewer homes;\n- provide information on how to access retro-fitting (e.g. funding sources, advice on improved insulation, solar panels and heat pumps etc.);\n- consider introducing, as in certain other councils, a council “kitemark” to be awarded to developments that comply with the council’s highest standards to encourage voluntary compliance with higher standards than those imposed by law, including but not limited to Passivhaus13;\n- recruit additional building controls inspectors as necessary to ensure required standards are met;\n- continue to work with and on behalf of social housing residents to get hazards such as mould and condensation rapidly resolved.\n| 13 | https://energysavingtrust.org.uk/passivhaus-what-you-need-know/#:~:text=Passivhaus%2520buildings%2520are%2520so%2520well,little%2520additional%2520heating%2520or%2520cooling |",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_contact/content_36.html": "Skip to content\nSkip to footer\nCambridge & South Cambridgeshire\nMenu\nNews\nAbout\nWhat We Stand For\nOur People\nContact Us\nGet Involved\nEvents\nVolunteer\nElection\nCandidates for Local Elections May 2025\nHiston and Impington Ward\nAreas\nNewnham Ward\nJoin\nDonate\nJoin\nDonate\nMenu\nContact Us\nEmail:\ncontact@cambridge.greenparty.org.uk\nTo top",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_get-involved_events/content_18.html": "Upcoming Events\n-\nMay 12, 2025: Green Drinks at the Rose & Crown\nRose and Crown\n2 Glebe Way, Impington\nCambridge , CB24 9JB -\nMay 15, 2025: Romsey Green Drinks at the Empress\nThe Empress Pub\n72 Thoday Street\nCambridge, CB1 3AX -\nJune 9, 2025: Green Drinks at the Rose & Crown\nRose and Crown\n2 Glebe Way, Impington\nCambridge , CB24 9JB -\nJune 19, 2025: Romsey Green Drinks at the Empress\nThe Empress Pub\n72 Thoday Street\nCambridge, CB1 3AX",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_manifesto/content_42.html": "Skip to content\nSkip to footer\nCambridge & South Cambridgeshire\nMenu\nNews\nAbout\nWhat We Stand For\nOur People\nContact Us\nGet Involved\nEvents\nVolunteer\nElection\nCandidates for Local Elections May 2025\nHiston and Impington Ward\nAreas\nNewnham Ward\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nManifesto\nManifesto\nTo top",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_04_statement-from-sarah-nicmanis-ahead-of-local-elections/content_51.html": "Skip to content\nSkip to footer\nCambridge & South Cambridgeshire\nMenu\nNews\nAbout\nWhat We Stand For\nOur People\nContact Us\nGet Involved\nEvents\nVolunteer\nElection\nCandidates for Local Elections May 2025\nHiston and Impington Ward\nAreas\nNewnham Ward\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nUncategorised\nStatement from Sarah Nicmanis Ahead of Local Elections\nStatement from Sarah Nicmanis Ahead of Local Elections\n14 April 2024\n/\n14 April 2024\nby\nmarke\nTo top",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_get-involved_volunteer/content_45.html": "Help keep your local party running\nCambridge & South Cambridgeshire Green Party is run by volunteers and we always welcome more help. If you’re interested, please fill in the volunteer form and we’ll be in touch.\nBelow and in no particular order are just some of the things we do. Basically, whatever your skills or interests we probably have a role for you!\n- Deliver leaflets (all year round, not just at election time!)\n- Develop our local party policies\n- Take part in action days to get more Greens elected\n- Organise social events\n- Write letters to the local papers\n- Draft press releases\n- Support our Green Councillors by drafting questions to Council, taking notes at public meetings, and in many other ways\n- Stand as Green candidates in local elections\n- Develop and maintain our websites\n- Help run our social media accounts\n- Fundraising\n- Write, design and print leaflets\n- Organise election campaigns in key wards\n- …. so much more!",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2023_05_1019/content_70.html": "Cambridge & South Cambs Greens response to the draft Water Resources Management Plan from Cambridge Water\nCambridge & South Cambridgeshire Green Party have submitted a detailed response to the draft Water Resources Management Plan produced by Cambridge Water.\nYou can read our response in full here.\nWe have long raised concerns about the regional water shortage and its impacts on both people and nature. We’re pleased to see that Cambridge Water now acknowledges the conclusion reached by the Environment Agency that the region is ‘seriously water stressed’ but we do not think the plan demonstrates a sufficiently urgent response given the climate change and biodiversity crises. The extreme weather fluctuations we have seen lately are set to become the new normal under climate change predictions and we need urgent action from our water company to cope with this.\nWe believe the priorities should be to:\n- Rapidly reduce abstraction from the Chalk aquifer, including by capping abstraction at today’s actual levels;\n- Take much more concerted and urgent action to manage demand, with actions that go beyond reliance on voluntary individual behaviour change.\nWe accept that measures such as surface water transfers and a reservoir will be necessary but these solutions must be strategically planned, clearly costed and transparent, and must be compatible with commitments to reach net zero and halt biodiversity loss.\nThe prevailing approach of pursuing economic growth at all costs is not appropriate. Water availability is a physical constraint and our priority should be to live within our means, through reducing total demand and finding sustainable ways to increase usable supply (for example through better rainwater capture). Currently we simply do not have the surplus water available which would be needed to supply the planned levels of development.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_manifesto_2024__protecting-nature/content_19.html": "The natural world is not simply there to be used; we are a part of it. It is nature that allows human society to exist and thrive. For example, farming depends on natural processes like pollination to produce food, while quality green spaces in urban areas are vital to our health, physical and mental. Social ties and our bonds with nature interact, as so many learned during the Covid-19 Pandemic. Cambridge’s iconic greens and commons are part of what gives the city its unique character, yet an estimated 68% of residents do not enjoy the level of access to green space that the World Health Organization recommends17. In other words, Cambridgeshire is nature-depleted, and our focus should be on restoring nature and not simply protecting what remains now. Unfettered development is driving further destruction of green space within Cambridge and across the Green Belt, and further fragmenting wildlife habitats. We must protect what we have, greatly expand the area of land set aside for nature, connect up our endangered habitats and safeguard them in perpetuity. We need to support Cambridgeshire farmers and rural communities, by encouraging the transition to more sustainable farming methods, by urging councils and businesses to buy more local food, and by improving public transport throughout Cambridgeshire.\nGreen-led Councils would:\n- oppose further losses of urban green space and Green Belt. Where a genuine local need for development has been identified, we would prioritise brownfield sites (subject to appropriate environmental impact assessments) and require high- quality green space for nature and people to be part of the design;\n- call for appropriate monitoring and enforcement of Biodiversity Net Gain and also for very tight regulation of the market for biodiversity “units.” Now that BNG is becoming mandatory for new developments we are very concerned that it will, in practice, lead to loss of biodiversity. In assessing planning applications we will insist that requirements are achieved on-site and not through off-setting.\n- oppose “garden grabbing” and the removal without good cause of even small natural elements, such as hedges or grass verges;\n- promote the expansion and full protection of the network of City Wildlife Sites, Country Parks and Local Nature Reserves;\n- ensure recreational green spaces and play areas are safe, clean, clear of litter and accessible to all;\n- support tree planting initiatives and help to ensure these are carried out according to best practice, opposing any unnecessary removal of trees or pressure from insurers relating to subsidence claims;\n- empower local neighbourhood groups to take care of biodiversity on their streets, making sure young trees are watered and that where appropriate wildflowers are planted on grass verges, working together with local groups like ‘On the Verge’18;\n- increase Council officer time allocated to biodiversity and green spaces and appoint dedicated wardens for specific areas; improve the support available for volunteer and community involvement in managing green space.\n| 17 | Barboza et al. 2021. Green space and mortality in European cities: a health impact assessment study. https://www.thelancet.com/journals/lanplh/article/PIIS2542-5196(21)00229-1/fulltext. The WHO recommends that everyone live within 300 metres (five minutes’ walk as a rule of thumb) of a green space measuring at least O.5 hectares. |\n| 18 | https://www.onthevergecambridge.org.uk/ |",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_author_marke/content_14.html": "18 November 2024 / 18 November 2024 by marke\nCambridge Water Failures Pose Threat To Environment And Water Supply The annual reviews by Ofwat, the Environment Agency and the Department for Environment, Food and Rural Affairs (Defra) of the performance of England’s water companies were published on 21 October 1. Jean Glasberg, Green Party City Councillor, says: “These letters make shocking reading. They provide […]\nRead more »\n30 September 2024 / 30 September 2024 by marke\nKathryn Fisher has been selected as Green Party candidate for the Histon and Impington by-election of 24 October 2024. More information here.\n15 July 2024 / 15 July 2024 by marke\nUrgent action needed to tackle pollution, flooding and water shortages Cambridgeshire residents are facing rising water bills with proposed price hikes of 13-14%1. But we are confronted with polluted rivers and failing sewage treatment plants, dried up chalk streams, and both flooding and drought which are damaging agriculture, roads and other infrastructure and affecting our […]\n4 June 2024 / 5 June 2024 by marke\nThe local Green Party prospective parliamentary candidates for the General Election are listed here.\n31 May 2024 / 5 June 2024 by marke\nMiranda Fyfe has been selected as Green Party prospective parliamentary candidate in South Cambridgeshire for the General Election 2024. Miranda has lived in Cambridgeshire for over 30 years. An active member of the Stapleford village community, she has worked in NHS management and is a keen campaigner for Active Travel and public transport, who practises […]\n3 May 2024 / 3 May 2024 by marke\nAbbey – Naomi Bennett Elected with 52% of vote. Coleridge – Sarah Nicmanis Second with 34% of vote. Newnham – Hugh Clough Elected with 46% of vote.\n14 April 2024 / 14 April 2024 by marke\n8 April 2024 / 14 April 2024 by marke\nThe full version of the manifesto can be found here. The shortened version is here.\n7 April 2024 / 14 April 2024 by marke\nSaran Nicmanis at Fanshawe Road flats, Coleridge Cambridge had just under 7350 council homes in September 20231 but, by March this year, there were still almost 28002 people on the waiting list, indicating that the City needs some 40% more social housing to give everyone a roof over their head. Cambridge City Council prides itself […]\n21 March 2024 / 14 April 2024 by marke\nSarah Nicmanis, Green Party parliamentary candidate for Cambridge, speaking to the Environment and Community Scrutiny Committee on Thursday 21st March with reference to the Petition requesting that Cambridge City Council publically supports the Climate and Ecology Bill. I speak as the Green Party parliamentary candidate for Cambridge City and on behalf of our local party […]",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_tag_economy/content_35.html": "Greens Call for urgent investment in social housing, climate action, and fair wages 4 February 2025 / 20 February 2025 by Green Party Admin Following the Chancellor of the Exchequers speech today, the Greens have expressed deep concerns about the current economic strategy by the Labour Government and the devastating impact it will have on the most vulnerable members of society. Green County council candidate, Kathryn Fisher explained: “The Chancellor is desperately scrabbling around for a plausible magic growth […] Read more » Darren Green Economy Green Party Kathryn Fisher",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_07_greens-call-for-declaration-of-a-water-emergency-in-cambridge/content_5.html": "Urgent action needed to tackle pollution, flooding and water shortages\nCambridgeshire residents are facing rising water bills with proposed price hikes of 13-14%1. But we are confronted with polluted rivers and failing sewage treatment plants, dried up chalk streams, and both flooding and drought which are damaging agriculture, roads and other infrastructure and affecting our health. The water companies themselves predict an insufficient supply of water by 20302.\nThe Greens are therefore calling on the Council to declare full recognition of the water emergency, the impact that this is already having on communities, businesses and the environment in Cambridge, and the potentially disastrous consequences it is leading to.\nJean Glasberg says “The City Council declared biodiversity3 and climate4 emergencies in 2019, which have helped to raise awareness of, and accelerate action on these critical issues, including influencing planning and other decisions. We need a water emergency declaration for the same reasons. Global heating is causing extreme weather events which are having a serious impact on our water resources. Under the Climate Change Act 2008, water companies are legally obliged to take action to adapt to the future impacts of climate breakdown5. We need clear evidence that they are doing this.”\nUrgent action is needed to address the current crisis, including full scrutiny of planning applications for large-scale developments. Full weight must be given to the evidence of the Environment Agency (a statutory consultee) in relation to water. The highest water efficiency standards should be required for any new developments, including mandatory greywater collection and recycling, a policy that the Greater Cambridge Shared Planning Service claims to promote but which is not being fully implemented.\nGreens are also requesting the Council to write to the Rt Hon Angela Rayner to demand that planning matters in Cambridge and South Cambridgeshire remain under the control of the local authorities and asking for the Written Ministerial Statement on the Cambridge Delivery Group6, of May 2024, to be replaced with a new statement that requires greater priority to be given to water issues in local planning applications.\nCambridge has the potential to become a model ‘sponge’ city7, a concept being pursued in other cities, where the creation of places with multiple areas of greenery, trees, ponds, soakaways, pocket parks, rain gardens and permeable paving is actively encouraged. The Council needs to engage with the water companies, but also put pressure on them to cap abstraction from the Chalk aquifer at today’s levels, rapidly increase efforts to repair leaks, and manage demand more effectively. While the Council itself must do all it can to encourage residents to use less water, we also need accelerated introduction of universal metering and the prompt declaration of hosepipe bans when needed.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_donate/content_13.html": "The Green Party has made history – we got five councillors elected.\nNow the hard work begins. Naomi, Matt, Jean, Elliot and Hugh will push the Labour to be bolder and better on climate, investing in public services and tackling inequality.\nReal hope and real change. Help make it happen by donating to our campaign.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_about-us_people/content_46.html": "Skip to content\nSkip to footer\nCambridge & South Cambridgeshire\nMenu\nNews\nAbout\nWhat We Stand For\nOur People\nContact Us\nGet Involved\nEvents\nVolunteer\nElection\nCandidates for Local Elections May 2025\nHiston and Impington Ward\nAreas\nNewnham Ward\nJoin\nDonate\nJoin\nDonate\nMenu\nCSCGP City Councillors\nNaomi Bennett\n(she/her)\nAbbey Ward\nElliot Tong\n(he/him)\nAbbey Ward\nMatthew Howard\n(he/him)\nAbbey Ward\nJean Glasberg\n(she/her)\nNewnham Ward\nHugh Clough\n(he/him)\nNewnham Ward\nCSCGP Committee Members\nBob Ensch\n(he/him)\nChair\nElizabeth May\n(she/her)\nCo-Convener\nSarah Nicmanis\n(she/her)\nCo-Convenor\nWelcome Team\nOliver Fisher\n(he/him)\nTreasurer\nMatthew Howard\n(he/him)\nCampaigns Officer\nNominations Officer\nElection Agent\nMiranda Fyfe\n(she/her)\nCampaigns Officer\nNominations Officer\nElection Agent\nChloe Mosonyi\n(she/her)\nYoung Greens\nEquality, Diversity & Inclusion\nPeter Price\n(he/him/they/them)\nSafeguarding\nEquality, Diversity & Inclusion\nDaniel Laycock\n(he/him)\nCommunications\nSilke Scott-Mance\n(she/her)\nWelcome Team\nKathryn Fisher\n(she/her/they/them)\nWelcome Team\nJacqueline Whitmore\n(she/her)\nEvents\nMark Eastlick\n(he/him)\nInformation Technology\nData Protection\nDarren Green\n(he/him)\nFundraising Officer\nSusan Daruvala\n(she/her)\nLiterature & Manifesto\nTo top",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_newnham-greens-campaigning/content_31.html": "Welcome to the Newnham Greens web pages. Here you will find news, information, links and contacts for the local Newnham members and volunteers of the Green Party.\nIncreasing Support for Greens in Newnham\nThanks to everyone who has supported the party. Our results in local city council elections shown below highlight growing support for the Green Party in Newnham.\nNewnham Candidate for County Elections 2025\nThe candidate for Newnham for the County Elections in 2025 is Peter Rees.\nPeter is committed to Newnham. Now age 29, he has lived, studied, and worked in Newnham for the past 23 years. He grew up and built large snowmen on the West fields and learnt to roller-blade around the Cavendish labs. He studied natural sciences and then a PhD in history & philosophy of science based at Clare College (also in Newnham!). For work, his job is documenting and researching the history of innovation in Cambridge.\nPeter wants to work for Newnham. As Chair of the Clerk Maxwell Road Residents’ Association, Peter is passionate about understanding and representing residents’ wishes for the future. Serving his local community has been extremely rewarding and this motivates his desire to help tackle broader county-level issues. In particular, his priority is to make Cambridgeshire a model for building a sustainable future.\n“I was shocked to learn that there are 61 County Councillors for Cambridgeshire, and not 1 of them is Green. The authorities are not taking the climate seriously. It is the elephant in the room. Who is going to speak out? Having witnessed the effects of the climate crisis here in Newnham, I am determined to make green growth a priority!”\nPeter is forward-looking and not anti-growth: he wants to facilitate green growth. The idea of ‘growth’ which dominates discussion in the news seems to mean green death: prioritising short-term maximisation of profits for large corporations and turning green spaces grey. Rather than measured in profit, green growth is measured in terms of green space and biodiversity, sustainable buildings and transport.\nCambridgeshire is growing: in the long run, green growth is for everyone.\nThe Newnham Green volunteers have started 2025 with some door knocking to find out residents views on local issues. Potholes, greenways, busways, bus services, developments, the South Newnham Plan to name a few !!",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2025_02_greens-call-for-urgent-investment-in-social-housing-climate-action-and-fair-wages/content_16.html": "Following the Chancellor of the Exchequers speech today, the Greens have expressed deep concerns about the current economic strategy by the Labour Government and the devastating impact it will have on the most vulnerable members of society.\nGreen County council candidate, Kathryn Fisher explained:\n“The Chancellor is desperately scrabbling around for a plausible magic growth bullet in order to prop up Labour’s ludicrous fiscal rules that don’t allow them to tax the super rich.”\nShe continued: “She sees Cambridge as this magic bullet, but the city doesn’t need growth, it needs investment in social housing and infrastructure. We should be investing in the old industrial heartlands in the north by redeveloping post-industrial sites, not pumping even more money into one of the most unequal, nature deprived and water-depleted cities in the country, by building million pound apartments all over the green belt.”\n“People who don’t know the Cambridge area and its problems well might be fooled, but there is no way that the government’s plan can work even purely in economic terms.” she added. “However, we have gone beyond problems that can be solved by magic money trees. Every suggested solution raises a whole host of new problems . Magical thinking puts the economy at risk as well as the environment.”\nFor months, the Green Party has been calling for higher wages for lower-paid workers and an end to austerity measures that have crippled public services. In her speech, Reeves stated the government would be looking at “the rising cost of health and disability benefits”. A compassionate and competent government would work harder to stop people becoming too ill to work in the first place. It should not put up with companies that make large profits by paying workers so little that they must claim in-work benefits to survive.\nGreen County council candidate, Darren Green said: “It is time to increase taxes on the accumulated wealth of big businesses and billionaires to redistribute resources and rebuild our broken public services. We must prioritise the needs of the people and the planet over the interests of the wealthy few. The climate crisis cannot be ignored.”\nThe Green Party welcomes well-paying, unionised jobs, but if Labour doesn’t take urgent action on the climate crisis, there will be no jobs on a dead planet. We say no to austerity, no to the destruction of our environment, and yes to a fairer, greener future for all.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_general-election_local-candidates-for-general-election-2024/content_43.html": "Cambridge – Sarah Nicmanis\nSarah has lived in Cambridge for over 20 years. As a mother who has worked in the housing and teaching sectors, she has observed the inequality of opportunity that is so striking in Cambridge.\nSarah says, “An obsession with growth has left Cambridge with threatened water supplies, a stripped-back green belt, a broken transport system, unaffordable house prices and shocking inequality. The Greens are the only local party challenging ‘business as usual’.\n“Our record of listening to, and working with, residents saw the Cambridge Green Party draw level for second place in the May elections. There is now a real opportunity in Cambridge to send a strong environmental and social justice message to the next government. Want Green? Vote Green!”\nEly and East Cambridgeshire – Andy Cogan\nAndy has lived, worked and volunteered in the Ely and East Cambs constituency for 25 years. He spent over 20 years as a lecturer and college manager. From 1999 to 2013 he ran COVER, a regional charity that did EU funded regional projects to boost the skills & employment of people furthest from the labour market. He chaired Reboot Cambridge Community Interest Company for 12 years that processed almost 300 tons of Computer ICT equipment for reuse and recycling which now has a home inside Emmaus, based in Landbeach. He’s currently a volunteer facilitator at a monthly dementia sufferers café and an active member of the Newmarket and Ely Universities of the Third Age. He has also spent time as a district councillor, was chairman of public service and personnel committees, was a council representative on a regional health authority, and was a lecturer’s union branch secretary. He reads, he writes. He bikes.\nIf elected, Andy will support measures that give local communities the power to say no to inappropriate developments that don’t address local needs, wants and aspirations. He will campaign to improve our public services, and to reduce the widening wealth gap between rich and poor and young and old. He will also campaign to repatriate our wealth that foreign interests who own utilities, such as Anglia Water, through privatisation and deregulation, are sucking out of Britain.\nSouth Cambridgeshire – Miranda Fyfe\nMiranda has lived in Cambridgeshire for over 30 years. An active member of the Stapleford village community, she has been a committee member of the school PTA, treasurer of the local tennis club and the support officer of a local charity.\nAs an NHS manager for ten years, working in both acute care and then end of life care, Miranda values our public sector and has experienced the disruption following poor government decisions. She joined the Green Party to champion real change, as major political parties failed to adequately address the huge environmental challenges we face.\nIf elected, Miranda plans to hold the new government to account, fight to protect our environment and achieve genuine public sector change.\nSt. Neots and Mid Cambridgeshire – Kathryn Fisher\nKathryn grew up in Cambridgeshire, studied at Cambridge University and now works as a landscape designer in the county. During the pandemic, she volunteered as the coordinator for Cambridge Community Kitchen, serving hot meals to help tackle food poverty. Cambridgeshire is one of the most unequal and nature-deprived places in the UK. If elected Kathryn would champion sustainable housing developments that benefit residents, an electrified East West Rail that takes people where they want to go, and investment in the green belt to improve biodiversity and habitat creation.\nKathryn hopes to be voice for young people in this country who have been continuously let down by the past 14 years of Tory rule. In this time, inequality has increased, hate crime has risen and the gender pay gap has stagnated. Kathryn joined the Green Party because it recognises that we are not born equal and that there are deeply entrenched systems in place that sustain this inequality. Kathryn is standing in the general election to champion change, to break down these systems so that everyone in this country benefits and to bring a fresh positive energy to the political landscape.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_manifesto_2024__safeguarding-water-supplies/content_60.html": "Our water crisis is accelerating. Cambridge experienced severe drought in 2022 and 2023 and flooding in early 2024. The erratic weather patterns, generated by climate change, are well understood by Cambridge Water, the water supply company for the city and parts of South Cambridgeshire, which notes in its 2025-2030 business plan19 that “we are likely to see more extremes of weather, with 60% less rainfall in the summer and 30% more rainfall in the winter in our Cambridge region by the 2080s.” Climate change in all its wayward ferocity also brings about severe flooding. Put simply, we now have by turns either too much or too little water, as well as distressingly high levels of pollution. Cambridge Water acknowledges that, with current growth proposals and the need for licence caps on abstraction to protect the natural environment, the region will run into a water deficit by 2029/3020. The targets set by both our water companies for addressing this, in a region classified by the Environment Agency as “seriously water-stressed”, remain woefully unambitious, indeed wholly inadequate, and incompatible with the February 2024 government ‘guidance’ on water scarcity21. Nationally, the Green Party is calling for water companies to be brought into public ownership22, since a resource as vital as water – essential for all forms of life – needs to be run by the public and for the public good. England should join Scotland, Wales, Paris and most of the world, and restore public ownership using the legal framework of special administration that already exists23. Meanwhile we can be taking action locally, recognising that there is good evidence to show that a more modest consumption of 80 litres per person could be achieved far sooner than the unduly timid targets currently set.\nWater quality is also rapidly worsening, as failing waste treatment plants, under- resourced monitoring and enforcement agencies, poor regulation of nutrients and excessive use of pesticides and herbicides in farming, and an increasing population mean that rivers and streams are becoming highly polluted. Monitoring by the Cam Valley Forum, Anglian Water (the company responsible for waste water throughout the city and South Cambridgeshire), and other bodies shows that current pollution levels in our rivers and chalk streams are simply unacceptable.\nThe record rainfall in 2024 led to flooding in many parts of both the city and surrounding areas of Cambridge, damaging agriculture, roads and other public infrastructure, and affecting the lives of numerous residents. Flooding, the responsibility of the Environment Agency, and drought, the responsibility of water companies, are currently addressed in isolation, neither silo integrating with quality or wider environmental impacts effectively. This is inefficient with too many expensive, single-outcome solutions. Plans for large- scale house building will increase the burden, causing over-abstraction and pollution with negative impacts on the quality of life for residents and further threats to our chalk streams, trees and natural vegetation as the water table falls and becomes more polluted.\nGreen-led Councils would strive to:\nReduce over-abstraction by:\n- opposing development unless there is certainty of adequate water. We strongly support the EA’s insistence on a pause on certain planning proposals until there is assurance of suitable mechanisms to provide an adequate water supply, for both the residents of Greater Cambridge and the natural environment on which we depend.\n- requiring the highest water efficiency credentials for all new developments, including mandatory greywater collection and recycling (while recognising that the legislation to implement this is not yet adequate);\n- engaging with water companies, alongside expert community groups, such as the Cam Valley Forum24, and campaigning groups such as the Friends of the River Cam25, to accelerate solutions to over-abstraction, supporting those that are strategically planned, clearly costed and transparent, and compatible with commitments to reach net zero and halt biodiversity loss;\n- putting pressure on the water companies to take more concerted, urgent and innovative action to:\n- rapidly reduce abstraction from the Chalk aquifer, including by capping abstraction at today’s actual levels;\n- manage demand, avoiding reliance on voluntary individual behaviour change, through actions such as the prompt declaration of hosepipe bans, the accelerated introduction of universal metering and proactive encouragement of water collection and recycling e.g. water butt installation; and rapidly increase efforts to repair leaks.\n- opposing the plans for a water offsetting and credits system; it has become clear from carbon credit markets and concerns about the similar Biodiversity Net Gain approach that it is very hard to regulate and evaluate such mechanisms. As a result, they are highly unlikely to achieve the desired outcome in the short to medium term.\nReduce pollution by:\n- supporting the public pressure on Anglian Water to invest urgently in updating its smaller, older sewage treatment works and to halt illegal dumping of sewage into rivers; all wastewater installations and infrastructure that discharge into chalk streams and rivers should be upgraded to this end.\n- supporting Cam Valley Forum recommendations for investment in monitoring (particularly using Event Duration Monitors [EDMs]) and increased stormwater storage.\nMitigate flooding by:\n- pushing for the prioritisation of nature-based solutions, including restoration of flood plain habitats and appropriate vegetation management to slow down surface run-off, reduce the risk of flash flooding and minimise pollution26;\n- promoting the concept of, and principles behind the ‘sponge’ city and region27 approach: i.e. the creation of places with multiple areas of greenery, trees, ponds, soakaways, pocket parks, rain gardens and permeable paving to allow water to drain away, and with measures to store rainwater and runoff (e.g. water butts).\nFinally, Green-led councils would continue to oppose the unnecessary relocation of the Cambridge Waste Water Treatment Plant into the Green Belt.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_02_cambridge-and-south-cambridgeshire-green-parliamentary-candidates/content_54.html": "Sarah Nicmanis\nParlimentary Candidate for Cambridge\nI have been an active, enthusiastic and proud member of the Cambridge Green Party for 8 years. I have lived in Cambridge for over 20 years and am raising a 5-year old child with my partner. I have worked in both the education and housing sectors, and have observed the inequality of opportunity rife in our city.\nHere in Cambridge, the obsession with growth has left us with threatened water supplies, a stripped-back green belt, a completely broken transport system, totally unaffordable house prices and shocking inequality.\nAs a member of parliament, I would focus resources on reducing that disparity by campaigning passionately for sensible Green policies that work to reduce poverty, keep healthcare free, bring energy companies, railways and bus networks into public hands, making public transport the cheapest and easiest option, insulating our homes to reduce emissions and lower bills and taxing dirty profits.\nWe are the only party that is challenging business as usual and our support is growing, with many people telling us that they see us as the best alternative to the status-quo. We need to seize the moment and make Cambridge Green!”\nI have lived in Cambridgeshire for 15 years, am married, have 3 children and work for a large local technology company. I was also a parish councillor in Teversham for 9 years, where I worked on a variety of local community projects.\nBeing passionate about social justice and environmental issues, the Green Party has been my political home for about 7 years. Times are tough: we are living through a cost-of-living crisis while facing the twin threat of a climate and biodiversity emergency.\nThe Greens offer bold policies designed to tackle both, such as retrofitting homes for insulation, improving energy efficiency standards for new developments or investing into affordable and reliable public transport.\nThe future of South Cambridgeshire is bright but with a progressive Green MP it could be even brighter.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_newnham/content_55.html": "Peter Rees is the Cambridge and South Cambridgeshire Green Party candidate for Newnham Ward in the Cambridgeshire County Council elections which will be held on May 1st 2025.\nPeter Rees is the Cambridge and South Cambridgeshire Green Party candidate for Newnham Ward in the Cambridgeshire County Council elections which will be held on May 1st 2025.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_news_page_2/content_6.html": "Green Results for Cambridge City Council Elections 2024 3 May 2024 / 3 May 2024 by marke Abbey – Naomi Bennett Elected with 52% of vote. Coleridge – Sarah Nicmanis Second with 34% of vote. Newnham – Hugh Clough Elected with 46% of vote. Read more »\nStatement from Sarah Nicmanis Ahead of Local Elections 14 April 2024 / 14 April 2024 by marke Read more »\nLocal Green Party Releases Manifesto for 2024 8 April 2024 / 14 April 2024 by marke The full version of the manifesto can be found here. The shortened version is here. Read more »\nGreens Explain why Cambridge’s Social Housing is Broken 7 April 2024 / 14 April 2024 by marke Saran Nicmanis at Fanshawe Road flats, Coleridge Cambridge had just under 7350 council homes in September 20231 but, by March this year, there were still almost 28002 people on the waiting list, indicating that the City needs some 40% more social housing to give everyone a roof over their head. Cambridge City Council prides itself […] Read more »\nSpeech for Environment and Community Scrutiny Committee of Cambridge City Council 21 March 2024 / 14 April 2024 by marke Sarah Nicmanis, Green Party parliamentary candidate for Cambridge, speaking to the Environment and Community Scrutiny Committee on Thursday 21st March with reference to the Petition requesting that Cambridge City Council publically supports the Climate and Ecology Bill. I speak as the Green Party parliamentary candidate for Cambridge City and on behalf of our local party […] Read more »\nResponse to the Government’s ‘Case for Cambridge’ and ‘Guidance on Addressing Water Scarcity’ 18 March 2024 / 1 April 2024 by marke Read more »\nGreens Celebrate Success as Labour Drops Threat to St Thomas’s Square Park 11 March 2024 / 3 April 2024 by marke Read more »\nResponse to the Consultation on the Greater Cambridge Housing Strategy 2024 – 2029 5 March 2024 / 18 March 2024 by marke Read more »\nGreens Launch Petition for City Council to Support Crucial Plans 22 February 2024 by marke Read more »\nCambridge and South Cambridgeshire Green Party Parliamentary Candidates 5 February 2024 / 8 February 2024 by marke Read more »",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_author_daniellaycock/content_44.html": "30 April 2025 / 30 April 2025 by daniellaycock\nGreen party candidate Elliot Tong (Abbey), Kathryn Fisher (Histon and Impington), Darren Green (Romsey) and Peter Rees (Newnham) spent the final full day of campaigning in their tight marginals before a massive get out the vote action on Thursday led by over 50 volunteers. Fisher said: “Our aim is to win at least four Green […]\nRead more »\n25 April 2025 / 25 April 2025 by daniellaycock\nLike you, I really thought things might start to improve last summer when we finally got rid of the incompetent and corrupt Conservative government, but since then pensioners’ winter fuel payments have gone, the two-child benefit cap hasn’t been scrapped, and now the Labour government is targeting the disabled, by reducing PIP benefits. The cost-of-living […]\n15 April 2025 / 15 April 2025 by daniellaycock\nAdrian Ramsay MP came to Cambridge on Wednesday to join local activists on the campaign trail. Mr Ramsay, co-leader of the Green Party and MP for Waveney Valley, spent his time speaking to residents in key Cambridge wards and in Histon & Impington, where Greens are hoping to gain their first South Cambridgeshire representative. Mr […]",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2025_04_bob-ensch-i-thought-things-would-change-with-labour-theyre-not-so-thats-why-im-standing-to-be-mayor/content_8.html": "Like you, I really thought things might start to improve last summer when we finally got rid of the incompetent and corrupt Conservative government, but since then pensioners’ winter fuel payments have gone, the two-child benefit cap hasn’t been scrapped, and now the Labour government is targeting the disabled, by reducing PIP benefits.\nThe cost-of-living crisis deepens for working people, as energy bills soar, and meanwhile the wealthy get richer and richer. The Green Party is now the only progressive party left in British politics; that’s why I’m standing for mayor.\nHaving lived in South Cambridgeshire for 45 years and directed the Cambridge office of a national construction company for 15 years, I understand business, I’m passionate about sustainability, and the importance of developing the skills of local people.\nWatching how our politicians are failing residents has made me determined to drive meaningful change. Since retiring from paid work, I co-founded the FutureIN programme, which supports young people at risk of homelessness by helping them find work in construction. I’m also a trustee of It Takes a City CLT, developing small housing sites for the homeless in Greater Cambridge. As chair of the local Green Party and with my experience of managing teams, I bring strong leadership skills, underpinned by unwavering ethical values.\nThe rapid growth of our region driven by the life sciences and IT sectors has brought prosperity for some but also a housing crisis, failing infrastructure and deepening inequality, while public investment is missing the mark. Working people have been left to bear the brunt of rising costs, hitting low-income households most. Meanwhile, our vulnerability to climate change – through water shortages, flooding and biodiversity loss – demands urgent action.\nI will ensure development is carefully managed, prioritising the needs of the many over the few. I’ll deliver an integrated transport system, with more buses on more routes with simple and affordable fares. I’ll invest to end homelessness, fight for tenants’ rights and campaign for rent controls. I’ll build more social housing because affordable housing simply isn’t. I’ll ensure that housing developments include community facilities, and that homes are properly insulated.\nWe cannot ignore the looming water crisis any longer – I’ll take action to get it sorted, and I want to see more space for nature across the region.\nWe need to increase support for small businesses, and we need to grow the green economy too.\nLast month YouGov reported that 78 per cent of us would like to see extreme wealth taxed rather than have any more cuts to public services. But the other parties aren’t listening – we are, that’s our policy. The BBC recently reported that 80 per cent of us want more government action on climate change. But the two major parties are rowing back on the country’s net zero commitment. We’re not.\nThe Green Party is the only party listening to you on these issues. If you want real hope and real change that will deliver a better world for you and your children, vote Green.\nBob Ensch\nGreen Party candidate for Cambridgeshire and Peterborough Mayor",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_tag_adrian-ramsey/content_3.html": "Adrian Ramsay spends time with Cambridge campaigners in the run up to local elections on 1st May. 15 April 2025 / 15 April 2025 by daniellaycock Adrian Ramsay MP came to Cambridge on Wednesday to join local activists on the campaign trail. Mr Ramsay, co-leader of the Green Party and MP for Waveney Valley, spent his time speaking to residents in key Cambridge wards and in Histon & Impington, where Greens are hoping to gain their first South Cambridgeshire representative. Mr […] Read more » Adrian Ramsey Kathryn Fisher",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_author_green-party-admin/content_23.html": "22 March 2025 / 22 March 2025 by Green Party Admin\nCambridgeshire and Peterborough Green Party is proud and delighted to announce Bob Ensch as its candidate for the Cambridgeshire and Peterborough Mayoral Election. With a successful career in construction and a passion for empowering the next generation, Bob is ready to lead the region towards a sustainable and prosperous future. Bob currently is the programme […]\nRead more »\n4 February 2025 / 20 February 2025 by Green Party Admin\nFollowing the Chancellor of the Exchequers speech today, the Greens have expressed deep concerns about the current economic strategy by the Labour Government and the devastating impact it will have on the most vulnerable members of society. Green County council candidate, Kathryn Fisher explained: “The Chancellor is desperately scrabbling around for a plausible magic growth […]",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_author_elliecrane/content_38.html": "6 November 2023 / 4 February 2024 by elliecrane\nRead more »\n3 October 2023 / 22 March 2024 by elliecrane\n17 July 2023 by elliecrane\n11 July 2023 / 11 July 2023 by elliecrane\n19 May 2023 / 9 June 2023 by elliecrane\n12 May 2023 / 9 June 2023 by elliecrane\n24 April 2023 / 11 June 2023 by elliecrane",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_election_histon-impington-2024/content_25.html": "Kathryn Fisher is the Cambridge and South Cambridgeshire Green Party candidate for the Histon and Impington Ward in the Cambridgeshire County Council elections which will be held on May 1st 2025.\nGet Involved\nYou can join the campaign WhatsApp group here.\nOur Candidate\nHaving grown up in Histon where she studied at Impington Village College before studying at Cambridge University, Kathryn has a broad, lived experience of Cambridgeshire and cares deeply about the people who live there. She currently works as a landscape designer, with a particular interest in biodiversity and nature-based solutions.\nShe believes in the bold positive change and that all issues require a holistic and long- term approach. It is clear to her that problems such as inequality and the climate crisis are intrinsically linked and that we must do all that we can to rectify the current state of climate emergency. There can be no climate justice without social justice, so whatever the proposed solution is, it must work ethically as well as environmentally.\nShe is a proud feminist and will always fight for women’s autonomy over their own bodies. She is an LGBTQAI+ ally and is especially passionate about protecting the trans community against violence. She will fight for the rights of minorities and those who suffer under discrimination. She is an antiracist and continues to educate herself around racial discrimination. Kathryn stays informed on difficulties facing the disabled community and cares greatly about accessibility. She opposes the genocide of the Palestinian population and backs the Green Party in its calls for a ceasefire and the end to all arms sales to Israel.\nKathryn believes social mobility is the cornerstone to a thriving society. Cambridge is the most unequal city in the UK as well as one of the most unaffordable. During the pandemic she volunteered at Waterbeach foodbank and at Cambridge Community Kitchen so it is obvious to her how critical the situation is. To mirror the Green Party’s taxation policy, she is an advocate for a wealth tax to redistribute wealth through the means of a properly funded welfare state. That includes substantial investment in the NHS and nationalisation of public services. She supports the introduction of a Universal Basic Income as a way to immediately end poverty in this country and to liberate everyone to pursue the life that they deserve. An important part of social mobility includes sustainable public transport infrastructure for which Histon, Impington and Orchard Park would benefit hugely.\nHer background in architecture means that she has a keen interest in the housing crisis. She is an advocate for the creation of council housing which she believes has the potential to innovate low-cost housing design in the UK through the reintroduction of architects into local councils, giving them the opportunity to reinvent the sustainable, modern home. She would also like to see rent controls introduced so that tenants can have greater stability as well as the capacity to save for their own home\nYou can see Kathryn talk on local issues at a recent General Election candidate debate here.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_newnham_contact/content_71.html": "Skip to content\nSkip to footer\nCambridge & South Cambridgeshire\nMenu\nNews\nAbout\nWhat We Stand For\nOur People\nContact Us\nGet Involved\nEvents\nVolunteer\nElection\nCandidates for Local Elections May 2025\nHiston and Impington Ward\nAreas\nNewnham Ward\nJoin\nDonate\nJoin\nDonate\nMenu\nContact Us\nEmail:\ncontact@cambridge.greenparty.org.uk\nTo top",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_manifesto_2024_/content_67.html": "Skip to content\nSkip to footer\nCambridge & South Cambridgeshire\nMenu\nNews\nAbout\nWhat We Stand For\nOur People\nContact Us\nGet Involved\nEvents\nVolunteer\nElection\nCandidates for Local Elections May 2025\nHiston and Impington Ward\nAreas\nNewnham Ward\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nManifesto\n2024\n2024\nTo top",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2025_04_greens-target-key-seats-on-final-day-of-campaigning/content_21.html": "Green party candidate Elliot Tong (Abbey), Kathryn Fisher (Histon and Impington), Darren Green (Romsey) and Peter Rees (Newnham) spent the final full day of campaigning in their tight marginals before a massive get out the vote action on Thursday led by over 50 volunteers.\nFisher said:\n“Our aim is to win at least four Green councillors and we are within touching distance of doing just that. We have brought real hope to this campaign, the hope that a group of Green councillors can push an incoming Lib Dem administration to be bolder and braver in delivering the real change our county needs.\nChair of Cambridge and South Cambridgeshire Greens and Mayoral candidate Bob Ensch said:\n“Our teams have been working incredibly hard for communities and getting things done. We want all four of our target candidates elected on Friday.”\nEND\nNOTES TO EDITORS\nThe Greens are targeting:\nElliot Tong – Abbey\nKathryn Fisher – Histon and Impington\nDarren Green – Romsey\nPeter Rees – Newnham",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk/content_1.html": "The Green Party campaigns for fair, green policies that make life better. We’d love you to join us for a greener Cambridge & South Cambridgeshire!\nGet Involved\nCambridge & South Cambridgeshire Green Party is run by volunteers and we always welcome more help. If you’re interested, please fill in the volunteer form and we’ll be in touch.\nLatest News\n- Greens target key seats on final day of campaigning\n- Bob Ensch: I thought things would change with Labour – they’re not so that’s why i’m standing to be mayor\n- Adrian Ramsay spends time with Cambridge campaigners in the run up to local elections on 1st May.\n- Bob Ensch Announced as Green Candidate for Cambridgeshire and Peterborough Mayoral Election\n- Greens Call for urgent investment in social housing, climate action, and fair wages",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_02_greens-launch-petition-for-city-council-to-support-crucial-plans/content_41.html": "Cambridge is yet to sign up to Climate and Ecology Bill despite the city being a world leader in climate and environmental science\nTHE GREEN PARTY is calling on the public to sign a petition urging Cambridge City Council to declare support for vital legislation.\nAlmost 900 organisations, politicians and scientists – including Cambridgeshire County Council – have backed the Climate and Ecology Bill originally introduced to Parliament by Caroline Lucas, Green MP for Brighton.\nBut the City Council is yet to join the list of nearly 350 local authorities – including Cambridgeshire County Council – that are supporting the Bill, despite cross-party support.\nAnd the Green Party believes that Cambridge, a city whose University and businesses are renowned around the world for their excellence in climate and environmental science, should stand up to be counted.\nSarah Nicmanis, the Green Party’s prospective parliamentary candidate, said: “Over the last couple of years, Cambridge has experienced directly the impacts of climate change.\n“Drought has caused our chalk streams to periodically dry up. Extreme rainfall events and winds have caused flooding and tree loss. Elderly and vulnerable residents have struggled with stiflingly hot days.\n“New climate and ecology legislation would mean that we could start to put in motion some of the urgently needed action to reverse the frightening changes that we are facing.”\nThe Climate and Ecology Bill is due back before in the House of Commons in March.\nThe Greens need at least 50 signatures from people who live, work or study in Cambridge by March 7 in order to take the petition before the City Council on March 21 (see details below).\nThe cross-party Bill requires the UK Government to develop and achieve a new environmental strategy to:\n- reduce greenhouse gas emissions in line with the 1.5°C required under the UK’s Paris Agreement obligations;\n- set nature measurably on the path to recovery by 2030;\n- prioritise nature in decision-making;\n- end fossil fuel production and imports as rapidly as possible; and\n- provide for re-training for those currently working in fossil fuel industries.\nGreen Party city councillors tried to introduce a motion backing the Bill in May 2021. It was supported by the Liberal Democrat and Independent groups, but not by Labour.\nNow the Cambridge and South Cambridgeshire Green Party has launched a petition, which calls on Cambridge City Council to:\n- Support the cross-party Climate and Ecology Bill;\n- Inform the local media of this decision;\n- Write to our local MP, Daniel Zeichner, asking him to support the Bill. He is not on the list of over 150 parliamentarians who have declared their support; and\n- Write to Zero Hour, the organisers of the cross-party campaign for the CE Bill, expressing Cambridge City Council’s support (councils@zerohour.uk).\nAnyone eligible can sign the petition here.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2023_10_local-green-party-responds-to-lapsed-making-connections-plans/content_72.html": "Labour and Lib Dems’ decision to cancel the plans was “for the wrong reasons”\nSarah Nicmanis, Cambridge Green Party Prospective Parliamentary Candidate, has criticised Labour and Lib Dem politicians, saying that they backed out of the plans for a congestion charge put forward in the Making Connections consultation for the wrong reasons. “The right reason would be because they had listened to the people during the consultation process, not because they think they would lose votes in the next election.”\nThe Cambridge and South Cambridgeshire Green Party (CSCGP) has now published its position paper (First Steps Towards a Plan B for transport in the Cambridge Area – A Greener Fairer Approach 18.10.23) confirming its views on the possible new directions of the Making Connections plans. The party holds that bus network and active travel network improvements must be delivered soon, and well. In order for this to happen in parallel with the wishes of the public, a large programme of communication and engagement needs to be quickly put into place to consult on new ideas of how the funds for the bus and active travel network are going to be put into place.\nSarah Nicmanis said “The most important thing now is that bus network improvements are delivered soon, and well. This will require a large programme of communication and engagement with the public. There must be no funding mechanism imposed until significant improvements to the bus network have been rolled out and shown to be a success.”\nShe noted that the idea of the Workplace Parking Levy, now one of the few remaining options being looked at, had long been put forward by the Cambridge Green Party. “In both the 2021 and 2022 consultations, we Greens suggested that a Workplace Parking Levy would help to ensure that large companies based here, which benefit enormously from Cambridge’s buoyant economy and international reputation, contribute fairly to the support and development of the transport system so urgently needed.\nIn addition to the Workplace Parking Levy, which the Cambridge and South Cambridgeshire Green Party understands would not bring in enough revenue alone, the party also encourages consultation on what the public thinks about a council tax precept that our local Green Councillors have spoken in favour of which would be a small addition to council tax, under £200 a year for a Band D property, which is a more fairly charged tax than the originally proposed congestion charge which was a regressive, ‘blanket’ tax. As an additional measure, a tourist/visitor tax which could either be collected via Cambridge Business Improvement District (Cambridge BID) at a £2 per night occupancy. This could effectively be named a ‘stressed-resource tax’ to recognise the use of water in our water-stressed region that is supplied via the chalk aquifer.\nProspective Parliamentary Candidate Sarah Nicmanis",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_news_page_3/content_32.html": "Greens accuse Cambridge Water of failing to take crisis seriously 6 November 2023 / 4 February 2024 by elliecrane Read more »\nLocal Green Party responds to lapsed Making Connections plans 3 October 2023 / 22 March 2024 by elliecrane Read more »\nGreens call on Cambridge Water to speed up installation of meters 17 July 2023 by elliecrane Read more »\nGreens condemn “Silicon Valley of Europe” plans for Cambridge 11 July 2023 / 11 July 2023 by elliecrane Read more »\nAlternative to the Cambourne busway could bring greater benefits at smaller cost 12 May 2023 / 9 June 2023 by elliecrane Read more »\nGreens join protest against “inhumane” government asylum bill 24 April 2023 / 11 June 2023 by elliecrane Read more »",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_category_cambridgeshire/content_27.html": "25 April 2025 / 25 April 2025 by daniellaycock\nLike you, I really thought things might start to improve last summer when we finally got rid of the incompetent and corrupt Conservative government, but since then pensioners’ winter fuel payments have gone, the two-child benefit cap hasn’t been scrapped, and now the Labour government is targeting the disabled, by reducing PIP benefits. The cost-of-living […]\nRead more »",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_newnham_newsletters/content_47.html": "Skip to content\nSkip to footer\nCambridge & South Cambridgeshire\nMenu\nNews\nAbout\nWhat We Stand For\nOur People\nContact Us\nGet Involved\nEvents\nVolunteer\nElection\nCandidates for Local Elections May 2025\nHiston and Impington Ward\nAreas\nNewnham Ward\nJoin\nDonate\nJoin\nDonate\nMenu\nNewnham Newsletters\nNewnham Home\nNewsletters\nContact\nNewnham.Winter.2024\nDownload\nNewnham Newsletter October.2024\nDownload\nNewnham Newsletter July2024\nDownload\nNewnham Update Spring 2024\nnewnham_spring_2024\nDownload\nNewnham Update Winter 2023\nnewnham_winter_2023\nDownload\nNewnham Update Summer 2023\nnewnham_summer_2023\nDownload\nTo top",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_05_green-results-for-cambridge-city-council-elections-2024/content_26.html": "3 May 2024 / 3 May 2024 by marke\nElected with 52% of vote.\nSecond with 34% of vote.\nElected with 46% of vote.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2025_03_bob-ensch-announced-as-green-candidate-for-cambridgeshire-and-peterborough-mayoral-election/content_28.html": "Cambridgeshire and Peterborough Green Party is proud and delighted to announce Bob Ensch as its candidate for the Cambridgeshire and Peterborough Mayoral Election. With a successful career in construction and a passion for empowering the next generation, Bob is ready to lead the region towards a sustainable and prosperous future.\nBob currently is the programme lead for FutureIN, an initiative dedicated to inspiring and upskilling young people in the construction industry. As a former director at Morgan Sindall Construction based in Cambridgeshire and Peterborough, he was at the forefront of delivering innovative projects that prioritised sustainability and positive impacts on local communities.\nBob was as a Non-Executive Director for the Employment and Skills Board for two years on Cambridgeshire and Peterborough Combined Authority, where he championed employment opportunities for disadvantaged young people in the region.\nBob’s commitment to environmental stewardship and social equity makes him an ideal candidate. His vision for Cambridgeshire and Peterborough includes investing in green infrastructure, and fostering a vibrant, inclusive economy.\nBob said: “I am thrilled to represent the Green Party in this mayoral election. Together, we can build a region that not only thrives economically but also leads the way in environmental innovation and social progress.”\nThe Green Party urges residents across Cambridgeshire and Peterborough to support Bob Ensch’s campaign and join the movement for a greener and brighter future.\nJoin the Green Party today: https://join.greenparty.org.uk/",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_tag_green-party/content_40.html": "Greens Call for urgent investment in social housing, climate action, and fair wages 4 February 2025 / 20 February 2025 by Green Party Admin Following the Chancellor of the Exchequers speech today, the Greens have expressed deep concerns about the current economic strategy by the Labour Government and the devastating impact it will have on the most vulnerable members of society. Green County council candidate, Kathryn Fisher explained: “The Chancellor is desperately scrabbling around for a plausible magic growth […] Read more » Darren Green Economy Green Party Kathryn Fisher",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_04_our-broken-social-housing-system/content_24.html": "Cambridge had just under 7350 council homes in September 20231 but, by March this year, there were still almost 28002 people on the waiting list, indicating that the City needs some 40% more social housing to give everyone a roof over their head. Cambridge City Council prides itself on the speed with which it is building new homes and indeed, thanks to an injection of funding through the Greater Cambridge Partnership, it has built more than some local authorities: 316 council houses in the 4-year period 2013/14 to 2017/18, with plans and funding in place for 500 more3. But that still leaves many people stuck on the waiting list.\nHowever, the City Council’s focus is now almost entirely on the misguided policy of ‘affordable’ housing. The Office of National Statistics deems a property ‘affordable’ if a householder has to spend only 30% of their gross income on rent, whilst acknowledging that there is no widely accepted standard on this4. In fact, the term ‘affordable’ is being used for a ragbag of situations encompassing social rented housing (council homes), affordable rent, subsidised home ownership, starter homes, discounted market sale housing and shared ownership5. The proposed 2024-2029 Greater Cambridge Housing Strategy7, the consultation on which closed last month, barely mentions social housing, stating only that the City Council will ‘provide some new council homes at 80% of market rents targeted at local workers’, although national guidance is that these should have rents at no more than 40-50% of the market rent6.\nSarah Nicmanis, Green Party candidate for Coleridge in the upcoming City Council elections, says: “Let’s be clear: affordable housing does not equate to social housing. The rush to provide it, without making enough available for those on council home waiting lists, will lead to growing homelessness. In Cambridge, developers’ profits appear too often to over-ride community needs. We urgently need a massive increase in the supply of genuine social housing. Radical solutions at national level are needed but, until then, we can be much more vigilant locally. Replacing social housing at 40% of market rent with so-called affordable housing at 80% might seem like a short-term solution for older homes with spiralling repair costs. However, it’s destroying the safety net for our most vulnerable families and building a major headache: councils will end up with soaring temporary accommodation bills, thus increasing pressure for cuts in council services, with every resident ultimately losing out.”\nWith the current astronomical rental prices in Cambridge (often over £1500 a month8), a vast number of new homes will be out of reach for local people; in Cambridge about four out of five people who rent properties cannot afford the average rent9. Cllr Elliot Tong (Abbey) says: “For those people who have had to move out of their council homes temporarily, because of demolition prior to re-building, the new rents may make their return impossible. This will further disrupt long-established local communities, the existence of which is so often overlooked by the wealthier, more itinerant, university and technology -based component of the city’s population.”\nThe Green Party considers that median local rents should take up no more than about 27% of gross income, for a one-income household on a median salary – this would be a ‘Living Rent’. At present, in Cambridge, as in other apparently wealthy cities such as Bristol11, this is far from possible. As we point out in our consultation response to the proposed new Housing Strategy12, commitment to the Right Homes, Right Place, Right Price charter13 would ensure that all new homes are built to the highest environmental standards, prioritising brownfield sites, while requiring all new developments to come with investment in local services.\nThe Housing Strategy is not yet approved, but planning applications have been submitted for the demolition of old council homes and their replacement with so-called affordable housing, such as the Ekin Road and recently approved Fanshawe Road developments. We can expect to see many more. The reasons why this is happening are many and not immediately resolvable: lack of suitable building space, the Right to Buy scheme (now widely recognised as disastrous)10, and the increasingly dilapidated council housing stock. But there are key steps we can take: the Housing Strategy must be more transparent about the current housing crisis; clearer policies should be set out for new social housing, with urgent discussion initiated on funding shortfalls; and current planning applications need much better scrutiny.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_category_uncategorised/content_52.html": "30 April 2025 / 30 April 2025 by daniellaycock\nGreen party candidate Elliot Tong (Abbey), Kathryn Fisher (Histon and Impington), Darren Green (Romsey) and Peter Rees (Newnham) spent the final full day of campaigning in their tight marginals before a massive get out the vote action on Thursday led by over 50 volunteers. Fisher said: “Our aim is to win at least four Green […]\nRead more »\n15 April 2025 / 15 April 2025 by daniellaycock\nAdrian Ramsay MP came to Cambridge on Wednesday to join local activists on the campaign trail. Mr Ramsay, co-leader of the Green Party and MP for Waveney Valley, spent his time speaking to residents in key Cambridge wards and in Histon & Impington, where Greens are hoping to gain their first South Cambridgeshire representative. Mr […]\n22 March 2025 / 22 March 2025 by Green Party Admin\nCambridgeshire and Peterborough Green Party is proud and delighted to announce Bob Ensch as its candidate for the Cambridgeshire and Peterborough Mayoral Election. With a successful career in construction and a passion for empowering the next generation, Bob is ready to lead the region towards a sustainable and prosperous future. Bob currently is the programme […]\n18 November 2024 / 18 November 2024 by marke\nCambridge Water Failures Pose Threat To Environment And Water Supply The annual reviews by Ofwat, the Environment Agency and the Department for Environment, Food and Rural Affairs (Defra) of the performance of England’s water companies were published on 21 October 1. Jean Glasberg, Green Party City Councillor, says: “These letters make shocking reading. They provide […]\n30 September 2024 / 30 September 2024 by marke\nKathryn Fisher has been selected as Green Party candidate for the Histon and Impington by-election of 24 October 2024. More information here.\n15 July 2024 / 15 July 2024 by marke\nUrgent action needed to tackle pollution, flooding and water shortages Cambridgeshire residents are facing rising water bills with proposed price hikes of 13-14%1. But we are confronted with polluted rivers and failing sewage treatment plants, dried up chalk streams, and both flooding and drought which are damaging agriculture, roads and other infrastructure and affecting our […]\n4 June 2024 / 5 June 2024 by marke\nThe local Green Party prospective parliamentary candidates for the General Election are listed here.\n31 May 2024 / 5 June 2024 by marke\nMiranda Fyfe has been selected as Green Party prospective parliamentary candidate in South Cambridgeshire for the General Election 2024. Miranda has lived in Cambridgeshire for over 30 years. An active member of the Stapleford village community, she has worked in NHS management and is a keen campaigner for Active Travel and public transport, who practises […]\n3 May 2024 / 3 May 2024 by marke\nAbbey – Naomi Bennett Elected with 52% of vote. Coleridge – Sarah Nicmanis Second with 34% of vote. Newnham – Hugh Clough Elected with 46% of vote.\n14 April 2024 / 14 April 2024 by marke",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_03_speech-for-environment-and-community-scrutiny-committee-of-cambridge-city-council/content_15.html": "Sarah Nicmanis, Green Party parliamentary candidate for Cambridge, speaking to the Environment and Community Scrutiny Committee on Thursday 21st March with reference to the Petition requesting that Cambridge City Council publically supports the Climate and Ecology Bill.\nI speak as the Green Party parliamentary candidate for Cambridge City and on behalf of our local party Cambridge and South Cambridgeshire Green Party. Last month we released a petition calling for Cambridge City Council to declare its public support for the Climate and Ecology Bill, as of today re-named the Climate and Nature Bill. This Bill was introduced to Parliament by Green Party MP Caroline Lucas in 2020, and today was introduced again, as a cross-party bill by Alex Sobel, MP.\nOur petition was signed by 86 people and quickly exceeded the 50 signatories that are required to bring it before this committee. We thank all those individuals who signed and showed their support for this initiative. Copies of the wording of the petition have been distributed around the chamber for you to refer to in the debate that follows my speech.\nWe ask that the representatives of our city who sit on Cambridge City Council declare their support for the Bill openly, and publicly in the local media. Cambridgeshire County Council has signed up to the Bill. The City Council is noticeable by its absence from the list of almost 350 local authorities that are in support. Cambridge is renowned worldwide for its expertise in climate and environmental science. By actively endorsing this bill, we reaffirm our city’s commitment to global leadership in sustainability and will inspire others to follow suit. With the Bill going before Parliament again, it is more urgent than ever that it gets full support across the country.\nOn Tuesday this week, the World Meteorological Organization sounded a ‘red alert’ to the world, having released a report confirming that 2023 was the hottest year on record by a clear margin, with records “once again broken, and in some cases smashed” for key indicators such as greenhouse gas pollution, surface temperatures, ocean heat and acidification, sea level rise, Antarctic sea ice cover and glacier retreat. In Cambridgeshire, we are seeing the dramatic effects of recent extreme weather events: intense rainfall partnered with hotter and drier summers are making roads unsafe for the public to use; agriculture has been badly hit by flooded fields; and chalk streams dried up during last years’ drought. As local residents and business owners, we are increasingly vulnerable to the impacts of extreme weather and climate events, as their frequency continues to rise.\nThe cross-party Climate and Nature Bill would require the UK to develop and achieve a new, more dynamic, necessarily urgent environmental strategy to: firstly, reduce greenhouse gases in line with the 1.5 degrees required under the UK’s Paris Agreement obligations;\n- secondly, instate a measured path to recovery by 2030;\n- thirdly, put nature, upon which our very existence depends;\n- fourthly, end fossil fuel production and imports as rapidly as possible; and\n- finally, provide for re-training for those currently employed by the fossil fuel industries.\nWe also request the Council to write to our MP Daniel Zeichner asking him to publicly support the Bill, along with the 130 or so other MPs who have already done so. And it’s not just councils and MPs who are behind the Bill: 881 organisations, politicians and scientists from all over the UK and across 12 political parties, as well as 42,000 members of the public who back it.\nWe urge Cambridge City Council to join other councils in solidarity, publicly support the Bill, and genuinely show that they and the City are true leaders in fighting climate change.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_05_miranda-fyfe-selected-as-green-party-candidate-for-south-cambridgeshire/content_49.html": "Miranda Fyfe has been selected as Green Party prospective parliamentary candidate in South Cambridgeshire for the General Election 2024.\nMiranda has lived in Cambridgeshire for over 30 years. An active member of the Stapleford village community, she has worked in NHS management and is a keen campaigner for Active Travel and public transport, who practises what she preaches. More information here.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_news/content_2.html": "Greens target key seats on final day of campaigning 30 April 2025 / 30 April 2025 by daniellaycock Green party candidate Elliot Tong (Abbey), Kathryn Fisher (Histon and Impington), Darren Green (Romsey) and Peter Rees (Newnham) spent the final full day of campaigning in their tight marginals before a massive get out the vote action on Thursday led by over 50 volunteers. Fisher said: “Our aim is to win at least four Green […] Read more »\nBob Ensch: I thought things would change with Labour – they’re not so that’s why i’m standing to be mayor 25 April 2025 / 25 April 2025 by daniellaycock Like you, I really thought things might start to improve last summer when we finally got rid of the incompetent and corrupt Conservative government, but since then pensioners’ winter fuel payments have gone, the two-child benefit cap hasn’t been scrapped, and now the Labour government is targeting the disabled, by reducing PIP benefits. The cost-of-living […] Read more »\nAdrian Ramsay spends time with Cambridge campaigners in the run up to local elections on 1st May. 15 April 2025 / 15 April 2025 by daniellaycock Adrian Ramsay MP came to Cambridge on Wednesday to join local activists on the campaign trail. Mr Ramsay, co-leader of the Green Party and MP for Waveney Valley, spent his time speaking to residents in key Cambridge wards and in Histon & Impington, where Greens are hoping to gain their first South Cambridgeshire representative. Mr […] Read more » Adrian Ramsey Kathryn Fisher\nBob Ensch Announced as Green Candidate for Cambridgeshire and Peterborough Mayoral Election 22 March 2025 / 22 March 2025 by Green Party Admin Cambridgeshire and Peterborough Green Party is proud and delighted to announce Bob Ensch as its candidate for the Cambridgeshire and Peterborough Mayoral Election. With a successful career in construction and a passion for empowering the next generation, Bob is ready to lead the region towards a sustainable and prosperous future. Bob currently is the programme […] Read more » Cambridgeshire Mayoral Election Peterborough\nGreens Call for urgent investment in social housing, climate action, and fair wages 4 February 2025 / 20 February 2025 by Green Party Admin Following the Chancellor of the Exchequers speech today, the Greens have expressed deep concerns about the current economic strategy by the Labour Government and the devastating impact it will have on the most vulnerable members of society. Green County council candidate, Kathryn Fisher explained: “The Chancellor is desperately scrabbling around for a plausible magic growth […] Read more » Darren Green Economy Green Party Kathryn Fisher\nGreens call for urgent action following publication of regulators’ reviews of the water industry 18 November 2024 / 18 November 2024 by marke Cambridge Water Failures Pose Threat To Environment And Water Supply The annual reviews by Ofwat, the Environment Agency and the Department for Environment, Food and Rural Affairs (Defra) of the performance of England’s water companies were published on 21 October 1. Jean Glasberg, Green Party City Councillor, says: “These letters make shocking reading. They provide […] Read more »\nKathryn Fisher Selected as Green Party Candidate for Histon and Impington By-Election 30 September 2024 / 30 September 2024 by marke Kathryn Fisher has been selected as Green Party candidate for the Histon and Impington by-election of 24 October 2024. More information here. Read more »\nGreens Call for Declaration of a Water Emergency in Cambridge 15 July 2024 / 15 July 2024 by marke Urgent action needed to tackle pollution, flooding and water shortages Cambridgeshire residents are facing rising water bills with proposed price hikes of 13-14%1. But we are confronted with polluted rivers and failing sewage treatment plants, dried up chalk streams, and both flooding and drought which are damaging agriculture, roads and other infrastructure and affecting our […] Read more »\nLocal Party Candidates for General Election 2024 4 June 2024 / 5 June 2024 by marke The local Green Party prospective parliamentary candidates for the General Election are listed here. Read more »\nMiranda Fyfe Selected as Green Party Candidate for South Cambridgeshire 31 May 2024 / 5 June 2024 by marke Miranda Fyfe has been selected as Green Party prospective parliamentary candidate in South Cambridgeshire for the General Election 2024. Miranda has lived in Cambridgeshire for over 30 years. An active member of the Stapleford village community, she has worked in NHS management and is a keen campaigner for Active Travel and public transport, who practises […] Read more »",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_manifesto_2024__climate-emergency/content_65.html": "Cambridge City Council, Cambridgeshire County Council and South Cambridgeshire District Council all declared climate and ecological emergencies in 2019. Cambridgeshire is one of the hottest parts of the UK, while globally 2023 was the hottest year on record and by a clear margin; a number of climatic tipping points, with multiple grave consequences, may soon be upon us. We must therefore continue to push for effective action appropriate to the scale of these threats. With international agreements on climate change falling far short of what is needed, work at a local level is more important than ever.\nClimate justice and social justice are inextricably linked. The Green Party of Cambridge and South Cambridgeshire (GPCSC) endorses the Doughnut Economics model (the notion that society must meet everyone’s needs without exceeding the capacity of our natural resources to support us)4; we now want to see the concept fully honoured and acted upon. Put simply, the levels of growth proposed for the city and region in the coming decades go far beyond what the earth can support, not least where water is concerned (See Caring for our Rivers and Streams, Safeguarding Water Supplies and Addressing Flooding).\nGreen-led Councils would:\n- keep the linked issues of social justice and the climate/ecological emergencies at the heart of every decision;\n- encourage and support businesses and institutions in Cambridge and South Cambridgeshire to adopt more ambitious net-zero commitments and implement actions to reach net-zero carbon by 2030 at the latest, in line with the Cambridge Climate Change Charter;\n- continue to put pressure on large institutions, including the public sector pensions fund and the local universities, to break their financial ties with the fossil fuel industry;\n- help to make Cambridge and South Cambridgeshire more resilient to the effects of climate change, for example by ensuring buildings remain habitable in extreme weather, and encouraging businesses to include weather extremes in their business continuity strategies;\n- take every opportunity to promote awareness of the benefits of, and support a shift towards, more plant-based diets, working together to this end with local businesses and co-operatives;\n- build on the “Green Transport Revolution” that will reduce overall traffic and accelerate the shift to electric vehicles by installing many more free or low-cost charging points, accessible to existing residents and standard in all new builds, and introducing appropriate safety regulations including clear guidelines on which vehicles can use which routes;\n- encourage landowners to prioritise biodiversity and sustainable agricultural practices;\n- continue to build on Cambridge’s achievements as a Sustainable Food City by promoting local sustainable food growing initiatives including local growers’ markets and community initiatives such as CoFarm5 and Cambridge Food Hub6, and work to provide sufficient allotment space to meet demand in existing and planned neighbourhoods.\n| 4 | https://www.kateraworth.com/doughnut/ |\n| 5 | https://www.cofarm.co |\n| 6 | https://cambridgefoodhub.org |",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_tag_darren-green/content_37.html": "Greens Call for urgent investment in social housing, climate action, and fair wages 4 February 2025 / 20 February 2025 by Green Party Admin Following the Chancellor of the Exchequers speech today, the Greens have expressed deep concerns about the current economic strategy by the Labour Government and the devastating impact it will have on the most vulnerable members of society. Green County council candidate, Kathryn Fisher explained: “The Chancellor is desperately scrabbling around for a plausible magic growth […] Read more » Darren Green Economy Green Party Kathryn Fisher",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_author_marke_page_2/content_48.html": "18 March 2024 / 1 April 2024 by marke\nRead more »\n11 March 2024 / 3 April 2024 by marke\n5 March 2024 / 18 March 2024 by marke\n22 February 2024 by marke\n5 February 2024 / 8 February 2024 by marke",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_manifesto_2024__green-future/content_12.html": "As a society we are facing linked climate, nature and inequality crises, and more and more of us are struggling from day to day simply to get by. The Green Party of England and Wales has a vision for a Green Recovery that will both promote social justice and tackle the climate and ecological emergencies1. Policies to reverse inequality, climate breakdown and shrinking biodiversity are at the very heart of our thinking, not optional elements that could be sacrificed to untrammelled growth.\nFor real progress, we need more Green voices in Parliament and ambitious, evidence-based policies promoting both social justice and climate justice.\n2024-2025 promises to be a critical year for Cambridge. It will bring major new science and technology developments (already approved and many under construction), and a consequent rapid increase in population and house building. Extreme weather events are predicted to continue, adding pressures of flooding, water shortages and heat stress.The next stage in the development of the Greater Cambridge Local Plan may be initiated. In addition, Cambridge 2050, the new and revised version of the 2040 strategy for the region, put forward by central government without consultation, may begin to take shape. This government strategy would have a huge impact on everyone in the region; Greens will robustly challenge it and support local government bodies in scrutinising it and pointing out the lack of consideration given to water supply, transport strategy and waste water treatment2. Greens will also continue to oppose the unnecessary relocation of the Cambridge Waste Water Treatment Plant into the Green Belt.\nWith the above context in mind, this manifesto focuses on what Green policies could achieve here in Cambridge and in South Cambridgeshire, as the number of Green councillors continues to rise.\nWe currently have five Green local councillors in Cambridge, three in Abbey ward and two in Newnham. They are working tirelessly on behalf of their residents and businesses while pushing for wider change across the City and beyond.\nThe City Council held elections on 2nd May 2024 and we were campaigning to secure more Green seats so as to become an even more powerful voice for social and environmental justice.\nA General election has been called for 4th July 2024, when all residents of Cambridge and South Cambridgeshire will have an opportunity to cast their vote for a local Green MP candidate; all such votes will contribute much-needed funds towards the Parliamentary administrative costs of those Green MPs who are elected elsewhere in the country, thus ensuring a more powerful and effective challenge to government – whoever is in charge3.\nResidents in South Cambridgeshire will have their next local elections in 2025 – when the whole of the County Council is up for election – and then in 2026, when South Cambridgeshire District Council has its elections. In the meantime, we’re aware that Council decisions made within Cambridge City have an impact on the lives of people throughout the South Cambridgeshire district surrounding the city.\nAs a small group within the City Council, our Green Councillors’ priority is to respond to the needs of their constituents, while campaigning to make the Council’s policies and practices as green as possible, through fair solutions that make life better for all.\nHere then, is our vision for Green-led Councils:\n- Real Action on the Climate Emergency\n- A Fairer, More Equal Society\n- Adequate, Available and Affordable Housing and an End to Homelessness\n- Comfortable, Energy-Efficient Buildings\n- A Green Transport Revolution\n- Protecting Nature and Green Spaces for Everyone\n- Caring for our Rivers and Streams, Safeguarding Water Supplies and Addressing Flooding\nApproved – Cambridge and South Cambridgeshire Green Party Members 28/03/24.\n| 1 | https://www.greenparty.org.uk/political-programme.html |\n| 2 | https://assets.publishing.service.gov.uk/media/65f1d8edff11704896615973/The_Case_for_Cambridge_March_2024.pdf |\n| 3 | Opposition parties receive funding towards Parliamentary business according to a set formula, referred to as ‘Short Money’. See https://commonslibrary.parliament.uk/research-briefings/sn01663/ |",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_tag_cambridgeshire/content_53.html": "Bob Ensch Announced as Green Candidate for Cambridgeshire and Peterborough Mayoral Election 22 March 2025 / 22 March 2025 by Green Party Admin Cambridgeshire and Peterborough Green Party is proud and delighted to announce Bob Ensch as its candidate for the Cambridgeshire and Peterborough Mayoral Election. With a successful career in construction and a passion for empowering the next generation, Bob is ready to lead the region towards a sustainable and prosperous future. Bob currently is the programme […] Read more » Cambridgeshire Mayoral Election Peterborough",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_04_local-green-party-releases-manifesto-for-2024/content_64.html": "8 April 2024 / 14 April 2024 by marke\nThe full version of the manifesto can be found here. The shortened version is here.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_09_kathryn-fisher-selected-as-green-party-candidate-for-histon-and-impington-by-election/content_33.html": "Kathryn Fisher has been selected as Green Party candidate for the Histon and Impington by-election of 24 October 2024. More information here.\nKathryn Fisher has been selected as Green Party candidate for the Histon and Impington by-election of 24 October 2024. More information here.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_election_candidates-for-local-elections-2025/content_34.html": "Candidate for Mayor for the Cambridgeshire and Peterborough Combined Authority\nCandidates for Cambridgeshire County Council Elections 2025\nCambridge City\nSouth Cambridgeshire\nBar Hill – Portia Northwood-Kilsby\nCambourne – Marcus Pithcaidy\nCottenham & Willingham – Zak Karimjee\nDuxford – Sophi Berridge\nFulbourn – Ellie Crane\nCambourne – Marcus Pithcaidy\nCottenham & Willingham – Zak Karimjee\nDuxford – Sophi Berridge\nFulbourn – Ellie Crane",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_tag_peterborough/content_29.html": "Bob Ensch Announced as Green Candidate for Cambridgeshire and Peterborough Mayoral Election 22 March 2025 / 22 March 2025 by Green Party Admin Cambridgeshire and Peterborough Green Party is proud and delighted to announce Bob Ensch as its candidate for the Cambridgeshire and Peterborough Mayoral Election. With a successful career in construction and a passion for empowering the next generation, Bob is ready to lead the region towards a sustainable and prosperous future. Bob currently is the programme […] Read more » Cambridgeshire Mayoral Election Peterborough",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_manifesto_2024__affordable-housing/content_57.html": "Greater Cambridge has a housing crisis with the lack of available and affordable housing forcing many to live miles from their place of work. Data from 2022 showed that median salaries in Cambridge and South Cambridgeshire were £36,000 and £39,500 respectively7; while in 2023, in Cambridge, the salary needed to buy a flat is £67,478 and for a terraced house it would be £109,1488. Four out of five people also cannot afford the average rent9; in 2023 the median monthly rent for a room in Cambridge was £63010. In 2023, 1,500 families were on the waiting lists for social housing in Cambridge, and nearly 2,000 families on those for South Cambridgeshire11. By 2024 these figures are thought to have almost doubled. At the same time, there are high levels of homelessness in Cambridge.\nAlthough decades of growth in housing supply clearly have not solved these serious issues, other political parties continue to call for yet more growth through the Local Plan. Instead of still more profit-driven private sector housing developments (including misleadingly named “affordable” housing), the Green Party nationally is demanding: a large increase in social housing, backed up by innovative approaches such as ownership cooperatives and co-housing projects; better use of existing housing stock and suitable brownfield sites for house building; and strict controls over rented accommodation, with the introduction of a Renters’ Charter.\nGreen-led Councils would:\n- challenge the policy of accelerated growth proposed in the draft Local Plan, and in the Cambridge 2040 central government strategy, recently retitled Cambridge 2050;\n- ensure that the provision of homes at social rents is at the heart of council-driven development, so that meeting the housing needs of those on the waiting list who are most at risk of becoming homeless is an absolute priority;\n- reinforce the Housing First initiative, in the light of the high levels of homelessness caused by, among other things, the cost of living crisis, the mental health crisis, and the shortage of reasonably priced rented accommodation12;\n- deliver an information campaign to clear up the confusion about affordable housing so that people can understand that it is ‘social rents’, not ‘affordable rents’, that reduce the social housing waiting list;\n- lobby the national government to remove all restrictions on how Councils use right-to-buy receipts so that funding can be released for new social housing and the retrofitting of existing properties;\n- bring empty properties back into use, setting up a “Redundant Buildings Taskforce” for this purpose;\n- replace council houses lost to ‘right to buy’ by buying back properties and letting them out at genuinely affordable rents;\n- apply the highest available Council Tax to second homes and holiday-let businesses as and when the powers to do so become available;\n- explore alternative housing delivery options to provide safe, affordable, sociable and sustainable living space for young people and other economically vulnerable groups, including creative use of empty buildings and innovative schemes such as Property Guardianship;\n- assist community groups and small businesses that are working to help society’s most vulnerable, and assist them in accessing funding and other support;\n- listen to the views of residents about local developments and reflect their concerns and aspirations in the planning process;\n- tackle rogue landlords by introducing a selective licensing scheme for private rented properties in the city along with an additional licensing scheme for Houses in Multiple Occupation (HMOs).",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_category_uncategorised_page_3/content_75.html": "17 July 2023 by elliecrane\nRead more »\n11 July 2023 / 11 July 2023 by elliecrane\n19 May 2023 / 9 June 2023 by elliecrane\n12 May 2023 / 9 June 2023 by elliecrane\n24 April 2023 / 11 June 2023 by elliecrane",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_category_uncategorised_page_2/content_73.html": "8 April 2024 / 14 April 2024 by marke\nThe full version of the manifesto can be found here. The shortened version is here.\nRead more »\n7 April 2024 / 14 April 2024 by marke\nSaran Nicmanis at Fanshawe Road flats, Coleridge Cambridge had just under 7350 council homes in September 20231 but, by March this year, there were still almost 28002 people on the waiting list, indicating that the City needs some 40% more social housing to give everyone a roof over their head. Cambridge City Council prides itself […]\n21 March 2024 / 14 April 2024 by marke\nSarah Nicmanis, Green Party parliamentary candidate for Cambridge, speaking to the Environment and Community Scrutiny Committee on Thursday 21st March with reference to the Petition requesting that Cambridge City Council publically supports the Climate and Ecology Bill. I speak as the Green Party parliamentary candidate for Cambridge City and on behalf of our local party […]\n18 March 2024 / 1 April 2024 by marke\n11 March 2024 / 3 April 2024 by marke\n5 March 2024 / 18 March 2024 by marke\n22 February 2024 by marke\n5 February 2024 / 8 February 2024 by marke\n6 November 2023 / 4 February 2024 by elliecrane\n3 October 2023 / 22 March 2024 by elliecrane",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_03_response-to-the-governments-case-for-cambridge-and-guidance-on-addressing-water-scarcity/content_30.html": "ABSOLUTELY NOT THE CASE FOR CAMBRIDGE!\nThe Cambridge & South Cambridgeshire Green Party (C&SCGP) is appalled by the tone, top-down approach, and lack of reality in the government’s new report The Case for Cambridge1. With ‘economic growth’ mentioned five times, and ‘climate’ appearing just twice, the proposal totally ignores all that Cambridge residents have been calling for in recent years: affordable housing, a reduction in the city’s extreme inequalities, and real solutions to the climate and biodiversity emergencies.\nSarah Nicmanis, Green Party parliamentary candidate for Cambridge, said: “Planning for the future of Greater Cambridge must be done with those who have long-term genuine interests here. I’ve heard too many residents say that they fear being ‘squeezed out’ by escalating housing costs and rising prices. We have a planning system that allows for such collaboration, and we need to get this back on track. The new Local Plan, already delayed by uncertainties about water availability, housing needs, and transport issues, is now being overturned by Gove’s top-down proposal, which risks aggravating the Town vs Gown sore that never seems to heal.”\nIf, as the report insists, Cambridge is doing so well economically, why is it a case for levelling up? Utterly tone deaf towards the cost-of-living crisis, it presents a fairy tale scenario of how the university, its tech offshoots, and the associated elite population could become even wealthier over the next two decades. The future of Greater Cambridge, however, is not only for students, talented graduates, academics, and tourists. The report emphasises the need for housing but totally misses the point that the real priority is genuinely affordable homes for long-term residents and the sustainability of service industries for tourism, academia, tech companies, the public sector, the trade and commercial sector, agriculture, and the food industries.\nThe references to ‘gentle density’ for housing, potential trams and light rail, and solutions to the water crisis are, of course, welcome – but most of these are dropped in as asides. The exception is water, which is addressed in a separate ‘guidance’ document2, not surprisingly given the strong stance taken by the Environment Agency (EA) on future development. We strongly support the EA’s insistence on pausing large-scale planning proposals until suitable mechanisms are enacted for ensuring adequate water supply, not only for the residents of Greater Cambridge, but also for the natural environment on which we depend.\nOliver Fisher, Green Party parliamentary candidate for South Cambridgeshire, said: “The water solutions need to be ‘real’ and we know what these are and what the water companies should be doing: a major campaign to reduce everyone’s water use to 80 litres per day; repairing infrastructure to seriously reduce leakage; installation of meters as well as rainwater harvesting systems and greywater recycling systems wherever possible; implementing a tiered water pricing structure to incentivise water conservation, and implementing hosepipe bans. These are tried and tested actions – and we must put them in place.”\nThe C&SCGP has concerns that a key part of the guidance is the establishment of a water offsetting and credits system. We strongly oppose this approach – studies have shown that the well-established carbon credits market has had little impact on carbon emissions, even if it has helped some small-scale biodiversity conservation and local community projects3. As the Cam Valley Forum has emphasised, water credits, an even newer concept, are likely to be less well regulated and effective4. We are deeply concerned over the proposal’s approach to capitalisation no matter the cost. Our residents deserve better.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_category_mayoral-election/content_66.html": "25 April 2025 / 25 April 2025 by daniellaycock\nLike you, I really thought things might start to improve last summer when we finally got rid of the incompetent and corrupt Conservative government, but since then pensioners’ winter fuel payments have gone, the two-child benefit cap hasn’t been scrapped, and now the Labour government is targeting the disabled, by reducing PIP benefits. The cost-of-living […]\nRead more »",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_manifesto_2024__green-transport-revolution/content_50.html": "We need a rapid shift to greener travel, with a more joined-up approach to transport planning and a focus on ending fossil fuel dependence.\nOur bus services are too expensive, too infrequent and are not integrated with wider travel networks. Lack of good public transport provision deepens inequalities by further disadvantaging people who cannot afford to live close to where the jobs are, or to run a car.\nAlthough Cambridge has the highest level of cycling of any city in the UK, we could do even better by improving the cycle network. Active travel saves money and improves health and well-being, while benefitting those less able to cycle or walk by reducing traffic jams and improving air quality. Providing viable public and active transport options motivates car drivers to move away from car use.\nDriving must be discouraged, to reduce congestion as well as carbon emissions. CSCGP believe a Workplace Parking Levy, a tax paid by large employers on staff parking bays, would be a fair and effective first step. The money raised would be invested in improvements to public transport. The search should also continue for a fairer, less expensive form of road-pricing, one that might encourage able-bodied citizens to choose bus or active travel over car travel14. We thus support the 2022 House of Commons Select Committee’s recommendation to replace fuel duty and vehicle excise duty with road-pricing based on the duration and time of the journey and vehicle type and size. Introducing emissions-based parking charges for residents’ parking, as in some London boroughs, would also be beneficial, with very small (and electric or hybrid) vehicles charged at a markedly lower rate than large, heavy and highly polluting vehicles, along with higher parking charges in the city for SUVs (with appropriate exemptions e.g. for the disabled), as is being considered in Paris, London and elsewhere. The growing popularity of very large cars (“autobesity”) increases carbon and particulate emissions, as well as road damage15, and endangers pedestrians, cyclists and even other motorists in smaller cars.\nCSCGP agrees with the principle of developing a rail network that would allow many more people to reduce their car use. However, the East West Rail (EWR) infrastructure and its construction must have minimal environmental impact, the trains must be electric, safety must be paramount and there should be good, active travel links along the route.\nThough invisible, air pollution in Cambridgeshire is deadly. In Greater Cambridge over 100 deaths in 2020 were directly due to this lethal mixture of gases and particulates, which can affect people of all ages through strokes, heart attacks, asthma and allergies. The Greens consider that the current air pollution strategy should be fully implemented and that we should comply with the more rigorous WHO standards. We reject the argument, seemingly accepted by Cambridge City Council, that having to build so many houses (producing yet more pollution) justifies lower standards16.\nGreen-led Councils would:\n- work to secure major investment in active transport to create a fully interconnected, properly segregated cycle network which is maintained to high standards (prioritising urgent action on safety issues such as potholes and non- gritted surfaces in icy weather);\n- ensure the Combined Authority delivers much improved, modernised bus services that are well connected, fast, cheap and convenient to use, and offers better fare structures for all journeys, clear information about fares and bus timing, tap on/ tap off options etc.;\n- continue to oppose new off-road busways, in favour of on-road bus priority measures;\n- introduce a Workplace Parking Levy, with suitable exemptions including for NHS premises and disabled parking spaces;\n- introduce emissions-based parking charges for residents’ parking;\n- support the further development and roll-out of innovative solutions to reduce private car use, including car-sharing schemes, on-demand minibus services and electric scooter/ bicycle hire, with vehicles designed to be accessible to as many people as possible;\n- engage with the design of Greenways, making sure the views of residents and users are taken into account and that the road user hierarchy is built into the design to avoid conflict between different categories of users;\n- combat air pollution by planting boundaries to parks and playgrounds with e.g. cotoneaster.\n| 14 | https://publications.parliament.uk/pa/cm5802/cmselect/cmtrans/789/summary.html |\n| 15 | The Fourth Power Rule: doubling the weight on a vehicle’s axle will do sixteen times as much damage to the roadbed. |\n| 16 | https://www.scambs.gov.uk/greater-cambridge-air-quality-strategy-consultation/ |",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_06_local-party-candidates-for-general-election-2024/content_22.html": "4 June 2024 / 5 June 2024 by marke\nThe local Green Party prospective parliamentary candidates for the General Election are listed here.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2023_07_1072/content_58.html": "Renewed calls for “pause and rethink” on growth following shock Government proposal\nGreen activists have branded Government plans to turn Cambridge into the Silicon Valley Of Europe as “arrogant”.\nThe Cambridge and South Cambridgeshire Green Party is horrified that Levelling Up Minister Michael Gove unveiled proposals to build 250,000 new homes in the region without any consultation.\nAnd local Greens have repeated their call for a “pause and rethink” on the policy of accelerated growth already contained in the draft Local Plan.\nSarah Nicmanis, the Green Party’s prospective parliamentary candidate for Cambridge, said: “We applaud Cambridge City Council for responding immediately to the report and pointing out that it has not been consulted on these ideas and that, as the planning authority, it would expect to be fully informed about and engaged with any deliberations.\n“We all need to work together to halt this top-down and arrogant concept.”\nIt is ironic that the proposals by the Department for Levelling Up, Housing and Communities have been drawn up for a region that, although very unequal in many ways, is also home to some of the wealthiest companies and individuals in the country.\nThe government plans involve identifying land to build new business parks, laboratories and science hubs, as well as homes.\nThe South Cambridgeshire and Cambridge Green Party hopes and expects that the authorities and people with the necessary powers will tackle this new threat which has already caused great anxiety to many local people.\nOli Fisher, the Green Party’s prospective parliamentary candidate for South Cambridgeshire, said: “It seems extraordinary that such a concept has been launched at government level (and even given a name – Cambridge 2040) amidst high national and regional concern about water shortages, transport congestion, and loss of green belt.\n“Building over the green belt, which is the only way this could be achieved, goes directly against all pledges to preserve environment and biodiversity and to meet climate targets.”",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_category_peterborough/content_10.html": "25 April 2025 / 25 April 2025 by daniellaycock\nLike you, I really thought things might start to improve last summer when we finally got rid of the incompetent and corrupt Conservative government, but since then pensioners’ winter fuel payments have gone, the two-child benefit cap hasn’t been scrapped, and now the Labour government is targeting the disabled, by reducing PIP benefits. The cost-of-living […]\nRead more »",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2023_07_greens-call-on-cambridge-water-to-speed-up-installation-of-meters/content_63.html": "Adverts to “ditch the hose and use a watering can” are not enough\nGreens say Cambridge Water must install water meters more quickly in order to tackle the long-term crisis.\nLocal residents who want to do their bit are frustrated at the long waiting times for meters.\nAnd the Cambridge and South Cambridgeshire Green Party says tackling this issue would have a much bigger impact than the water company paying for adverts urging consumers to use their garden hoses less over the summer.\nDemand for water in Cambridge remains far too high for the amount available in the region, which is officially classified by the Environment Agency as “seriously water-stressed“.\nSarah Nicmanis, the Green Party’s Prospective Parliamentary Candidate for Cambridge, said: “There are around 30,000 homes still unmetered in the Cambridge Water area – about one in five of their household customers.\n“It’s very frustrating to see such slow progress towards universal metering, and an apparent inability to install meters promptly for those customers who have asked for one.”\nCambridge Water’s draft plan proposes to install 4,200 smart meters per year over 10 years, aiming for universal coverage of smart meters by 2035.\nBut their own figures show that only 650 meters were installed in the 12 months between October 2021 and September 2022, and no further data seems to have been published.\nThe company acknowledges delays due to COVID-19, but say that a catch-up plan is being developed. Yet other water companies are installing smart meters much faster and neighbours Anglian Water have set a target of 2030.\nCambridge Water’s website states, “those customers with smart meters acknowledged that they had changed their behaviours to reduce their usage and save money”.\nThe company also cites that Ofwat, the water regulator, estimates that households with a meter use 10% less water on average than those without.\nCambridge Water also claim on their website that it is a “simple” process to have a meter fitted and most will be installed within 90 days of the customer’s application.\nBut that is not the experience of Green Party member Richard Potter, of Cherry Hinton.\nCambridge Water did an initial survey back in February, but after five follow-up phone calls the water company has still not provided a date for installation.\nMr Potter said: “1,200 houses are being built in North Cherry Hinton, and 12,000 are planned for Marshalls Airport land.\n“In 2019 Cambridge had the highest ever UK temperature, and the top temperature was even higher in 2022.\n“The threat to our water supply is escalating – we need to change how we live now”.\nSome Cambridge residents are concerned about the roll-out of smart water meters, fearing that (as has happened with energy meters) vulnerable customers may be switched to expensive pre-payment tariffs.\nHowever, water metering charges and tariffs do not work in that way: there is one single tariff for most households while appropriate protection for customers in vulnerable circumstances is available. The ‘WaterSure’ tariff applies to customers on income-related benefits and either with medical conditions that involve using large volumes of water, or who have three or more dependent children living with them: this caps bills at the average household bill for their area.\nCambridge Water customers who manage to get a new meter installed can have it removed after two years if they are not happy with the result.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_election/content_61.html": "Skip to content\nSkip to footer\nCambridge & South Cambridgeshire\nMenu\nNews\nAbout\nWhat We Stand For\nOur People\nContact Us\nGet Involved\nEvents\nVolunteer\nElection\nCandidates for Local Elections May 2025\nHiston and Impington Ward\nAreas\nNewnham Ward\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nElection\nElection\nTo top",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_category_press-release/content_59.html": "4 February 2025 / 20 February 2025 by Green Party Admin\nFollowing the Chancellor of the Exchequers speech today, the Greens have expressed deep concerns about the current economic strategy by the Labour Government and the devastating impact it will have on the most vulnerable members of society. Green County council candidate, Kathryn Fisher explained: “The Chancellor is desperately scrabbling around for a plausible magic growth […]\nRead more »",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_03_response-to-the-consultation-on-the-greater-cambridge-housing-strategy-2024-2029/content_17.html": "Introduction: the current Housing situation in Greater Cambridge\nGreater Cambridge has a crisis of housing affordability. Too many people now live under the stress of insecure housing and many others are forced to live miles away from their place of work. Data published in October 2022 showed that median salaries in Cambridge and South Cambridgeshire were £36,000 and £39,500 respectively1. However, according to research based on the HM Land Registry UK House Price Index in April 2023, the salary needed to buy a flat in Cambridge is £67,478 and that needed to buy a terraced house would be £109,1482.\nAverage rents in Cambridge are totally unaffordable for the average earner as well. It was worked out this year that four out of five people cannot afford the average rent price3. The median monthly rent for a room in Cambridge this year was £630.004 (that has gone up by over £100 in two years), and average monthly earnings were a take-home pay of £2000. But many sources5 have now worked out that you need about £49,000 to live comfortably in this city and not struggle to make ends meet.\nThe numbers of families without a permanent home and in short-term housing, whether hotels and B&Bs or temporary rental properties, hit a record high6 this year, with the latest statistics showing it now affects 121,327 children, according to data collated by the House of Commons library7. Other figures, also compiled by the library, show that councils across England have 261,189 homes that are classed as long-term vacant, meaning they have been empty for six months or more.\nLocally, the build, build, build philosophy has done nothing to bring down the average house prices or the average rents, or provide enough social housing for the numerous Cambridge and South Cambridgeshire families who are currently on the waiting list for social housing, numbering 1508 and 19188 respectively as of March 2023. However, this number is now thought to have almost doubled.\nThe decades of growth in housing supply clearly haven’t solved these serious housing issues and yet more growth is sought via the Local Plan. Instead of profit-driven private sector housing developments (including inaccurately named “affordable” housing), Greens want to see a large increase in social housing, backed up by innovative approaches such as ownership cooperatives and co-housing projects. We need to make better use of existing housing stock and suitable brownfield sites. In addition, we call for strict controls governing rented accommodation, and the drawing up of a renters’ charter.\nResponses to sections of the Housing Strategy:\np.11: “For those on low incomes, the housing options are scarce, with a reliance on social housing for rent. There is also a growing ‘affordability gap’ where middle income households are being squeezed out of the market, with limited housing options for home ownership or in the private rented sector.”\nWe completely agree. Why is it then that the rate of social housing provision is so slow? For instance, there is zero social housing promised at a proposed development on Fanshawe Road (p.4, Update on New Build Council Housing Delivery9). This rows back significantly on the initial ‘100% Social Housing” promise for this development with no explanation given by the council as to why this is happening.\nLooking at the council housing picture in Cambridge City: according to the HSC Programme Update Report delivered to the Housing Scrutiny Committee on 23rd January 2024, 272 of the 706 council houses planned for the next ten years are promised as social homes (a percentage of 39% of all council housing). The next decade will see worsening inequality if the current trend continues meaning greater numbers in housing need. The rest of the 706 houses are planned as affordable housing, a mix of 60% and 80% of market rent which constitutes 15% and 30% of forecasted council housing respectively, and private sale which will be sold at full market rates constituting 16% of the forecasted council housing for the next ten years. The waiting list for social housing numbered 1508 in Cambridge (and 1908 in South Cambridgeshire) according to records in March last year. This means that at the present rate of social housing supply, it will take 50-60 years to meet the needs of all of the households on this waiting list. So the reality is that many of these people will have passed away by then after a lifetime of being abandoned by their council. This paints a very depressing picture in our city that hosts significant inequality despite the enormous amounts of wealth generated here. The projected council housing mix will do very little to address this yawning gap in economic wellbeing and in fact only adds to the problem as the largest share of the council housing provision is pitched at 80% of market rent and private sale. That is 46% if we add together the 30% (213 homes) at 80% of market rent and the 16% (113 homes) at private sale.\n“Providing a range of homes at different tenures will go some way in providing homes that are affordable for those on a lower to average incomes.”\nAs explained in the introduction section, four our of five people cannot afford average rent prices. Going back to the figures provided in the Housing Scrutiny Report for the next ten years, as the Housing Strategy itself is lacking in figures, the mix provided favours the unaffordable end of renting/buying and will do very little to provide genuinely affordable housing which is social housing. Pitching affordable housing at this point as 80% of market rent is still not affordable for most people, for example the median rent for a 1 bedroom property is £1450 per month10 and someone earning a salary of £36,000 will take home £28,971 which equates to £2414.25 per month11. This means they are spending 60% of their income on rent. With 80% of market rent, the so-called ‘affordable rent’, the amount it costs to rent this 1 bedroom property would be reduced to £1160 – this is 48% of income going on rent. According to the latest report published by the ONS, a property is “”affordable” if a household would spend the equivalent of 30% or less of their income on rent (for new or existing tenancies)”12. So this so-called affordable rent is 18% in excess of being affordable which leaves the big question of how these tenants are going to ever be able to afford to save for their own home.\n“Social and Affordable Rent remains the highest priority…”\nSpell out further that affordable rent is not affordable…\n“…decisions on affordable housing mix are based on sound and up to date evidence.”\np.12: Mitigating and adapting to climate change\n“The delivery of a new generation of high quality energy and water efficient council homes.”\n“The use of on-site renewable energy and low carbon technologies, and homes built to Passivhaus or similar high standards.”\n“Information, advice and support to enable occupants to understand how new technologies can be used and the benefits they can bring.”\nThe Cambridge and South Cambridgeshire Green Party applauds these intentions as they are absolutely key to hitting those crucial Net Zero targets by 2030 for Cambridge City and 2050 in South Cambridgeshire.\np.13: “As well as homes being developed in the right places, with early provision of appropriate infrastructure…”\nWhat exactly is the strategy for providing ‘appropriate infrastructure’? Can the council give examples of how they have facilitated better infrastructure in previous developments such as the Ironworks development or the Timberworks development? What is the plan for this very important aspect of housing which impacts greatly on local services? How does the council work to improve the chances of citizens being able to get a dental appointment, a doctor’s appointment, a school place for their child, and even a hospital appointment? There is strong evidence of Cambridge citizens not being able to access these basic service currently with some travelling to Ely to access an NHS dentist and many on waiting lists for important hospital treatment. The current strategy lacks sufficient detail to address these important issues affecting the wellbeing of Cambridge citizens.\n“…some priority for allocation of Social and Affordable Rent homes is given to particular groups of applicants to help create mixed communities.”\nThis would be a better intention than the current situation where there is evidence that the council is acting in a contrary manner. For example, at the Fanshawe Road development, no social housing has been promised, meaning that the housing provided there will not cater to a mixed community – it will cater to those who can afford it which is extraordinary considering that 22 of the households who were moved out were social housing tenants. These people have been promised a home in the new estate which seems like an empty gesture as many who will have settled in their new communities with children settled at school and are highly unlikely to find it a sensible decision to uproot their lives once more and move back. Add to that the fact that the new homes will be pitched at a much higher rent, effectively pricing them out of the new development and it is easy to see the intention behind this project is one of gentrification, and does not “meet a broad range of housing needs” (p.13).\n“Cambridge City Council will: deliver and keep under review its 10-year affordable housing programme, through the Cambridge Investment Partnership (CIP), to help increase supply, address losses incurred through the Right to Buy, and meet a broad range of housing needs.”\nWe notice that no figures are provided here, unlike South Cambridgeshire District Council who do provide a target of delivering “at least 375 new council homes between 2023 to 2028” (p.14) over the page, and we wonder why that is. There is no commitment to an actual number in the strategy which is what we would expect to find especially as the goal is to keep the programme “under review”. What can the strategy review if there are no figures in the strategy to review? The Cambridge and South Cambridgeshire Green Party has had to do some digging to find the projected figures for the council housing delivery in Cambridge city13 and the numbers have been cited already in this response to show that the proposed delivery does not match housing need in Cambridge.\n“Cambridge City Council will: provide some new council homes at 80% of market rents targeted at local workers, through homes delivered over and above the 40% affordable housing requirement in the Local Plan.”\nLooking at the data cited above regarding spiralling rental costs and house prices, we are not confident that local workers can afford what the council are offering. For example, consider that the starting salary for a social worker is £24,00014; this is a vital contributor to public welfare, increasingly essential to prevent child mortality as the recent very tragic case of Bronsen Battersby sadly illustrates15. This essential member of the public sector, along with other public sector workers such as nurses, junior doctors, teachers and teaching assistants, cannot currently afford to live in Cambridge and this can be seen from the recruitment issues being experienced. Cambridge housing is prohibitively expensive, the high costs leading to many local workers leaving and heading to other areas where housing is more affordable and there is more confidence that the local infrastructure can meet a household’s needs. We are not confident that the strategic objective of offering homes at 80% of market rent is affordable enough for local workers to deem it sensible to stay in Cambridge.\n“Improve its approach to early planning for the delivery of new council homes, including working with existing tenants and leaseholders to help ensure homes can be effectively managed and service charges can be set at appropriate levels.”\nThis is another necessary and particularly meaningful intention especially as the recent experience of leaseholders at Davy Road does not reflect an existing intention to set service charges “at appropriate levels.” Leaseholders there are being charged for scaled back essential works with no reasonable explanation as to what these essential works are and why they are needed considering the residents of the Davy Road flats have been warned that the site has been marked for development. Leaseholders have been told to save for maintenance costs for a building that they might have to move out of which seems incredibly unfair.\np.15 “Everyone has the right to live in a warm, safe and decent home…”\nThe above goal is an honourable one and yet this mission of the council’s is not evident with the current number of socially-rented homes. Why is the council not facilitating this right by placing a necessarily strong emphasis on prioritising social housing and doing whatever they can to facilitate these rights?\np.16: “The councils are committed to maintaining high standards in council homes, and have a number of programmes in place to help ensure the safety and wellbeing of tenants. Mitigating damp and mould is one area where there has been a recent increase in focus.”\nWe are not confident that this is true of the council. Many council tenants complain of a lack of effective action by the council on damp and mould. Earlier this year, the number of complaints about damp and mould went up to 408 and there is widespread awareness amongst Cambridge City councillors that this is a serious issue for the residents they represent16.\n“Cambridge City Council in particular has been seeing an increase in reports of homes being used as short-term holiday lets.”\nWe feel that is a ‘needs-must’ situation for council tenants and a sign that the cost-of-living (inequality) crisis has meant that residents are having to think more creatively about how they can afford to make ends meet. As some of the statistics depicted on the following page (p.17) illustrate, there is a wider, and very serious, broader issue of growing poverty, particularly in unaffordable Cambridge.\np.17: “Ensure that rented homes meet statutory Minimum Energy Efficiency Standards, for the benefit of tenants and to help meet council objectives around reducing carbon emissions.”\nCould the council not go further than the minimum energy efficiency standards considering they have committed to a Net Zero target by 2030? This target is not going to be achieved with the current ‘minimum’ aspirations of this strategy.\n“Whilst the number of long-term empty homes across all tenures is low compared to many other parts of the country at less than 1% of the total Greater Cambridge housing stock.”\nWe disagree with this statement on Empty Homes in Cambridge and feel this is incorrect information. Research from Action on Empty Homes reveals that 1 in 24 homes in Cambridge is empty17. which shows that ONS statistics are not showing the full extent of the problem, and in terms of reliability of the research from Action on Empty Homes, it is claimed on their website: “Each year Action on Empty Homes analyses the Government’s official data on long-term empty homes, producing the only comprehensive analysis of this data. Our data below is based on Government data published by DLUHC 8 Nov 2023.”\n“Cambridge City Council will: Implement its new net zero retrofit pilot project to retrofit 50 council homes to net zero carbon standards.”\nThis seems a shockingly low target considering the aim is to achieve Net Zero on all council stock by 2030 – if this is the goal, then we can already consider that target missed. Oddly, there is no mention anywhere in the report about the number of houses that the council own and how we can know what percentage of the stock will be retrofitted. The whole document seems to be missing figures and numbers so we can understand what is actually being committed to in this strategy.\np.20: Preventing and tackling poverty & inequality, and building community wealth.\nThis sections talks about the growing number of people who are “struggling to make ends meet.” We completely agree; however, the goals mentioned here, namely “Enabling residents to access debt and other financial advice…support to increase access to digital services…grant funding to help minimise fuel and water costs” will make very little impact on the overall picture of growing poverty and growing homelessness if people in great housing need cannot be housed in the first place. The amount of social housing needs to be much higher commitment so that those on the waiting list for a social home, not an affordable home, can have a chance of escaping destitution and homelessness.\np.21: Both councils offer community grants to voluntary and community groups which help bring people together, and there are plans for warm spaces, which were provided in partnership for people to meet to help with the cost of living crisis, to evolve into longer term Community Hubs.\nAs with the rest of this strategy, these claims about what is already being done would benefit from examples and case studies. Without this evidence, these come across as empty, sweeping statements.\nConclusive comments about the Greater Cambridge Housing Strategy 2024-2029\n- The rate of social housing provision is much too slow considering the spiralling number of Cambridge citizens in desperate housing need. Cambridge City Council and South Cambridgeshire District Council’s Housing Strategy must meet the challenges of our region: namely, growing poverty, increasing homelessness and worsening inequality that is affecting the wellbeing, life chances and life expectancy of our people.\n- The Strategy lacks insufficient detail and rigorous evidence backing up its claims about dealing with damp and mould complaints, the number of empty homes in this region, appropriate service charging for leaseholders, what is realistically affordable for local workers who need housing (especially in Cambridge), and its legacy in providing enough housing for those of its residents who are really struggling.\n- The Cambridge and South Cambridgeshire Green Party applauds the intentions of mitigating and adapting the council housing stock as they are absolutely key to hitting those crucial Net Zero targets by 2030 for Cambridge City and 2050 in South Cambridgeshire, but the 50 council homes committed to by Cambridge City Council will certainly miss that target. No figure at all has been pledged by South Cambridgeshire District Council.\nGreens Solutions to Cambridge’s Housing Affordability Crisis\n1. The Greens would give councils the power to set rent controls in areas like ours where the housing market is particularly overheated. Similar to how it has been done in Berlin and Amsterdam, and how it is now being done in Scotland where they are trialling it out until the end of next month (March 2024). In Scotland, private landlords now cannot increase their tenant’s rent by more than 3% unless you can prove that there has been an increase in certain costs.\nA good argument for rent controls is that the evidence from Europe shows that regulated markets can also be attractive to investors. It is a departure from the UK norm which let’s face it is creating more destitution and more homelessness and suffering for our people, and bringing us closer to the European norm which is a more balanced approach.\n2. Greens would introduce an incentive to bring empty homes back into use. Recent research has found that England has ‘twice as many empty homes as families stuck in B&Bs’. The number of families without a permanent home and in short-term housing, such as hotels, B&Bs or temporary rental properties has hit a record high this year with latest statistics showing it affects over 120,000 children. I know a mother and two young children who have only just been moved from a London hotel after being stuck there for a year only to be moved into another temporary accommodation, at least this is a ground floor flat – but it’s a twenty minute bus ride away from the eldest child’s school. Meanwhile, figures show that 261,189 homes across England are classed as long-term vacant. Research from Action on Empty Homes reveals that 1 in 24 homes in Cambridge is empty (ONS statistics are not showing the full extent of the problem).\n3. The right-to-buy scheme has to go. Despite all the housebuilding, very, very few of the houses becoming available are social homes. In Cambridge, the Labour Council have only provided 113 homes for social rent than we had a decade ago; a shocking average of just 11.3 a year. So although Cambridge City Council has built or acquired 786 new homes over the last 10 years, they have lost the majority of this housing stock through Right to Buy sales and demolitions.\nThis is not helping over 2500 households who are currently on the waiting list for a social home. A figure that has increased of course due to the cost-of-living crisis, or let’s call it what it is ‘an inequality crisis.’\nAnd in the meantime, we all need to clear up the confusion between social housing and affordable housing and educate the public that they have totally different financial implications for household budgets. What is worse is the confusion means residents think their council is dealing with local housing affordability crisis when, in reality, they are exacerbating the problem.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_manifesto_2024__equal-society/content_69.html": "To combat the scourge of inequality, the Green Party nationally is calling for: a wealth tax on the super-rich, who have startlingly large carbon footprints; the raising of Universal Credit by £40 per week; the introduction of an unconditional Universal Basic Income; the provision of free school meals for all primary and secondary schoolchildren; and the nationalising/renationalising of the energy and water companies. Cambridge is an increasingly diverse city, a diversity that the Green Party respects and celebrates, in a spirit of collective kindness. Our city is also, however, one of the most unequal in the country. Cambridge has enormous prestige due to its successful universities, colleges, businesses and scientific and technological enterprises, but many living in the city do not have a stake in that success and affluence. We need to share this wealth with local communities, ensuring a decent standard of living for all and a healthy, sustainable society.\nGreen-led Councils would:\n- lobby for a Universal Basic Income pilot in the city and region;\n- continue to promote Cambridge as a City of Sanctuary, welcoming refugees and working with community and voluntary sector organisations to support them;\n- identify and act on the needs of the Gypsy, Roma and Traveller communities;\n- tackle misogyny and violence against women and girls;\n- defend LBGTIQA+ rights, supporting trans and non-binary people in their accessing of services corresponding to their gender rights;\n- promote disability rights and endorse the social model of disability, emulating best practice in other councils;\n- ensure policy decisions take more account of the mental health crisis afflicting our communities, and the young in particular, after the long years of austerity, the divisions of Brexit, the deepening of the climate emergency and the Covid-19 pandemic;\n- rekindle Cambridge’s Neighbourhood Watch and Speed Watch schemes and improve night-time safety through better street lighting;\n- tackle anti-social behaviour, mindful of the fear it causes.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_11_greens-call-for-urgent-action-following-publication-of-regulators-reviews-of-the-water-industry/content_11.html": "Cambridge Water Failures Pose Threat To Environment And Water Supply\nThe annual reviews by Ofwat, the Environment Agency and the Department for Environment, Food and Rural Affairs (Defra) of the performance of England’s water companies were published on 21 October 1. Jean Glasberg, Green Party City Councillor, says: “These letters make shocking reading. They provide the detail behind the recent national publicity on the scandalous failure of the water industry.”\nThe letter to Cambridge Water 2, the supplier of the city’s water, states clearly that “Your current performance is a risk to the environment and security of supply…” and points out that there is an on-going deficit in the ‘supply-demand’ balance. Despite the alarms that have been raised, the company is still not addressing the challenge of supplying the rising need for water, much of it due to new development, nor has it reduced the impact of its abstractions on the environment, including harm to chalk streams. Perhaps not surprisingly, Cambridge Water’s 2025 draft Water Resources Management Plan has still not been approved by Defra.\nThe letter explains how, in 2019, Cambridge Water forecast the improvements it would have made by 2024, and shows that these have not been achieved. Key failures are: interruptions in supply (72% above the forecast and due mainly to system breakdowns or pollution); delay in installing water meters; and leakage from pipes. The significant increase in demand from the non-household sector, including new science parks, is not adequately addressed and there are questions over data accuracy. The company has until 29th November to explain the action it will take on the problems identified 3.\n“The fundamental problem is the assumption by all involved that economic growth and the development of new high value industries must go ahead” says Jean Glasberg. “We must pause the approval of large developments until there is evidence the water crisis can be resolved. The EA’s objections to recently approved planning applications were correct, and Cambridge Water must move much faster to address its shortcomings”.| 1 | https://www.ofwat.gov.uk/publications/4/ |\n| 2 | https://www.ofwat.gov.uk/publication/cambridge-water-wrmp-annual-review-2024-letter/ |\n| 3 | Other water companies are also in trouble. South Staffs Water, the company owning Cambridge Water is dubbed “the worst performing company this year”. The letter to Anglian Water highlights ‘serious concerns’ with security of supply and risks to the environment. |",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2023_04_1032/content_74.html": "Cambridge City councillors stand with colleagues across the country opposing plans to lock up refugees\nCambridge Greens are joining the battle against new asylum laws.\nOver 200 local councillors from across the UK and from different political parties have pledged to fight for all of their residents – including those seeking asylum – in the face of government plans to house people on old barges and former prisons.\nThey have signed an open letter ahead of a Government bill going before the House of Lords on Tuesday [April 25].\nThe proposed legislation would see children and pregnant people locked behind bars – a policy described as abhorrent by charities and housing organisations – and would amount to an effective ban on the right to claim asylum.\nNaomi Bennett and Dr Hannah Copley, Green representatives for Abbey ward, have put their names to the letter.\nCllr Bennett said: “My grandpa came here from Krakow in 1901 as a lone refugee. He was so proud of his adopted country’s tolerance and decency. He used to call England the best country in the world. He would be so sad at this horrible inhumane policy.”\nThe open letter from the group of local councillors strikes the same tone. It reads: “As a group of local councillors from across the UK – and from different political parties – we are appalled by this Government’s latest abhorrent plans for people seeking sanctuary in our communities.\n“The Home Office is recklessly endangering people’s lives by placing them in accommodation that is manifestly unsafe, and leaving them at the mercy of private companies that treat them as commodities.\n“We will stand up for everyone in our communities, and fight for their right to housing that is safe and welcoming.\n“The Home Office’s calculated strategy of division and disdain will not work – our communities, and their care for one another, are stronger than that.\n“As local councillors, we pledge to work tirelessly for the good of all our communities, to ensure that all our residents can live safely and with dignity.”\nThe councillors are from 51 different local authorities from across the UK, and have pledged to stand up for their communities and use council powers to ensure that all residents – including those seeking asylum – are supported.\nThe government is currently at loggerheads with several local authorities over asylum accommodation plans, and is attempting to push through emergency legislation to allow it to shortcut council planning processes.\nLocal authorities have a broad set of decision-making powers, and resistance from councillors to the latest asylum plans could cause further headaches for central government.\nCouncillor Dr Hosnieh Djafari-Marbini of the Migrant Champions Network, the organisation supporting the letter, said, “The fact is that communities up and down the country want to stand in solidarity with people seeking sanctuary, and provide them a warm welcome.\n“And it’s clear that councillors from across the country are equally committed to making sure that people arriving here have the support they need.\n“But decisions taken by central government too often make that impossible. We hope that the Government will listen to the voices of these councillors, and equip local communities to provide a warm welcome, instead of pursuing an agenda of hostility and division, and lining the pockets of private companies.”\nThe full text of the letter and list of signatories is available here.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2023_11_greens-accuse-cambridge-water-of-failing-to-take-crisis-seriously/content_56.html": "Late notification of public meeting is typical of lack of transparency and action, say Greens\nGreens are calling on Cambridge Water to take the crisis more seriously after the company failed to notify customers in good time about a public meeting.\nAt an online meeting tomorrow [November 7], customers and stakeholders are due to be given the chance to ask questions and challenge Cambridge Water about their revised draft Water Resources Management Plan and associated business plan for 2025-2030.\nThe Green Party’s Sarah NicmanisBut Sarah Nicmanis, the Green Party Prospective Parliamentary Candidate for Cambridge, said: “Although water industry regulator Ofwat expects registrations for these meetings to be open for at least 4 weeks in advance of the planned date, many people received notification of this meeting only one week in advance.\n“Is this a tactic by Cambridge Water to limit the number of people who will ask difficult questions?\n“Our water company must start to take the current water crisis more seriously.”\nOfwat requires the company to hold two public meetings to allow for scrutiny of its service, its impact on the environment, whether the plan will affect water bills and other issues.\nIn its revised plan, Cambridge Water points out that demand for water will exceed supply in 2029/2030 – only six years away – if existing policies continue.\nHowever, the company is still planning only a 50% reduction in leakage from pipes by 2050, with a continued lack of clarity as to why leakage cannot be reduced more quickly. The company’s overall aim for a reduction in household water use remains at 110 litres per person per day by 2050, while other water companies have far more ambitious targets.\nAs local Greens explained in their consultation response, there is good evidence to show that 80 litres per person per day could be achieved in the same time scale.\nThe Greens are therefore continuing to call on Cambridge Water to:\n- Rapidly reduce abstraction from the Chalk aquifer, including by capping abstraction at today’s actual levels.\n- Take much more concerted and urgent action to manage demand, with actions that go beyond reliance on voluntary individual behaviour change through, for example, the introduction of hosepipe bans and universal metering.\nCambridge Water now finally recognises the critical impact that climate change will have on our water resources, noting in its draft business plan that “we are likely to see more extremes of weather, with 60% less rainfall in the summer and 30% more rainfall in the winter in our Cambridge region by the 2080s.”\nBut their targets for addressing the main challenges in this region, classified by the Environment Agency as “seriously water-stressed”, remain totally or woefully unambitious or inadequate.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2025_04_adrian-ramsay-spends-time-with-cambridge-campaigners-in-the-run-up-to-local-elections-on-1st-may/content_4.html": "Adrian Ramsay MP came to Cambridge on Wednesday to join local activists on the campaign trail.\nMr Ramsay, co-leader of the Green Party and MP for Waveney Valley, spent his time speaking to residents in key Cambridge wards and in Histon & Impington, where Greens are hoping to gain their first South Cambridgeshire representative.\nMr Ramsay said: “We need Green voices on the Council to push for policies that benefit the many, not just the wealthy few. I am hugely impressed by the energy and dedication of the candidates I have met today and I know they would be strong advocates for their communities.”\nThe Green Party, which currently has five councillors on Cambridge City Council, is standing candidates in every seat in the Cambridgeshire County Council election, as well as in the Mayoral election for Cambridgeshire and Peterborough. They are hoping to gain seats across the county on 1st May.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2024_03_greens-celebrate-success-as-labour-drops-threat-to-st-thomass-square-park/content_7.html": "Greens and local residents are relieved to hear the news that our Labour Council has finally dropped proposals for the development of seven houses on St Thomas’s Square Play Park, a protected local green space.\nSt Thomas’s Park is a green space rich in biodiversity, visited daily by local families for the well-resourced play area and by local dog walkers who enjoy the open green space nearby. Greens have supported the understandable concerns of the Friends of St Thomas’s Park since last summer by meeting with key campaigners, representing their views at a local residents’ meeting, making a bid for an Environmental Improvement grant and spreading their campaign message in their local newsletters.\nGreens understand that council officers dropped the planned development for purely financial reasons. Jacqueline Whitmore, Coleridge resident and Green Party member says,\n“We wish the plans have been axed because the Council and its Coleridge councillors had listened to residents. However, I’m very relieved that Labour have seen sense and dropped the proposals. As local residents we can now feel reassured that our park is safe.”\nSarah Nicmanis, Green candidate for Coleridge Ward, and Green Party parliamentary candidate says,\n“I am pleased Labour have abandoned their plans to build over St Thomas’s Park, and that residents can continue to enjoy their park, a protected space which must continue to be truly protected, and not be subjected to intrusive works.”",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_2023_05_alternative-to-the-cambourne-busway-could-bring-greater-benefits-at-smaller-cost/content_68.html": "Independent charity Cambridge Past, Present and Future (Cambridge PPF) has put forward a proposal which they say would have a far greater benefit to cost ratio than the Cambourne to Cambridge busway proposed by the Greater Cambridge Partnership. Cambridge & South Cambridgeshire Green Party is calling on Cambridgeshire County Council to properly consider this alternative solution.\nThe Green Party is in favour of investing in and improving public transport and recognises the need for a better bus service for residents from Cambourne and Bourn to access Cambridge. However, the party remains strongly opposed to the Greater Cambridge Partnership proposal, which would cost a minimum of £160 million while saving just three minutes on a 30-minute journey. If built, the busway will cut through Green Belt land including the West Fields, involve the loss of hundreds of trees in Coton Orchard and cause irreversible damage to landscape and habitats.\nJean Glasberg, newly elected Green City Councillor for Newnham, said “The busway was a key issue on the doorstep during the recent election. It is an expensive and ineffective solution that does not provide a good service or value for money and would cause huge environmental harm that cannot be offset by biodiversity net gain elsewhere. I hope that the members of the County Council will take this opportunity to have a rethink and allow a proper evaluation of a route which is a fraction of the cost, has better connectivity, and does not cause irrevocable damage.”\nThe County Council will vote next week [Tuesday 16th May] on a motion to have the Cambridge PPF proposals formally assessed by independent transport experts so that an impartial report on both options can be presented to the Council. The report should explore the benefit-to-cost ratio of both proposals, their impact on the environment, timescales and how they fit as part of a coherent transport strategy for the region. The Green Party, which does not currently have representation on the County Council, urges Councillors to vote in favour of this motion.",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_tag_mayoral-election/content_9.html": "Bob Ensch Announced as Green Candidate for Cambridgeshire and Peterborough Mayoral Election 22 March 2025 / 22 March 2025 by Green Party Admin Cambridgeshire and Peterborough Green Party is proud and delighted to announce Bob Ensch as its candidate for the Cambridgeshire and Peterborough Mayoral Election. With a successful career in construction and a passion for empowering the next generation, Bob is ready to lead the region towards a sustainable and prosperous future. Bob currently is the programme […] Read more » Cambridgeshire Mayoral Election Peterborough",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_tag_kathryn-fisher/content_20.html": "Adrian Ramsay spends time with Cambridge campaigners in the run up to local elections on 1st May. 15 April 2025 / 15 April 2025 by daniellaycock Adrian Ramsay MP came to Cambridge on Wednesday to join local activists on the campaign trail. Mr Ramsay, co-leader of the Green Party and MP for Waveney Valley, spent his time speaking to residents in key Cambridge wards and in Histon & Impington, where Greens are hoping to gain their first South Cambridgeshire representative. Mr […] Read more » Adrian Ramsey Kathryn Fisher\nGreens Call for urgent investment in social housing, climate action, and fair wages 4 February 2025 / 20 February 2025 by Green Party Admin Following the Chancellor of the Exchequers speech today, the Greens have expressed deep concerns about the current economic strategy by the Labour Government and the devastating impact it will have on the most vulnerable members of society. Green County council candidate, Kathryn Fisher explained: “The Chancellor is desperately scrabbling around for a plausible magic growth […] Read more » Darren Green Economy Green Party Kathryn Fisher",
  "https_cambridge_greenparty_org_uk_/https_cambridge_greenparty_org_uk_category_press/content_39.html": "25 April 2025 / 25 April 2025 by daniellaycock\nLike you, I really thought things might start to improve last summer when we finally got rid of the incompetent and corrupt Conservative government, but since then pensioners’ winter fuel payments have gone, the two-child benefit cap hasn’t been scrapped, and now the Labour government is targeting the disabled, by reducing PIP benefits. The cost-of-living […]\nRead more »"
}