{
  "https_www_sidneyyankson_uk/https_www_sidneyyankson_uk_contact/content_3.html": "I would love to hear from you to find out how I can help improve Southampton Itchen for all of us.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_sidneyyankson_uk/https_www_sidneyyankson_uk_news_sidney-yankson-supports-new-plan-veterans-under-conservatives/content_7.html": "The Conservatives are today announcing a raft of measures to support veterans, including a new veterans' bill, extended tax breaks for veterans' employers and cheaper railcards for veterans. If elected, the Conservatives will build on their plan to make the UK the best place in the world to be a veteran.\nThe men and women who have served our country at home and abroad are heroes. That is why the Conservatives will introduce the UK's first ever Veterans' Bill. It will enshrine veterans' rights, such as ensuring military qualifications have an equal standing with civilians' qualifications in law for the first time. This Bill will confirm the UK as a world leader in support for veterans.\nGetting veterans into good jobs is an important element of supporting them. In addition to these bold actions, the Conservatives will extend the National Insurance holiday for veterans' employers. By cutting tax for employers who hire veterans, we will incentivise them to hire even more. The plan is working with the employment rate of veterans has rising from 80 per cent to 89 per cent since 2015, higher than the UK average.\nThe price of a Veterans Railcard will be cut by almost a third from £30 per year to £21, bringing it in line with the price serving personnel pay for the HM Forces Railcard.\nThe Conservatives have legislated to protect our veterans against repeated reinvestigations where there is no new and compelling evidence against them, and to end vexatious claims against our armed forces.\nVeterans have been willing to put their lives on the line for our freedom, peace and security. They deserve to be treated with respect, live in comfort and with peace of mind. By continuing to build on an impressive record the Conservatives are showing they are standing firmly behind them.\nMeasures like the National Insurance holiday for veterans' employers, special pensions and compensation benefits, visa fees waivers for our Commonwealth vets, bespoke support for mental and physical health, a wraparound employment service ensuring veterans secure high paid and skilled jobs, as well as tens of millions in funding have been transformational for veterans' quality of life.\nPrime Minister Rishi Sunak said:\n“The heroes who have put their lives on the line to protect our freedoms represent the very best of our country.\n“That's why we have prioritised making the UK the best place in the world to be a veteran with our clear plan to give them the opportunities, aftercare and support they deserve to live prosperous, fulfilled lives.\n“The choice at the election is clear – vote for the Conservatives for a dedicated veterans' minister, veterans' rights enshrined in law and more opportunities for veterans, or Labour who have no plan and would take us back to square one.”\nVeterans Minister Johnny Mercer said:\n“D-Day is a moment for us to reflect on the historic bravery of those men who fought for us 80 years ago. Their spirit lives on in the millions of veterans who continue their legacy today.\n“I am hugely proud of the progress we've made in ensuring the UK is the best place in the world to be a veteran and I am dedicated to making sure we go even further with this clear plan to support vets.\n“And we will go further by passing a law to enshrine veterans' rights in law so that all veterans can have the peace of mind that their dedication will be recognised and rewarded throughout their lifetimes.”\nFor further information, please contact the Press Office on 020 7984 8121 or email us at [email protected].\nOur Plan\n· We will maintain the Office for Veterans Affairs in its current position in the Cabinet Office, with a dedicated Minister for Veterans Affairs in the Prime Minister's Cabinet and maintain the £10 million operating budget of the Office for Veterans Affairs at £10m throughout the next Parliament.\n· We will retain the National Insurance holiday for those who employ veterans, and we will bring forward measures to disregard War Pensions and Armed Forces Compensation Scheme awards as income from benefits and pensions.\n· We will extend the visa fees waiver introduced to cover Commonwealth personnel, to include their direct dependents. We will fully implement the findings of the independent review into Veterans UK and bring forward measures to ensure that public bodies record whether someone has served in the UK's Armed Forces.\n· We will cut the cost of the Veterans Railcard so that it costs the same as the HM Forces Personnel railcard. Reducing the cost from £30 per annum to £21.\n· We will bring into law the UK's first ever Veterans' Bill, which seeks to enshrine Veterans' rights in law for the first time. This will:\no Criminalise the wearing of medals or decorations that people are not entitled to.\no Create a legal duty to publish a Veterans Strategy and Veteran Strategy Action Plan, with a requirement for the Government to report progress to Parliament.\no Give military qualifications equal standing with civilian qualifications to enable veterans to use their experience to enter highly paid skilled sectors.\no Ensure that veterans receive a full transcript upon leaving the Armed Forces which includes a clear record of the training qualifications that veterans achieved in the military.\no Require Government to appoint a National Veterans Commissioner on statutory footing.\n· We will change the law to ensure that Veterans ID cards are valid identification in all future elections\nHow we will pay for this\n· We will maintain the existing £10 million budget of the Office of Veterans' Affairs to ensure our plan is delivered for veterans.\n· The reduction in the cost of the Veterans Railcard will be funded within existing DfT budgets.\nThe alternative\n· There was no Cabinet-level Minister for Veterans' Affairs at any point during the last Labour Government.\n· Rowing back on Northern Ireland Troubles (Legacy and Reconciliation) Act 2023\nConservative Party candidates who are veterans\nVeteran Conservative Party candidates:\n6. David TC Davies\n7. Simon Hart\n9. David Davis\n10. Andrew Bowie\n11. Steve Baker\n12. Leo Docherty\n13. Adam Holloway\n14. Andew Selous\n15. Darren Henry\n16. Jason McCartney\n17. Sarah Atherton\n18. Jack Lopresti\n19. Edward Leigh\n20. Bob Seeley\n21. Desmond Swayne\n22. Julian Lewis\n23. Bill Wiggin\n24. James Gray\n25. Mark Francois\n26. Richard Drax\n27. Andrew Murrison\n28. Stuart Anderson\n29. Tobias Ellwood\n30. James Sunderland\n32. Philip Hollobone\n33. Benjamin Obese-Jecty – Army – Huntington\n34. Carline Deal – Army – Hove and Portslade\n35. Craig Smith – Royal Air force - North West Leicestershire\n36. David Reed – Royal Marines Commando - Exmouth and Exeter East\n37. Dylan Thomas – Army – Hayes and Harlington\n38. James Clark – Army – Great Yarmouth\n39. Johno Lee – Army – Nottingham East\n40. Lincoln Jopp – Army – Spelthorne\n41. Lucy Trimnell – Royal Navy - Frome and East Somerset\n42. Matthew Jackman – Army (reserves captain) - Westmorland and Lonsdale\n43. Paul Athens – Army – Hazel Grove\n44. Sidney Yankson – Army – Southampton Itchen\n45. Stuart Anderson – Army - Shropshire South\n46. Ed McGuiness – Army – Surrey Heath",
  "https_www_sidneyyankson_uk/https_www_sidneyyankson_uk/content_1.html": "My latest news\nMy Map\nAm I your candidate?\nEnter your postcode to confirm that Sidney Yankson is your candidate.\nI'm Sidney Yankson, the Conservative candidate for Southampton Itchen. Here, you can find my latest news, campaigns and more about me. I'm here to help, so please don't hesitate to get in touch.\nEnter your postcode to confirm that Sidney Yankson is your candidate.",
  "https_www_sidneyyankson_uk/https_www_sidneyyankson_uk_news_category_Speeches/content_5.html": "Sidney Yankson speaking on defence, diplomacy and development on the Coalition for Global Prosperity panel at the Conservative Party Conference - 30 September 2024 30th September 2024 Today I had the pleasure of speaking on a panel at the Conservative Party Conference 2024. The panel’s topic was “the Key to Prosperity: Making Development and... Speeches",
  "https_www_sidneyyankson_uk/https_www_sidneyyankson_uk_accessibility/content_4.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_sidneyyankson_uk/https_www_sidneyyankson_uk_news_sidney-yankson-attends-prime-ministers-final-general-election-speech-caroline-nokes/content_8.html": "With Caroline Nokes for the final general election speech by Prime Minister Rishi Sunak at Ganger Farm Sports Park, Romsey, Hampshire on the eve of poll.\nSidney Yankson\nWith Caroline Nokes for the final general election speech by Prime Minister Rishi Sunak at Ganger Farm Sports Park, Romsey, Hampshire on the eve of poll.\nSidney Yankson",
  "https_www_sidneyyankson_uk/https_www_sidneyyankson_uk_cdn-cgi_l_email-protection/content_9.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_sidneyyankson_uk/https_www_sidneyyankson_uk_news_category_Westminster-News/content_6.html": "Sidney Yankson attends launch of a new report titled \"Development in the Pre-War Era\" at The Royal United Services Institute. 28th January 2025 Today I attended the launch of a new report published by the Coalition for Global Prosperity. Endorsed by former Defence Secretary The Rt Hon Grant Shapps, the... Westminster News\nSidney Yankson attends the Prime Minister's final general election speech with Caroline Nokes 3rd July 2024 With Caroline Nokes for the final general election speech by Prime Minister Rishi Sunak at Ganger Farm Sports Park, Romsey, Hampshire on the eve of poll. Sidney... Westminster News\nSidney Yankson listening to retired residents about paying tax on their pensions 17th June 2024 Today I listened to lots of residents that are happy that the prime minister and chancellor are cutting taxes for retired pensioners. The Prime Minister has... Westminster News\nSidney Yankson supports the plan to recruit 8,000 more police officers, with the full power of arrest 10th June 2024 I support the Government setting out a clear plan to recruit 8,000 more police officers, with the full power of arrest, as we take the bold action needed to cut... Westminster News\nSidney Yankson supports new plan for veterans under the Conservatives 6th June 2024 The Conservatives are today announcing a raft of measures to support veterans, including a new veterans' bill, extended tax breaks for veterans' employers and... Westminster News\nSidney Yankson remembers the fallen for the D-Day 80th anniversary. Served our country. Serving Southampton. Serving you. 6th June 2024 Remember the fallen for the D-Day 80th anniversary. Sidney Yankson [email protected] Westminster News\nSidney Yankson on BBC Politics South discusses how to improve the NHS, reduce the cost of living and tackle food security 26th May 2024 Today I appeared on the BBC Politics South show (recorded on 24 May 2024). I discussed how our plan to take bold action to secure the long term future of the... Westminster News\nSidney Yankson supports national service for our country 26th May 2024 I support the Prime Minister's plan for young people. As a former reservist myself, I learned the valuable life skills of self-discipline, team work, leadership... Westminster News\nSidney Yankson meets Secretary of State for Defence - Rt. Hon. Grant Shapps MP to ask for more support for Southampton veterans 25th March 2024 Today I attended the House of Commons to observe Defence Questions in the House and also had a meeting with the Secretary of State for Defence, Rt. Hon. Grant... Westminster News",
  "https_www_sidneyyankson_uk/https_www_sidneyyankson_uk_news_breakfast-business-owners/content_2.html": "Breakfast with business owners\nThank you to Dean for our business breakfast roundtable this morning. It was valuable to hear how government should be assisting businesses to grow and prosper. 97% of businesses are SMEs and we should engage with them to move our country forward.\nGetting Britain working.\nFor more information, please contact mailto:[email protected].\nSidney Yankson"
}