{
  "https_kevinmckenna_co_uk/https_kevinmckenna_co_uk_contact/content_2.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_kevinmckenna_co_uk/https_kevinmckenna_co_uk_privacy-policy/content_4.html": "I am the MP for Sittingbourne and Sheppey. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf and ask for views on local issues.\nAs a Labour MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy for details of what information they hold, why, and how they use and process that information.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nData collection and use\nThe office of Kevin McKenna MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do so where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary in order to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, e-mail, phone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send e-mails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe option I provide in all communications.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the MP for Sittingbourne and Sheppey, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary to resolve or otherwise complete your request, although I may retain a minimum amount of information about closed cases in the event that you contact me again for help.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for Sittingbourne and Sheppey, or until you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nYour rights\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n- Obtain copies of the personal information I hold about you (known as a “subject access request”)\n- Request that I correct or update any personal information held about you\n- Ask that we erase or restrict the way in which I use your information\n- Request that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\n- You may opt out of receiving further communications from me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my Data Protection Officer:\nData Protection Officer, Office of Kevin McKenna MP, House of Commons, London, SW1A 0AA\nEmail: [email protected]\nAlternatively, you have the right to complain to the Information Commissioner’s Office (the “ICO”) if you are not satisfied with the way I use your information. You can contact the ICO by writing to: Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, Cheshire SK9 5AF.",
  "https_kevinmckenna_co_uk/https_kevinmckenna_co_uk_administrative-officer/content_3.html": "I am hiring a capable administrative officer to be based in Sheerness\nJob Title: Administrative Officer\nWorking For: Kevin McKenna\nLocation: Sheerness\nSalary: £24,000\nLength of Contract: Permanent, subject to six months probation\nDesirable\nDesirable\nUpon appointment you will be required to apply for security clearance, undertaken by the Security Vetting and Pass Office. See Members’ Staff Security Clearance page for further info. Kevin McKenna MP will pay staff in accordance with IPSA guidelines.\nClosing Date: 15 February 2024\nInterview/Start Dates: Interviews will take place week commencing 24 February 2024. To start as soon as possible\nPlease send CV and covering letter (no more than one page) to [email protected]",
  "https_kevinmckenna_co_uk/https_kevinmckenna_co_uk/content_1.html": "My team and I are here for you. Find out how to contact us and what details we’ll need to support you.\nFind out what I’ve done in Westminster to represent the people of Sittingbourne and Sheppey.\nLearn more about my work within the constituency as your Member of Parliament.\nI would like to thank everyone who voted for change in Sittingbourne and Sheppey, and across the country. I was elected in July 2024, but becoming an MP was never on my career plan.\nAt university I studied microbiology, but chose to train as a nurse after seeing the nursing care many of my friends received during the AIDS crisis. I specialised in critical care and then moved into health policy, completing a Darzi Fellowship and working for NHS England.\nMy move into politics came from this experience administering policy and the belief that more healthcare voices are important in politics; most healthcare workers don’t have the option to get involved the way I did due to their long working hours! Healthcare remains close to my heart, and since my election to Parliament, I’ve been elected as an officer of the All-Party Parliamentary Group for Health.\nMy husband and I live in Sittingbourne, and I’m proud to represent the constituency where I live. As we go into 2025, my team and I will continue to update this website and work hard to serve you, the people of Sittingbourne and Sheppey.\nMy full new website is currently under construction. Until then, please do feel free to get in touch with me if you need any support or have questions.\nSign up to receive my newsletter to keep up to date with my work in Westminster and the constituency and be the first to hear about how I’m representing you.\nI will only use the details you provide to send you my newsletter – you can find out more by reading my privacy policy.",
  "https_kevinmckenna_co_uk/https_kevinmckenna_co_uk_cdn-cgi_l_email-protection/content_5.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare."
}