{
  "https_www_samholland_uk_/https_www_samholland_uk_news_category_Opinions/content_12.html": "Stop Rainham Quarry Survey 18th December 2023 Plans to build a new quarry in Rainham have gone to Havering Council. If approved, this new 50-acre site will be quarrying 2 million tonnes of sand and gravel... Opinions\nBeam Park Station: What do you think? 15th October 2023 Sam Holland and Keith Prince's Survey on Beam Park Station. Opinions\nSam's Survey 21st September 2023 Thank You for coming to 'Sam's Survey', let him know your views on our local area. Opinions",
  "https_www_samholland_uk_/https_www_samholland_uk_news_we-cannot-allow-remembrance-be-disrupted-protest/content_7.html": "For over 100 years, Britain has staged a national act of remembrance for those slain whilst fighting for the freedom and traditions which have made Britain the beacon of hope, democracy, and freedom that it is today. Our national story is interwoven with the annual story of remembrance. A rare occasion where the oldest veteran through to the youngest child, come together in a unified and proactive expression of respect, mourning and gratitude.\nAcross Dagenham and Rainham, we will remember the sacrifice made by those from the local area who died in service of our country. In World War One, the 57 from Rainham who gave their lives in France and Belgium, including fighter ace Second Lieutenant Ralph Luxmore Curtis. During World War Two, the 68 pilots stationed at RAF Hornchurch who were killed in the Battle of Britain. The 147 on the Ford Motor Company Roll of Honour, who went to war and never returned, and the 426 fatal casualties during Blitz bombing across Dagenham.\nMore recently, we remember those from our area who died in Afghanistan, Warrant Officer Ian Fisher from Elm Park, Rifleman Martin Kinggett and Private Tony Rawson, both from Dagenham.\nWithout their sacrifices, and that of so many armed forces personnel throughout the generations, we would not have a society in which protest, about strongly held views on so many different issues, could take place. Remembering that is what we all do on Armistice Day and Remembrance Sunday.\nThat’s why doing everything we can to protect the sanctity of remembrance, both in Central London, and around the country is so important.\nThere are times to protest and there are times to mourn and pay our respects. Acts of Remembrance this weekend should remain just that.",
  "https_www_samholland_uk_/https_www_samholland_uk_news_join-your-local-neighbourhood-watch-group-dagenham-and-rainham/content_11.html": "Crime and anti-social behaviour is a growing issue across Dagenham and Rainham. So to ensure we are safer in our communities I have setup local community Neighbourhood watch groups across Dagenham and Rainham. Let’s make Dagenham and Rainham a safer place to live for everyone. Join your local community group below ⬇️ https://www.facebook.com/groups/703042511988870/?ref=share_group_link (Beam Park) https://www.facebook.com/groups/245555225256573/?ref=share_group_link (Dagenham) https://www.facebook.com/groups/773067474248542/?ref=share_group_link (Elm Park) https://www.facebook.com/groups/1614686079269774/?ref=share_group_link (Rainham) https://www.facebook.com/groups/1608416983231836/?ref=share_group_link (Rush Green) https://www.facebook.com/groups/920616556109234/?ref=share_group_link (Wennington)",
  "https_www_samholland_uk_/https_www_samholland_uk_campaigns_reverse-ulez-expansion-dagenham-and-rainham/content_24.html": "Tweet Labour's Sadiq Khan and his punitive ULEZ tax is clearly a money making scheme. I'll be fighting to get it reversed.",
  "https_www_samholland_uk_/https_www_samholland_uk_privacy/content_28.html": "This document outlines how Sam Holland processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Sam Holland\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Sam Holland.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Sam Holland, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Sam Holland via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_samholland_uk_/https_www_samholland_uk_contact/content_3.html": "Skip to main content\nMain navigation\nHome\nAbout Sam\nNews\nContact\nContact\nLeave this field blank\n8-12 Salisbury Road, Dagenham RM10 8TT\n01708 761 583\n[email protected]\nSam on Facebook\nSam on Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_samholland_uk_/https_www_samholland_uk_news_sam-holland-selected-conservative-candidate-dagenham-rainham/content_20.html": "Conservative Party members from across Dagenham and Rainham have selected Sam Holland as the Conservative Prospective Parliamentary Candidate for the Dagenham and Rainham Constituency for the next general election.\nSam was born and raised in Dagenham, the son of a family of Ford Factory workers and was educated at Britton’s Academy in Rainham. He is Dagenham and Rainham to his fingertips.\nSam will be a great champion for local people in a constituency where Labour have taken the people for granted for far too long. He is well placed to stand up for local people here in Dagenham and Rainham and in Parliament as he understands the issues they face having lived them himself.\nCommenting after his selection, Sam Holland said, “It is the honour of my life to be selected as the Conservative Prospective Parliamentary Candidate for where I was born and brought up. I will work as hard as I possibly can to campaign for the better country and future we all want to see. Together, we can restore pride in what it means to be made in Dagenham and Rainham”.\nChairman of the Dagenham and Rainham Conservative Association, Matej Travnicek said, “To beat Labour here we need someone who understands the local area and the challenges residents face. Sam knows our community better than most having been born, raised, educated and worked here. I have no doubt Sam will be able to turn the tide against Labour and make a great Member of Parliament for Dagenham and Rainham”.",
  "https_www_samholland_uk_/https_www_samholland_uk/content_1.html": "Latest News Sam Holland welcomes Independent Football Regulator from Government, putting Dagenham & Redbridge and West Ham’s voices front and centre Sam Holland welcomes Independent Football Regulator from Government, putting… Sam Holland says stick to the plan as he welcomes Budget which puts families in Dagenham and Rainham first Sam Holland says stick to the plan as he welcomes Budget which puts families in… PETITION: Expand the Superloop to Dagenham and Havering Sadiq Khan has left Dagenham and Havering behind with his so-called Superloop… My Plan for Bicester East No more overdevelopment Dagenham and Rainham are famous for their quality family housing. Whilst we… Fighting crime in Dagenham and Rainham Under Labour's Sadiq Khan, the Met Police is under special measures. They… More activities for young people and the elderly. I've led youth groups in Dagenham and Rainham. I will work with local… Reverse ULEZ expansion to Dagenham and Rainham Labour's Sadiq Khan and his punitive ULEZ tax is clearly a money making… Put local decisions in your hands Labour's boroughwide Controlled Parking Zone policy in Barking and Dagenham… Ensuring we have cleaner streets In Dagenham and Rainham rubbish on our streets and fly-tipping is on the… Put local decisions in your hands Find me on Facebook Test More activities for young people and the elderly. My map Am I your candidate? Enter your postcode to confirm that Sam Holland is your candidate. Postcode\nSam Holland welcomes Independent Football Regulator from Government, putting Dagenham & Redbridge and West Ham’s voices front and centre Sam Holland welcomes Independent Football Regulator from Government, putting…\nSam Holland says stick to the plan as he welcomes Budget which puts families in Dagenham and Rainham first Sam Holland says stick to the plan as he welcomes Budget which puts families in…\nPETITION: Expand the Superloop to Dagenham and Havering Sadiq Khan has left Dagenham and Havering behind with his so-called Superloop…\nFighting crime in Dagenham and Rainham Under Labour's Sadiq Khan, the Met Police is under special measures. They…\nMore activities for young people and the elderly. I've led youth groups in Dagenham and Rainham. I will work with local…\nReverse ULEZ expansion to Dagenham and Rainham Labour's Sadiq Khan and his punitive ULEZ tax is clearly a money making…\nPut local decisions in your hands Labour's boroughwide Controlled Parking Zone policy in Barking and Dagenham…\nEnsuring we have cleaner streets In Dagenham and Rainham rubbish on our streets and fly-tipping is on the…",
  "https_www_samholland_uk_/https_www_samholland_uk_showdarrenthedoor/content_10.html": "After many media reports stating that Cllr Darren Rodwell, Leader of the London Borough of Barking and Dagenham, was tying his campaign banners to gravestones, Sam Holland, Conservative Parliamentary Candidate for Dagenham and Rainham, has launched a petition to Sir Keir Starmer, James Asser (Chair of the Labour National Executive Committee) and David Evans (General Secretary of the Labour Party) to suspend Mr Rodwell.\nSam Holland wrote a letter to Sir Keir to demand he investigate Cllr Darren Rodwell's actions - more than 48 hours have now elapsed with no public response from the Labour Party. It is time to petition them to do something about it. It is time for Mr Rodwell to go.\nArticles:",
  "https_www_samholland_uk_/https_www_samholland_uk_news_we-must-end-labours-war-motorist/content_34.html": "Dagenham and Rainham has a proud motoring history. We made the most popular car ever driven in Britain. Successive generations of my own family were part of that proud heritage, working in every part of the Ford Dagenham plant. Many of them were even members of the trade unions which once stood so firmly behind the working men and women of Dagenham and Rainham, supporting them as they went about their work.\nThat proud history has done so much to shape me and my politics today – and that’s why I’m so determined to stand up to modern Labour and its war on working class motorists here in Dagenham and Rainham and across London.\nIt simply isn’t right that people in our area must accept all the burdens imposed upon them and their use of private vehicles by the Labour Mayor Sadiq Khan and his supporters and backers in our local councils.\nThe ULEZ expansion has disproportionately targeted working-class aspiration, foisting new costs on small business owners like plumbers, builders, market stool owners, joiners, fitters, electricians, Ice Cream vans, taxis, you name it – all who rely on their mostly non-compliant vehicles to go about their work.\nULEZ is not the only front in this war. Controlled Parking Zones (CPZs) have been installed in many areas of Dagenham on streets where they aren’t wanted by residents. My Labour opponent in the General Election here sat in the Cabinet of Barking and Dagenham Council and was personally responsible for them. Now Labour has part-control in Havering Town Hall, who is to say they will not be arriving with a vengeance across Elm Park, South Hornchurch, Beam Park, Rainham and Wennington with her backing too? More restrictions. More fines for non-compliance.\nThe new Silvertown Tunnel looks set to bring with it new Toll charges not just there but on the existing Blackwall Tunnel too. Anything between £8-£17 a day to cross the river.\nPay-per-mile is actively being explored for future roll-out by Labour Mayor Sadiq Khan. A new super tax on driving anywhere and everywhere within the Greater London boundary. Undoubtedly this will be supported by his proxies here in Dagenham and Rainham should he get a third term in City Hall.\nI’m really concerned it won’t end there. If we look at Labour-run Wales, they’ve just implemented a country-wide 20mph default speed limit across the nation. A blueprint for making driving even more difficult across the United Kingdom.\nI want to slam the brakes on Labour’s targeting of Motorists and will lead the charge for a screeching U-turn on all these draconian and divisive anti-motoring, anti-hard work, anti-aspiration measures coming to Dagenham and Rainham. With your support, we can put an end to the war on Motorists not just here, but across the United Kingdom.",
  "https_www_samholland_uk_/https_www_samholland_uk_about-sam-holland/content_16.html": "I'm Sam Holland, I'm standing to be the first Conservative MP for Dagenham and Rainham.\nI grew up at 7 Hunters Hall Road, Dagenham and attended Brittons School in Rainham. My first job at 16 was in Tesco Rainham. I’m the son of a family of Ford factory workers and latterly a London bus driver. My Mum is a cleaner in a Rainham factory. My Aunt, a maternity worker at Queen’s Hospital, Romford. I’m the product of one of the best upbringings on offer in the UK – a Dagenham and Rainham family with local Dagenham and Rainham values. I understand what it means to be made in Dagenham and Rainham.\nMum and Dad understood that to get on in life, hard work and giving back to your community is what counts. Ever since I was young, they have instilled this ethos in me. That’s why I volunteered with the Dagenham Air Cadets and even became its Commanding Officer – there, I led and guided a team to turn potentially troubled Dagenham kids into great citizens and future leaders. My team and I helped instil values of hard work, teamwork, and self-reliance into Dagenham’s young people.\nI am not a career politician. Away from campaigning, I am lucky enough to work in financial services. I am married to my wonderful wife Becky who I love with all my heart. In my spare time, I enjoy watching football (which I'm not very good at playing) and have recently taken up golf - a sport better suited to my fitness level!",
  "https_www_samholland_uk_/https_www_samholland_uk_cdn-cgi_l_email-protection/content_26.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_samholland_uk_/https_www_samholland_uk_cookies/content_17.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_samholland_uk_/https_www_samholland_uk_news_nhs-queens-hospital-and-reality/content_21.html": "Prospective Conservative MP for Dagenham and Rainham Sam Holland has hit out at Labour’s Jon Cruddas and Margaret Mullane for what he called their “smoke and mirrors” campaign on the NHS and Queen’s Hospital.\nCiting a figure of more than 60,000 waiting for treatment across the Barking, Havering, and Redbridge University Hospital Trust (BHRUT), Jon Cruddas and Margaret Mullane claimed this was the fault of the Prime Minister.\nIn response, Sam Holland told the Havering Daily, “Labour time and again fail to acknowledge the role a focus on quality and standards plays in the delivery of public services. Under the Chairmanship of Former Labour Home Secretary Jacqui Smith, only this year the Care Quality Commission issued a report explicitly stating that Queen’s Hospital requires improvement in the standard of management and care across multiple departments. Jacqui Smith also Chairs another NHS Trust, University Hospitals Birmingham, where improvements are required. Sadly, at the height of the pandemic, Jacqui Smith deemed it appropriate to appear on Strictly Come Dancing instead of having a laser-focus on helping the front-line there through the pandemic.\nJon Cruddas and Margaret Mullane also failed to highlight the role their Union backers have had in calling strikes which have been deliberately timed to hamper a great national effort to reduce overall waiting times following the Pandemic”.\nSpeaking of his personal connection with the local NHS and Queen’s Hospital, Sam added, “The outcomes at Queen’s Hospital, and of the wider local NHS, are personal for me. Members of my own family work on the front-line in Queen’s, and members of my family have received end-of-life care at the Hospital. I know how dedicated and professional the front-line staff are at the Hospital and I pay tribute to them and everything they endured to get us all through the pandemic”.\nThe Government has put record levels of funding into the NHS and is committed to cutting overall waiting times across the country. The Prime Minister has launched the first ever Long-term Work Force plan for the NHS which will see Medical School places, GP’s, and Adult Nursing training places all increase significantly so it has the skills and staffing it needs long into the future.",
  "https_www_samholland_uk_/https_www_samholland_uk_RainhamQuarry/content_27.html": "Plans to build a new quarry in Rainham have gone to Havering Council. If approved, this new 50-acre site will be quarrying 2 million tonnes of sand and gravel for up to 20 years, with 114 two-way Heavy Goods Vehicle (HGV) movements per day.\nPeople in Rainham are tired of not being listened to, what with the ongoing issues at Launders Lane, and the legacy impact of the Wennington fires.\nPlease complete the survey below expressing your views on these plans. The more completed surveys we have, the more that can be passed to Havering Council.\nQuarry details: https://www.rainhamquarry.co.uk/",
  "https_www_samholland_uk_/https_www_samholland_uk_map-locations/content_5.html": "Skip to main content\nMain navigation\nHome\nAbout Sam\nNews\nContact\nMy map",
  "https_www_samholland_uk_/https_www_samholland_uk_news/content_6.html": "Sam Holland welcomes Independent Football Regulator from Government, putting Dagenham & Redbridge and West Ham’s voices front and centre Tuesday, 19 March, 2024 Sam Holland welcomes Independent Football Regulator from Government, putting Dagenham & Redbridge and West Ham’s voices front and centre Local football clubs are the lifeblood of communities across the country, so fans should be at the heart of decisions impacting them. That is why the Conservative Government is introducing legislation to create an Independent Football Regulator, making sure fans... Articles\nSam Holland says stick to the plan as he welcomes Budget which puts families in Dagenham and Rainham first 6th March 2024 Sam Holland says stick to the plan as he welcomes Budget which puts families in Dagenham and Rainham first. Sam Holland, Prospective Conservative MP for... Articles\nPETITION: Expand the Superloop to Dagenham and Havering 21st February 2024 Sadiq Khan has left Dagenham and Havering behind with his so-called Superloop. Let's change that! Local News\nJoin your local neighbourhood watch group in Dagenham and Rainham 1st February 2024 Crime and anti-social behaviour is a growing issue across Dagenham and Rainham. So to ensure we are safer in our communities I have setup local community... Local News\nStop Rainham Quarry Survey 18th December 2023 Plans to build a new quarry in Rainham have gone to Havering Council. If approved, this new 50-acre site will be quarrying 2 million tonnes of sand and gravel... Opinions\nBarking and Dagenham Debt and Deficit – sounding the alarm 18th November 2023 We hear much from Labour about “Tory cuts” to local government. Now, it is true that local government budgets have been cut since 2010. A necessity following a... Articles\nWe cannot allow Remembrance to be disrupted by protest 7th November 2023 For over 100 years, Britain has staged a national act of remembrance for those slain whilst fighting for the freedom and traditions which have made Britain the... Articles\nSam Holland welcomes second Cost of Living payment from Conservative Government for 16,500 vulnerable households in Dagenham and Rainham 31st October 2023 As global inflation driven by Putin’s illegal war in Ukraine continues to put pressure on households, the Conservative Government is delivering its £94 billion... Articles\nTell Darren Rodwell to GO... 23rd October 2023 After many media reports stating that Cllr Darren Rodwell, Leader of the London Borough of Barking and Dagenham, was tying his campaign banners to gravestones... Local News\nBeam Park Station: What do you think? 15th October 2023 Sam Holland and Keith Prince's Survey on Beam Park Station. Opinions",
  "https_www_samholland_uk_/https_www_samholland_uk_campaigns_more-activities-young-people-and-elderly/content_4.html": "I've led youth groups in Dagenham and Rainham. I will work with local organisations to bring more new and existing activity provisions for all.\nI've led youth groups in Dagenham and Rainham. I will work with local organisations to bring more new and existing activity provisions for all.",
  "https_www_samholland_uk_/https_www_samholland_uk_news_sam-holland-says-stick-plan-he-welcomes-budget-which-puts-families-dagenham-and-rainham-first/content_22.html": "Sam Holland says stick to the plan as he welcomes Budget which puts families in Dagenham and Rainham first.\n- Sam Holland, Prospective Conservative MP for Dagenham and Rainham, has welcomed the Government’s Budget, sticking to the plan and supporting more families across Dagenham and Rainham with the cost of living.\n- By sticking to the plan to halve inflation and strengthen the economy, the Conservative Government have unveiled a Budget that continues to support with the cost of living by cutting taxes, supporting parents with childcare and cutting the cost of fuel at the pump.\n- This Budget supports families across Dagenham and Rainham, putting more money in their pockets to help with the cost of living, reward hard work and build a brighter future for people.\nSam Holland has welcomed the Conservative Government’s Budget, sticking to the plan and supporting more families across Dagenham and Rainham with the cost of living.\nBy sticking to the plan, and more than halving inflation from 11.1. per cent to 4.0 per cent, the Conservatives are tackling the cost of living, with wages continuing to grow and mortgage rates starting to come down.\nAt the Budget the Conservatives have gone further to support families by putting more money back in people’s pockets through tax cuts, supporting more parents with the cost of childcare and freezing fuel duty for the fourteenth consecutive year.\nThe cut to National Insurance, together with the tax cut announced at the Autumn Statement 2023, means a hard-working family in Dagenham and Rainham with two earners earning the average wage – £35,400 – will receive a combined annual tax cut of £1,827.\nThe cut to the High-Income Child Benefit Charge means a family with two children in Dagenham and Rainham, whose higher earner has an income of £65,000, will gain around £1,664 towards the cost of their childcare.\nThese measures build on significant cost of living support including £900 cost of living payments for eight million families, a record boost to the National Living Wage and the increase of the State Pension and working age benefits.\nThis Budget builds on the Conservative Government’s work to stick to the plan to deliver a brighter future for Britain.\nCommenting, Sam Holland said:\n“Although inflation is down from 11.1 per cent to 4.0 per cent and wages are growing, I am pleased the Conservative Government is continuing to help families across Dagenham and Rainham with the cost of living.\n“This Budget builds on significant cost of living support by putting more money back in people’s pockets, cutting the cost of childcare and freezing fuel duty.\n“The Government have been able to put forward these measures thanks to the long-term decisions the Conservatives have taken, sticking to the plan to strengthen our economy, and helping to secure a brighter future for families across the country.”\nCommenting, Chancellor of the Exchequer Jeremy Hunt MP said:\n“Because the Conservatives are sticking to the plan, with the economy inflation is down from 11.1 per cent to 4.0 per cent, meaning we can cut taxes and put more money in people’s pockets to grow the economy.\n“Our Budget cuts taxes to reward work, supports small businesses and helps more parents with the cost of childcare to grow the economy and fund public services.\n“By sticking to the plan, the Conservatives will deliver a stronger economy to build a brighter future. Labour cannot say what they would do with the economy because they do not have a plan and would take us back to square one.”",
  "https_www_samholland_uk_/https_www_samholland_uk_campaigns_test/content_8.html": "Skip to main content\nMain navigation\nHome\nAbout Sam\nNews\nContact\nTest\nTweet\nTest",
  "https_www_samholland_uk_/https_www_samholland_uk_campaigns_fighting-crime-dagenham-and-rainham/content_18.html": "Under Labour's Sadiq Khan, the Met Police is under special measures. They have failed us on Crime. I will fight to make Dagenham and Rainham safer for you and your family.\nUnder Labour's Sadiq Khan, the Met Police is under special measures. They have failed us on Crime. I will fight to make Dagenham and Rainham safer for you and your family.",
  "https_www_samholland_uk_/https_www_samholland_uk_beam-park-station/content_9.html": "Sam Holland welcomes Independent Football Regulator from Government, putting Dagenham & Redbridge and West Ham’s voices front and centre\nLocal football clubs are the lifeblood of communities across the country, so fans should be at the heart of decisions impacting them.",
  "https_www_samholland_uk_/https_www_samholland_uk_campaigns_ensuring-we-have-cleaner-streets/content_15.html": "In Dagenham and Rainham rubbish on our streets and fly-tipping is on the increase. Much of which is from people who do not live in our communities. As your candidate and hopefully your MP, I will fight for more cameras to catch fly-tippers in the act, fight for higher fines to make sure people learn their lesson and finally fight for more funding to hire more street cleaners across Dagenham and Rainham.",
  "https_www_samholland_uk_/https_www_samholland_uk_campaigns_put-local-decisions-your-hands/content_2.html": "Labour's boroughwide Controlled Parking Zone policy in Barking and Dagenham is a key example why we need grassroots led decisions in our communities. Under my campaign schemes like Parking Zones will be community led and not imposed unwilfully on local hardworking people.",
  "https_www_samholland_uk_/https_www_samholland_uk_superloop/content_30.html": "Sam Holland welcomes Independent Football Regulator from Government, putting Dagenham & Redbridge and West Ham’s voices front and centre\nLocal football clubs are the lifeblood of communities across the country, so fans should be at the heart of decisions impacting them.",
  "https_www_samholland_uk_/https_www_samholland_uk_news_sam-holland-welcomes-second-cost-living-payment-conservative-government-16500-vulnerable/content_31.html": "- As global inflation driven by Putin’s illegal war in Ukraine continues to put pressure on households, the Conservative Government is delivering its £94 billion cost of living support package to help vulnerable and low-income families across the country.\n- This is why, as part of this record support, eight million low-income households will receive the second Cost of Living payment worth £300 from 31 October 2023, with payments totalling £900 through 2023-24, helping to protect the most vulnerable people from rising prices.\n- The Conservative Government is working to deliver on the Prime Minister’s priority to halve inflation this year, while providing targeted cost of living support in the meantime.\nSam Holland has welcomed the arrival of the second Cost of Living payment worth £300 for 16,500 vulnerable and low income households in Dagenham and Rainham from 31 October 2023, as part of the Conservative Government’s record £94 billion cost of living support package.\nEight million households across the UK in receipt of eligible means-tested benefits, such as Universal Credit, Pension Credit, or tax credits, will benefit from the second of three Cost of Living payments totalling £900 in 2023-24. These payments help low-income and vulnerable families affected by rising prices driven by Putin’s illegal war in Ukraine and the aftermath of the Covid-19 pandemic.\nThis latest payment builds on the Cost of Living payments made last year worth up to £1,200, and form part of the Conservative Government’s record financial support for the most vulnerable, worth an average of £3,300 per household.\nThe payment will be made automatically so there is no need to apply and it will not count towards the benefit cap or impact on existing benefit awards.\nFurther support will also be made available for vulnerable households later this winter. Winter Fuel Payments have been boosted again this year with an additional £300 Pensioner Cost of Living payment.\nIn addition, nearly three million low-income households are eligible for a £150 rebate on their winter electricity bills through the Warm Home Discount, and the Cold Weather Payment is coming into effect from 1 November 2023 to provide eligible households an extra £25 a week when the temperature drops below zero degrees for more than seven days.\nThe Conservative Government is taking immediate steps to support hardworking families with the cost of living, while working to halve inflation and taking the long-term decisions that are in the best interests of the country.\nCommenting, Sam Holland said:\n“The Conservative Government is continuing to do everything it can to cushion households across Dagenham and Rainham from the impact of rising prices driven by Putin’s illegal war in Ukraine and the aftermath of the Covid-19 pandemic.\n“The record financial support has already supported thousands of families across Dagenham and Rainham, and this latest £300 Cost of Living payment for 16,500 eligible households will make a huge difference to the most vulnerable households and those on the lowest incomes as we move into the colder months.\n“While the Conservative Government is taking immediate action to support those most in need, they rightly remain committed to halving inflation which is the best way to help everyone with the cost of living.”\nCommenting, Mel Stride, Secretary of State for Work and Pensions, said:\n“Tackling inflation is the best way to boost people’s incomes, but as we work to halve it, we are protecting the most vulnerable households from high prices with this latest Cost of Living payment.\n“Thousands of Work Coaches based in Jobcentres across the country are on hand to help people find work or enhance their skills, and I encourage anyone wanting to strengthen their finances and unleash the benefits of work to contact their local Jobcentre to see what help is available.”",
  "https_www_samholland_uk_/https_www_samholland_uk_news_sams-survey/content_23.html": "Sam Holland welcomes Independent Football Regulator from Government, putting Dagenham & Redbridge and West Ham’s voices front and centre\nLocal football clubs are the lifeblood of communities across the country, so fans should be at the heart of decisions impacting them.",
  "https_www_samholland_uk_/https_www_samholland_uk_about-rss/content_25.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_samholland_uk_/https_www_samholland_uk_accessibility/content_32.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_samholland_uk_/https_www_samholland_uk_news_barking-and-dagenham-debt-and-deficit-sounding-alarm/content_33.html": "We hear much from Labour about “Tory cuts” to local government. Now, it is true that local government budgets have been cut since 2010. A necessity following a ballooned fiscal deficit and increased debt left by the last Labour Government. That annual deficit ran to £103 billion in the fiscal year 2009/2010. Faced with such an unsustainable budget deficit, the government rightly chose to cut government spending. Indeed, the then Labour Chancellor Alistair Darling agreed with this need to reduce annual spending, saying before the 2010 General Election that his Labour government, if re-elected, would “…cut deeper than Margaret Thatcher did”. The alternative was to raise taxes on ordinary working people.\nAs a Conservative, I believe working people know how to spend their money better than any government.\nFast forward to 2023, we face similar fiscal challenges. A once in a generation public health emergency necessitated the de facto switching off of the UK economy, and hugely expensive spending on schemes like furlough, to stave off unprecedented levels of unemployment and keep the economy afloat. Without the fiscal restraint shown by the Conservative-led Government in the early 2010’s, this intervention to protect people’s livelihoods throughout the pandemic simply wouldn’t have been possible. The Government took decisive action to fix the leaky roof before a huge storm blew in.\nHere in Dagenham and Rainham, we have a very different scenario at the local level.\nThe London Borough of Barking and Dagenham (LBBD) faces both immediate and longer-term budget challenges – of huge proportions. It is one of the most heavily indebted councils in Britain, mostly due to property acquisitions[1].\nIn fiscal year 2023/24, LBBD has a forecast overspend of £15 million. This budget gap is estimated to reach around £30 million by fiscal year 2027/28. Reserves have sharply decreased from what were once considered healthy levels to just £17.5 million. At this rate of depletion, reserves will be exhausted within 1-3 years, leaving insufficient funds to cover projected overspend. LBBD would in effect be a bankrupt council.\nThe root cause of this budgetary pressure appears to be excessive levels of borrowing to fund the council’s increasingly risky investment strategy. Debt is projected to double to £2 billion in the next 3 years and to reach nearly £3 billion in 7 years’ time[2].\nReading LBBD’s Treasury Management Strategy Statement 2023/24, council officers have highlighted several major development schemes have been approved despite them not being financially viable, incurring huge risks to the council taxpayer[3].\nLBBD also appears to be relying on optimistic assumptions for income sources such as council tax, business rates and investment dividends. Any underperformance (which is not an impossibility set against continued wider UK and global economic headwinds), could create a crisis – some risks resting on these optimistic forecasts appear to already be crystallising.\nIt’s also hugely concerning that the council has not had a proper audit conducted of its accounts since fiscal year 2018/19[4].\nThe council needs to urgently change its course.\nIn the cabinet meeting of 20th September 2022, chaired by the Leader of the Council, Cllr Darren Rodwell, the council agreed to borrow further millions for property acquisitions[5].\nThese decisions, made amidst the council's financial difficulties, raise serious questions about fiscal responsibility and accountability. Without serious course correction, LBBD may eventually default on these self-imposed debts, accumulated through extraordinary financial mismanagement.\nBarking and Dagenham is an area with significant deprivation and challenges – it should urgently reconsider its approach to debt and adopt a more prudential path to managing its budget and spending. Council taxpayers should not have to pick up the burden of its elected Councillor’s financial folly.\nSources:\n[1] Source: Treasury Management and Investment and Acquisition Strategy 2023/24 Mid-Year Review - paragraph 4.12\n[2] Source: LBBD Treasury Management Strategy Statement 2023/24, Appendix TMSS 2023-24 - App.2 Borrowing.\n[3] Source: LBBD Treasury Management Strategy Statement 2023/24, Appendix TMSS 2023-24 - App.2 Borrowing.\n[4] Source: Audit and Standards Committee Meeting – Weds 4th Oct 2023 - Webcast – particularly 34 mins 05 secs and 45 mins 19 secs (Cllr Rocky Gill expression of concern on amount of debt and deficit and leadership of the council in relation to its finances).\n[5] Source: LLB Cabinet Meeting – Thurs 20th Sep 2022 – Agenda and Minutes. Item 34: Proposed Purchase of Maritime House Office Building, Linton Road, Barking and Item 35: Proposed Purchase of the Edwards Waste Site, Gallions Close, Barking. 20th Sep 2022 Cabinet Meeting Agenda and Minutes",
  "https_www_samholland_uk_/https_www_samholland_uk_news_category_Articles/content_19.html": "Sam Holland welcomes Independent Football Regulator from Government, putting Dagenham & Redbridge and West Ham’s voices front and centre 19th March 2024 Sam Holland welcomes Independent Football Regulator from Government, putting Dagenham & Redbridge and West Ham’s voices front and centre Local football clubs... Articles\nSam Holland says stick to the plan as he welcomes Budget which puts families in Dagenham and Rainham first 6th March 2024 Sam Holland says stick to the plan as he welcomes Budget which puts families in Dagenham and Rainham first. Sam Holland, Prospective Conservative MP for... Articles\nBarking and Dagenham Debt and Deficit – sounding the alarm 18th November 2023 We hear much from Labour about “Tory cuts” to local government. Now, it is true that local government budgets have been cut since 2010. A necessity following a... Articles\nWe cannot allow Remembrance to be disrupted by protest 7th November 2023 For over 100 years, Britain has staged a national act of remembrance for those slain whilst fighting for the freedom and traditions which have made Britain the... Articles\nSam Holland welcomes second Cost of Living payment from Conservative Government for 16,500 vulnerable households in Dagenham and Rainham 31st October 2023 As global inflation driven by Putin’s illegal war in Ukraine continues to put pressure on households, the Conservative Government is delivering its £94 billion... Articles\nWe must end Labour’s War on the Motorist 6th October 2023 Dagenham and Rainham has a proud motoring history. We made the most popular car ever driven in Britain. Successive generations of my own family were part of... Articles\nThe NHS, Queen’s Hospital and the Reality 21st September 2023 Prospective Conservative MP for Dagenham and Rainham Sam Holland has hit out at Labour’s Jon Cruddas and Margaret Mullane for what he called their “smoke and... Articles\nLetter of Concern: Sam Holland calls for Children Service's Investigation 11th September 2023 Today, Sam Holland, Conservative Parliamentary Candidate for Dagenham and Rainham, wrote to the Department for Education calling for an investigation into the... Articles",
  "https_www_samholland_uk_/https_www_samholland_uk_news_category_Local-News/content_14.html": "PETITION: Expand the Superloop to Dagenham and Havering 21st February 2024 Sadiq Khan has left Dagenham and Havering behind with his so-called Superloop. Let's change that! Local News\nJoin your local neighbourhood watch group in Dagenham and Rainham 1st February 2024 Crime and anti-social behaviour is a growing issue across Dagenham and Rainham. So to ensure we are safer in our communities I have setup local community... Local News\nTell Darren Rodwell to GO... 23rd October 2023 After many media reports stating that Cllr Darren Rodwell, Leader of the London Borough of Barking and Dagenham, was tying his campaign banners to gravestones... Local News\nSam Holland selected as the Conservative candidate for Dagenham & Rainham 5th September 2023 Conservative Party members from across Dagenham and Rainham have selected Sam Holland as the Conservative Prospective Parliamentary Candidate for the Dagenham... Local News",
  "https_www_samholland_uk_/https_www_samholland_uk_campaigns_no-more-overdevelopment/content_13.html": "Tweet Dagenham and Rainham are famous for their quality family housing. Whilst we need more housing, it should be in keeping with the local community.",
  "https_www_samholland_uk_/https_www_samholland_uk_news_sam-holland-welcomes-independent-football-regulator-government-putting-dagenham-redbridge-and/content_29.html": "Sam Holland welcomes Independent Football Regulator from Government, putting Dagenham & Redbridge and West Ham’s voices front and centre\n- Local football clubs are the lifeblood of communities across the country, so fans should be at the heart of decisions impacting them.\nThat is why the Conservative Government is introducing legislation to create an Independent Football Regulator, making sure fans are consulted on key decisions that impact club heritage, boosting fan involvement and guaranteeing that fans have a say in the future direction of their club.\n- The Conservative Government is sticking to its plan to put fans first creating a brighter future for our national game and local clubs, including Dagenham & Redbridge and West Ham fans in Dagenham and Rainham\nSam Holland has welcomed the news that Dagenham & Redbridge and West Ham and their fans are set to benefit from the creation of an Independent Football Regulator following the introduction of the Football Governance Bill.\nLocal clubs are the lifeblood of communities across the country. The introduction of legislation to create the Independent Football Regulator follows a number of threats to the game that have arisen without fan consultation; these have included club relocations, the creation of the European Super League and drastic alterations to the identity of clubs which have threatened their heritage.\nThat is why the Conservative Government is addressing the concerns of fans by creating an Independent Football Regulator which will be given comprehensive powers to work with clubs to improve their finances, create stronger tests for proposed club owners and safeguard clubs’ heritage by delivering greater fan representation in club decisions.\nThe Independent Football Regulator will oversee a new licensing regime for clubs in the top five tiers of English football. The regulator will follow an advocacy first approach but will have the power to revoke licences and impose fines where serious breaches occur.\nThe regulator will also be responsible for overseeing requests by club owners to sell the club or relocate the stadium and introduce baseline standards for fan involvement in key off field decisions such as club heritage.\nThe Conservative Government is sticking to its long-term plan for fans, making sure that their concerns are listened to, creating a brighter future for the game.\nCommenting, Sam Holland said:\n“Football clubs like Dagenham & Redbridge and West Ham are the lifeblood of communities across the country, including in Dagenham and Rainham with thousands of us each week turning out to support our local teams.\n“That is why I welcome that the Conservative government is ensuring that fans are better represented through the creation of the Independent Football Regulator which will bolster clubs’ financial security, protect the heritage of our clubs and represent fans at all levels.\n“The Conservative Government is sticking to its long-term plan for fans, creating a brighter future for fans and our beloved local clubs.”\nCommenting, Prime Minister Rishi Sunak said:\n“Football has long been one of our greatest sources of national pride. Up and down the country, it brings people together in celebration or commiseration.\n“But for too long some clubs have been abused by unscrupulous owners who get away with financial mismanagement, which at worst can lead to complete collapse – as we saw in the upsetting cases of Bury and Macclesfield Town.\n“This Bill is a historic moment for football fans – it will make sure their voices are front and centre, prevent a breakaway league, protect the financial sustainability of clubs, and protect the heritage of our clubs big and small.”\nCommenting, Culture Secretary Lucy Frazer said:\n“Football is nothing without its fans. We are determined to put them back at the heart of the game, and ensure clubs as vital community assets continue to thrive.\n“The new Independent Regulator of Football will set the game on a sustainable footing, strengthening clubs and the entire football pyramid for generations.”"
}