{
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_pipcouncillors-1/content_37.html": "We are now offering Party Membership to our supporters. Join us and have your say on how we can shape Castle Point for the benefit of the residents. Visit our membership page here\nWho We Are\nGet to Know Our Councillors\nWarren Gibson\nCouncillor for Victoria Ward\nI have lived in Castle Point for all of my 46 years, with a majority of that time being spent living in Victoria ward. My parents rented, and ultimately, bought their own home from the council, my childhood home. I went to school in this area, I love this area and I am passionate about its survival and sustainability. I earn my living as a Castle Point taxi driver; I have experience serving on committees in order to drive real and positive change. I am not a politician but I have the necessary skillset to deliver results for the people I represent without the restraints of a party whip. I decided to stand in the local council elections for a number of reasons and was enthused to join PIP which I believe had a real voice, free from the shackles and nonsensical point scoring of party-political ideology. Castle Point needed to change, under the Conservative majority council, which seemed to believe it had a divine right to rule without the checks and balances being applied to rein them in, the boroughs infrastructure had deteriorated, the banks had moved out, schools, doctors and dentist had become oversubscribed, our libraries are under threat and our roads had become ‘third world’. There had been very little to engage or embrace either the youth group or the older members of our community. The straw that broke the camel's back for me was the utter disregard for the voters of Castle Point when trying to push through the Local Housing Plan, a plan more aligned with the interests of large property developers than the hopes, needs and requirements of local people. I was so encouraged when doing door to door canvassing for the 2021 local elections that these concerns were shared by the vast majority of residents I spoke to, and they were also looking for change. I was elected as a PIP councillor in May 2021 and am very proud and feel very honoured to be able to represent Victoria ward.\nSteve Mountford\nCouncillor for Cedar Hall Ward\nI have lived in Cedar Hall, Thundersley for most of my adult life. I regularly walk our dog in the Cedar Hall Ward and surrounding area, so I am local to be able to understand and represent the people that live here. I am married and have four sons who went to Thundersley Primary School and King John School.\nBeing elected in May 2021, was a major achievement in bringing independence to our borough. I am the cabinet portfolio holder for resources, which means I am responsible for the finances for Castle Point Council. I am a qualified accountant so I bring valuable experience to help ensure our council is being run effectively, that we receive value for money and plan ahead.\nBecoming a councillor has shown me a whole new way to look at things locally and nationally too.\nI originally decided to stand as a councillor to stop the Conservative Party from building 5,000 houses on our Green Belt in Castle Point. We withdrew the failed Conservative Local Plan and are working on a new Castle Point Plan that protects the Green Belt and utilises Brownfield sites.\nIn 2022, we took the overall majority of the council allowing us to make key decisions; including resolving some long overdue issues of under-investment and utilising the assets and resources to improve services and reduce costs.\nemail; cllrsmountford@castlepoint.gov.uk\nRuss Savage\nCouncillor for St Marys Ward\nI was born in Laindon in 1964, where I received my education. On leaving school, aged 16, I secured an Electrical Apprenticeship at Shellhaven Refinery where I worked for 20 Years. My roles included Maintenance, Telecoms and Projects (where I acquired skills for building teams with one central aim, and how to achieve this in a managed and timely manner). I moved to working Offshore in 2000; commuting to various European destinations, flying to offshore installations across the North Sea and also working on Shell’s onshore installations. I held various Senior Operations roles, one of these being Shell UK’s HSE Safety Specialist. My responsibilities included coaching Operational Safety, and undertaking HSE related audits on all aspects and locations operated by the company internationally. Also part of this role, I investigated various incidents and accidents within our business, participating in multi agency, multi country investigations. During this period I utitlised my project management experience together with skills of identifying issues, implemented actions to improve, and monitoring actions for compliance and effectiveness . From my roles I have learnt how to work under pressure, in very stressful and extreme environments, and be able to make rational and sensible decisions taking all the evidence into account. After a rewarding career, I was very lucky to be able to retire early in 2020. Living in Benfleet since 1990 I have been a School Governor at Jotmans school for many years. Although I have never been ‘political’, I have become concerned in recent years about how the local council has been run, and how they were taking actions without taking residents views into account. When I heard about The People's Independent Party in early 2021, their ideas on how to save our Green Belt, and how local residents views and concerns really do matter, I volunteered to help. I believed I had the attributes and skills, learnt from my working life, to be able to make a difference for the community and make Castle Point a better place to live.\nI became a PIP candidate for St Mary’s ward, and after a short but intensive campaign, not only on the Local Plan, but all aspects of local government, I received the support of the ward in May 2021 and was elected as a councillor, a seat which for many years had been Conservative\nemail; cllrrsavage@castlepoint.gov.uk\nLynsey McCarthy-Calvert\nCouncillor for Appleton Ward\nI live on Kents Hill Road with my husband, 4 children and mother-in-law. My family have deep roots here. I work as a doula (birth education and support) and psychotherapist/counsellor, so listening to people is what I do for a living. Previously I was chair of the Mid & South Essex Maternity Voices Partnership and I was also a non-executive member of the NHS England’s Regional Maternity Programme Board for East of England working strategically to improve maternity services for the region. My priority is to listen to fellow residents and follow their wishes. I want to improve our services for all residents and will look for ways to provide youth services, promote good mental health, reduce vandalism and anti-social behaviour. I want to see increased access to community services for our elderly and vulnerable residents and improve our child and adult social care. I will lobby for Essex County Council to turn our streetlights on and repair and maintain our roads and paths which are in a shocking condition. My focus for standing as your Appleton Ward candidate is due to the devastating effect of the Local Plan. This plan is to build over 5,000 homes within the next 15 years. We must fight to reduce the numbers and protect our green belt at all costs. Our future depends on it. Voting for me will be a vote for change, for a local person whose only interest is to serve fellow residents, to hold the council to account and demand fairness and transparency from the administration at Castle Point Borough Council.\ncllrlmccarthy-calvert@castlepoint.gov.uk\nHannah Barton-Brown\nCouncillor for St. Peter's Ward\nI have lived in Thundersley all my life and I am very passionate about the area. I have two small children who go to a local school and my husband runs a local business. As a resident who has concerns about the local issues within the area, I feel like I can’t complain about something that I am not willing to fight to change. I am passionate about driving change, not giving in, and pushing for what is right. I am not a politician, and I am not a fan of politics. I am concerned that there are decisions being made on our local area that are not in the best interests of the community. When I heard about a group of like-minded people who want to fight for our local area and represent the residents, I felt it was only right to want to get involved and have a voice. We need to ensure that we have suitable facilities in the area for the young and the elderly. Invest in improvements for the area to benefit our community. Utilise our open spaces and supporting those who need it. Let’s not turn everything into a concrete jungle putting our services under strain. Working together as a team we can ensure the voices of residents are heard and that the government and council do not railroad projects that are not in the best interests of our community. I would like to be a voice for the local people to ensure we will continue to love living in Castle Point and protect our area for the future\nTom Gibson\nCouncillor for Cedar Hall Ward\nI have lived in Castle Point my whole life and attended The King John School and Seevic College. I went to The University of Huddersfield to study Politics and was President of the Huddersfield Student wing which allowed me to develop skills in various aspects of political operation. I worked on grassroots campaigns to save the A&E at Huddersfield Royal Infirmary, as well as various other community causes. Wherever I have been and whatever I have done, being involved as part of a community has been at the heart of it all. My ideology is completely aligned with The People’s Independent Party: transparent, honest and a steadfast representation of the interests of the people who I have grown up with and not tied to national party politics. Whether you have lived here for decades and are appalled at what is being done to our once happy and sustainable borough or, like me, are a young person facing the harsh reality that you will never be able to afford to live independently in the community you've called home for your entire life. I want to help correct the Local Plan to reduce the numbers, protect the green belt and ensure affordable housing is affordable. The choice for the May Election is simple. Please vote for your local People's Independent Party candidate and start having a real say in what happens to your community and your home.\nKieron Bowker\nCouncillor for Victoria Ward\nThank you for your resounding support in 2022. It’s a real privilege to represent you all in Victoria.\nI’m 64 years old and I’m very happily married to Gerri with one son Henry. I have spent much of the last 40 years living in the area. I have become increasingly frustrated with national Red/Blue “pendulum” politics. Haven’t we all? The “One Size Fits All” national policy approach puts local needs and local voices firmly at the back of the queue in favour of national party dogma and political posturing. That’s not for me.\nPIP are local people for local people. I feel greatly energised by this new approach. I am an unashamed “localist” and common sense centrist. I make no apologies for that. Our precious greenbelt remains under serious threat from developers who don’t give a fig for the consequences. Land agents and developers will continue to seek to destroy our borough under concrete and then simply move on to the next target. That’s what they do as we all know. But I can’t stand by and allow them to destroy our borough. I refuse to wave the white flag as the previous administration did. We, the local people speak the same simple language.\nSince the independent alliance took control, we have kicked out the disastrous 2019 Conservative plan to destroy vast swathes of our greenbelt as we said we would. We kept our promise. You spoke. We listened. The first Independent administration in Castle Point history are now working on a new local plan based upon real local need, much lower numbers, smaller dwellings and on brownfield sites. Our shared vision.\nWe continue to seek transparency and accountability in all matters. We have instigated a root and branch formal review of structure in Castle Point in order to make us Fit For Purpose in the 21st century. We have delivered a completely balanced budget in 2023 which was a challenge having inherited a substantial Conservative deficit.\nWe are actively lobbying Essex County Council on many fronts. We currently receive very poor value/ service from this one party dominated monolith. There are no transparent accounts from ECC. It is extremely frustrating. Ultimately we need PIP councillors at a County level to raise the volume.\nAllan Edwards\nCouncillor for Boyce Ward\nI work as a consultant for a London based public relations agency, specialising in technology. Benfleet is my home and my whole family lives in the area. I was brought up in the town, attending Kents Hill school, Appleton school, and SEEVIC. For the past eight years I have lived in Boyce ward with my wife and daughter in a street that has shown its tremendous community spirit during the last few challenging years. I volunteer at the Fusion Youth Club as I believe providing our young people with a choice of activities is vital to developing a healthy community. I want to preserve the environment and strengthen the community that makes Benfleet, and Boyce ward special, that means protecting our green belt and ensuring that necessary development comes with the necessary infrastructure.\nI have decided to stand with The People’s Independent Party to bring back a voice for the people, rather than following national party politics, which serves it’s own master.\nSharon Ainsley\nCouncillor for St Mary's Ward\nI have lived in St Mary's ward for over 20 years and in Castle Point all my adult life. I raised my family here. My daughter went to school locally, before going to university. I currently work in logistics as a key worker and previously in Finance.\nA founder member of 'Jotmans Farm Action Group', I have campaigned to preserve this precious area of green belt from development, for over a decade and with your help, will continue to do so. I am passionate about protecting our greenbelt and improving air quality. I want Castle Point to be a great place to live and work. Working together, we can lobby for Improvements to parks creating safe, inviting places and outdoor activities for everyone. Planting wildflowers will help our bees and wildlife. Moreover, I want to make sure that we see an element of levelling up in St Mary’s Ward. Anglian Water need to clean up their Act: For too long, we have suffered with Fugitive emissions from the Water Treatment facility in Watlington Road. In Richmond Park, foul water is pumped into the Watercourses, and escaped untreated sewage spilled onto the playing fields. It’s not on! The choice for the May Election is simple. Please vote for your local People's Independent Party candidate and start having a real say in what happens to your community and your home",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_blank-page-1/content_35.html": "Privacy policy\nWhat type of information do we collect?\nWe receive, collect and store any information you enter on our website or provide us in any other way. In addition, we collect the Internet protocol (IP) address used to connect your computer to the Internet; login; e-mail address; password; computer and connection information and purchase history. We may use software tools to measure and collect session information, including page response times, length of visits to certain pages, page interaction information, and methods used to browse away from the page. We also collect personally identifiable information (including name, email, password, communications); payment details (including credit card information), comments, feedback, product reviews, recommendations, and personal profile.\nHow do we collect information?\nWhen you contact our website, as part of the process, we collect personal information you give us such as your name, address and email address. Your personal information will be used for the specific reasons stated above only.\nWhy do we collect such personal information?\nWe collect such Non-personal and Personal Information for the following purposes:\nTo provide and operate the Services;\nTo provide our Users with ongoing customer assistance and technical support;\nTo be able to contact our Visitors and Users with general or personalised service-related notices and promotional messages;\nTo create aggregated statistical data and other aggregated and/or inferred Non-personal Information, which we or our business partners may use to provide and improve our respective services;\nTo comply with any applicable laws and regulations.\nHow do we store, use, share and disclose site visitors' personal information?\nOur company is hosted on the Wix.com platform. Wix.com provides us with the online platform that allows us to sell our products and services to you. Your data may be stored through Wix.com’s data storage, databases and the general Wix.com applications. They store your data on secure servers behind a firewall.\nAll direct payment gateways offered by Wix.com and used by our company adhere to the standards set by PCI-DSS as managed by the PCI Security Standards Council, which is a joint effort of brands like Visa, MasterCard, American Express and Discover. PCI-DSS requirements help ensure the secure handling of credit card information by our store and its service providers.\nHow do we communicate with site visitors?\nWe may contact you to notify you regarding your account, to troubleshoot problems with your account, to resolve a dispute, to poll your opinions through surveys or questionnaires, to send updates about our party, or as otherwise necessary to contact you to enforce our User Agreement, applicable national laws, and any agreement we may have with you. For these purposes we may contact you via email, telephone, text messages, and post.\nPrivacy policy updates\nWe reserve the right to modify this privacy policy at any time, so please review it frequently. Changes and clarifications will take effect immediately upon their posting on the website. If we make material changes to this policy, we will notify you here that it has been updated, so that you are aware of what information we collect, how we use it, and under what circumstances, if any, we use and/or disclose it.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_copy-of-mike-dearson/content_36.html": "Hello\nMy name is Rob Lillis and I am a PIP candidate for St Mary's ward.\nI have lived in Benfleet nearly all of my life, as has my wife Mandy. We have two children who both attended the same primary school here that I did. My mother and my wife’s parents both live in our Borough. I lived in St. Mary’s ward when I was younger and for the past 17 years on Mill Hill in Boyce ward. I presently run my own banking consultancy company, having worked in banking for several years beforehand. In the past, I have been a school governor, a tutor, a member of various community and fundraising groups and helped run a local boys’ football team for ten years.\nA founding member of Residents Against Glyders Expansion (RAGE), I have campaigned to preserve this area of Green Belt from development. I am fully committed to helping save our Borough’s Green Belt by getting the right Local Plan in place, that we residents both want and need.\nI was truly honoured to be elected as PIP councillor for Boyce ward in May 2023. The fact that so many of my fellow residents put their faith in me (and PIP) was very humbling.\nI presently represent PIP on two of the Council’s committees:\nDevelopment Management Committee (DMC)\nEnvironment Policy and Scrutiny Committee\nI have thoroughly enjoyed my time as councillor, though of course it has its challenges. I take this opportunity to thank all of my wonderful PIP colleagues for their constant help and support. Under the excellent leadership of Cllr. Warren Gibson, I am convinced that we can continue the good work that we are doing on behalf of the residents of our Borough. I welcome very much the fact that the Local Government Association (LGA) notes that the present administration has made significant progress in transforming Castle Point Borough Council. There remains a great deal of work to do, but the report from the LGA clearly shows that we are on the right track.\nEvery decision taken by our local council should always be in the best interests of the community they are employed to serve. This remains at the forefront of my mind in all that I do.\nPIP stands for everything that I believe in; honesty, transparency, accountability, and normal local people (like you and I) listening to and representing the residents.\nMy sincere thanks for your continued support.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_nicolabenson/content_33.html": "Hello\nMy name is Nicola Benson and I am PIP candidate for St. Georges ward\nIt has been a great honour to serve the residents of St George’s ward since being elected in May 2023 and I am asking for your vote once more in the upcoming election. As a fellow resident of St George’s ward I will fight tirelessly to prevent the destruction of our Greenbelt at Glebelands. A development of any size on Glebelands would be catastrophic to our local area, the additional cars will further exacerbate traffic issues at Tarpots and surrounding roads will be busier as cars try to find alternative routes. Furthermore, it will push our already stretched healthcare and schooling resources to the limit. Our Green Belt across the borough must remain preserved for future generations to enjoy and benefit from.\nLooking around Castle Point, the condition of our roads and footpaths is disgraceful. I will continue to raise issues with our roads and pavements with ECC.\nI am proud of what PIP has achieved so far including transforming and streamlining the structure of our Council as well as rejecting applications to build on several Green Field sites within our borough.\nA vote for me is a vote for a passionate, community minded, deep-rooted local resident ready to serve fellow residents.\nI stand for fairness, transparency and honesty.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_votinginfo/content_2.html": "top of page\nVoting Information\nVoting gives you the power to decide how Castle Point is run. The councillors you help to elect will be making decisions on issues that you care about, including Housing, Roads and the Environment.\nBy voting in local elections you can support a candidate who will represent your views in council chamber, and can influence the policy issues you care about. An election is also your chance to speak out if you have a complaint about the way our borough is being run. If you don’t vote, you’ll have had no say over who will be making decisions on the issues important to you. You can vote at a polling station, by post if you have applied for a postal vote or by proxy if you are physically unable to attend your polling station.\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk/content_1.html": "May 2nd Local Council Elections\nPIP win all 24 mainland ward councillor seats!\nAchievements in the first 2 years of the CPBC Independent Administration\n-\n0% CPBC portion of Council Tax increase for 2024/25 with a balanced budget.\n-\nRestructured the council to be more efficient, with annual savings in excess of £500k.\n-\nWorking on the new Local Plan that enhances the borough and produces a strategy for how it will look over the next 20 years. The Castle Point Plan will be submitted on time by April 2025 and will reflect residents' views expressed through the consultation process.\n-\nFunded the Highway Ranger service after Conservative run Essex County Council removed funding.\n-\nApproved building of 7 new council houses (only 11 were built in the last 10 years).\n-\nVoted down the disastrous Conservative Local Plan which would have destroyed much of Castle Point's Green Belt forever.\n-\nWithdrew the old Conservative Local Plan.\n-\nImplemented the Community Infrastructure Levy on new developments to help deliver the infrastructure needed in the area. This should have been implemented years ago and would have raised around £5 to £8 million over the last 10 years.\n-\n£1.5M capital spending programme to rejuvenate buildings neglected over the last 20 years.\n-\nEnhancing and developing our community assets to ensure their long-term use and started a program of fun family events announced for 2024.\nWe are The People's Independent Party\nLocal People For Local People\nPIP Street Stalls\nOur local councillors are at street stalls the first 4 Saturdays of every month , 10am - 12 midday weather permitting, talking to and listening to local residents;\n1st Saturday at Hadleigh (outside Iceland)\n2nd Saturday at Thundersley Village\n3rd Saturday at Tarpots\n4th Saturday at Benfleet High Rd. (outside Co-Op)\nTHE INDEPENDENT ADMINISTRATION FREEZE THE CPBC PORTION OF COUNCIL TAX FOR 2024/25 MUNICIPAL YEAR\nSee budget speech delivered by Steve Mountford, CPBC Cabinet Member for Resources",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_johnknott/content_43.html": "Hello\nMy name is John Knott and I am PIP candidate for St. Michael's ward.\nI have lived in Castle Point for over 23 years, the whole of this time living in St Michaels Ward.\nI am married with two grown up children, four grandchildren, two dogs and some chickens!\nI retired from a 30 year career with Essex Police in 2011 having spent my whole career on the ‘front line’ serving as a Constable and Sergeant. After retiring I worked 1:1 supporting a child with severe Cerebral Palsy.\nI am passionate about preserving the Green Belt in this Borough, especially in St Michaels Ward.\nIt was for this reason that I joined PIP and am proud that PIP have already rejected applications to build on several Green Field sites in our Ward and are on track to deliver a new local plan that will prioritise Brown Field development.\nI am also proud that PIP has transformed and streamlined the structure of our Council and has this year, to support our residents in the current financial climate, been able to freeze our Council Tax. This compares to a 5% ECC rise and neighbouring Councils being in serious financial difficulties.\nI am a supporter of the ‘20 Is Plenty’ group in Daws Heath which is seeking to improve road safety particularly in St Michaels Road, Bramble Road and Daws Heath Road Areas.\nSince being first elected last May I have had the privilege of meeting many local people and helping them with their individual concerns.\nA vote for me is a vote for a local person living in the Ward, for someone who is committed to this area and someone who will continue to work hard to assist the people of St Michaels Ward.\nIt is also a vote for PIP…. A Party composed of local people from differing backgrounds, not driven by National Politics or Dogma ….. all wanting to put Community First.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_sharonainsley/content_41.html": "Hello\nMy name is Sharon Ainsley and I am PIP candidate for St. Mary's ward.\nI have had the privilege of serving as Ward Councillor for St Marys Ward since May 2022.\nDuring this time, I have strived to serve our community and fulfil my obligations by attending all Council meetings, training sessions & briefings, together with sitting on several committee’s: Member for Environment, Licencing and Wellbeing (Chair 2023),\nAnd of course, being available to help residents whenever asked to do so.\nAll whilst holding down a full-time job!\nI am passionate about protecting the Environment and have made it a personal mission to hold Anglian Water to Account. In Oct 23 the Environment PSC called Anglian Water in to face robust questioning. We believe Anglian Water should adequately address the very many ongoing concerns, poor service, and lack of investment across Castle Point and the Wider Essex Area.\nA founder member of Jotmans Farm Action Group, for many years, I have fought to stop inappropriate development in the Greenbelt. I am equally passionate about protecting our green spaces and improving air quality.\nIn my time as a Councillor, I have: -\nLast summer arranged for the Wellbeing Team from ECC to hold a Stall in Sainsburys in the High Road. They had lots of helpful advice and freebies to give away. I hope to bring more such events to Benfleet this year,\nListed all the defective streetlights in St Mary’s Ward and submitted a report to ECC Highways. Within 6 months all the lights apart from a few with electrical defects (Still working on those, were illuminated again.\nResidents from Merrivale, contacted me to ask for help with the lighting on the stairs. Within a few days, the lights were back on, much to the appreciation of many residents.\nI also arranged for the walkway floor to be upgraded as it posed a slip hazard.\nA certain road, which shall remain nameless, to the West of St Marys, has so many complex issues. My support is ongoing. I think they will agree, PIP Cllrs have not let them down.\nI am a regular visitor to South Benfleet playing Fields/ Richmond Park, where I walk my dog. Together with our rangers, I keep my eyes peeled for issues and regularly pick up litter, especially from the Childrens playground.\nI have designed, submitted plans, and had funding approved to create a Sensory Garden in Richmond Park. This I’m sure will be welcomed by so many and will offer a calming space filled with scented wildlife friendly plants, restful seating; a therapeutic space for people to recuperate; a learning zone full of exciting things to touch and smell and accessible for people with sight loss or wheelchairs to be fully independent.\nAll this has fuelled a strong desire to continue serving you in this capacity. And I hope you will lend me your vote.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_lauriedixon/content_34.html": "top of page\nHello\nMy name is Laurie Dixon and I am PIP candidate for Thundersley South ward.\nI have lived in Castle Point most of my life. I worked in Insurance as a Head Broker for a large Company in London. I am now retired and follow my passion for travel and wildlife photography. I want to help protect our Borough’s precious Green Belt. I stand with PIP as they are an independent Party who have provided our Borough with a voice to oppose the previous disastrous Conservative-backed Local Plan. PIP demonstrates integrity and I want to stand to represent my local ward. I love Castle Point and I want to now give back to the community.\nContact\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_contact-us/content_38.html": "top of page\nWe are now offering Party Membership to our supporters. Join us and have your say on how we can shape Castle Point for the benefit of the residents. Visit our membership page here\nContact Us: Contact\nbottom of page\nWe are now offering Party Membership to our supporters. Join us and have your say on how we can shape Castle Point for the benefit of the residents. Visit our membership page here",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_kateknott/content_25.html": "Hello\nMy name is Kate Knott and I am standing as PIP candidate for Hadleigh St. James ward\nI have lived in Daws Heath, Hadleigh for over 23 years being happily married with 2 children and 4 grandchildren, some of whom also live in Hadleigh.\nI retired in 2019 having worked for nearly 3 decades within the Early Years sector more recently as a manager of a nearby large preschool. As a consequence, I am a keen supporter of educational opportunities and provision for young families and those with additional needs.\nSince retirement I have been able to follow another one of my passions by being a member of a local History group that meets within the Hadleigh Old Fire Station and if elected I would strive to support and help retain this site which is a vital hub for our community.\nI have been supporting PIP since it was started just a few years ago as I felt it was time for change whereby local people, free of the chains of the traditional political parties, could be represented and also represent their community in a non-partisan way. I have been impressed with the achievements of PIP since they have been running the Council, particularly the way they have transformed the Council, managed the Boroughs finances in a sound, prudent way and fought to protect our Green Belt. I feel now that I want to be part of the exciting journey that PIP has started in bringing change and ambition for our Community.\nIf you are kind enough to put your trust in me and vote for me on May 2nd it will be a vote for someone who lives in, and cares passionately about Hadleigh and its rejuvenation and for a Party that has already in a very short time in running the Council made great changes for the better .",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_membership/content_12.html": "We’ve come such a long way in such a short amount of time together. We can now offer membership as the best way to protect what we’ve achieved, and to keep our progress moving forwards. Your support has made everything possible and now you can help shape the party going forward! Help us to be successful in local elections so we can fully represent your views and aspirations. All of your subscription goes directly towards helping our campaigns.\nBenefits include;\n-\nGetting the latest from inside the Party with regular member updates.\n-\nHaving your say on Party policy by joining the PIP Policy Forum, because your ideas matter.\n-\nAbility to connect with other PIP members.\n-\nSupporting local campaigns which matter to our local community.\n-\nInvitation to attend the PIP Annual General Meeting\n-\nTo be eligible to stand for election as a PIP Candidate, so if you decide that you want to take part in our democracy, you can!\nWe have kept the membership fee to a minimum and all monies raised will go towards our Election Campaigns, however we know how tight money can be, especially during this cost of living crisis, and if you are on benefit please contact us either via our contact page or at info@thepip.org.uk and we will waive your fee.\nMembership Terms & Conditions in full here\nTo join as a member of the People's Independent Party please click on the select membership button below. You will be requested to apply for a site login, once this has been approved you can either pay the £15 joining fee via the PayPal link or by direct bank transfer to Lloyds bank account 66227962 sort code 30-98-97 adding your name as a reference.\nOn applying for login and membership you will receive some information emails. If you haven't received in your inbox please check in your junk folder and add PIP to your safe sender list.\nIf you feel you would like to also make a donation to the Party you can do so here\nChoose your membership plan\nPIP Party Membership\n15£Every yearJoin our Party",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_mattcortes/content_28.html": "top of page\nHello\nMy name is Matt Cortes and I am PIP candidate for Thundersley South ward.\nSince studying Politics & Law in college I have always had a keen interest in current affairs and politics both nationally and locally. I believe it is up to each of us individually to make the area a better place for all of us who live there. I am appalled at the quality of the roads around Castle Point. The deterioration is putting people in danger. PIP has a great mix from across the political spectrum that have come together for one reason, to protect and improve Castle Point. When I moved to the area one of the key reasons was all the beautiful green areas. We want to protect our Green Belt and retain our beautiful green spaces.\nContact\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_warrengibson/content_16.html": "Hello\nMy name is Warren Gibson and I am standing as PIP candidate for St. Michaels ward.\nI have lived in Castle Point for all of my 48 years, with a majority of that time being spent living in Victoria ward. My parents rented, and ultimately, bought their own home from the council, my childhood home. I went to school in this area, I love this area and I am passionate about its survival and sustainability.\nI am the leader of the People's Independent Party having been first elected as a Councillor in 2021, and have been Cabinet Member for Strategic Planning since 2022. In this role, I have overseen the withdrawal of the disastrous Conservative Local Plan and we are now set to deliver the first ever resident-led Castle Point Plan in 2025.\nUnder my leadership, PIP will always commit to preserving our Green Belt. We have also overseen a top-down transformation of the Council in order to save taxpayers' money and enhance efficiency. We have made a great start over the past 2 years, and need your vote to continue with this good work.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_general-9/content_31.html": "The People's Independent Party\n(Castle Point)\nRepresenting The Local Community\nHome\nPIP Local Councillors\nElection Leaflet 2024\nFAQ\nWard Index\nPIP Membership\nElection Results\nVoting Info\nUseful Links\nCastle Point Roads\nBecoming a Councillor\nCouncil Structure\nNews\nContact Us\nHelp us\nDonate\nPrivacy Policy\nCookies\nForum\nBlog\nMore",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_copy-of-tim-copsey/content_22.html": "Hello\nMy name is Duncan Macpherson and I am standing as a PIP candidate for St James ward\nAfter retiring from my position as a purchasing manager with a leading food manufacturer I\nreturned to Castle Point seven years ago with my partner of forty years. I have keenly followed PIP from the onset and strongly support their vision as local matters often require local solutions. In the past, I have supported local independent councillors, introduced traffic calming measures and helped run a Neighbourhood Watch scheme working closely with the police. I enjoy problem-solving and helping people in the community to the best of my ability. Please give me the chance to serve the residents of Hadleigh and help PIP complete our good work for the Borough. Thank you.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_deansilk/content_17.html": "top of page\nHello\nMy name is Dean Silk and I am PIP candidate for St. George's ward\nI have lived in Benfleet for 35 years and have seen how it has declined throughout the previous administration. I believe strongly in protecting the Green Belt and maintaining our public open spaces for current and future generations. I’ve managed a youth football team at Benfleet Football Club for the past 7 years. I have been a taxi driver in the Borough for many years and may have driven many of you to various destinations. This has given me a unique insight into what matters to Castle Point residents. If elected, I promise to uphold PIP’s core values and represent residents to the best of my ability.\nContact\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_kieronbowker/content_46.html": "top of page\nHello\nMy name is Kieron Bowker and I am PIP candidate for Tarpots ward\nI am happily married and blessed with a son. I am a current Councillor and am the Chair of the Development Management Committee. I joined PIP to provide an independent representation for our Borough after being disillusioned by the abysmal Conservative plan to destroy Castle Point's Green Belt. We have saved over £500,000 annually while balancing budgets, despite inheriting a deficit, with no service cuts. I remain resolutely committed to honesty and transparency rather than grabbing headlines or photo opportunities. It's about doing right by our residents and making a brighter future for all of us.\nContact\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_electionresults/content_13.html": "We are now offering Party Membership to our supporters. Join us and have your say on how we can shape Castle Point for the benefit of the residents. Visit our membership page here\nMay 2nd 2024 Local Council Election Results\nSeats where PIP fielded Candidates\nAppleton\nLynsey Kathryn Calvert, commonly known as Lynsey McCarthy-Calvert (PIP) - 854\nMichael Harry Maurice Dixon (CON) - 449\nWayne Johnson (CON) - 504\nDiana Meiling Jones (PIP) - 831\nLorraine Pauline Larman, commonly known as Lorraine P. Larman (PIP) - 793\nMark Jonathan Maguire (LAB) - 205\nBarry Webb (CON) - 420\nCharlie Michael Young (LAB) - 196\n2 rejected. Percentage turnout: 29.6%\nDiana Meiling Jones, Lorraine P. Larman and Lynsey McCarthy-Calvert elected\nHadleigh St James\nAimme Harbinson (PIP) - 850\nSimon Evan Hart (CON) - 464\nKatherine Ann Knott, commonly known as Kate Knott (PIP) - 946\nDuncan Graham Macpherson, commonly known as Duncan Macpherson (PIP) - 791\nDina Mehdi (LAB) - 251\nCharlotte Ann Reilly (LAB) - 245\nJacqueline Elizabeth Thornton, commonly known as Jacqui Thornton (CON) - 445\n5 rejected. Percentage turnout: 33.3%\nAimme Harbinson, Kate Knott and Duncan Macpherson elected.\nSt George’s\nNicola Lyn Benson (PIP) - 751\nWilliam Frederick Brew, commonly known as Billy Brew (GREEN) - 195\nSteven Paul Cole (IND) - 409\nDavid Cross (CON) - 369\nPaul Harbord (CON) - 333\nNanine Pachy (PIP) - 509\nJacqueline Constance Reilly, commonly known as Jackie Reilly (LAB) - 245\nDean Joshua Silk, commonly known as Dean Silk (PIP) - 552\nFrederick George West, commonly known as Freddy West (LAB) - 202\n6 rejected. Percentage turnout: 28.4%\nNicola Lyn Benson, Nanine Pachy and Dean Silk elected.\nSt Mary’s\nSharon Anne Ainsley (PIP) - 1322\nLaurence James Chapman (LAB & CO-OP) - 285\nJoseph Patrick Cooke, commonly known as Joe Cooke (LAB & CO-OP) - 249\nRoxanne Catherine Indianna Goldfinch (CON) - 390\nRobert James Lillis, commonly known as Rob Lillis (PIP) - 1351\nGeorgina Morgan-Bates (LAB & CO-OP) - 239\nRussell Jason Gareth Savage, commonly known as Russ Savage (PIP) - 1360\n0 rejected. Percentage turnout: 35.8%\nRuss Savage, Sharon Anne Ainsley, Rob Lillis elected.\nSt Michael’s\nTimothy David Copsey, commonly known as Tim Copsey (PIP) - 1387\nWarren Gibson (PIP) – 1396\nJohn Charles Knott (PIP) - 1450\nAmie Esther Maguire (LAB) - 179\nJacqueline Warner (LAB) - 165\n38 rejected. Percentage turnout: 38.3%\nTim Copsey, Warren Gibson and John Charles Knott elected.\nTarpots\nKieron David Bowker (PIP) - 730\nMichael Ernest Dearson, commonly known as Michael Dearson (PIP) - 899\nHolly Jane Foxen, commonly known as Holly Foxen (LAB) - 232\nSusan Janet Foxen (LAB) - 221\nSunil Kumar Gupta (CON) - 504\nAndrew Graham Sheldon (CON) - 674\nBenn Clive Wimbledon, commonly known as Benn Wimbledon (PIP) - 678\n10 rejected. Percentage turnout: 28.3%\nKieron Bowker, Michael Dearson and Benn Wimbledon elected.\nThundersley North\nMargaret Belford (CON) - 382\nHelen Lesley Emberson (LAB) - 209\nWilliam Frederick Emberson, commonly known as Bill Emberson (LAB) - 209\nThomas James Gibson, commonly known as Tom Gibson (PIP) - 1298\nGareth John Howlett, commonly known as Gareth Howlett (PIP) - 1408\nStephen Mountford, commonly known as Steve Mountford (PIP) - 1339\nVincent Derrick White (CON) - 300\n6 rejected. Percentage turnout: 31.8%\nTom Gibson, Gareth Howlett and Steve Mountford elected.\nThundersley South\nGwyneth Ann Bailey, commonly known as Gwyn Bailey (LAB) - 168\nMatthew Stephen Cortes, commonly known as Matt Cortes (PIP) - 648\nJames Matthew Cutler (CON) - 364\nAndrew James Darling (LAB) - 144\nLaurence M Dixon, commonly known as Laurie Dixon (PIP) - 634\nAllan David Edwards (PIP) - 652\nAdrian Roper (CON) - 316\nAndrew David Thornton, commonly known as Andy Thornton (CON) - 321\n2 rejected. Percentage turnout: 27.9%\nMatt Cortes, Laurie Dixon and Allan David Edwards elected.\nOverall result\nPeople's Independent Party: 24 Councillors Elected\nMay 4th 2023 Local Council Results\nAPPLETON\nBenjamin Bizzell (PIP)* 653\nWayne Johnson (Con) 614\nMark Maguire (Labour and Co-operative) 241\nBOYCE\nRob Lillis (PIP)* 1036\nChas Mumford (Con) 566\nGwyn Bailey (Lab) 149\nCEDAR HALL\nGareth Howlett (PIP)* 900\nColin Mclean (CON) 624\nMoreblessing Chasiya (LAB) 142\nKeiron McGill (Reform UK) 32\nST GEORGE’S\nNicola Benson (PIP)* 604\nJack Fortt (CON) 409\nKatie Curtis (LAB) 244\nST JAMES’\nJacqui Thornton (Con)* 698\nSonny Allain (PIP) 451\nDina Mehdi (Lab) 311\nGeoffrey Duff (Lib Dems) 156\nSimon Woodward (Reform UK) 79\nST MARY’S\nDi Jones (PIP)* 948\nJames Cutler (Con) 420\nLaurence Chapman (Labour and Co-operative) 262\nST PETER’S\nMichael Dearson (PIP)* 892\nMichael Dixon (CON) 497\nBill Emberson (LAB) 199\nVICTORIA\nJohn Knott (PIP)* 1356\nEleanor Dixon (Con) 277\nJoe Cooke (Labour and Co-operative) 153\nMay 5th 2022 Results\nAppleton Ward:\nWayne Johnston (con) - 732\nLynsey McCarthey-Calvert (PIP) - 798\nToni Rocha Filho (lab) - 239\n1769 votes, 5 rejected. Lynsey McCarthey-Calvert elected.\nSt. George's Ward:\nNicola Benson (PIP) - 562\nRos Dunhill (Lab) - 256\nSue Mumford (con) - 606\n1,424 votes, 3 rejected. Sue Mumford elected.\nVictoria Ward:\nBowker (PIP) - 1,152\nTom Harrison (lab & co-op) - 181\nPaul Varker (con) - 515\n1848. 8 rejected. Kieron Bowker elected.\nSt. Peter's Ward:\nHannah Barton-Brown (PIP) - 750\nNikki Drogman (con) - 664\nBill Emberson (lab) - 198\n1,612 votes, 3 rejected. Hannah Barton-Brown elected.\nCedar Hall Ward:\nMoreblessing Chasiya (lab) - 161\nTom Gibson (PIP) - 1056\nPat Haunts (con) - 584\n1801 votes, 2 rejected. Tom Gibson elected.\nBoyce Ward:\nGwyn Bailey (lab) - 196\nAllen Edwards (PIP) - 902\nJack Fortt (con) - 783\n1,881 votes, 3 rejected. Allen Edwards elected.\nSt. Mary's Ward:\nSharon Ainsley (PIP) - 940\nLaurence Chapman (lab) - 268\nBen Downton (Her) - 23\nAndrew Sheldon (con) - 737\n1968 - votes, 2 rejected. Sharon Ainsley elected.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_blank-page-2/content_11.html": "Cookies\nHow we use cookies\nA cookie is a small file which asks permission to be placed on your computer's hard drive. Once you agree, the file is added and the cookie helps analyse web traffic or lets you know when you visit a particular site. Cookies allow web applications to respond to you as an individual. The web application can tailor its operations to your needs, likes and dislikes by gathering and remembering information about your preferences.\nWe use traffic log cookies to identify which pages are being used. This helps us analyse data about web page traffic and improve our website in order to tailor it to customer needs. We only use this information for statistical analysis purposes and then the data is removed from the system.\nOverall, cookies help us provide you with a better website, by enabling us to monitor which pages you find useful and which you do not. A cookie in no way gives us access to your computer or any information about you, other than the data you choose to share with us.\nYou can choose to accept or decline cookies. Most web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. This may prevent you from taking full advantage of the website.\nLinks to other websites\nOur website may contain links to other websites of interest. However, once you have used these links to leave our site, you should note that we do not have any control over that other website. Therefore, we cannot be responsible for the protection and privacy of any information which you provide whilst visiting such sites and such sites are not governed by this privacy statement. You should exercise caution and look at the privacy statement applicable to the website in question.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_lynseymccarthey-calvert/content_27.html": "Hello\nMy name is Lynsey McCarthy-Calvert and I am PIP candidate for Appleton ward.\nI live on Kents Hill Road with my 4 children. My family have deep roots here. Since being elected in 2022 I am proud to have represented Appleton Ward and worked to improve services and protect our green belt land.\nIn May 2023 I was elected as Mayor of Castle Point. My year in office has been incredibly busy, meeting with many people who contribute to making Castle Point a great place to live and work.\nI expanded the Mayor's Business Awards to include categories such as the Green Business Award and Young Business-person of the Year to recognise the innovation and ambition that thrives in Castle Point. Having met hundreds of inspiring children and young people this year, I have been motivated to resurrect the Castle Point Borough Youth Council and to introduce a Youth Mayor.\nMy year serving as Mayor has left me even more motivated to continue the great work PIP have begun and I hope to leave a legacy of civic pride for the future generations of Castle Point.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_castlepointhighways/content_29.html": "The State of Castle Point's Highways\nIt will not come as a surprise to anyone using Castle Point roads to be informed that our highways are in a shocking state.\nEssex County Council have the responsibility to maintain our highways to a safe and acceptable level, and we learnt in December 2022 that their strategy is to provide a ‘managed decline to our roads’. The value of annual deterioration, is modelled at £77.7m per year across Essex. This is compared to Essex County Council’s investment of £36.675m per year to fix those wear and tear issues such as potholes.\nECC have also decided to halt funding of the Highways Rangers – who carry out cleaning and minor repairs on road signs and bollards, trim vegetation to improve the visibility of signs and ad hoc grass cutting and strimming of highway verges.\nPIP do not believe these decisions are acceptable, and that we should not just put up with road users safety being compromised. We have tried to lobby ECC councillors on this matter via our party's local councillors, but as we do not yet have any ECC councillors of our own we find a limited response.\nPIP will be fielding candidates in the next Essex County Council elections in 2025.\nIf you care about the state of our roads we would urge you to report issues to this ECC highways link\nTell us - Essex County Council (essexhighways.org)\nAlso inform your Essex County Councillor for your area;\nHadleigh\nCouncillor Mrs Jillian Reeves: Conservative Party\nEmail: cllr.jillian.reeves@essex.gov.uk\nSouth Benfleet\nCouncillor Andrew Sheldon: Conservative Party\nEmail: cllr.andrew.sheldon@essex.gov.uk\nThundersley\nCouncillor Beverley Egan: Conservative Party\nEmail: cllr.beverley.egan@essex.gov.uk\nIf you are unsure which of these is your councillor please use link below to search by postcode\nCouncillor Search (essex.gov.uk)\nAnd lastly please copy our Castle Point MP, Rebecca Harris who should be on our side fighting for the correct level of money from the UK Government to fund our local services.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_donate/content_4.html": "top of page\nWe are now offering Party Membership to our supporters. Join us and have your say on how we can shape Castle Point for the benefit of the residents. Visit our membership page here\nDonate to The People's Independent Party (Castle Point)\nHelp Us Make a Difference\nDo YOU want to make a difference to peoples lives in Castle Point? By helping us with a donation, it doesn't matter how much, just a sum you can afford, you will be helping yourself and the community. YOUR help will aid us to inform, educate and engage with the community to make Castle Point a better place to live.\nThank YOU.\nYou can make direct transfers using The People's Independent Party bank account\nAccount Number 66227962 Sort Code 30-98-97\nYou can also donate via PayPal or Credit/Debit card using the link below\nDonate: Donate\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_help-us/content_21.html": "top of page\nWe are now offering Party Membership to our supporters. Join us and have your say on how we can shape Castle Point for the benefit of the residents. Visit our membership page here\nDo Your Part\nWe believe that there is no one single answer—every little bit helps when it comes to making an impact. There are many meaningful ways you can help us succeed in our mission of making Castle Point a better place to live . Have an idea that’s not listed below? Reach out and let us know.\nVolunteering\nHelping with leaflet delivery and/or canvassing\nPlanning a Fundraiser\nHelp raise funds for the Party to be able to gain professional advice and representation\nOrganising an Event\nDo you have experience in organising public events for community involvement & fundraising\nHelp us: Take Action\nContact us below if you are able to help us with leaflet delivery, door to door canvassing, organising a fund raising event or anything else!\nHelp us: Text\nContact\nHelp us: Contact\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_timcopsey/content_18.html": "Hello\nMy name is Tim Copsey and I am standing as PIP candidate for St. Michael's ward\nI have lived in Castle Point for many years. My wife was born in Hadleigh and she is a school teacher. We have two grown up children who live with us in our home in Daws Heath. I studied at Deanes and used to enjoy my walk past the fields to and from school.\nIn my career I developed many business skills as a successful company director and in more recent years pursued my creativity through freelance photography.\nIn my life I have been involved with charitable endeavours including being a trustee of a mental health charity, had a leading fundraising/treasury roll for an overseas orphanage and volunteered at a foodbank.\nI love the natural world and care passionately about protecting green belt. By dedicating years to campaigning to protect green spaces I have gained a lot of knowledge about planning. I would like to put my commitment to good use by serving the community as a councillor.\nI am standing in the Castle Point Borough Council election in May 2024 as a candidate for The People’s Independent Party. I thought it would be appropriate to provide a few words on my decision. I continue to be a very engaged local resident who cares passionately about protecting our green spaces. I also believe that local matters should be dealt with by local people not obscured by national politics. I have been asked to stand for election at various points over the years and I always declined. I suppose I don’t consider myself politically ambitious but rather just want to see good policies pursued locally for the benefit of my community. Since PIP came into being I have always shared with them their core values of fighting to protect green belt, localism, integrity, community focus, value for money for council tax payers and so forth. The leader of PIP Councillor Warren Gibson convinced me that I could do more to serve Castle Point from within the council than as a campaigner on the outside. I am also very aware this particular council election is a crucial one. All councils and many residents are facing difficult times with the cost of living crisis and lots of folk are feeling the pressure. The electorate faces a clear choice…to return to the dark days before the Independents controlled the council or to continue on the more positive pathway with the knowledge that with the Independents steering the council it is being done with Castle Point as the priority.\nI would like to thank all candidates of all political persuasions for being prepared to put themselves forward to face the electorate in the election. This in itself is a great service to local democracy.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_news/content_6.html": "top of page\nWe are now offering Party Membership to our supporters. Join us and have your say on how we can shape Castle Point for the benefit of the residents. Visit our membership page here\nIn the Press\nNews: News\nbottom of page\nWe are now offering Party Membership to our supporters. Join us and have your say on how we can shape Castle Point for the benefit of the residents. Visit our membership page here",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_blog/content_24.html": null,
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_dianajones/content_23.html": "Hello\nMy name is Diana Jones and I am PIP candidate for Appleton ward\nI’ve lived in the same ward in Benfleet with my husband for the past 38 years, raising a family of 3 children who attended local schools, 2 of whom still live in the borough with their young families, so I am well aware of the need for affordable housing within the borough. I taught at local secondary schools for many years, and am now a Maths tutor, as well as helping with childcare for my grandchildren.\nUp until the arrival of The People’s Independent Party in the last few years I was not at all interested in local politics but had actually become very disenchanted with the lack of real representation at our Council. PIP helped me to see that local residents could actually take part in local government without the restrictions of a political party whip, that local people could actually represent local people. Hence I stood as a candidate in May 2023 and had the great privilege of being elected to office. It has been a huge honour and responsibility representing the residents of my ward and borough at the Council. In that role, I have sought to help residents with local issues, as well as standing on committees such as Scrutiny, Licensing, Common Liaison Committee, and the Local Highways Panel. I hope that you will consider giving me your vote this year so that I may continue to represent you at the Council, and to support the good work by PIP in transforming Castlepoint Borough Council.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_council-makeup/content_8.html": "We are now offering Party Membership to our supporters. Join us and have your say on how we can shape Castle Point for the benefit of the residents. Visit our membership page here\nBorough Council Structure\nLocal government in Castle Point operates under a two tier system – Essex County Council and Castle Point Borough Council\nEssex County Council\nEssex County Council covers the whole of the county and provide the majority of public services in the area. ECC is responsible for: education, highways, transport planning, passenger transport, social care, libraries, waste disposal and strategic planning.\nCastle Point Borough Council\nCPBC provides more local services and is responsible for housing, leisure and recreation, environmental health, waste collection, planning applications and local taxation collections.\nCastle Point Borough Council is made up of the following areas;\nCanvey Island\nHadleigh\nSouth Benfleet\nThundersley.\nThese are split into 14 wards, with each electing 3 Councillors to represent their residents, with the exception of Canvey Island West, which elects 2 Councillors to represent their residents. In 3 out of every 4 years years, one councillor is elected to represent each ward on a 4 year term. In the 4th year there are no Borough elections.\nIf one party obtain 21 or more councillors out of 41, they will have a majority and be said to have control of the council. If no party achieves a majority, the council is said to have No Overall Control and a power sharing agreement can be arranged between parties.\nCastle Point Borough Council uses the ‘Leader & Cabinet’ system whereby a cabinet of 8 is formed under the guidance of a leader.",
  "https_www_thepip_org_uk_/http_www_thepip_org_uk/content_50.html": "May 2nd Local Council Elections\nPIP win all 24 mainland ward councillor seats!\nAchievements in the first 2 years of the CPBC Independent Administration\n-\n0% CPBC portion of Council Tax increase for 2024/25 with a balanced budget.\n-\nRestructured the council to be more efficient, with annual savings in excess of £500k.\n-\nWorking on the new Local Plan that enhances the borough and produces a strategy for how it will look over the next 20 years. The Castle Point Plan will be submitted on time by April 2025 and will reflect residents' views expressed through the consultation process.\n-\nFunded the Highway Ranger service after Conservative run Essex County Council removed funding.\n-\nApproved building of 7 new council houses (only 11 were built in the last 10 years).\n-\nVoted down the disastrous Conservative Local Plan which would have destroyed much of Castle Point's Green Belt forever.\n-\nWithdrew the old Conservative Local Plan.\n-\nImplemented the Community Infrastructure Levy on new developments to help deliver the infrastructure needed in the area. This should have been implemented years ago and would have raised around £5 to £8 million over the last 10 years.\n-\n£1.5M capital spending programme to rejuvenate buildings neglected over the last 20 years.\n-\nEnhancing and developing our community assets to ensure their long-term use and started a program of fun family events announced for 2024.\nWe are The People's Independent Party\nLocal People For Local People\nPIP Street Stalls\nOur local councillors are at street stalls the first 4 Saturdays of every month , 10am - 12 midday weather permitting, talking to and listening to local residents;\n1st Saturday at Hadleigh (outside Iceland)\n2nd Saturday at Thundersley Village\n3rd Saturday at Tarpots\n4th Saturday at Benfleet High Rd. (outside Co-Op)\nTHE INDEPENDENT ADMINISTRATION FREEZE THE CPBC PORTION OF COUNCIL TAX FOR 2024/25 MUNICIPAL YEAR\nSee budget speech delivered by Steve Mountford, CPBC Cabinet Member for Resources",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_aimmeharbinson/content_15.html": "Hello\nMy name is Aimme Harbinson and I'm standing as PIP candidate for Hadleigh St. James\nI’m 25 and have lived in Castle Point since 2009 after moving from Dagenham.\nI’m currently working as a Specialist Housing Officer for South Essex, providing housing based support for the most vulnerable members of our society which is incredibly rewarding.\nI’m also a fully trained swimming coach, I worked at Castle Point Leisure between 2016 and 2022 teaching 100’s of children and adults which is still a huge passion of mine. This passion took me traveling to Dubai where I taught individuals from around the world and gained knowledge from all different cultures, additionally in my spare time I still cover lessons throughout South Essex.\nI take great pride living in Hadleigh and love to use local amenities, restaurants, the country park and open spaces, as this is where I spent most of my childhood and would want the same for generations to come.\nProtecting green belt and open spaces is a huge passion of mine and I recently spoke heartfelt words against the development on Green Belt in Daws Heath\nI believe that no matter what walk of life you come from you should have no limits and being elected would only fuel that message to other young people to partake in paths they never thought possible. If you do choose to support me and the PIP party I’ll consistently strive to be a voice for people who may feel unheard and be committed to supporting our local people/area in whichever way needed.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_faq-1/content_7.html": "top of page\nFAQ: FAQ\nFrequently Asked Questions\nWhat is the history of The People's Independent Party\nIsn’t PIP just a single policy party (Green Belt)? & why should I vote for you in the upcoming local elections?\nWhat is PIP doing to improve residents experience of living in Castle Point?\nHow is PIP ensuring we get value for money from our Council Tax?\nWhat is a Local Plan & why is it important to have one?\nWhen was the last Castle Point local plan adopted and how often should it be reviewed?\nWhy is using brownfield better than using Green Belt for building in Castle Point?\nWhat do developers contribute financially towards new infrastructure and how can we be sure that their contributions are made?\nWhat is the latest on how the Castle Point Plan is progressing\nHow does PIP's alliance with the Canvey Island Independent Party work?\nCan you provide information about parking provision for new developments in Castle Point?\nHow have you managed to freeze the CPBC portion of Council Tax in such a challenging financial climate when other councils are having to raise theirs by the maximum allowed by government?\nWho is responsible for repairing potholes in Castle Point?\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_forum_party-subscription-posts/content_51.html": "The People's Independent Party\n(Castle Point)\nRepresenting The Local Community\nHome\nPIP Local Councillors\nElection Leaflet 2024\nFAQ\nWard Index\nPIP Membership\nElection Results\nVoting Info\nUseful Links\nCastle Point Roads\nBecoming a Councillor\nCouncil Structure\nNews\nContact Us\nHelp us\nDonate\nPrivacy Policy\nCookies\nForum\nBlog\nMore\nWelcome! Have a look around and join the conversations.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_benn-wimbledon/content_39.html": "top of page\nHello\nHello, I'm Benn Wimbledon, I'm PIP candidate for Tarpots ward\nI have lived in Castle Point for most of my life and am married with a baby daughter. I am passionate about the survival, growth and sustainability of Castle Point for my and everyone else's children's futures. I manage a successful business and feel I have transferable skills that will help me to deliver real results for our Borough. I decided to stand with PIP to represent younger people and I have the passion and dedication to make change. I have chosen to join PIP as, out of all local parties, I feel PIP to be the most authentic and down to earth with a record of delivering the change they promise.\nContact\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_naneenpachy/content_20.html": "top of page\nHello\nMy name is Nanine Pachy and I am standing as PIP candidate in St. George's ward.\nI currently work locally supporting children and young people and have a keen interest in art and design. I'm committed to preserving our Green Belt and opposed to large-scale housing developments due to the impact this has on our infrastructure and over-congested roads. I believe Brown Field sites would be better suited for housing, and that housing should be social, affordable, built sustainably, and have renewable energy. I stand with PIP to provide an independent voice for Castle Point, that isn't tied to national party politics. Please vote PIP to support our local independent party.\nContact\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_pipcouncillors2024/content_9.html": "top of page\nMeet The PIP Local Councillors\nIf you're not sure which ward you reside in please follow link below\nAppleton Ward\nAppleton Ward\nAppleton Ward Ward\nHadleigh St. James Ward\nHadleigh St. James Ward\nHadleigh St. James Ward\nSt. George's Ward\nSt. George's Ward\nSt. George's Ward\nSt. Mary's Ward\nSt. Mary's Ward\nSt. Mary's Ward\nSt. Michael's Ward\nSt. Michael's Ward\nSt. Michael's Ward\nTarpots Ward\nTarpots Ward\nTarpots Ward\nThundersley North Ward\nThundersley North Ward\nThundersley North Ward\nThundersley South Ward\nThundersley South Ward\nThundersley South Ward\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_useful-links/content_3.html": "We are now offering Party Membership to our supporters. Join us and have your say on how we can shape Castle Point for the benefit of the residents. Visit our membership page here\nUseful Links\nCastle Point Borough Council\nCPBC Website Here\nFind out who your local councillor is Here\nLink to Castle Point Planning Portal Here\nReport an abandoned vehicle Here\nReport Churchyard / Dead Animal on the Highway/ Grafitti / Litter / Litter Bin / Fly Tipping / Grass Cutting / Damaged Street Name Plate issues Here\nTell the Council You are Moving Home Here\nLink to Council Tax Portal Here\nRefuse and Recycling - Find Information and Report Issues Here\nCastle Point Leisure Information & Booking Here\nEssex County Council\nECC Website Here\nFind out who your ECC councillor is Here\nReport a road or pavement surface Issue or Street Lighting Issue Here\nEssex Police - Find Information and Report Issues Here\nFree Help & Advice Lines\nCitizens Advice Bureau Here\nDebt Advice Foundation Here\nThe Samaritans Here\nHealth Watch Essex - Information & Guidance on Issues Relating to NHS Patient Care Here\nBeGambleAware Here\nDepression & Mental Health Help Line Here\nEssex Walks - Find routes and public rights of way around Essex Here",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_lorrainelarman/content_44.html": "top of page\nHello\nMy name is Lorraine Larman and I am standing as a PIP candidate for Appleton ward\nI have lived in the area for most of my life and have three children who all attend local schools. My early career involved training cooks for the 500 schools in Essex and then I became a cleaning manager in 2000. In 2012, I was asked to join the Board of a domestic refuge, as this is a charity close to my heart. I want to stand with PIP to ensure we have an independent council and protect the Green Belt. This April, I will have the honour of being installed as the Master of the Worshipful Company of Environmental Cleaners.\nContact\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_becomingacouncillor/content_32.html": "We are now offering Party Membership to our supporters. Join us and have your say on how we can shape Castle Point for the benefit of the residents. Visit our membership page here\nCouncillor Information\nInformation on becoming a PIP Councillor\nWhat matters to you in your local area? Whatever needs changing in your neighbourhood, you could be just the person to change it by becoming a Peoples Independent Party (PIP) local councillor.\nThere are many reasons why you might like to become a PIP councillor\nto make a difference and help shape the future of the local community\nconcern about your local area and wanting to ensure the community gets the right services\nto represent the views of local people and ensure that community interests are taken into account\nconcern about a specific issue and wanting to do something about it\nhaving good ideas for the council and community in a time of scarce resources\nto contribute to your skills\nto build on other community work through a charity, voluntary group or school governing body\nto pursue your political ambitions and contribute to your community\na career-enhancing activity, allowing you to develop leadership and analytical skills and to obtain practical and managerial work experience.\nIn order to be truly democratic, local councils need to be representative of their community. Castle Point Borough Council (CPBC) can only be as effective as the relevant and vibrant people elected to run it, so we need councillors who are capable, energetic and engaged – from all backgrounds and experiences to reflect their communities, and who can bring their own perspective on what is needed locally.\nCPBC is led by democratically elected councillors who, working together, set the council’s vision, direction and budget. CPBC is run on a system similar to that of central government, with a small elected executive (or cabinet) to decide on policy and make decisions which other councillors then ‘scrutinise’ or examine in detail.\nCPBC plays a big part in the local economy and influences many aspects of the lives of the people who live and work in Castle Point. Central government still has some influence over councils through controlling some of their funding and through legislation, however, this is lessoning as more powers are devolved locally.\nAre you ready to help change the face of local government? No other role gives you the chance to make such a huge difference to the quality of life for people in your local area.\nCPBC is responsible for a range of services, including;\nplanning and licensing\nhealth and wellbeing\nhousing and regeneration\ncommunity safety and cohesion\nwaste collection and recycling\nparks and open spaces\nleisure and community halls\nWhat do councillors do?\nCouncillors are elected to a council to represent their local community, so they must either live or work in the area. Becoming a councillor is both a rewarding and privileged form of public service. You will be in a position to make a difference to the quality of people’s daily lives and to their prospects. Being an effective councillor requires commitment and hard work. Councillors must listen to the views of residents, other councillors and experts and work to bring them together to a common aim.\nResidents, community groups, local business, outside bodies and the council, will all make legitimate demands on a councillor’s time, on top of the demands and needs of their personal and professional lives. If you are considering becoming a councillor it’s worth discussing the idea with your family and friends. You will need their support as you will have to spend time attending to council business, and depending on your ambitions this can amount to a substantial amount of time. The time commitment for councillors can range from 5 to 20+ hours a week. Your role within the council and local circumstances will determine how much time you spend on council duties. Joining a planning committee, for example, will increase your workload. Being a councillor is very worthwhile, but it does also require time. You will need to balance your council commitments with your personal and professional life, and this can sometimes cause conflict. If you have caring responsibilities you will also need to think about how to manage those. That said, there are many people looking after children or dependent adults who make excellent local councillors, particularly since they often have direct personal knowledge of the services they are responsible for providing or overseeing. By law if you are working your employer must allow you to take a reasonable amount of time off during working hours to perform your duties as a councillor. As with most things in life, what you get back will depend on what you put in.\nWhat’s expected of a PIP councillor\nThe councillor’s role and responsibilities include:\ncommunity leadership, engagement and support\nmaking decisions\nattending full council meetings, and most attend scrutiny meetings (the process of examining the work and decisions of the executive).\ndeveloping and reviewing council policy\nscrutiny and holding the executive/cabinet to account\nregulatory, quasi-judicial and statutory duties , for example planning and licensing committees which take non-political decisions on applications\nhold regular meet your residents sessions, which provide a chance for residents to discuss their problems or concerns.\nat election times contribute to the return of PIP candidates who can deliver real change\nMuch of a councillor’s work can be done by telephone, letters or email, though sometimes it is better to arrange meetings with residents or council staff to resolve issues. Often all a resident needs is to be directed to the right information and/ or contacts to enable them to deal with an issue themselves, Castle Point is a two-tier area (where there is a local council along with a county council), and you will need to know who your county councillors are to redirect some inquiries to them.\nIn the 2018 census of local authority councillors, the Local Government Association found that;\nEighty-five per cent of councillors became councillors in order to serve their community\nSixty per cent thought that representing local residents was among the most important role of councillors, and fifty-one per cent thought the same of supporting local communities\nEighty-five per cent would recommend the role of councillor to others\nSixty-eight per cent intended to stand for re-election.\nDo I need any special skills or experience to be a councillor?\nIt’s important that councils have councillors who reflect and represent the communities they serve, and also have a broad range of skills and life experience. You don’t have to be highly educated or have a profession. Skills gained through raising a family, caring for a sick or disabled relative, volunteering or being active in faith or community groups can be just as valuable.\nWhile you don’t need any special qualifications to be a councillor, having or being able to develop the following attributes will help you in the role:\ncommunication skills\nproblem solving and analytical skills\nteam working\norganisational skills\nthe ability to engage with your local community.\nDon’t worry if you don’t yet feel that you have all the skills to be a councillor, PIP & CPBC provide support, information and training for new councillors.\nWill I get paid for being a councillor?\nCPBC councillors don’t receive a salary, but they do get a ‘member’s allowance’ (which is taxable) in recognition of their time and expenses incurred while on council business. CPBC also provide a special responsibility allowance to those who undertake additional duties such as the Leader of the Council, portfolio holders, scrutiny chairs and opposition leaders.\nCan I be a councillor and have a job?\nYes. By law if you are working your employer must allow you to take a reasonable amount of time off during working hours to perform your duties as a councillor. The amount of time given will depend on your responsibilities and the effect of your absence on your employer’s business. You should discuss this with your employer before deciding to stand for election.\nPlease note that there are some jobs which will make an individual ineligible for councillorship. You are disqualified from standing as a candidate at elections in Castle Point if you are a paid officer or employee of CPBC. This can include if you are employed under the direction of a joint board or committee, such as fire services and education authorities. It is not always the case that a public service worker would be denied from standing as a councillor. Therefore, if you work in the public sector and are unsure of whether you can stand, you should seek advice from your employer’s HR department to establish whether the disqualification applies to you.\nWhat support is available to elected councillors to help carry out their role?\nCouncils have staff, known as Officers, available to provide support and assistance. Exactly what facilities you get will depend on position you hold. CPBC will provide you with a computer or tablet for council business use.\nCPDC provides induction and training for new councillors. As a new councillor, you will be invited to take part in an induction programme, introducing you to the workings of the council. Training for councillors continues throughout their term of office on a variety of relevant topics. The professional offices working at the council, plus PIP councillors are available to assist in any way they can, such as advice about council procedures or problems in your ward.\nThe timescale\nCouncillors are elected for four-year terms. At the end of this time you can retire or stand for re-election. You can choose to retire at any time. If you stand to replace a councillor who has retired during the year (not at a scheduled election or by-election) you will serve for the remainder of that person’s term of office.\nIdeally, you will need to begin campaigning with PIP at least a year before an election so that you can get to grips with the important local issues, meet as many voters as possible and raise your profile before the election takes place.\nWho can become a councillor?\nThe easy answer is almost anyone, as long as you are:\nBritish or a citizen of the Commonwealth or European Union\nat least 18 years old\nregistered to vote in Castle Point; or have lived or had your principal place of work in the borough for 12 months before standing; or have been an owner or tenant of any land or premises in the borough for at least 12 months before standing.\nYou can’t be a councillor if you:\nwork for the CPBC, or for another local authority in a politically restricted post\nare the subject of a bankruptcy restrictions order or interim order\nhave been sentenced to prison for three months or more (including suspended sentences) during the five years before election day\nhave been convicted of a corrupt or illegal practice by an election court.\nIf you would like to find out more about becoming a local councillor please leave a message on our contact us page or by email at info@thepip.org.uk and we'll get back to you",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_roblillis/content_14.html": "Hello\nMy name is Rob Lillis and I am a PIP candidate for St Mary's ward.\nI have lived in Benfleet nearly all of my life, as has my wife Mandy. We have two children who both attended the same primary school here that I did. My mother and my wife’s parents both live in our Borough. I lived in St. Mary’s ward when I was younger and for the past 17 years on Mill Hill in Boyce ward. I presently run my own banking consultancy company, having worked in banking for several years beforehand. In the past, I have been a school governor, a tutor, a member of various community and fundraising groups and helped run a local boys’ football team for ten years.\nA founding member of Residents Against Glyders Expansion (RAGE), I have campaigned to preserve this area of Green Belt from development. I am fully committed to helping save our Borough’s Green Belt by getting the right Local Plan in place, that we residents both want and need.\nI was truly honoured to be elected as PIP councillor for Boyce ward in May 2023. The fact that so many of my fellow residents put their faith in me (and PIP) was very humbling.\nI presently represent PIP on two of the Council’s committees:\nDevelopment Management Committee (DMC)\nEnvironment Policy and Scrutiny Committee\nI have thoroughly enjoyed my time as councillor, though of course it has its challenges. I take this opportunity to thank all of my wonderful PIP colleagues for their constant help and support. Under the excellent leadership of Cllr. Warren Gibson, I am convinced that we can continue the good work that we are doing on behalf of the residents of our Borough. I welcome very much the fact that the Local Government Association (LGA) notes that the present administration has made significant progress in transforming Castle Point Borough Council. There remains a great deal of work to do, but the report from the LGA clearly shows that we are on the right track.\nEvery decision taken by our local council should always be in the best interests of the community they are employed to serve. This remains at the forefront of my mind in all that I do.\nPIP stands for everything that I believe in; honesty, transparency, accountability, and normal local people (like you and I) listening to and representing the residents.\nMy sincere thanks for your continued support.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_forum/content_40.html": "The People's Independent Party\n(Castle Point)\nRepresenting The Local Community\nHome\nPIP Local Councillors\nElection Leaflet 2024\nFAQ\nWard Index\nPIP Membership\nElection Results\nVoting Info\nUseful Links\nCastle Point Roads\nBecoming a Councillor\nCouncil Structure\nNews\nContact Us\nHelp us\nDonate\nPrivacy Policy\nCookies\nForum\nBlog\nMore\nBrowse below & post questions, tips, and anything else that you'd like to share with the Castle Point Community.\nAdd or edit a post to get the conversation started.\nWelcome! Have a look around and join the conversations.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_tomgibson/content_47.html": "Hello\nMy name is Tom Gibson and I am standing as PIP candidate for Thundersley North ward\nI have lived in Castle Point my whole life and attended The King John School and Seevic College. I went to The University of Huddersfield to study Politics and was President of the Huddersfield Student wing which allowed me to develop skills in various aspects of political operation. I worked on grassroots campaigns to save the A&E at Huddersfield Royal Infirmary, as well as various other community causes. Wherever I have been and whatever I have done, being involved as part of a community has been at the heart of it all.\nSince being elected as a Councillor I have been involved in campaigns to benefit the whole community and spoke passionately against the Hart Road development at appeal due to my commitment to protect our green spaces. I am the Cabinet member for Assets & Special Projects and have overseen the allocation of a £140,000 fund to improve our open spaces which included a new path at Thundersley Common and a new Games Area at John Burrows. I continue to oversee the council’s asset review to ensure they are fully optimised. We are undertaking some really exciting projects and we need your vote on the 2nd May.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_forum_welcome-to-the-forum/content_49.html": "The People's Independent Party\n(Castle Point)\nRepresenting The Local Community\nHome\nPIP Local Councillors\nElection Leaflet 2024\nFAQ\nWard Index\nPIP Membership\nElection Results\nVoting Info\nUseful Links\nCastle Point Roads\nBecoming a Councillor\nCouncil Structure\nNews\nContact Us\nHelp us\nDonate\nPrivacy Policy\nCookies\nForum\nBlog\nMore\nAdd or edit a post to get the conversation started.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_newsletterfebruary2024/content_5.html": "The People's Independent Party\n(Castle Point)\nRepresenting The Local Community\nHome\nPIP Local Councillors\nElection Leaflet 2024\nFAQ\nWard Index\nPIP Membership\nElection Results\nVoting Info\nUseful Links\nCastle Point Roads\nBecoming a Councillor\nCouncil Structure\nNews\nContact Us\nHelp us\nDonate\nPrivacy Policy\nCookies\nForum\nBlog\nMore\nThe People's Independent Party February 2024 Newsletter",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_allanedwards/content_45.html": "Hello\nMy name is Allan Edwards and I am PIP candidate for Thundersley South ward.\nCastle Point is home, my whole family lives in the area. Being a councillor for the past two years has been a privilege. Working on the environment, scrutiny and audit committees has given me an active role in making our Council more accountable and transparent. I have championed empowering the Council to bring some of the 1,000+ unused properties in Castle Point back into use, this will cut pressure to build on our cherished green spaces and give families that are waiting for homes more choice. Our Party has made great progress, but there is still much to do. Please vote for three PIP candidates to continue to changing our area for the better.\nAllan speaking on behalf of residents on property developers application to build on Green Belt land at the Glyders",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_garethhowlett/content_42.html": "Hello\nMy name is Gareth Howlett and I am a PIP candidate for Thundersley North ward.\nI was born and raised in Thundersley and have lived in Castle Point for most of my life. I currently work as a team leader in the utility industry. I am married and we have two children who both attended local schools. I live near The Common in Thundersley North ward and love the area, in which I grew up. I played for Thundersley Rovers football club from the age of 6 until I was 40.\nI want to help the local community and continue the great work achieved by the party’s policy to protect all the green spaces and the wildlife we have locally. But more importantly, be Local People for Local People.\nMy promise to you is, to be honest, and be an independent voice to represent the Thundersley North residents.\nI was elected as a Councillor in May 2023 and have thoroughly enjoyed my role so far. I am part of the environment and DMC committee which deals with bigger planning applications, and enjoy being involved in this. I have taken pleasure in meeting residents and helping with a wide variety of issues such as welfare, lights, drains,trees etc. I believe the smaller issues are just as important as the big ones. I was also overjoyed to organise the new sign/replanting of the Marie Curie field of hope.\nI would like the opportunity to carry on doing my best, and my promise to represent Cedar Hall residents, to be honest, a voice for local people and fight to save the Green Belt of which I am passionate about.",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_stevemountford/content_26.html": "Hello\nMy name is Steve Mountford and I am PIP candidate for Thundersley North ward.\nI have lived in Thundersley most of my adult life. I live near Thundersley Village, so I am truly local to be able to understand and represent the people who live here. I am married and have four sons, who went to Thundersley Primary School and King John School. I decided to stand in 2021 with PIP to bring independence to Castle Point. I am the cabinet member responsible for resources/finances and I am a qualified accountant. Since taking power at Castle Point, in a short time, we have transformed the structure and delivery of services. We have cut costs to be more efficient and delivered a healthy budget this year with a 0% increase.\nMy aim is to represent you independently and I am constrained by National Party Politics.\nSteve delivering the CPBC budget 2024/25",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_membershipdelete/content_10.html": "top of page\nOUR AUTOMATIC PAYMENTS PROCESSING IS DOWN AT THE MOMENT. TO JOIN AS A MEMBER OF THE PEOPLE'S INDEPENDENT PARTY PLEASE PAY JOINING FEE OF £15 BY BANK TRANSFER TO LLOYDS BANK ACCOUNT 66227962 SORT CODE 30-98-97. PLEASE ADD YOUR EMAIL ADDRESS AS REFERENCE AND WE WILL CONTACT YOU BACK\nbottom of page",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_ward-index/content_19.html": "The People's Independent Party\n(Castle Point)\nRepresenting The Local Community\nHome\nPIP Local Councillors\nElection Leaflet 2024\nFAQ\nWard Index\nPIP Membership\nElection Results\nVoting Info\nUseful Links\nCastle Point Roads\nBecoming a Councillor\nCouncil Structure\nNews\nContact Us\nHelp us\nDonate\nPrivacy Policy\nCookies\nForum\nBlog\nMore",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_russ-savage/content_30.html": "Hello\nMy name is Russ Savage and I am PIP candidate for St. Mary's ward.\nI have been one of PIP’s St. Marys Ward councillors for three years now and what a rewarding 3 years I have had. If I were to be brutally honest, I never imagined that PIP and the Independent Group would be in control of the council as quickly as we were, or expected to be sitting on the decision making ‘Cabinet’ ( I am now the Cabinet member for People & Community). However, I’m very proud of the way that I and PIP have influenced the changes that now shape our Council. We continue to seek transparency and accountability in all matters and, having instigated a root and branch ‘Peer review’ by the Local Government Association, we already see a more healthy-looking and cost-effective organisation. Unravelling many of the issues left to us by the former Conservative Administration has been extremely challenging. Reducing and restructuring the top tiers of the councils’ officers, has reduced costs to you our residents, by over half a million pounds. Moreover, this restructuring gives us a much clearer vision of how we can put our community at the heart of everything we do. Since becoming elected in 2021, I’ve become a grandfather, and I don’t think that there is anything more grounding than the importance of family. This continues to influence my resolve that we should protect the area that we live in.\nThe forthcoming local election in May is not just about the Local Plan, but it does affect all aspects of our day to day lives. PIP is well along the way of developing a new local plan for everyone within our community. I would like to reiterate that I am not ‘Anti-Build’ and as I sit on the Development Management Committee, I do want to see the right homes, in the right places ‘for the right People’ – our local people!\nI also now sit on the Local Plan Development Board, and as such we have already proved that we didn’t need over 5,000 extra houses in the area, and furthermore, that we can accommodate our ‘local need’ on Brown Field sites.\nLocal crime is another issue that I’m working on with our Local Community Policing team. I currently sit on the Police & Fire Crime Commissioner panel (PFCC) and am working to secure grant funding for a total upgrade of the Boroughs CCTV.\nWhen elected we didn’t have great provisions for the youth or older community within the borough. PIP have secured funding for both a ‘Sensory Garden’ at Richmond Park and a ‘Multi Use Games Area’ in John Burrows. And I will ensure in my Cabinet role, that we continue to allocate funding for future local projects and improvements to our community spaces.\nPlease help me to continue to fight for you all and carry on the good work that we have already started. My aim is to protect OUR Castle Point, to care about where WE live, for YOU the residents, our green spaces and our ecology. Putting you at the heart of everything we do.\nThis election is important for every resident in Castle Point, so please vote for\nRussell Savage\nThe Independent Councillor in St Mary’s Ward\nPIP – Local People for Local People",
  "https_www_thepip_org_uk_/https_www_thepip_org_uk_membership-tcs/content_48.html": "Party Membership Terms & Conditions\nTerms\nThe People's Independent Party reserves the right to not accept an application for membership.\nApplying to join PIP\n-\nApplication for membership of the People's Independent Party on-line through the Party’s website (www.thepip.org.uk) is subject to review by the Party before final approval. Final approval, or non-approval, will be communicated to the applicant as soon as possible after the application is made.\n-\nApplications will not be considered where the applicant is a member under suspension or is a former member currently expelled from the Party.\n-\nWe will contact you using the details provided to keep you informed about the party and your membership.\nAll party members are bound by the General Terms and Conditions.\n-\nTo pay the membership fee.\n-\nTo be bound by and abide by the Party Constitution.\n-\nTo sustain and promote the objects and values of The People's Independent Party.\n-\nTo engage in no conduct which brings or is likely to bring the Party into disrepute.\n-\nTo do nothing, including declaring opinions, which is in conflict with the purpose, objects and values of the People's Independent Party. Expressing disagreement with the policies of the Party shall not constitute conduct which brings or is likely to bring the Party into disrepute.\n-\nTo engage in no conduct which brings or is likely to bring the Party into disrepute.\n-\nTo be a member or supporter of no other UK-registered political party nor a supporter of any candidate of such a party.\n-\nIn addition to the above terms and conditions, to abide by all codes of conduct which may exist from time to time (however they are called) which regulate the conduct of Party members.\nReturn to the PIP Membership page here"
}