{
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-6/content_7.html": "Welsh Government Pressed on Impact of New Family Farms Tax\nThe Welsh Government have been urged to clarify how many farms in Wales will be affected by the Family Farm Tax.\nThe Welsh Government have been urged to clarify how many farms in Wales will be affected by the Family Farm Tax.\nThe Welsh Liberal Democrats have called on the UK Labour Government to do more to encourage economic investment in the South Wales Valleys to tackle the trend of long-term deindustrialisation in the region.\nGPs and care providers across Wales will be “pushed to the brink” without an exemption from the Budget’s National Insurance tax hike, Welsh Liberal Democrat MP David Chadwick has warned.\nResponding to the publication of the UK Government budget, Welsh Liberal Democrat Deputy Leader David Chadwick MP said:\nThe Welsh Liberal Democrats have called on both the Welsh and UK Labour governments to provide a fair deal for Welsh Small Businesses ahead of the UK and Welsh budgets.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_default-2035b3603478e76f064f0d4055da58b9_page-6/content_20.html": "Local Lib Dem campaigners are trying to\nget something done to improve the NHS\ndental service here in Carmarthenshire.\nResidents have complained that they can’t\nget to see an NHS dentist here.\nWe have teamed up with Welsh Lib Dem\nleader Jane Dodds MS who has been\ncampaigning on the issue across Wales.\nWe want to see NHS dentistry available for\neveryone, so let us know how you’ve been\naffected by the collapse in the NHS\ndentistry service.\nMae ymgyrchwyr lleol y Democratiaid\nRhyddfrydol yn ceisio cael rhywbeth i'w\nwneud i wella gwasanaeth deintyddol y GIG\nyma yn Sir Gaerfyrddin.\nMae trigolion wedi cwyno nad ydyn nhw'n\ngallu cael gweld deintydd GIG yma.\nRydym wedi ymuno ag arweinydd y\nDemocratiaid Rhyddfrydol Cymreig, Jane\nDodds AS, sydd wedi bod yn ymgyrchu ar y\nmater ledled Cymru.\nRydym am weld deintyddiaeth y GIG ar gael\ni bawb, felly rhowch wybod i ni sut mae'r\ncwymp yng ngwasanaeth deintyddiaeth y\nGIG wedi effeithio arnoch.\nThe Welsh Liberal Democrats will use your contact details to send you information on the topics you have requested. Any data we gather will be used in accordance with our privacy policy at libdems.org.uk/privacy. To exercise your legal data rights, email: data.protection@libdems.org.uk.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-10/content_26.html": "Tax Social Media Companies to Pay for Mental Health Support – Welsh Liberal Democrats\nThe Welsh Liberal Democrats have outlined their plans to support mental health today, stating that social media companies should pay triple the tax they currently do with the profits going towards supporting mental health.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_default-2035b3603478e76f064f0d4055da58b9_page-3/content_28.html": "Llandybie Community Council has declared a\nnature emergency following concerns about the\nstate of nature in the UK.\nLiberal Democrat Councillor Julian Tandy, who proposed the\nmotion stated that the country is in the middle of a nature\ncrisis with almost half of all UK wildlife in long term decline\nand 15% of species being at risk of extinction.\nProfessor Sir Partha Dasgupta’s review into The Economics\nof Biodiversity, commissioned by Her Majesty’s Treasury,\nhighlighted that humanity does not exist in isolation from\nnature but sits within it. Nature is an asset on which all\naspects of our society depend and with biodiversity\ndeclining faster than at any time in human history, we are\nundermining the productivity, resilience and adaptability\nthat nature lends our society.\nCommenting, Councillor Julian Tandy said: “I am delighted our community\ncouncil passed the motion to declare a nature emergency.\nThe climate emergency is only hastening this destruction of the natural\nenvironment, damaging habitats and disrupting ecosystems. Yet it is these very\nhabitats that have the potential to lock up carbon and fight back against rising\nglobal temperatures. It is essential that we not only protect these spaces,\nbut let them thrive – for the benefit of people, planet and nature.\nAs we recover from the COVID-19 crisis, the need for nature-rich green spaces\nwhere we live and work is clearer than ever and will help health, education and\nthe economy build back stronger. We recognise that action must be taken now\nto remedy this and to put nature into recovery at a local level, in support of\nregional, national and international work to do the same.”\nMae Cyngor Cymuned Llandybie wedi datgan\nargyfwng natur yn dilyn pryderon am gyflwr\nbyd natur yn y DU.\nDywedodd y Cynghorydd Julian Tandy, o'r Democratiaid\nRhyddfrydol, a gynigiodd y cynnig, fod y wlad yng nghanol\nargyfwng natur gyda bron i hanner holl fywyd gwyllt y DU\nyn dirywio yn y tymor hir a 15% o rywogaethau mewn\nperygl o ddiflannu.\nAmlygodd adolygiad yr Athro Syr Partha Dasgupta i\neconomeg Bioamrywiaeth, a gomisiynwyd gan Drysorlys Ei\nMawrhydi, nad yw dynoliaeth yn bodoli ar wahân i natur\nond ei fod yn eistedd o'i fewn. Mae natur yn ased y mae\npob agwedd ar ein cymdeithas yn dibynnu arno a gyda\nbioamrywiaeth yn dirywio'n gyflymach nag ar unrhyw\nadeg yn hanes dynol, rydym yn tanseilio'r cynhyrchiant, y\ngwytnwch a'r gallu i addasu y mae natur yn benthyg ein\ncymdeithas.\nLlandybie Community Council Declares Nature Emergency.\nCyngor Cymuned Llandybie Yn Datgan Argyfwng Natur.\nFull\nWrth ddweud, dywedodd y Cynghorydd Julian Tandy: \"Rwy'n falch iawn bod\nein cyngor cymuned wedi pasio'r cynnig i ddatgan argyfwng natur.\n\"Mae'r argyfwng hinsawdd ond yn prysuro'r dinistr hwn o'r amgylchedd\nnaturiol, gan ddifrodi cynefinoedd ac amharu ar ecosystemau. Eto i gyd, yr\nunion gynefinoedd hyn sydd â'r potensial i gloi carbon a brwydro'n ôl yn erbyn\ntymheredd byd-eang sy'n codi. Mae'n hanfodol ein bod nid yn unig yn\ngwarchod y gofodau hyn, ond yn gadael iddyn nhw ffynnu – er lles pobl, planed\na natur.\n\"Wrth i ni adfer o argyfwng COVID-19, mae'r angen am fannau gwyrdd sy'n\nllawn natur lle rydyn ni'n byw ac yn gweithio yn gliriach nag erioed a byddwn yn\nhelpu iechyd, addysg a'r economi i adeiladu'n ôl yn gryfach. Rydym yn\ncydnabod bod yn rhaid cymryd camau nawr i gywiro hyn a rhoi natur mewn\nadferiad ar lefel leol, i gefnogi gwaith rhanbarthol, cenedlaethol a rhyngwladol i\nwneud yr un peth.\"",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-11/content_31.html": "“robust action needed”- Welsh Lib Dems call for increase funding for gambling support services\nThis week in the Senedd, the Welsh Liberal Democrats have called on the Welsh Government to commit towards improving gambling support services in Wales.\nThis week in the Senedd, the Welsh Liberal Democrats have called on the Welsh Government to commit towards improving gambling support services in Wales.\nA staggering 9,231 car thefts have gone unsolved in England and Wales since the last election, new Liberal Democrat analysis of Home Office statistics has uncovered.\nThe Liberal Democrats have announced their plans to increase the number of water inspections to clamp down on sewage dumping water firms.\nThe Welsh Liberal Democrats have challenged Shadow Welsh Secretary Jo Stevens on her party’s stance on rebuilding relations with Europe ahead of the general election.\nThe Liberal Democrats have today (Monday 17 June) announced plans to support motorists in rural areas by doubling the scope of Rural Fuel Duty Relief scheme, saving drivers in these areas 5p a litre at the pump.\nA second tactical voting site, run by the organisation Best for Britain, has backed voting for the Liberal Democrat candidate for Brecon, Radnor and Cwm Tawe David Chadwick as the best way of preventing a Conservative win in the constituency.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_donate/content_22.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the window\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_get-involved_get-email/content_13.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_default-2035b3603478e76f064f0d4055da58b9_page/content_18.html": "Sewage Shame\nRaw sewage dumping into our local rivers and\ncoastal areas continues to be a national\ndisgrace - and it is getting worse!\nIn the last year over 450,000 sewage spills were\ncounted in English and Welsh waters. That’s\nalmost 3.5 million hours of sewage dumping - an\nincrease on the previous year.\nThings need to change - and the Lib Dems are\nleading the way by calling for:\nA sewage tax on water companies to force them\nto re-invest profits to improve the sewage\nnetwork and fix leaks.\nOFWAT (the water regulator) to be abolished and\nreplaced with an Independent Regulator with\nreal powers to stop sewage discharges and issue\nunlimited fines.\nUrgent action is needed now to protect our rivers\nand coastal areas. The Welsh Lib Dems have a\nplan to stop the sewage dumping scandal.\nMae carthion amrwd yn gwaredu i'n hafonydd\nlleol a'n hardaloedd arfordirol yn parhau i fod yn\nwarth cenedlaethol - ac mae'n gwaethygu!\nYn ystod y flwyddyn ddiwethaf cafodd dros\n450,000 o ollyngiadau carthion eu cyfrif yn\nnyfroedd Lloegr a Chymru. Mae hynny bron i 3.5\nmiliwn awr o gael gwared ar garthion - cynnydd o'i\ngymharu â'r flwyddyn flaenorol.\nMae angen i bethau newid - ac mae'r Democratiaid\nRhyddfrydol yn arwain y ffordd drwy alw am:\nTreth carthion ar gwmnïau dŵr i'w gorfodi i ailfuddsoddi\nelw er mwyn gwella'r rhwydwaith\ncarthffosiaeth a thrwsio gollyngiadau.\nOFWAT i gael ei ddiddymu a'i ddisodli gan\nReoleiddiwr Annibynnol â phwerau go iawn i atal\ngollyngiadau carthion a rhoi dirwyon diderfyn.\nMae angen gweithredu ar frys nawr i warchod ein\nhafonydd a'n hardaloedd arfordirol. Mae gan y\nDemocratiaid Rhyddfrydol Cymreig gynllun i atal y\nsgandal gwaredu carthion.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales/content_1.html": "Lib Dems Challenge Welsh Secretary on Rotten Tata Transition Deal\nWelsh Liberal Democrat MP for Brecon, Radnor and Cwm Tawe David Chadwick, has challenged the Welsh Labour Secretary of State for Wales Jo Stevens, today in Parliament.\nWelsh Liberal Democrat MP for Brecon, Radnor and Cwm Tawe David Chadwick, has challenged the Welsh Labour Secretary of State for Wales Jo Stevens, today in Parliament.\nResponding to new statistics revealing that Dŵr Cymru/Welsh Water discharged sewage into rivers, lakes, and coastal waters for over 968,340 hours last year, Welsh Liberal Democrat Leader Jane Dodds MS said:\nResponding to the Royal College of Emergency Medicine, comments on corridor care in Wales, Welsh Liberal Democrat Leader Jane Dodds MS said:\nResponding to the Labour Government voting to reject a Liberal Democrat amendment which would have exempted health and care providers from the national insurance rise, Welsh Liberal Democrat Westminster Spokesperson David Chadwick MP said:\nWelsh Liberal Democrat MP David Chadwick has sponsored a cross-party Bill in Parliament designed to secure fairer prices for farmers and food producers across the UK.\nResponding to the report published today by the Severn Estuary Commission, Welsh Liberal Democrat Leader Jane Dodds MS said:",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_llandybie-community-councils-funding-for-20-groups/content_3.html": "Llandybie Community Council's Funding for 20 groups\nLLandybie Community Council regularly awards funds to organisations that contribute significantly to community life, and the latest round of funding was no exception.\nAt a presentation evening at Saron Hall, more than 20 groups were handed funds to help them continue their vital work.\nAmong the notable recipients this year were the Crafty Baggers, a group providing people with not just creative outlets such as knitting and other forms of art, but also opportunities to attend social gatherings and coffee mornings.\nCarol Rio’s Spine Road Community project also secured a grant.\nThe project, which involves Penygroes community members looking after a shared garden where they grow flowers and vegetables, has fostered a lively community spirit throughout the seasons.\nParticularly celebrated was the Llandybie Friends of Tenovous Group, which had quite a memorable year after hitting the £200,000 figure in terms of money raised for people supported by the cancer charity over the past three decades.\nThe council's chair, Carey Thomas, urged community voluntary and charity groups to apply for funding, saying: \"Our commitment to supporting the fabric of our communities is an essential added value in helping sustain the good work of these groups in our communities\".",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_get-involved/content_11.html": "Get Involved\nThere are several ways to get involved with the Liberal Democrats. Members and non-members volunteer their time to spread our message, create our policies and fight for fairer communities. Have a look at some of the ways to get involved below:",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_default-2035b3603478e76f064f0d4055da58b9_carmarthenshire-campaigns-1/content_10.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_default-2035b3603478e76f064f0d4055da58b9_page-1/content_29.html": "Make St David's Day a Bank Holiday\nAlmost every country on earth has a national holiday, why not Wales?\nThe Welsh Liberal Democrats are calling for\nSt. David’s Day to become a public holiday in\nWales and have introduced a bill to\nParliament to allow it to happen.\nIn Scotland and Ireland St Andrew’s Day and\nSt Patrick’s Day respectively are already\npublic holidays.\nEveryone in Wales deserves the opportunity\nto celebrate who we are and our unique\nculture which unites us.\nMae bron pob gwlad ar y ddaear yn cael gwyliau cenedlaethol, pam ddim Cymru?\nMae'r Democratiaid Rhyddfrydol Cymreig yn\ngalw ar Ddydd Gŵyl Dewi i fod yn wyliau\ncyhoeddus yng Nghymru ac maen nhw wedi\ncyflwyno mesur i'r Senedd i ganiatáu i hynny\nddigwydd.\nYn yr Alban ac Iwerddon mae Dydd Sant\nAndrew a Dydd Sant Padrig eisoes yn wyliau\ncyhoeddus.\nMae pawb yng Nghymru yn haeddu'r cyfle i\nddathlu pwy ydyn ni a'n diwylliant unigryw\nsy'n ein huno.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_apple-orchard-kickstarts-renovation-project-in-capel-hendre/content_12.html": "Step Forward for Banc Y Draenen Park Renovation with Orchard\nLlandybie Community Council and Carmarthenshire County Council have initiated plans to regenerate Banc Y Draenen Park, beginning with the planting of an apple orchard.\nThe first tree was planted with students from Penygroes and Saron schools joining the chairperson of Llandybie Community Council.\nThis, alongside mixed tree and shrub planting, is part of phase one of the project which was shared with local primary schools along with an educational talk from Matthew Collinson, the local places for nature officer for Carmarthenshire.\nThe plan, also, involves council environment committee members, Cllr Griff Davies and Cllr Julian Tandy.\nThe second phase will involve the wider Capel Hendre community in a consultation exercise on further enhancements, which potentially includes a community garden, wild meadows and a dedicated nature area equipped with bird and bat boxes.\nThe public consultation on the Banc Y Draenen Park Project is expected in the coming weeks.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_search/content_9.html": "Oops, an error occurred! Code: 20250503220608ccd2f6c3\nThis website uses cookies\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_default-2035b3603478e76f064f0d4055da58b9_what-we-stand-for/content_16.html": "What We Stand For\nOur beliefs, principles and values\n\" The Liberal Democrats exist to build and safeguard a fair, free and open society, in which we seek to balance the fundamental values of liberty, equality and community, and in which no-one shall be enslaved by poverty, ignorance or conformity. \"\nPREAMBLE TO THE LIBERAL DEMOCRAT CONSTITUTION\nThe Liberal Democrats stand firm on seven core values: liberty, equality, democracy, community, human rights, internationalism, and environmentalism. Each of these underpin the party's specific policy proposals.\nLiberty\nWe believe in the right of individuals to make their own decisions about how they live their lives, as long as they do not cause harm to others.\nOur aim is to empower and support individuals to pursue their dreams, to make the most of their talents and to live their lives as they wish.\nEquality\nWe stand by the idea that without equality, true liberty cannot be realised.\nThis requires an active state to: ensure that no one is held back by poverty, poor health, or discrimination, including on the basis of personal characteristics or beliefs; provide access to education or training, and other public services, including a welfare safety net; and guarantee that everyone enjoys equality before the law.\nDemocracy\nWe understand that through democracy, every citizen is empowered to make their voice heard, without being dominated by entrenched interests or the power of money; checks and balances, so that those in power cannot abuse their positions for personal gain or political advantage; and a plurality of views, where no individual or organisation is deterred from speaking truth to power.\nCommunity\nWe believe it is important to provide support for a diverse range of organisations that enable individuals to join together in the pursuit of common goals or activities; and the decentralisation of political and economic power to local government and the nations and regions of the UK.\nHuman Rights\nUpholding these values of individual and social justice, we reject all prejudice and discrimination based upon race, ethnicity, caste, heritage, class, religion or belief, age, disability, sex, gender identity or sexual orientation and oppose all forms of entrenched privilege and inequality.\nInternationalism\nLiberal Democrats are proud internationalists. We believe that our country and our people thrive when we are open and outward-looking. The UK can be an incredible force for good when it stands tall on the world stage, championing the values of equality, democracy, human rights and the rule of law.\nWe are passionate about close British-European cooperation, which benefits us and our allies. While we support a longer-term objective of EU membership, we recognise that the Conservatives have damaged trust in the UK so badly that there is a lot of work to do before that is possible. We have therefore set out a comprehensive step-by-step plan to rebuild our ties of trade, trust and friendship with our nearest neighbours – ties that can only be built back gradually over time.\nEnvironmentalism\nWe value the importance of acting at home and internationally to promote environmentally sustainable means of production and consumption and living in harmony with nature.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_default-2035b3603478e76f064f0d4055da58b9_page-5/content_19.html": "Carmarthenshire has the\n6th slowest Red call\nresponse time in Wales.\nShocking figures have unveiled the local\nareas in Wales with the longest\nambulance delays, revealing a stark\n“postcode lottery” for response times to\nlife-threatening calls.\nPotential heart attack and stroke victims\nin the worst-hit areas are now waiting an\naverage of one hour and 57 minutes for\nparamedics to arrive.\nThe figures, show Carmarthenshire\nresidents have the 6th worst response\ntime for Red calls (immediately life\nthreatening) and wait 6.1% longer for\nAmber (serious but not life threatening),\nat well over 2 hours, than the Welsh\naverage.\nThe Welsh Liberal Democrats are calling\nfor action on the social care crisis in order\nto free up hospital beds and stop\nambulances waiting outside hospitals.\nWelsh Liberal Democrat Leader Jane\nDodds MS said:\n“Far too many people are being left to\nwait too long in an emergency across\nevery region of Wales. None of this is the\nfault of our hardworking ambulance staff\nwho are doing their utmost in extremely\ndifficult conditions.”\nMae gan Sir Gaerfyrddin\ny 6ed amser ymateb i alwadau\nCoch arafaf yng Nghymru.\nMae ffigyrau brawychus wedi datgelu'r\nardaloedd lleol yng Nghymru gyda'r oedi\nhiraf o ran ambiwlansys, gan ddatgelu\n\"loteri cod post\" llwm ar gyfer amseroedd\nymateb i alwadau sy'n peryglu bywyd.\nMae trawiad posib ar y galon a\ndioddefwyr strôc yn yr ardaloedd sydd\nwedi'u taro waethaf bellach yn aros\ncyfartaledd o awr a 57 munud i\nbarafeddygon gyrraedd.\nMae'r ffigurau, yn dangos bod gan\ndrigolion Sir Gaerfyrddin y 6ed amser\nymateb gwaethaf i alwadau coch (sy'n\nperyglu bywyd ar unwaith) ac aros 6.1%\nyn hirach am Amber (difrifol ond nid yw'n\nbygwth bywyd), ar ymhell dros 2 awr, na\nchyfartaledd Cymru.\nMae'r Democratiaid Rhyddfrydol Cymreig\nyn galw am weithredu ar yr argyfwng\ngofal cymdeithasol er mwyn rhyddhau\ngwelyau mewn ysbytai a stopio\nambiwlansys rhag aros y tu allan i ysbytai.\nDywedodd Arweinydd Democratiaid\nRhyddfrydol Cymru, Jane Dodds AS:\n\"Mae gormod o lawer o bobl yn cael eu\ngadael i aros gormod o amser mewn\nargyfwng ar draws pob rhanbarth yng\nNghymru. Nid oes dim bai ar ein staff\nambiwlans sy'n gweithio'n galed, ac sy'n\ngwneud eu gorau glas mewn amodau\nhynod o anodd.\"",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-13/content_17.html": "Lib Dem manifesto pledges £760 million in extra funding for Wales\nThe Liberal Democrats have promised to deliver £760 million in extra funding to Wales as part of their manifesto launch.\nThe Liberal Democrats have promised to deliver £760 million in extra funding to Wales as part of their manifesto launch.\nA tactical voting website has backed the Liberal Democrats and candidate David Chadwick as the best way to defeat the Conservatives in Brecon, Radnor and Cwm Tawe.\nWelsh Lib Dems uncovers water firms have discharged sewage over 83,000 times in Welsh Waterways.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-12/content_30.html": "Labour Criticised For Not Backing Proposals to Put Power Pylons Underground\nPowys Liberal Democrats have criticised Labour for voting against proposals to make it mandatory for all new electricity cables to be underground rather than overhead pylons.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-2/content_25.html": "US Steel Tariffs – Show Strength to Protect What is Left of the Welsh Steel Industry\nResponding to the news that the UK has been hit with a 25% import tax on steel imports to the US\nResponding to the news that the UK has been hit with a 25% import tax on steel imports to the US\nThe Liberal Democrats have hit out at the Conservative Party following the publication of data showing that lamb imports to the UK have risen dramatically\nResponding to the news that a new £1 million joint research initiative to tackle water quality issues in the River Wye will be established by the UK & Welsh governments, local Welsh Liberal Democrat MP for Brecon, Radnor and Cwm Tawe David Chadwick said:\nLib Dems call for health and social care sector to be exempted from National Insurance tax hike in Spring Statement. In Wales, health and care providers, including dentists, GPs and care homes are facing a £759 million tax hike.\nWelsh Liberal Democrat MP for Brecon, Radnor and Cwm Tawe David Chadwick is calling on the UK Labour Government to scrap the latest energy bill rise for local pensioners who’ve been stripped of their Winter Fuel Payments.\nWelsh Liberal Democrat Westminster Spokesperson David Chadwick MP has today led a debate on fairness in the agricultural supply chain.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-4/content_24.html": "Welsh Unemployment Rise: Labour Must Scrap Their Jobs Tax\nResponding to the latest figures showing unemployment at 5.6%, up 2.3 percentage points on the year, Welsh Liberal Democrat Westminster Spokesperson David Chadwick MP said:\nResponding to the latest figures showing unemployment at 5.6%, up 2.3 percentage points on the year, Welsh Liberal Democrat Westminster Spokesperson David Chadwick MP said:\nThe Welsh Liberal Democrats have called on Labour to reset their relationship with farming and the countryside following the release of statistics showing farming incomes in Wales have fallen by 34% for the period April 2023 to March 2024.\nResponding to a letter sent by Welsh Secretary Jo Stevens & Transport Minster Heidi Alexander to First Minister Eluned Morgan regarding Welsh rail funding, Welsh Liberal Democrat Westminster Spokesperson David Chadwick MP said:\nThe Welsh Government have been urged to support local councils who are struggling to fund social care services.\nThe Liberal Democrats have once again called for the Crown Estate to be devolved to Wales during a debate Crown Estate Bill in the House of Commons today.\nThe Liberal Democrats secured a vote in Parliament this week to protect Welsh GPs, hospices and other health and social care providers from the Government’s National Insurance tax hike.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_default-2035b3603478e76f064f0d4055da58b9/content_15.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-5/content_2.html": "David Chadwick Raises Concerns Over Coal Tips with UK Government Minister\nWelsh Liberal Democrat MP for Brecon, Radnor and Cwm Tawe David Chadwick has raised concerns over the safety of coal tips across Wales in parliament this evening.\nWelsh Liberal Democrat MP for Brecon, Radnor and Cwm Tawe David Chadwick has raised concerns over the safety of coal tips across Wales in parliament this evening.\nShocking new research commissioned by the Liberal Democrats reveals that 58% of people in Wales expect food prices to rise because of the Family Farm Tax announced in the Budget.\nDavid Chadwick, Welsh Liberal Democrat MP for Brecon, Radnor and Cwm Tawe is calling on the Government to urgently enshrine an outright ban on bonuses for water company bosses in law.\nThe Welsh Liberal Democrats have launched a blistering attack on the Severn Trent and Hafren Dyfrdwy water companies, accusing them of fleecing the public at the same time as filling our rivers and seas with raw sewage.\nThe Welsh Liberal Democrats have reiterated their calls for Labour to exempt health and social care providers from the National Insurance tax rise following a stark warning from Care Forum Wales\nWelsh Liberal Democrat MP for Brecon, Radnor and Cwm Tawe David Chadwick has called on the UK Labour Government to reverse their planned changes to the agricultural property relief scheme.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-9/content_27.html": "Harmful bacteria in Wye bathing spot a “disgrace”- Welsh Lib Dems\nThe Welsh Liberal Democrats have today shared their reaction to the discovery of harmful bacteria at the Warren bathing site of the river Wye.\nThe Welsh Liberal Democrats have today shared their reaction to the discovery of harmful bacteria at the Warren bathing site of the river Wye.\nThis week in the Senedd, the Welsh Liberal Democrats have called on the Welsh Government to protect unpaid carers.\nThe Welsh Liberal Democrats are celebrating a return to representation in Parliament after successfully winning the seat of Brecon, Radnor and Cwm Tawe from the Conservatives.\nThis week in the Senedd, the Welsh Liberal Democrats have backed a motion which would see lying being made illegal in the Senedd.\nThe Welsh Liberal Democrats have stated that this Thursday’s election represents a historic chance to save Brecon, Radnor and Cwm Tawe’s rivers.\nWelsh Lib Dem leader Jane Dodds has ruled out propping up the Welsh Labour Government over concerns with the Vaughan Gething donation scandal.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-8/content_21.html": "Liberal Democrats Attack Labour Over Cuts to Mid Wales Rail Services\nThe Welsh Liberal Democrats have attacked Labour over planned cuts to rail services across Mid Wales, stating the plans will reduce investment in communities, limit opportunities for local people and go against plans to tackle climate change.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_get-involved_volunteer/content_8.html": "Help us build a better Carmarthenshire\nVolunteer to help the Carmarthshire Liberal Democrats\nBecome a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-1/content_23.html": "Lib Dems Challenge Welsh Secretary on Rotten Tata Transition Deal\nWelsh Liberal Democrat MP for Brecon, Radnor and Cwm Tawe David Chadwick, has challenged the Welsh Labour Secretary of State for Wales Jo Stevens, today in Parliament.\nWelsh Liberal Democrat MP for Brecon, Radnor and Cwm Tawe David Chadwick, has challenged the Welsh Labour Secretary of State for Wales Jo Stevens, today in Parliament.\nResponding to new statistics revealing that Dŵr Cymru/Welsh Water discharged sewage into rivers, lakes, and coastal waters for over 968,340 hours last year, Welsh Liberal Democrat Leader Jane Dodds MS said:\nResponding to the Royal College of Emergency Medicine, comments on corridor care in Wales, Welsh Liberal Democrat Leader Jane Dodds MS said:\nResponding to the Labour Government voting to reject a Liberal Democrat amendment which would have exempted health and care providers from the national insurance rise, Welsh Liberal Democrat Westminster Spokesperson David Chadwick MP said:\nWelsh Liberal Democrat MP David Chadwick has sponsored a cross-party Bill in Parliament designed to secure fairer prices for farmers and food producers across the UK.\nResponding to the report published today by the Severn Estuary Commission, Welsh Liberal Democrat Leader Jane Dodds MS said:",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-3/content_4.html": "Higher Education in Wales Being Hollowed Out\nResponding to the news of cuts at Bangor University and the University of South Wales, Leader of the Welsh Liberal Democrats Jane Dodds MS said:\nResponding to the news of cuts at Bangor University and the University of South Wales, Leader of the Welsh Liberal Democrats Jane Dodds MS said:\nThe Welsh Liberal Democrats have called for the UK Labour Government to draw up plans for real economic investment in former mining communities across Wales.\nResponding to the news that Cardiff University is set to shed 400 jobs, including cutting its nursing course, Welsh Liberal Democrat Westminster Spokesperson David Chadwick MP said:\nResponding to the speech by the Chancellor of the Exchequer Rachel Reeves on economic growth, Welsh Liberal Democrat Spokesperson David Chadwick MP said:\nFollowing a Welsh Affairs Select Committee meeting on cross-border health care between England and Wales\nJane Dodds MS has again raised fears around the potential impact of cuts to the Heart of Wales Line",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_page-7/content_5.html": "Lib Dems Slam Welsh NHS Waiting Lists as 'Obscene'\nResponding to the news that hospital waiting times figures in Wales have hit a record high, Welsh Liberal Democrat Leader Jane Dodds MS said\nResponding to the news that hospital waiting times figures in Wales have hit a record high, Welsh Liberal Democrat Leader Jane Dodds MS said\nWelsh Liberal Democrat Leader Jane Dodds MS has called on the Welsh Labour Government to set clear targets as part of their cross-border care plans to cut NHS waiting lists.\nThe Treasury is reportedly set to receive a £1.5 billion windfall from Octopus Energy. The cost of reinstating the Winter Fuel Payments for this year would be £1.4 billion.\nThe Treasury is reportedly set to receive a £1.5 billion windfall from Octopus Energy. The cost of reinstating the Winter Fuel Payments for this year would be £1.4 billion.\nLiberal Democrat MP for Brecon, Radnor and Cwm Tawe David Chadwick has been elected to sit on the powerful Welsh Affairs Select Committee in Westminster.\nDavid Chadwick, the newly elected Liberal Democrat MP for Brecon, Radnor and Cwm Tawe has used his maiden speech in Parliament today to draw attention to the healthcare crisis impacting his constituency.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_default-2035b3603478e76f064f0d4055da58b9_page-4-1/content_14.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_carmslibdems_wales_/https_www_carmslibdems_wales_take-our-survey/content_6.html": "Please select either the English or the Welsh Version of the survey\nThe Welsh Liberal Democrats will use your contact details to send you information on the topics you have requested. Any data we gather will be used in accordance with our privacy policy at libdems.org.uk/privacy. To exercise your legal data rights, email: data.protection@libdems.org.uk."
}