{
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_park-and-ride-challenge-on-the-19th-and-the-results-are-in/content_78.html": "Park And Ride Challenge On The 19th, And The Results Are In\nThe decision by the new Conservative administration at Maidstone Council to allow the Park and Ride service to stop is being reviewed this Wednesday 19th January, with strong opposition to the closure from the Liberal Democrats and members of the other smaller groups.\nLiberal Democrat councillors Derek Mortimer, Brian Clark, Cynthia Robertson decided to “call-in” the decision which was held behind closed doors. The secretive nature of the decision wild speculation has appeared in public about the usage levels and the bridging costs requested to keep the service running after February until numbers return to normal.\nWhat is clear is the public’s desire to keep the service. A petition, run by the Liberal Democrats, has resulted in 1,483 people calling on the service to be retained. However, it is the personal stories rather than just the number of signatories that have highlighted the need to retain the service. Stories such as Trudi’s who may have to look for another job, or Rachel’s who states: “To lose this service would be more than an inconvenience it would prevent us coming into the town centre”, or Marie’s who faces waiting in the cold over multiple changes whilst on her way to the hospital. Looking past the issues the cessation of the service will have for many Maidstone residents that use the service it was Chris from Allington that summed it up for everyone: “I find it hard to believe they are thinking of making changes that will create more traffic in Maidstone.”\nCllr. Clive English said of the petition:\n“The decision to close Park and Ride if it happens should not be based on the unusual situation faced by all Public transport operators over the period of the Pandemic, but should be based on what is in the long term good of Maidstone, with a full knowledge that we may be about to close down one of the few avenues that we have to reduce congestion, and that the controversial Maidstone local Plan review continues to cite as an important measure. If it does close that will be yet another missing piece in an already very shaky looking Local Plan.”\nCllr. Derek Mortimer had the following to say:\n“This valued facility supports our town centre economy and keeps many cars off our main routes into and out of town. I am highly suspicious that the two sites in Allington and Willington Street are being lined up for even more housing developments. The decision based on Covid usage is premature and once closed we will never get it back again.”\nThe petition itself has been somewhat revealing by analysing the signatories. Of the 1,483 people signing the petition 2/3 (989) live in Maidstone Borough. The greatest number of signatories is as expected around where the park and ride run from with Allington leading the way, and Bearsted following, but all 26 Wards in the Borough are represented with people across Maidstone Borough recognising the value of this service.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone/content_18.html": "About Maidstone Liberal Democrats\nThe Liberal Democrats have a rich history of representing and fighting for the interests of the people of Maidstone. As a party, we are proud to serve the residents of the county town of Kent.\nFind out how we help Maidstone:\n- Local Government\n- Local Areas\nLocal Government\nMaidstone covers many political structures including:\n- Two Parliamentary Constituencies each returning a Member of Parliament\n- Eight County Council Divisions returning nine County Councillors\n- 26 Wards returning 55 Borough Councillors\n- 41 Parish Councils\nEach group has their own distinct roles and responsibilities that attempt to work together to improve the lives of the people of Maidstone.\nTo find out more about how the different levels of government work together locally please see our page on local government responsibilities.\nTo find out more about your locally elected Liberal Democrats please choose from the following tiers.\nLocal Areas\nMaidstone comprises of 26 electoral wards, each unique in both character and history; and each with their local amenities, resources and needs. As a party we seek to help all the wards within Maidstone.\n|\n|\n|",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_pop-goes-pound12-million/content_41.html": "Pop goes £12 million…\n£12 million pounds by the reckoning of almost all in Maidstone is not an insignificant sum, and certainly more than tuppenny rice and treacle. However, it took just 27 seconds to introduce the amendment to MBC’s Medium Term Financial Strategy Capital Expenditure programme wiping off a planned £12 millions of investment in Public Realm and Greening planned between 2025 and 2028.\nThe amendment was introduced as follows by cabinet member Cllr. Cooper:\n“…the second is relating to the town centre strategy greening and lighting, that has been amended because there was a much larger figure put into the capital programme originally, clearly until the town centre strategy is finalised and has been through full council and obviously through committee stages it is very difficult to say what we can afford so we didn’t believe it was appropriate to put it into the capital strategy…”\nFortunately, these funds are purely paper based with the description being:\n“At this stage, the estimates in the draft capital programme are indicative. Funding from external sources, including CIL, Section 106, UK Shared Property Fund, will be sought wherever possible.”\nThat these are now removed from the capital expenditure plan does not stop them from being included later with the same external sources being sought to make them a reality. The amounts were purely indicative and yet to be allocated against any improvements or works their inclusion or removal has little bearing on the eventual aspirations of the Council for improving the town centre. Post budget these figures will be revised, and those amounts removed from 24/25 to 27/28 for public realm and greening expenditure can be reintroduced with a greater focus hand in hand with the town centre strategy once adopted.\nMaidstone Liberal Democrats are committed to improvements to Maidstone, something underpinned by our alternative vision for the town centre. The changes are only on paper and will certainly be revised (no capital expenditure figures have been entered after the financial period 24/25, something that is unfeasible), we trust that the 27 second removal of £12 million from the budget will not be used to claim lack of funds when discussing ideas for the future of Maidstone.\nCllr. Clive English said: \"Should the current administration wish to remove these placeholder funds until there is further clarity on where they might be spent that is well within their purview and I am happy with the amendment. The indicative figure of £12 millions should not be forgotten however and its removal should not be used as a technicality to make it appear there are no funding options available for improving the town centre.\"",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_new-support-bus-services-to-west-maidstone/content_98.html": "New support bus services to West Maidstone\nThe bus company Arriva will on 24 July withdraw the services they consider no longer financially viable following the £2.2m pa reduction in support for local bus services by the KCC Conservative Executive.\nFollowing concerns raised by many local residents Ian Chittenden, Liberal Democrat County Councillor Spokesperson for Highways and Transport raised the issue with Kent County Council Transport Officers.\nKCC Officers have now agreed that bus company Nu-Venture will provide a revised services as detailed on the link below which will start from 24th July.\nThis is still subject to a final sign off by KCC and formal notification to the Traffic Commissioners, who oversee bus timetable changes nationally, but this is not anticipated to be a problem.\nWe appreciate the efforts of the KCC Officers and the team at Nu- Venture in making these arrangements at short notice.\nIt is important that residents support these revised services to ensure that they are retained.\nInformation from Nu-Venture\nBuses operated by locally owned Nu-Venture will replace certain Arriva services in the Maidstone area with trips at shopping times on Mondays to Fridays starting on 24 July. English National Concession Passes will continue to be accepted for travel and cash/card fares will still be available from the bus driver.\n• Nu-Venture Bus 78, previously discontinued in 2022 because it was not possible to run it reliably because of driver shortages, has been resurrected and will provide two round trips in each direction between Queens Road, Barming, Upper Fant Road and Maidstone Town Centre.\nExisting Nu-Venture services 79A/79C are revised and renumbered 79 with timetable changes allowing about thirty minutes extra shopping time in Maidstone to meet local requests. Bus 79 will start at Mid Kent Shops, serving Tintern Road, Castle Rd, Conway Rd, Maxwell Drive and Poplar Grove en route to/from Maidstone Town Centre. The section of route which currently serves Headingley Rd, Allington Way and Hildenborough Crescent is discontinued for now, pending the possible creation of parking restrictions to allow buses free passage.\nFull timetables for the affected routes will be available from 10 July at the company’s website http://www.nu-venture.co.uk",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_in-council-september-23/content_88.html": "In Council September '23\nMeetings within the chamber during September verged from the detailed to the fractious. The primary planned business for the month was the continuing discussions concerning the Medium Term Financial Strategy and Budget Proposals. With inflation running at levels that exceed the feasible revenue generation capabilities of the council through taxation and services there are large challenges that lay ahead. The beginning of the month saw an excellent all councillors briefing setting out the cost saving proposals which we are glad to report will have a negligible impact on the services provided by MBC but should see MBC come in on budget.\nThe livelier part of discussions in September involved Maidstone Borough Council’s response to the proposed extension of the Hermitage Lane Quarry into the ancient woodland of Oaken Wood. Liberal Democrat councillors would like to extend their thanks to campaigners for their continued efforts to save Oaken Wood and whilst the outcomes from September are far from perfect we will continue to support your cause.\nPlanning, Infrastructure and Economic Development PAC 6th and 18th\nPIED PAC (the short name for this committee), has a rather hefty workload this month with two very important meetings. The first on the 6th was joined by many members of the public concerned with the proposed quarry extension into Oaken Wood.\nThe meeting was a little more raucous than usual due to the passion felt about saving Oaken Wood. After several excellent speeches from the members of the Save Oaken Wood campaign and considered and well researched representations from visiting members Cllr. Tony Harwood (Lib Dem, North Ward), and Cllr. Stuart Jeffery (Green, Bridge Ward), arguing against expansion of the quarry the committee proceeded with lengthy discussions.\nMost opposition members spoke against the expansion and supporting the views of the 25,000 plus people who had signed the Woodland Trust petition, including Lib Dem councillors Clive English and Richard Conyard. Before Vanessa Jones (Independent, Boxley Ward), brought forward the motion that the weak response be retracted and replaced with text in alignment with the response made by the Woodland Trust which succeeded by a vote of 7 to 2.\nUnfortunately, the proposal from the committee was not followed by the cabinet member, which resulted in this decision being challenged later in the month in the Overview and Scrutiny Committee.\nThe second meeting on the 18th was primarily concerned with the governments inspectors modifications to the proposed local plan. Whilst the first meeting was weighted with passion, this was weighed by the report which came in at 560 pages. The committee moved for the modifications to go to public consultation, not because all parts are warmly accepted, but because they are the factual recommended modifications. Lib Dem councillors will likely be focusing on areas within their wards of interest to residents and inviting further comment.\nHousing, Health, and Environment Policy Advisory Committee 7th September\nThe HHE PAC was sought for approval on increases in Fixed Penalty Notices (FPNs), pertaining to:\n- Littering\n- Fly-tipping\n- Graffiti\n- Duty of care for household waste\nThese followed government changes in allowing an increase in penalties for those found to have committed these offences. The committee recommended that the maximum penalty allowed be put in place with a slight reduction for early payment.\nCorporate Services Policy Advisory Committee 11th September\nThe fieriest parts of this committee meeting did not involve an agenda item with most items going through smoothly and the primary business being the Medium Term Financial Strategy and Budget Proposals which having been expertly explained in a councillor briefing at the beginning of the month only raised a few clarifications.\nWhat did set the cat amongst the pigeons was the feeling that not all appropriate points has been captured in regards to the previous meeting and MBCs Biodiversity and Climate Change plan. The plan was the primary business in July for most advisory committees and it was felt by members that whilst proposed activities were plentiful, there was no coherent plan, activities were not prioritised effectively, and most importantly no proper deadline to achieve many of the activities set out.\nWhilst exchanges were forthright in putting across views and disappointments consensus was reached, and a clearly structured plan will be presented in a future meeting (subsequently set for November). To underline the necessity of having a clearly structured plan proposals to employ two further officers to administer the plan were recommended to be put on hold until a clear, well structured, and goal driven plan is presented.\nOverview and Scrutiny Committee 19th September\nThe O&S committee also saw many members of the public in attendance. Earlier in the month saw the PIED PAC recommend that MBC produce a strongly worded response to KCC in relation to the extension of the Hermitage Lane Quarry, whilst this was voted for 7 to 2 the cabinet member responsible chose not to follow the advice (more can be read here), and actively response with an opposite view, the decision was “called in” for review by the O&S committee.\nGoing against the recommendation of the advisory committee, as could be expected, not only incensed some members of the committee, but also those campaigning hard to save Oaken Wood; and this meeting was proceeded by a demonstration outside the town hall.\nBy nature of the “call in” a ratified response had yet to be submitted to KCC and after a lively debate a vote for no further action was successful. The results of this are that no strongly worded letter of objection was sent to KCC from MBC and the original unratified letter proposing mild mitigation that the original committee felt was unsuitable remains the official response.\nThose voting to no further action where the Conservative councillors: Blackmore, Hastie, Webb, Hinder, Round and Cannon; they were joined by Independent Cllr. Gooch.\nFull Council 27th September\nThe month of meeting was ended with a full council meeting. The primary points of interest for the public being:\n- Freedom of the Borough granted to the branches of the Royal British Legion within the borough.\n- Freedom of the Borough of England Footballer Alessia Russo\nBoth of which were voted through.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors_cllr-paul-wilby/content_26.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_budget-debate-lib-dem-proposal-for-native-woodland-restoration-at-willington-street-park-and-ride-site/content_80.html": "Budget Debate: Lib Dem Proposal For Native Woodland Restoration At Willington Street ‘Park And Ride’ Site\nWhile Maidstone Lib Dems were unable to overturn Maidstone Conservatives' refusal to provide support for the continuation of Park and Ride services, they retain their support for a fit for purpose 21st Century Park and Ride.\nHowever, at Maidstone Council's budget debate on Wednesday, Cllr Clive English proposed adding £70k to the budget to provide core funding for the rewilding of the now defunct Willington Street P&R car park, should all attempts to continue park and ride fail, in preference to leasing the site at market rent for car parking or redevelopment for yet more housing.\nThe amendment to the budget was seconded by Lib Dem Planning Committee Spokesperson Cllr Tony Harwood who highlighted the opposition to paving the site when the Park and Ride service was first established in the 'quieter eastern side of Mote Park' .\nSupporting the amendment, Cllr Brian Clark once again highlighted Maidstone Council's call for landowners in the Borough to join in with MBC’s tree planting drive, stating afterward, \"If the council is really taking this initiative seriously, it should practise what it preaches by planting and rewilding their own land.\" The amendment was defeated with Conservatives, supported by a handful of Independent and Maidstone Group councillors opposing the pro-environment measure.\nCllr Tony Harwood commented, ”If Park and Ride services cannot be re-established, it would be a tragedy for Mote Park, and for local people and our beleaguered wildlife, if this site is left paved-over for use as a market rate overspill car park, as has been suggested, or worse yet more housing. If this council is serious about restoring lost tree cover and rewilding, this would be a great time to show its commitment\".\nCllr Clive English had previously commented, \"With the climate emergency as a backdrop, it would show a complete lack of ambition, and add insult to injury, if Mote Park ‘Park and Ride’ closed only to become a car park. If no alternative Park and Ride services can be found, we must consider returning this site back to a native woodland in this historic setting.\"",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_page-1/content_51.html": "Geoff Samme Elected as County Councillor for Maidstone North East\nGeoff joins 11 other Lib Dems on KCC\nGeoff joins 11 other Lib Dems on KCC\nScheme hindered by requirement for mass-developments\nBringing forward new policies to protect our Landscape & Green spaces\nNew plans set to tackle local housing challenges\nFollowing a Defence Review, it was announced in 2016 that Invicta Park Barracks, home to the 36 Engineers Regiment and the King's Gurkha Engineers, would close in 2029.\nWe aim to make this development different by enabling delivery of high-quality green space, medical facilities and ensuring that local residents benefit from any new affordable accommodation.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_maidstone-residents-generously-donate-items-for-ukraine/content_61.html": "Maidstone Residents Generously Donate Items For Ukraine\nSouth Ward councillors Brian Clark, Derek Mortimer and Paul Wilby are working with numerous groups helping to collect humanitarian items for residents in Ukraine. On Saturday Cllrs Clark and Mortimer, collected the first van full of donations from the Loose YMCA and later Cllr Clark collected two further van loads from Staplehurst Parish Council. The boxes collected include urgently needed items such as medical supplies, canned food, hygiene products, baby food, nappies, batteries, candles, toothpaste.\nThe destination drop off point, Brother Parcel Post, took the first pallet full of items on Saturday. The remainder have been placed in temporary storage and will be dropped off next week.\nOn Sunday morning Cllrs Brian Clark and Paul Wilby supported a further event held by the Tovil Parish Clerk at YMCA Tovil. During the event Staplehurst Parish Council stopped by with the remainder of their donations which will be stored in Tovil until the next lorry is available for Ukraine. Cllr Mortimer commented, ”Its tremendous to see the communities throughout Maidstone pulling together to help those in Ukraine, so clearly suffering”. Cllr Clark continued, “This is going to be a long haul but Brother Parcel Post have sent five full lorries to Ukraine over the last two days and still have a warehouse full of pallets ready to go, that’s amazing\"\nNB Brother Parcel Post has been in business for 10 years predominantly shipping online items from the UK to Ukraine and neighbouring countries but after war broke out they were unable to continue their business and switched to sending humanitarian aid to Ukraine.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_maidstones-cityfibre-installation-rollout/content_40.html": "Maidstone’s CityFibre installation rollout\nFollowing the very considerable traffic disruption in the Allington and London Road areas of west Maidstone during the Summer of 2023, Cllrs Chris Passmore and Ian Chittenden had a meeting on 9 August at the KCC Aylesford offices with KCC Officers, Lanes-i and CityFibre representatives.\nThis meeting was to:\n- put over the concerns of residents,\n- better understand how the programme was being managed,\n- push for what could be done in the short term to alleviate the frustrations of residents.\nThe outcome of this meeting is summarised in section 2 below.\nDuring this meeting the CityFibre representative started to explain the bigger picture of what is planned for completing the CityFibre installation in west Maidstone through to Easter 2024 as well as the longer-term programme for the whole of Maidstone. Both Councillors expressed their concerns that, unless this strategic programme critical for the future of Maidstone is better managed and communicated, it is likely that other parts of urban Maidstone will in the future experience similar or potentially even greater disruption, leading to further local resident frustration.\nFurther meeting planned for September.\nCllrs Chris Passmore and Chittenden have now arranged a further meeting in September with Cllr Neil Baker, the Cabinet Member for Highways and Transport to better understand the strategic plan for the roll out of the CityFibre System across the rest of west Maidstone and then the rest of Maidstone, so that the lessons learnt in this first phase are not just repeated.\nThe questions that they are specifically wanting answers to are:\n- What is the ‘scheme’ under which CityFibre have the licence to dig up parts of west Maidstone?\n- Who in the KCC authorised this particular programme?\n- What has so far been specifically authorised in terms of the extent of the highspeed fibre network for Maidstone?\n- Who is currently overseeing this programme?\n- Why was Allington and the London Road selected as the first area to have this highspeed fibre network?\nSection 2 – Summary of 9 August meeting with KCC Officers, Lanes-i and CityFibre representatives.\n- The entire length of the Queens Road would be open for traffic from 3rd September.\n- That it is possible that the Queens Road will not be closed again with only traffic control round the working areas – although this cannot be confirmed until later in August.\n- Lanes-i say that they have met their statutory communication requirements with local residents with regards to leaflet drops to local residents.\n- That there had been some communication with some Councillors through a short remote presentation about the programme six months ago. (This was subsequently confirmed by MBC Councillor Cynthia Robertson)\n- That KCC, Lanes-i and CityFibre will now have regular weekly/fortnightly? meetings to review progress and to share information as to the areas being worked.\n- That residents will tolerate some disruption in anticipation of the longer-term benefit of this high-speed link and the increased value of their property.\n- That this privately funded highspeed one gigabyte per second fibre network is planned to cover the whole of Maidstone over the next 7 years. The object is to support Maidstone's commercial, academic and residential development for the next 50 years.\n- The Councillor’s understanding (to be confirmed) is that it is to be built using loops of fibre trunking from strategically placed exchanges serving up to 35k residences with the first fibre exchange located at the Allington Community Association. This explains why they are having to dig up Castle Way “twice” to separate by 8m? the two “arms” of the loop. This structure of loops makes the fibre system less vulnerable, since data can flow in either direction back to the exchange but does make its construction more complex.\n- The Councillor’s understanding (again to be confirmed) is that the west Maidstone loop will take until Easter 2024 to complete.\n- CityFibre are keen to have residents contact them directly about their concerns and I was going to be provided with a link to post out, however this has not yet been provided.\nCllrs Chris Passmore and Ian Chittenden also pressed the following two issues:\n- The very poor communication with Nu-Venture Coaches Ltd who run services on the Queens Road advising of the closures and putting the company in breach of his legal obligations. The first the company knew of the closure was when he received the public notice on 29 June 2023.\n- They requested again to see the Risk Assessment, Method Statements and associated training records of Lanes-i staff covering the operation the temporary storage site at Adisham Drive where a local resident has witnessed poor Health and Safety procedures. This is to reassure residents that Lanes-i are a competent and safe ‘operator’.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_lib-dem-call-to-save-park-and-ride-defeated-by-maidstone-tories/content_83.html": "Lib Dem call to save Park and Ride defeated by Maidstone Tories\nOn Wednesday Councillors at MBC’s Policy and Resources committee reconsidered December's decision to refuse additional pandemic support for Park and Ride Services, following Call-in by Lib Dem Councillors Derek Mortimer, Cynthia Robertson and Brian Clark. That decision, proposed by Maidstone Conservatives against officer advice, led to Arriva's confirmation that Park and Ride services at Mote Park and Allington will cease in February.\nDuring discussion Cllr Mortimer submitted a petition signed by nearly 1,500 residents to support continuation the service. He explained that residents from all backgrounds had made contact, wishing to protect the service. Cllr Clark introduced the Call-In, reading extracts from a letter the KCC’s Director of Environment, Waste and Transport had submitted to MBC in 2018, stressing the importance of the Park and Ride services and how it was a key part in Maidstone’s current adopted local plan.\nCllr Robertson followed by describing the impact the loss of the service would bring to the towns residents especially the vulnerable and disabled who value the service. The call in was supported by Lib Dem committee members, but Conservatives successfully proposed endorsing the original decision to provide no additional support.\nFollowing the meeting Cllr Derek Mortimer commented, “The Park and Ride service has been severely impacted by the pandemic like many services. The government has made pandemic grant funding available to impacted services but Maidstone Conservatives have refused to extend available support funding for Park and Ride”. He continued, “In discussion, some focused on the lack of passenger take up, but numbers have been increasing steadily, only dropping when the government introduced Plan B in early December. It's hardly rocket science to understand this drop, recorded across Christmas 2021, is directly linked to pandemic restrictions and the Christmas holidays”.\nCllr Brian Clark noted, “We had to try to reverse this decision given Park and Ride is a key part of the borough’s \"Net Zero\", air quality improvement and congestion reduction goals. It is concerning that the decision was taken in a secret meeting with no consultation with council members or the public and no undertaking of any equalities impact assessment to consider the impact on residents. Even the deputy leader conceded that even he had no idea about the plan until after the decision was made. Astonishing\"\nHighlighting contradictions Cllr Cynthia Robertson concluded, “On the day the Whitehall Conservatives agreed to a return to office working, this decision by Maidstone Conservatives, insisting that the world has changed and that there will not be a return to office working, could not be more confused and short sighted. Many of the MBC's lower paid employees use this service will now be forced to pay daily parking charges, while adding to town centre congestion. This is a a bad day for our borough”",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_focus-archive/content_5.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_page-4/content_45.html": "Council demands Cabinet Reconsider Support for the destruction of Ancient Woodland at Oaken Woods\nDespite the opposition of almost all of the Conservative Group, including the Local Members the Council voted on Wednesday night to ask the Cabinet to reconsider is support for the proposal to massively extend ragstone quarrying at Oaken Woods.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors_cllr-dinesh-khadka/content_19.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_conservative-administration-show-complacency-over-the-state-of-our-rivers-again/content_66.html": "Conservative Administration show complacency over the state of our Rivers. Again…\nAfter the underwhelming response from the Conservative Cabinet to the All-party Scrutiny Review of Water supply and disposal in Maidstone it was perhaps not a surprise, but still a profound disappointment that once again the Administration has ignored proposals to improve the quality of our local rivers. At Wednesday’s Cabinet Meeting a report was presented following a reference from Council to investigate setting up a task force to improve the quality of Rivers in the Medway Basin in collaboration with the relevant agencies and interested parties. This could have facilitated co-operation on reducing pollution, and flooding and improving natural habitats.\nLiberal Democrat Group Leader, Clive English who attended the meeting to try and get the Cabinet to support the proposal said “the decision to not set up the task force on the basis that the existing arrangements for dealing with the many issues affecting our local rivers are working just fine defies belief, they clearly are not, and it is tragic that the Cabinet do not seem to realise this”.\nTony Harwood Lib Dem Group planning spokesperson and chair of River Len Local Nature Reserve management committee added: \"The Cabinet really need to get out more! Our local watercourse are being sucked-dry by water company over-abstraction, polluted by sewage and runoff and strangled by man-made barriers, while their banks are heavily littered and wildlife is dying.\"",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_maidstone-liberal-democrats-launch-new-community-initiative/content_90.html": "Maidstone Liberal Democrats launch new community initiative\nThis August Maidstone Lib Dem’s have launched a new community initiative with their Street Champion program. We are asking members of the public to be an extended set of eyes and ears for councillors and campaigners to help them improve where we all live.\nCllr. Richard Conyard who is heading up the programme expanded on the idea of Street Champions:\n“Many of us have full time jobs as well as being councillors, and whilst we try our best there are simply not enough hours in the day to be rapidly aware of issues within our wards. For example, I live in Brewer Street which is at the southwest corner of East Ward, if there is a fly-tipping issue towards Notcutts in the northeast corner unless I am informed it can be a little while before I inspect that part of my ward and can help.”\n“This is where I hope Street Champions can play a part. I want to connect residents with their councillors beyond what is already happening. If residents are aware of an issue, regardless of the resident’s political affiliation, I want to let them know we are just at the end of a telephone or available on email to help them. We are all in this together to help our community.”\nThe scheme is open to all, and whilst Street Champions contact details are collected to feedback on progress and future campaigns they will be kept private unless the Street Champions themselves wish to let others know.\nNewly elected KCC Councillor Chris Passmore said:\n“This is a fantastic scheme and provides an opportunity for councillors and residents to work together to make a real difference in Maidstone right on their doorsteps. I am looking forward to playing my part and becoming even more stuck into the business to improving the borough.”\nYou can sign-up to become a Street Champion on this page.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_page-10/content_46.html": "Budget Debate: Lib Dem Proposal For Native Woodland Restoration At Willington Street ‘Park And Ride’ Site\nWhile Maidstone Lib Dems were unable to overturn Maidstone Conservatives' refusal to provide support for the continuation of Park and Ride services, they retain their support for a fit for purpose 21st Century Park and Ride.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_geoff-samme-elected-as-county-councillor-for-maidstone-north-east/content_2.html": "Geoff Samme Elected as County Councillor for Maidstone North East\nWe are delighted to announce that Geoff Samme was elected as the new Kent County Councillor for Maidstone North East in the County Council elections held on 1 May 2025.\nGeoff will join 11 other Liberal Democrat councillors at County Hall, forming the official opposition to Reform UK on Kent County Council. His election ensures that Maidstone North East continues to have a strong Liberal Democrat voice championing local issues.\nWe would like to pay tribute to Ian Chittenden, who has served the Maidstone North East with distinction since 2005. Ian made a significant contribution to the Council, most recently as a respected member of the Environment & Transport Cabinet Committee. We thank him for his years of dedicated service and wish him a long and happy retirement.\nFinally, we would also like to thank all the Liberal Democrat candidates who stood in the other Maidstone County Divisions. While not successful this time, their hard work and commitment to their communities are deeply valued and appreciated.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_council-demands-cabinet-reconsider-support-for-the-destruction-of-ancient-woodland-at-oaken-woods/content_57.html": "Council demands Cabinet Reconsider Support for the destruction of Ancient Woodland at Oaken Woods\nDespite the opposition of almost all of the Conservative Group, including the Local Members the Council voted on Wednesday night to ask the Cabinet to reconsider is support for the proposal to massively extend ragstone quarrying at Oaken Woods that would destroy a huge and irreplaceable swathe of ancient Woodland. With the exception of Fay Gooch all non- Conservative Members of the Council present voted for the motion.\nLiberal Democrat Group Leader Clive English who seconded the motion said: “A majority of Members of the Council have shown that they do not agree with the Cabinet’s support for the destruction of this irreplaceable habitat and wish the Council to think again. Maidstone’s Cabinet are literally the only people other than the applicant who have given the proposal unequivocal support. The public response and that of Tonbridge and Malling has been very different. Even Kent County Council has wavered in the face of the united opposition and has issued another call for sites. Maidstone Borough Council should not be the one’s to offer succour to this ill conceived and damaging proposal.\"\nCllr Tony Harwood built on this in the meeting highlighting the highest of protections that ancient woodland is given in the National Planning Policy Framework and with only 2.5% of the land area in the UK being ancient woodland, it is one of the lowest percentages in the world. In the meeting he added:\n\"We have heard a lot of warm words from councilors across the council chamber regarding the urgency of tackling the climate and ecological emergencies. We now have a chance to do something about it and vote to protect Oaken Wood.\"\nCllr. Brian Clark also added:\n\"“There are pockets of ancient woodland across our borough but many are dwarfed by the ancient woodland at Oaken Wood. Make no mistake, if the Tories wave this plan through, developers will be sent a strong message that the borough’s ancient woodland is available for development.\"\nMore than 25,000 members of the public submitted objections to the grubbing of this irreplaceable ancient Kentish coppice woodland during an earlier KCC consultation.\nThe vote itself was recorded; those voting For are asking the cabinet to reconsider the previous broadly supportive response to the destruction of Oaken Wood in line with campaigns from groups like the Woodland Trust and the more than 25,000 objections. Those voting Against are happy with the broadly supportive response submitted at this time.\nFor (28)\n| Councillor | Ward | Party |\n| Brian Clark | South | Liberal Democrat |\n| Maureen Cleator | Shepway South | Labour |\n| Patrick Coats | Fant | Independent |\n| Richard Conyard | East | Liberal Democrat |\n| Martin Cox | East | Independent |\n| Derek Eagle | Sutton Valence and Langley | Green |\n| Clive English | High Street | Liberal Democrat |\n| Susan Grigg | Loose | Independent |\n| Paul Harper | Fant | Independent |\n| Tony Harwood | North | Liberal Democrat |\n| Stuart Jeffery | Bridge | Green |\n| Vanessa Jones | Boxley | Independent |\n| Denise Joy | High Street | Independent |\n| Dinesh Khadka | High Street | Liberal Democrat |\n| Ashley Kimmance | Heath | Liberal Democrat |\n| Sandra Knatchbull | Bearsted | Conservative |\n| Steve Mumford | Boughton Monchelsea and Chart Sutton | Independent |\n| David Naghi | East | Liberal Democrat |\n| Gordon Newton | Downswood and Otham | Independent |\n| Cynthia Robertson | Allington | Liberal Democrat |\n| Margaret Rose | Fant | Labour |\n| Janetta Sams | Harrietsham and Lenham | Independent |\n| Tom Sams | Harrietsham and Lenham | Independent |\n| Micheal Thompson | North | Liberal Democrat |\n| Stephen Thompson | Detling and Thurnham | Green |\n| Dan Wilkinson | Park Wood | Labour |\n| Joanna Wilkinson | Shepway North | Labour |\n| Thomas Wilkinson | Allington | Liberal Democrat |\nAgainst (21)\n| Councillor | Ward | Party |\n| Alan Bartlett | Shepway North | Conservative |\n| Annabelle Blackmore | Marden and Yalding | Conservative |\n| Heidi Bryant | Boxley | Conservative |\n| David Burton | Marden and Yalding | Conservative |\n| Denis Spooner* | Bearsted | Conservative |\n| Gary Cooke | Shepway South | Conservative |\n| Paul Cooper | Shepway North | Conservative |\n| Stanley Forecast | Allington | Conservative |\n| Patrik Garten | North Downs | Conservative |\n| Michelle Hastie | North | Conservative |\n| Bob Hinder | Boxley | Conservative |\n| Peter Holmes | Heath | Conservative |\n| Lewis Mckenna | Park Wood | Conservative |\n| Lottie Parfitt-Reid | Coxheath and Hunton | Conservative |\n| John Perry | Staplehurst | Conservative |\n| James Reid | Coxheath and Hunton | Conservative |\n| Paddy Riordan | Staplehurst | Conservative |\n| Martin Round | Headcorn | Conservative |\n| Claudine Russell | Marden and Yalding | Conservative |\n| Ziggy Trzebinski | Headcorn | Conservative |\n| Simon Webb | Coxheath and Hunton | Conservative |\n* Edited: The original list had Cllr Tom Cannon as voting against this motion in place of Cllr Denis Spooner. The author would like to extend his apologies to both councillors for this mistake.\nAbstentions (2)\n| Councillor | Ward | Party |\n| Fay Gooch | Barming and Teston | Independent |\n| Val Springett | Bearsted | Conservative |",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_lib-dem-action-to-clean-up-maidstones-filthy-rivers/content_68.html": "Lib Dem Action To Clean-Up Maidstone’s Filthy Rivers\nIn 2021 the Government's Environment Agency received more than 100,000 reports of pollution in England. The public and their elected representatives reported rivers choked with human waste and toxic run-off, fish killed and nature reserves poisoned.\nVirtually all of these reports were ignored and now we understand why. Recently, leaked documents revealed that the Agency, which is tasked with the protection of England’s environment, had ordered its personnel to ignore all but the most high-profile pollution incidents. Its staff responded to just 8,000 of the 116,000 potential pollution incidents reported to them. Underfunding and low morale across those Agency teams tasked with protecting the natural environment and wildlife is the cause for this statistic.\nSign Petition to Restore our Rivers\nLocally, Maidstone Lib Dems wrote to the Environment Agency’s Area Director (who has ultimate responsibility for pollution incidents in Kent) last summer, demanding urgent action to tackle the shocking decline in the health of local watercourses. We have now received a response from the Area Director, which, significantly, included an offer for Maidstone Council to work more closely with the Environment Agency on restoring our rivers. The state of our Borough's watercourses is a scandalous omission from the deeply flawed Local Plan Review.\nLiberal Democrat Councillors, armed with the Environment Agency's letter, are demanding that Maidstone Council prioritises the protection and clean-up of our litter-choked, filthy, local rivers and streams.\nMore specifically, Lib Dem Planning Spokesperson Tony Harwood has called upon Maidstone Council to: ‘Act upon the Area Director’s commitment to facilitate a camera investigation by Southern Water of the condition of their wastewater pipeline serving south Maidstone’, which has caused multiple sewage pollution incidents at the Maidstone Council owned River Len Local Nature Reserve and Mote Park.\nMaidstone Council Lib Dem Group Leader Cllr. Clive English is further demanding a meaningful partnership between the Environment Agency and Maidstone Borough Council to put in place policies and investment to clean-up our local rivers stating: \"Maidstone Borough Council's policy decisions on housing, employment and, crucially, associated traffic growth have big consequences for inadequate wastewater infrastructure and our beleaguered rivers and streams\".\nCllr. Tony Harwood concludes: \"Increasing demand for water fueled by the Government's housing targets is bleeding our landscape dry, while this unprecedented development surge has also seen exponential growth in quantities of waste water and run-off reaching our streams and rivers”.\nKent County Council Lib Dem Group Environment and Transport Spokesperson Ian Chittenden is demanding increased funding for pollution enforcement, paid for from the fines that currently go direct to the Treasury, and a meaningful partnership between the Environment Agency and Kent County Council to provide strategic leadership on cleaning-up Kent's rivers. Ian\nstates: \"Local decisions on roads, minerals, housing and economic development all have big consequences for our watercourses, because of Kent's antiquated sewerage systems and profoundly polluting highway drainage infrastructure\".\nIan concludes: \"Increasing demand for potable water, fuelled by the Government's unsustainable housing targets, is bleeding Kent's landscape dry, while all this unprecedented development has also seen exponential growth in quantities of foul waste water and contaminated run-off reaching our natural environment\".",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_update-on-proposed-newnham-court-aldi/content_42.html": "Update on proposed Newnham Court Aldi\nOn Thursday 24th August the Planning Committee discussed the proposed building of an ALDI Supermarket at Newnham Court. Whilst there was some public support for the Application there was also considerable opposition from residents living in the area. The application was also clearly in contravention of the Maidstone Local Plan, which allocated the site for high value employment related to medical and scientific purposes. In was also clear that the proposal occupied a prominent site located in close proximity to the Area of Outstanding Natural Beauty. Because of the constrained nature of the site the Committee felt that the proposed building and car parking simply could not be adequately screened and would have a detrimental effect on the AONB. Many residents raised concerns about traffic, but as KCC Highways had not objected this could not be considered.\nConsequently, after some considerable discussion the Committee voted overwhelmingly to refuse the application. on the grounds of the application failing to comply with Local Plan policy and on Landscape and biodiversity grounds.\nCllr. Clive English commented: \"The Committee were conscious that to approve the application would have effectively demolished the employment section of the Local Plan and would have required that immediate additional, probably green field land would need to be brought forward to replace the lost employment land.\"",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_campaigns_clean-up-the-river-len/content_100.html": "Clean up the River Len\nClean up the River Len\nI call upon Maidstone Borough Council initiate, launch, lead and provide secretariat for a River Len Stakeholder Task Force as described below.\nThe recent motion to give the River Medway rights has been forwarded to the Overview and Scrutiny Committee.\nRights for nature and particularly the right to flow for rivers have been initiated by indigenous communities across parts of the world and have directly and indirectly met some success (particularly in Central and South America. However, within the heavily legally regulated European context declarations of rights for nature have been more symbolic in nature and have achieved little to date in practical terms.\nA more practical and effective model has been pursued in France, where restoration of the Loire River Valley, Dordogne River Basin and latterly the River Seine has delivered remarkable results. The secret to French success has been tough and high profile stakeholder groups involving landowners, regulators and local government agencies all working towards a bold and unified vision, think ‘La Loire Sauvage’.\nAs the largest catchment in Kent covering 930 square miles (2,409 km2) comprising some 25% of the area of Kent testing a stakeholder group using the Medway and its tributaries would be too ambitious and complex (after all Maidstone only has an interest in a short length of its course). Indeed, the River Medway flows for 70 miles (113 km) from just inside the West Sussex border to the point where it enters the Thames Estuary in north Kent.\nThere is already in existence a promising Upper River Beult farm cluster group – facilitated by South East Rivers Trust – which has shown some promise.\nHowever, geographically the most appropriate riverine focus for such a task group is undoubtedly the River Len. This small river flows for its entire length in Maidstone Borough and the Council owns some key stretches and therefore has a genuine ability to influence its future.\nThe River Len is heavily modified with man-made weirs, culverts and dams from its source in Lenham through to its confluence with the Medway at the Archbishop’s Palace Gardens. The structure-impeded flow of the river exacerbates pollution from wastewater and other diffuse sources such as agricultural and highway runoff. Several tributaries of the River Len are classified as chalk streams as they rise at spring-lines at the foot of the Kent Downs AONB, while other streams emerge from the Greensand Ridge. Some of these tributaries, such as the Hollingbourne Stream, Lilk at Bearsted and Fair Bourne at Fairbourne Heath have high profiles in their own right.\nWe proposed that Maidstone Borough Council initiate, launch, lead and provide secretariat for a River Len Stakeholder Task Force with participation invited from key landowners along the course of the river Len and its chalk stream and Greensand tributaries alongside the Environment Agency, South East Rivers Trust, Kent County Council (including Kent Highways), National Highways, South East Water, Southern Water, NFU Kent, Leeds Castle Foundation, River Len Local Nature Reserve, Kent Wildlife Trust and potentially academic engagement from University of Kent and/or Greenwich.\nThe vision for the Stakeholder Task Force will encompass:\n- Progressive removal and/or bypassing of manmade barriers to ecological movement i.e. restoring the right to a natural flow;\n- Setting measurable targets and achieving continuous improvement across flow rates and water quality (including mitigating current pathways for diffuse pollutants including agricultural and highway run-off);\n- Enhancing and recreating riparian habitats along the course of the River Len and its tributaries, including wet woodland, marsh and fen, wet heathland, flood meadow, ponds and ditches; and\n- Restoration, expansion and reintroductions of declining or lost riparian flora and fauna including migratory fish, DesMoulin’s Whorl Snail, White-clawed Crayfish, White-legged Damselfly, Water Shrew, Water Vole, Otter, Common Snipe, Lapwing, Woodcock, Southern Marsh Orchid, Black Poplar.\nPostscript: With the learning, experience and leadership the Borough Council will take from its stewardship of a River Len Stakeholder Task Force MBC would become a powerful advocate for the rehabilitation of the wider River Medway catchment.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_page-2/content_39.html": "New administration formed\nFollowing the Borough Council Elections in May when the Conservatives lost 12 of their 25 seats on the Borough Council, intensive discussions have been taking place between the Liberal Democrat, Labour and Green and Independent Alliance Groups to form...",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_page-3/content_36.html": "In Council January '24\nJanuary saw the continuation of preparing for the 24/25 budget focusing primarily on the Capital Programme from the proposed Medium Term Financial Strategy.\nJanuary saw the continuation of preparing for the 24/25 budget focusing primarily on the Capital Programme from the proposed Medium Term Financial Strategy.\nLocal Lib Dem health and environment campaigner Councillor Tony Harwood has welcomed the Government's announcement that disposable vapes are to be banned.\nOnce again calls to take action are ignored by the current Conservative administration.\n£12 million pounds by the reckoning of almost all in Maidstone is not an insignificant sum, and certainly more than tuppenny rice and treacle. However, it took just 27 seconds to cut £12 millions from MBC's Medium Term Financial Strategy.\nFind out what has been occurring in the chamber in December.\nThe theme of council meetings in November was very much that of cancellation, delay, and revisitation.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_mill-pond-in-palace-avenue-receives-spring-clean/content_64.html": "Mill Pond in Palace Avenue Receives Spring Clean\nFifteen refuse sacks of litter were retrieved from the Rootes Mill Pond in Palace Avenue on Saturday afternoon. The long overdue clean-up was undertaken by local Borough and County Councillors Dinesh Khadka, Clive English, Chris Passmore and Tony Harwood.\nAmongst the squalid haul was recklessly discarded fishing tackle, syringes, 'sharps' boxes, traffic cones, fast food detritus, soiled underwear and hundreds of drink bottles and cans. The councillors were clear that this was just the first phase of a comprehensive clean-up of the area - as huge quantities of litter still disfigure the mill pond's banks and island.\nObserving the sad plight of a Moorhen attempting to create a nest from a collection of potentially lethal litter made the councillors determined to clear the area, despite the practical challenges involved in accessing the mill pond.\nThe councillors were all united in the view that the mill pond should be a focal point for the town - a beautiful, cooling, urban oasis and wildlife haven, rather than a too often polluted and litter-strewn eyesore. The redevelopment of Len House and planned 'daylighting' of the adjacent stretch of the River Len provides a once in a lifetime opportunity for the rehabilitation of this for too long neglected part of the town.\nCllr. Dinesh Khadka, who organised the clean-up, stated: \"We cannot leave all the responsibility of clearing litter and fly-tipping to our overstretched council environment team.\" He continued: 'As individuals we all need to take more pride in our area and each do what we can to keep the County Town clean.\"\nCounty Cllr. Chris Passmore added: \"Businesses, landowners and public sector organisations, like the County Council and National Highways, also need to do more to keep the land they are responsible for litter and fly-tipping free.\"\nCouncillor Clive English expressed a concern that cleanliness across the Borough has declined in recent years. He stated: \"Maidstone is drowning under a tidal wave of litter and and compares very badly with other parts of the UK.\" Adding \"Behaviours have got to change and both enforcement and education need to be stepped up.\"\nCouncillor Tony Harwood summed up the situation when he stated \"It is not the natural state of things to live in a rubbish tip, if people just stopped dropping litter and dumping waste we'd all be a lot happier, healthier and richer.\"\nAs a postscript, Tony Harwood wants to see the mill pond incorporated into the River Len Local Nature Reserve, which he believes will ensure the site is managed appropriately for wildlife and kept clean going forward. Tony, who is also chair of the management committee of the reserve, explained that: \"A past attempt to assimilate the mill pond into the River Len Local Nature Reserve were not supported by Maidstone Council.\" Adding: \"A higher profile for the mill pond, associated with the redevelopment of Len House, provides an opportunity to re-energize the nature reserve designation debate.\"",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_in-council-january-24/content_52.html": "In Council January '24\nJanuary saw the continuation of preparing for the 24/25 budget focusing primarily on the Capital Programme from the proposed Medium Term Financial Strategy. The Capital Programme can seem as exciting as well and confusing as amounts are proposed for improvements across the borough. It is the first step of intent with figures after the 24/25 budget being fuzzy and most if not all expenditure still up for rigorous debate with approval of the programme not being an approval to spend.\nCommunities, Leisure, and Arts 9th January\nCLA PAC saw the ongoing issue of the operation of Maidstone Leisure Centre brought on step closer to resolution with the recommendation that the extension of the contract with the existing operator Serco be noted without objections.\nThe capital programme also saw proposals for improvements to reduce costs of the existing leisure centre, a new gallery at Maidstone Museum, and refurbishing the kiosk at Mote Park, and a new £60 millions leisure centre for Maidstone all be recommended for inclusion and further discussion.\nPlanning, Infrastructure, and Economic Development 10th January and 29th January\nBusiness in the PIED PAC in January included the Capital Programme from the Medium Term Financial Strategy, the biannual update to the Biodiversity and Climate Change Action Plan, and the potential formation of a Local Bus Focus Group to replace the Quality Bus Partnership closed by KCC.\nThe Capital Programme had few entries that related to the business of PIED PAC with amounts to the previously advised improvements to the Medway Street Car Park and public realm and greening in the town centre being waved through. In a surprise amendment £12 millions was removed from town centre public realm and greening improvements between 2025 and 2028 being removed more of which can be read about here.\nThe Biodiversity and Climate Change Action Plan showed positive movement from the previous disappointing update. The Local Bus Focus Group was approved with an amendment to report back after two sessions to ensure that action is being undertaken and the group does not become a “talking shop”.\nHousing, Health, and Environment 16th January and 30th January\nThe HHE PAC discussed the capital programme (with housing being one of the largest areas of expense), the changes to bin provision and receiving an update on the 1,000 affordable homes all of which were noted and agreed as per recommendations.\nCorporate Services January 17th\nCS PAC was asked to consider their section of the Capital Programme and commercial proposals for the Archbishop’s Palace.\nThe Archbishop’s Palace proved contentious with the committee being presented a “take it or leave it” offer from one company to run the Palace. Much of the debate was held in closed session due to the sensitive nature of the debate and in closed session two votes were held one to advise that the proposal as it stood should be rejected until a list of concerns were addressed, and a second that the proposal be accepted with the same list of concerns being passed to the cabinet for further consideration. Both votes were tied with the chairman having the casting vote. The eventual decision was to accept whilst noting the concerns and councillors Conyard, Harper, and Thompson requested to have their objection noted in the minutes.\nThe Capital Programme asked the committee to run their eye over 36 areas of proposed investment the largest of these dealing with combatting housing issues within the borough which accounted for over £70 millions in 24/25 alone.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_new-administration-formed/content_67.html": "New administration formed\nFollowing the Borough Council Elections in May when the Conservatives lost 12 of their 25 seats on the Borough Council, intensive discussions have been taking place between the Liberal Democrat, Labour and Green and Independent Alliance Groups to form a new administration.\nAgreement was reached on an ambitious programme for Maidstone to address many of the issues faced by local residents and businesses. However, the Labour Party nationally would not allow their councillors to take part. Therefore the Liberal Democrats and Green Independent Alliance have moved forward and at the Council's Annual Meeting in May formed a joint administration. This has Cllr Stuart Jeffrey of the GIA as Leader and Cllr Clive English (Leader of the Lib Dem Group) as Deputy Leader of the Council. Clive is also the cabinet member for Environment and Enforcement.\nIn all there are 8 cabinet members - 4 from each Group. This is an increase in cabinet members, but the programme we have to deliver is very ambitious and we need to have sufficient people to deliver it after years of Tory neglect.\nThe programme which will set out the new administration's plans for the next 4 years will be presented to the next meeting of the Council on 17th July\nIn addition to Clive the Lib Dem cabinet members are:\n- Cllr Tony Harwood (Planning Policy)\n- Cllr Simon Wales (Housing and Homelessness)\n- Cllr Dave Naghi (Community Cohesion and Safety)\nAdditionally Cllr Paul Wilby is chairing the Planning Committee.\nCllr Simon Wales said, \"This is an exciting time to be entrusted to deliver the Housing and Homelessness portfolio. We have ambitious plans for building social housing in suitable sites across the Borough as identified in the revised local plan. We will be working closely with our housing providers, such as Golding Homes who are planning to regenerate part of the Shepway estate, as well as with the private sector to ensure Maidstone has the homes it needs.\"\nGroup Leader Clive English added \"Working together with the GIA we aim to bring forward an ambitious programme over the next 4 years that will once again make Maidstone a desirable place to live work and do business, whilst protecting and enhancing the built and natural environment\"",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_in-council-december-23/content_37.html": "In Council December '23\nCommittee meetings in December were quiet affairs with end of quarter reports being noted and fees and charges being reviewed for the next financial year. Whilst many fees were held at their current level some had to increase to counter in part the projected shortfall for 24/25.\nCommunities, Leisure, and Arts 5th December\nFees and charges made up most of the business at the CLA PAC, most charges being held at their existing amounts. The quarter financial update and performance monitoring report also highlighted the increased footfall at Maidstone Museum and the increased ticket sales at the Hazlitt theatre.\nPlanning, Infrastructure, and Economic Development 7th December\nThe town centre strategy came back to the PIED PAC, unfortunately not for release and public consumption, but to be delayed whilst further research is carried out. The delay is frustrating, but we appreciate the need to ensure that the official strategy is correct. To help progress the strategy we have created our own vision of how we see the future of Maidstone town centre.\nHousing, Health, and the Environment 12th December\nDiscussion in the HHE PAC primarily revolved around the response to the governments cap on safe and legal routes and what provision is available in Maidstone. With between 700 and 900 people on the housing list and 300 in temporary accommodation it was the position of the administration that a response of zero capacity be returned. The committee felt that this was primarily a political exercise that MBC should not be drawn into, and a blank response be returned.\nCorporate Services 13th December\nFees and charges for corporate services were the primary business with charges being increased by approximately 5% to counter the part of the shortfall for the next financial year.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_cranborne-avenue-closure-plan-at-wheatsheaf-junction-met-with-anger-from-local-residents/content_72.html": "Cranborne Avenue Closure Plan At Wheatsheaf Junction Met With Anger From Local Residents\nKCC is planning a temporary closure of Cranborne Avenue in March ahead of a proposal to demolish the Wheatsheaf pub, signalise Plains Avenue at Loose Road and reconfigure the Wheatsheaf junction. KCC’s original plan was to start work to deliver the junction changes this spring.\nGiven his previous involvement which lead to the planned closure of Cranborne Avenue being removed from the infrastructure plan in Maidstone’s Local Plan for Housing several years ago, Cllr Brian Clark raised strong objection to the planned closure. Ahead of initial consultation, KCC officers admitted to Cllr Clark that that they had not, to that point undertaken any modelling of the traffic impact of closure on Cranborne Avenue, Plains Avenue, South Park Road, and nearby roads, or the impact of signalisation at Plains Avenue. KCC had only modelled the benefit to traffic flows on the A229 by removing Cranborne Avenue’s “green light” phase (around 18 seconds). As such it was Cllr Clark’s opinion that the public consultation was flawed.\nCllr Clark stated, “The new 'temporary' closure plan is a compromise, suggested by officers last summer, after I had raised a strong objection to construction starting in Spring 2022. In suggesting the plan, officers agreed to monitor and assess the impact of closure (without signalising Plains Avenue) on the road network and seek public feedback during the 6-month trial.\nHe continued “It is my view that a junction redesign should include keeping Cranborne Avenue open but given the situation that we were facing, I was pleased that officers agreed to hold off on the permanent change, giving residents a chance to give their feedback”\nCllr Clark concluded, “Residents I have spoken to fear that closure will increase congestion (as the current traffic managed by the light still needs to go somewhere) and will be a major impact on their quality of life. I share this concern and urge all residents to provide feedback to the consultation using the email CranborneAvenue@kent.gov.uk and consider also sending met their views at brianclark.ld@gmail.com",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_page-8/content_56.html": "Camden Street Play Area reopens\nCamden Street play area is back open and good to see the kids already enjoying it (not in shot obviously). The new tree is also in and seating will be installed soon.\nCamden Street play area is back open and good to see the kids already enjoying it (not in shot obviously). The new tree is also in and seating will be installed soon.\nAfter being contacted by Lib Dem councillors Golding Homes have completed the renovation of Hedley Street Play Area\nThe Leader of Kent County Council (KCC) and the Chief Nurse of the NHS in Kent and Medway have issued a heartfelt apology after a critical report into how the local area – KCC, NHS Kent and Medway and local schools and other settings – provide support for children with special educational needs and disabilities (SEND) in the county.\nMaidstone’s Local Plan Update has been thrown into turmoil after the council attempted to submit volumes of previously unseen documentation mid way through the government inspector’s hearing at the town hall last week. The inspector was caught off guard commenting, \"As I sit here now I’m slightly in the dark..”, and noting “..I’m starting to feel compromised”.\nLeader of Maidstone Borough Liberal Democrat Councillors Clive English has paid tribute on behalf of the Group to her Majesty Queen Elizabeth II. Clive said: \"For 70 years the Queen has unstintingly and diligently served the public of this Country and the Commonwealth through decades of tremendous change and often great difficulty in the life of our Nation and the World. We thank her for that great record of devoted and selfless service and think at this time of her family and wish them strength and courage.\"\nLast October Maidstone's hapless MPs Helen Grant and Helen Whately voted down an amendment to the Environment Bill that would have stopped the dumping of sewage into rivers and coastal waters. Many of the Parliamentary supporters of continued sewage dumping by the water companies cited cost as their justification for putting profit before the health of our environment.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_page-5/content_35.html": "Hildenborough Crescent Sink hole\nThe reappearance of this sink hole in July has led to both the closure of the road and the significant concern of residents that it could get larger if not addressed.\nThe reappearance of this sink hole in July has led to both the closure of the road and the significant concern of residents that it could get larger if not addressed.\nFind a little more about what your Lib Dem councillors have been doing when not in committee meetings.\nThe proposal for a new Aldi branch at Newnham Court was unsuccessful. The following is an update as to some of the reasons why.\nFollowing the very considerable traffic disruption in the Allington and London Road areas of west Maidstone during the Summer of 2023, Cllrs Chris Passmore and Ian Chittenden had a meeting on 9 August to try to sort this out.\nIn an extra meeting of the Overview and Scrutiny Committee two recent cabinet decisions were \"called in\" for further scrutiny.\nThe Joint Transport Board for Maidstone was eventful for all the wrong reasons.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_bin-chaos-a-tale-of-a-totally-avoidable-disaster/content_71.html": "Bin Chaos. A tale of a totally avoidable disaster.\nOver the past fortnight residents have been shocked by the hasty and botched introduction of the Council's new Refuse collection contracts. Whilst it is never entirely easy to introduce a major change like this the Conservative administration appears to have been underprepared for the issues. The problems with delayed, or completely missed collections have been worsened by the Council not having a prepared communication strategy with the website not giving up-to-date or accurate information and the switchboard collapsing under the press of complaints.\nLiberal Democrat Councillors have been reporting information to the Council to ensure it does have accurate information and have been pushing hard to sort out this mess and to get the Collections back on track. We are also trying to rectify the Council's poor communications with the public. It’s just a pity the Conservative led Council did not plan properly in the first place.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_in-council-november-23/content_38.html": "In Council November '23\nThe theme of council meetings in November was very much that of cancellation, delay, and revisitation. Two of the four Policy Advisory Committees were cancelled, two important updates (Town Centre Strategy and Biodiversity and Climate change), were delayed. Finally, the full council meeting sparked lively discussion by revisiting the decision previously reached being broadly supportive of the quarrying of Oaken Wood.\nCommunities, Leisure, and Arts November 7th\nCancelled due to lack of business.\nPlanning, Infrastructure, and Economic Development November 8th\nIt had been hoped that the Town Centre Strategy would have been discussed at this meeting having been presented two months previously, unfortunately it was delayed again. The largest item on the agenda was the financial update and overspend due to lack of planning business whilst waiting for the new local plan to be adopted.\nWorks were also approved for minor improvements to the Medway Street Car Park to allow more bays, charging stations, and secure cycle storage. Cllr. Clive English spoke as a visiting member to highlight the need for parking in the town centre, the revenue it generates, and to encourage members and officers to be mindful not to encourage development of low quality residential on car parking sites.\nHousing, Health, and Environment November 14th\nThe temporary accommodation emergency formed most of the discussion in this committee. The budget for temporary accommodation is presently forecast to be 85% over the estimate with problems arising due to interest rate hikes and the cost of living. With 245 households in temporary accommodation, 140 of which are housed by the private sector, this has led to the forecast of this statutory obligation to rise to £1,690,000 from a budget of £910,000. The committee voted to reduce the current three-year plan for acquisition of additional accommodation and changes to the private sector leasing plan to two years. Whilst there would be a capital outlay, for costs for those using this scheme would be reduced by approximately 1/3rd.\nCorporate Services November 15th\nMuch to the dismay of various members this committee was cancelled due to lack of business. This came as something of a surprise given the promised update to the Biodiversity and Climate Change plan to allow progress to be effectively monitored and key deadlines to be set. After remonstrations by various opposition councillors the cabinet member stated that work had yet to be completed and the deadline missed.\nOverview and Scrutiny November 21st\nThe Overview and Scrutiny Committee continued to investigate waste and environmental crime with suggestions of maintaining the balance between education and enforcement. During the discussion at the Committee at its last meeting it was established that the policy introduced by KCC and Medway of barring access to their respective Waste transfer stations to residents of the other authority was both inconvenient to residents and poses a risk of a significant increase in fly tipping.\nAs a result of the discussion, it was agreed the MBC Cabinet Member Patrik Garten and the Overview and Scrutiny Chairman Clive English should jointly write to the Cabinet Members at KCC and Medway.\nClive said \" This policy is likely to cost Medway and KCC more in dealing with increased fly tipping than it saves. All parties across the political spectrum in Maidstone are asking them both to reconsider the matter.\"\nAt the recommendation of members all councillors are encouraged to report any waste crime blackspots.\nFollowing persistent efforts from Brian Clark Liberal Democrat Member for South Ward the Council finally has a date for discussing the long delayed Integrated Transport Strategy with the agreement by the Overview and Scrutiny Committee to discuss the Strategy in February.\nBrian said: \" It is absolutely vital that Maidstone starts to sort out its disastrous traffic system and stop building housing without putting in the necessary road and other transport arrangements to support it\". Brian also raised concerns about schemes not progressing despite having funding and the risk of that funding being lost due to lack of progress.\nFull Council November 29th\nThe most controversial item from the full Council was the vote to ask the cabinet to reconsider their position on Oaken Wood to come out against the expansion of a quarry into Oaken Wood, more can be read here.\nOther general items of business including polling station locations, synchronisation of parish elections and the annual report of the Audit, Governance, and Standards committee were moved and resolved quickly without need for debate.\nFinally, a motion to put in place a detailed timeline for renovations or rebuilding the Mote Park Leisure Centre for the meeting of the Communities, Leisure and Arts committee meeting in February failed. As a group whilst we felt it is important that decisions are made, and the motion was well intentioned part of the request will be dealt with in an earlier meeting and the placement of a strict deadline before having a clear picture of budgets placed a too greater burden against the uncertainty.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_david-naghi-maidstone-mallings-best-choice-to-be-the-next-mp/content_70.html": "David Naghi: Maidstone & Mallings best choice to be the next MP\nA message from our Liberal Democrats candidate for Maidstone & Malling David Naghi ahead of the big day on July 4th.\n‘After giving over 20 years of public service to Maidstone Council as a councillor and Mayor, I now have the honour to fight for your vote to represent our community and new constituency, Maidstone & Malling.\nWith these new boundaries comes new opportunities. In what is a town with a far and wide community, it is fantastic to have Malling now officially part of the constituency. Many people in and around Maidstone have a strong connection to the town, and it does feel that we are now one community in our new constituency.\nFor too long we have not had representation that will put Maidstone & Malling first. The centralisation and chaos of Westminster has distracted from the changes our community needs that will genuinely make things better for us.\nWe need a local candidate who actually cares for our area. As someone who has lived here all my life, I have witnessed first hand the problems our constituency has had to endure.\nInappropriate housing is putting our infrastructure at breaking point, our health services are being run into the ground, our environment is constantly threatened, and people are not getting the support they need in this economic climate.\nI want to be able to work full-time for our constituency, be a constant presence in our community, and make Maidstone & Malling a better place to live for all of us.\nThe local elections in 2023 for Tonbridge & Malling council and the 2024 local elections in Maidstone showed exactly that our community trusts the Liberal Democrats to serve on the priorities that matter to our area.\nThe Liberal Democrats have the most number of councillors within the constituency following the recent elections. We also accumulated the most number of votes, standing head and shoulders above any other party. Many people know that by voting in Liberal Democrats, they will have a local community champion who will work hard to serve them.\nThese results show that we are the challengers to the Tories. They have had their chance, they have had 14 years. By voting for myself, you are voting for an experienced local resident who loves our area, and wants to make it a better place to live for all of us.\nWith a fresh approach from a local candidate, we can bring change to people’s everyday lives. Let us work together to put Maidstone & Malling first, so we can all make it a better place for us to live. I would be very glad to have your support on the 4th of July in order to do so.\nKind Regards, David Naghi.\nPublished and promoted by David Thornewell on behalf of David Naghi both of 49, Betjeman Close, Larkfield, Aylesford, ME20 6TQ",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_death-of-the-queen/content_93.html": "Death Of The Queen\nLeader of Maidstone Borough Liberal Democrat Councillors Clive English has paid tribute on behalf of the Group to her Majesty Queen Elizabeth II. Clive said: \"For 70 years the Queen has unstintingly and diligently served the public of this Country and the Commonwealth through decades of tremendous change and often great difficulty in the life of our Nation and the World. We thank her for that great record of devoted and selfless service and think at this time of her family and wish them strength and courage.\"\nIan Chittenden, Kent County Councillor added,, “No matter what problems we as a country experienced internally or internationally, our Queen was the rock that held us steady for many years. God Bless King Charles and the royal family and give them the strength to lead us through the coming years”.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_focus-archive_grove-green-focus-september-2023/content_10.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_improvements-to-waste-site-in-tovil-moving-ahead-and-a-second-borough-facility-planned/content_65.html": "Improvements to Waste site in Tovil moving ahead, and a second borough facility planned\nIn developing a response to the Kent Minerals and Waste local plan 2013-30 Consultation, members of Maidstone’s Strategic Planning and Infrastructure committee agreed to welcome the Expansion of the Tovil Household Waste and Recycling Centre and the provision of a second waste site in the East of the Borough.\nCllr Clark, who supported amendment to welcome these inclusions, commented, “For a number of years I have worked with KCC officers and my fellow ward Councillors Derek Mortimer and Paul Wilby to develop capacity improvements to the Tovil facility, and to ensure the required works receive strategic funding from developer contributions in the local plan review”\n“We have also campaigned for an additional site in the borough, desperately needed to reduce the strain on roads around the Tovil facility, and we are delighted that this second site is now moving forward.”",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_good-news-on-the-river-len/content_97.html": "Good news on the River Len\nIt is not often Southern Water receive praise for their actions. But recent investment by the water company at the River Len Local Nature Reserve in Maidstone has been singled-out as having had a 'transformational impact' upon water quality within the popular wildlife site.\nOver many years a pumped combined sewerage system serving south Maidstone had routinely surcharged after heavy rain, leaking large quantities of untreated sewage into the River Len. Even during dry weather an eye-watering sewage stench permeated the route of the pipeline and affected adjoining residential and commercial neighbourhoods.\nMaidstone Borough Councillor Tony Harwood, who chairs the nature reserve's management Committee, methodically documented and reported the pollution incidents and campaigned for infrastructure improvements.\nThe breakthrough came early in 2023 when following yet another sewage leak Cllr. Harwood contacted Southern Water direct and met their engineers on site, walking the route of the problem pipeline and inspecting the leaky, smelly raised turrets and manhole covers. The Southern Water engineers suggested a range of measures, including new sealing-plates, pipe re-lining and a flue to vent gases and reduce pressure within the sewer. They subsequently prepared a detailed funding proposal, which was quickly approved through their internal bidding processes.\nCllr. Harwood states: \"The Southern Water infrastructure improvements were all delivered in recent weeks and the impact has already been transformational. No leaks or surcharging of sewage has been observed since - even during and after the recent heavy rainfall. The clarity of the river water and growth of aquatic vegetation within the nature reserve is already showing signs of recovery. \"\nHe added: \"The stink that has hung over the nature reserve and the surrounding area has also all but disappeared.\"\nInnovation and investment in wastewater infrastructure is key to tackling the recent decline in water quality and biodiversity along the River Len. Cllr. Harwood believes that an extensive reedbed filtration system is needed to supplement Southern Water's Harrietsham Wastewater Treatment Works, highway and farm runoff should be captured in balancing ponds and ditches (rather than discharged directly into the river and its tributaries), tree and other natural vegetation cover should be increased along the course of the Len as a pollution buffer, outmoded man-made barriers such as weirs and culverts removed and measures taken to keep surface water from roads and buildings out of Maidstone's sewers (such as diverting rainwater into sustainable drainage systems and rain gardens).",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_lib-dems-fight-to-save-tovil-tip/content_87.html": "Lib Dems fight to save Tovil Tip\nThe curse of fly-tipping in South Maidstone is about to explode, with the Household Waste facility in Tovil facing the axe along with three other Kent facilities, as Tories at KCC prepare to pull £1.5m from household waste centres over the next two years.\nCouncillors will vote on a paper being brought to KCC's Environment and Transport Committee next week which provides three options. The first two options see the closure of the Tovil facility, and the last will see the facility reduced to opening just 2 days per week.\nCllr Brian Clark, South Ward, commented, “Maidstone Conservatives clearly have little concern for increased flytipping in South Maidstone given this harmful proposal. With congestion at chronic levels in town, South Maidstone residents will be faced with a miserable drive through the congested town centre to the other side of Allington”\nCllr Paul Wilby followed, “Conservatives are so out of touch with local residents that they have put forward a plan for closing this facility at a time that they are significantly ramping up house building, leaving all South Maidstone residents without a waste facility. I urge residents to sign our petition to stop this harmful plan”\nLink to Petition:\nhttps://digitallibdems.typeform.com/to/aEdbexzT",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_in-council-june-23/content_89.html": "In Council June '23\nJune has been a much busier month for your Liberal Democrat Councillors with the committees returning, budgets to review, and work to be set for the rest of the year.\nNew Investment\nIn the new Planning, Infrastructure, and Economic Development committee Cllrs. Ashley Kimmance and Richard Conyard were happy to support all four of the recommended Community Infrastructure Levy (CIL), proposals as well as inviting a new round of proposals this autumn / winter. The recommended proposals are:\n- The redevelopment of Heather House Community Centre in Park Wood.\n- The redevelopment of the St Faith’s Community Centre in Ringlestone.\n- Improvements to Junction 7 of the M20 to improve traffic flow along the A249 and Bearsted Road near Vinters Park.\n- Improvements to Linton Crossroads to improve safety and traffic flow.\nCllr. Conyard said:\n“I’m happy to support these proposals, the centres will be valuable community assets for decades to come, Junction 7 has been crying out for improvements for years, and Linton Crossroads doesn’t appear to have changed from when I moved to Boughton Monchelsea in the mid-eighties and wasn’t designed for today’s levels of traffic. I understand the call for improvements in and around Hermitage Lane and Fountain Lane that were raised by other councillors, but without schemes that are ready to go I feel those ready must proceed. I am glad we can consider further schemes shortly.”\nPotential Parish Changes\nCllr. Brian Clark has been busy on the Democracy and General Purposes Committee with the proposal to merge the neighbourhood boundary of the North Loose Residents Association and Loose Parish Council. Cllr. Clark presented the proposal which received support from all members and is now out for a six-week public consultation. You can have your say here:\nhttps://letstalkmaidstone.uk.engagementhq.com/community-governance-review\nCllr. Clark said:\n“The NLRA is celebrating 20 years of providing a voice for residents, and I'm proud to have served on the NLRA committee for many years before successfully standing as a local councillor.\nSadly, with most committee members moving on in years, and several with ongoing health issues, the group felt the way to secure their legacy would be to join with Loose to create a single parish representing the wider Loose community.”\nIt is also proposed to expand Barming Parish Council boundaries to Fountain Lane. Suggestions to consult on abolishing Boxley Parish Council and Tovil Parish Council were not taken forward as they had either not been suggested by the public in the stage one consultation, or had very limited support.\nLocal Plan and Development\nBoth Cllrs. Tony Harwood and Clive English have attended the 2nd stage of the Examination of the Local Plan Review to oppose the allocation of housing in the Green belt at Lidsing and the cramming of housing into Invicta Barracks among other ill-considered proposals in the Local Plan Review. Tony and Clive also made opposing the Council’s inadequate approach to providing infrastructure and mitigation for proposed and existing housing developments.\nAt the same time as the Local Plan Review has been going on the Council has been consulting on a new policy document on Design and Sustainability Tony Clive and Brian Clark amongst other Lib Dem Councillors have made strong representations that this document is wholly inadequate, with major opportunities to tighten up on everything from parking standards to water efficiency to renewable energy, to controlling subdivision of houses into flats or Houses of Multiple occupation being missed. Tony said:\n\"Every proposal is caveated with maybes and would it not be nice if. Instead of requiring action. It is not a policy document, but a wish list that will be ignored as it currently stands.\"\nTown Centre Strategy\nJune also saw the first meeting of the Town Centre User Group which comprises of all councillors for High Street Ward and surrounding wards. This was for many of the councillors the first opportunity to see the draft Town Centre Strategy to take Maidstone Town Centre to 2050. Unfortunately, the exact contents of the draft are commercially confidential and cannot be publicly disclosed. For many Lib Dem councillors the draft appears to be another profound disappointment.\nCllr. Clive English said:\n“There is little recognition that a Town needs more than housing to thrive, little strategy to enhance town centre uses, or provide reasons to visit the town and no proposals to deal with traffic, improve matters for pedestrians and cyclists, or pretty much anything that smacks of any degree of ambition.”\nOn receiving the draft, and with the approval of other Lib Dem councillors Cllr. Richard Conyard submitted a comprehensive response to the draft highlighting shortfalls and proposing areas of ambition that he felt should be investigated. In summary Cllr. Conyard stated:\n“As the strategy currently stands, I do not believe it fit for purpose. I hope there is an opportunity for changes before it is sent through to the policy advisory committees and cabinet.”\nPublic Transport\nIn the first “proper” meeting of the Overview and Scrutiny Committee areas for examination and discussion were set and the schedule is currently being prepared by the hard-working democratic services Officers. Much of this is building from the work of last year’s committee, however it is hoped by Cllrs. Richard Conyard and Brian Clark that proposals to conduct light reviews into Digital Demand Responsive Transport (sometimes termed the future of busses), and Integrated Public Transport can be squeezed into a packed schedule.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_houses-in-multiple-occupation-hmo-policy-update/content_7.html": "Houses in Multiple Occupation (HMO) Policy Update\nDespite motions from Maidstone Borough Council's Planning Committee, and other forums, seeking the urgent development of planning policies that would enable some control over quantity and quality of Houses in Multiple Occupation in the Borough, the previous Conservative administration at Maidstone Council failed to act on these requests.\nIndeed, the then Conservative Government at Westminster further compounded an already challenging situation by changing the influential National Planning Policy Framework by removing the national policy 'hook' for managing over concentrations of HMOs within specific communities.\nThis policy malaise ended with the ousting of the Borough Council's Tory leadership in May 2024. Within days of the new council administration coming into office, the cabinet member for Planning (and local Fant resident) Tony Harwood instructed planning officers to prepare an ambitious HMO Supplementary Planning Document (SPD).\nAll the required supporting evidence and surveys have now been gathered and the SPD is currently at a draft stage and undergoing internal scrutiny by Development Management, Housing, Legal and those other specialist teams who will need to make this document work for them.\nAs regards current planning applications, these must be determined strictly in accordance with prevailing national and council policies. Any deviation from this quasi-judicial framework by Planning Committee would likely result in an appeal to the Planning Inspectorate, where the absence of local policy would significantly reduce the likelihood of a decision to refuse being upheld and the risk of punitive costs against the public purse. This means that until the draft HMO SPD is adopted, the Borough Council has very little room for manoeuvre.\nHowever, we can now confirm that the HMO SPD and a covering report will go before the Borough Council's Planning Policy Advisory Committee on 5th March, followed by Cabinet on 19th March.\nAssuming all goes well at both the Policy Advisory Committee and Cabinet, the Borough Council will commence the four week public consultation on 31st March.\nAllowing for the resolution of any issues raised by key stakeholders and the wider public, this will enable the HMO SPD to be published and start operating in late spring/early summer - thus filling the HMO policy void that the new administration inherited.\nCouncil planners sometimes get a bad press, but the extent of local research and volume of empirical evidence required to support the development of a document that can stand up to inevitable challenge was significant and we thank them.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_lost-in-traffic/content_44.html": "Lost in Traffic\nAnyone hoping for some progress on dealing with Maidstone's perennial and interminable traffic problems would have been sorely disappointed by the last meeting of the Joint Transport Board for Maidstone. Despite the many problems in Maidstone this Board seldom meets, allegedly because of a lack of business to discuss, so there had been some hope that when this meeting was finally arranged some serious discussion on local transport issues would ensue. This did not happen.\nFor some reason only one County Council Officer attended thereby preventing any meaningful discussion. The meeting started with numerous questions from the public regarding the contreversial closure of Cranborne Avenue. As there were no Highway Officers present no definitive answers could be given. The next item for discussion was the Integrated Transport Package for Maidstone. There was no discernible progress noted on any of the parts of the Package and in the absence of any Highway Officers no questions could be asked. Understandably the Board declined to note the report and resolved to ask the County Council to arrange a full presentation on the Integrated Transport Package so that a full and frank discussion could take place.\nThe next discussion on proposals to improve bus services was a little more productive, but the Board criticised the unimaginative quality of the proposals and resolved to seek a report on establishing a new forum to work with local bus companies to improve services to be presented to the Autumn meeting of the Board.\nFinally, there was outrage amongst members at the inaccuracy and the dismissive tone of a memo from the Cabinet Member at KCC basically saying that the County Highways Department would not engage with or support Local Planning authorities during the Planning process. The Board resolved to write to the Leader and Cabinet Member pointing out the many inaccuracies in the memo in relation to its interpretation of National Planning Policy and Government Guidance.\nLiberal Democrat Group Leader Clive English said: \"The Joint Transport Board should be the Forum where the Borough County and Parishes discuss our transport problems and find solutions. Instead KCC have reduced the scope of what can be discussed, preventing the public and Councillors from raising anything other than so called strategic issues. When meetings are held the Agendas are thin with few supporting papers and officers often do not attend from the County to allow discussion to take place .It is clear the system is not working and requires root and branch reform.\"",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_liberal-democrats-oppose-flawed-local-plan-review/content_50.html": "Liberal Democrats oppose flawed Local Plan Review\nDespite determined cross-party opposition from councillors, including the Liberal Democrat Group (supported by many local residents), Maidstone Borough Council voted to adopt their controversial Local Plan Review document. However, this may not be the end of the saga. Speaking during the Debate Liberal Democrat Planning Spokesperson Tony Harwood pointed out that there were big practical challenges involved in the delivery of the larger housing allocations especially in the light of late issues raised by KCC on the day. These include the question marks hanging over the delivery of critical infrastructure at Lidsing and Lenham Heathlands and the impossibility of squeezing-in the sheer numbers of new homes proposed for Invicta Park Barracks and the Town Centre. Tony said: “Maidstone’s Local Plan Review is built on foundations of sand and it is inevitable that the document will need to undergo some significant surgery going forward to make it deliverable and environmentally acceptable.”. He continued: “The big worry is that the largest housing allocations in the new plan will collapse under the weight of their own contradictions and leave the Borough vulnerable to speculative housing applications.”.\nLiberal Democrat Group Leader Clive English added: “The only justification for this poorly designed plan has been that ‘any plan is better than no plan’, but if this plan unravels it will lead to the very situation it was meant to avoid, with developers needing to bring forward extra development sites.” Adding: “Ironically, we would have opened the door to development on controversial and hard to develop sites without extending protection to the rest of the Borough - we will now have to see what can be done in terms of damage limitation and what room for manoeuvre the Council might have if the governing administration changes on 2nd May.”\nDuring the meeting two amendments were called to delay the decision. The last by Cllrs. Clive English and Tony Harwood of the Liberal Democrats to allow time to digest the late information from KCC, these were voted against.\nAt the outset the Conservative Party called for the vote to be named to be clear which councillors were for the Local Plan Review, against the Local Plan Review, or wished to abstain.\nVoting FOR the implementation of the Local Plan Review:\n| Councillor | Party | Vote |\n| Alan Bartlett | Conservative | For |\n| Annabelle Blackmore | Conservative | For |\n| Claudine Russell | Conservative | For |\n| David Burton | Conservative | For |\n| Denis Spooner | Conservative | For |\n| Denise Joy | Independent Group | For |\n| Fay Gooch | Independent Group | For |\n| Gary Cooke | Conservative | For |\n| Gill Fort | Conservative | For |\n| Gordon Newton (Mayor) | Independent Group | For |\n| James Reid | Conservative | For |\n| John Perry | Conservative | For |\n| Lewis McKenna | Conservative | For |\n| Lottie Parfitt-Reid | Conservative | For |\n| Martin Cox | Independent Group | For |\n| Martin Round | Conservative | For |\n| Michelle Hastie | Conservative | For |\n| Paddy Riordan | Conservative | For |\n| Patrick Coates | Fant and Oakwood Independent | For |\n| Patrik Garten | Conservative | For |\n| Paul Cooper | Conservative | For |\n| Paul Harper | Fant and Oakwood Independent | For |\n| Peter Holmes | Conservative | For |\n| Sandra Knatchbull | Conservative | For |\n| Simon Webb | Conservative | For |\n| Stanley Forecast | Conservative | For |\n| Steve Munford | Independent Group | For |\n| Susan Grigg | Independent Group | For |\n| Tom Cannon | Conservative | For |\n| Val Springett | Conservative | For |\n| Ziggy Trzebinski | Conservative | For |\nVoting AGAINST the implementation of the Local Plan Review:\n| Councillor | Party | Vote |\n| Ashleigh Kimmance | Liberal Democrat | Against |\n| Bob Hinder | Conservative | Against |\n| Brian Clark | Liberal Democrat | Against |\n| Clive English | Liberal Democrat | Against |\n| Cynthia Robertson | Liberal Democrat | Against |\n| Dan Wilkinson | Labour | Against |\n| David Naghi | Liberal Democrat | Against |\n| Derek Eagle | Green Independent Alliance | Against |\n| Derek Mortimer | Liberal Democrat | Against |\n| Janetta Sams | Green Independent Alliance | Against |\n| Joanna Wilkinson | Labour | Against |\n| Margaret Rose | Labour | Against |\n| Maureen Cleator | Labour | Against |\n| Mike Thompson | Liberal Democrat | Against |\n| Paul Wilby | Liberal Democrat | Against |\n| Richard Conyard | Liberal Democrat | Against |\n| Stephen Thompson | Green Independent Alliance | Against |\n| Stuart Jeffery | Green Independent Alliance | Against |\n| Tom Sams | Green Independent Alliance | Against |\n| Tony Harwood | Liberal Democrat | Against |\n| Vanessa Jones | Green Independent Alliance | Against |",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_TownCentreStrategy/content_27.html": "Maidstone's Alternate Town Centre Vision\nTown Centres across the country face many challenges including the decline of traditional retail and office employment activities. Maidstone is no exception to this.\nIn the autumn of 2022 councillors, on the advice of MBC officers, voted to approve the commissioning of a Town Centre Strategy for Maidstone. It was to provide a plan to the year 2050 and build a thriving town centre for years beyond.\nDuring the formation of the official draft town centre strategy councillors across all parties, primarily those from town centre wards, were invited to provide feedback through a mixture of walks, user group meetings, and briefings. Despite providing in-depth feedback, as of the time of writing, no response to the feedback has been received.\nWhilst the draft strategy does have a number of beneficial points we do not believe what has been produced, so far, is a blueprint to rejuvenate our town centre. The delay in the release of this document, originally it was due to be available earlier this year, is understandable given the complexity, but frustrating. We strongly feel that it is critical that what is finally adopted be in the best interests of Maidstone.\nMaidstone has tended to focus on short-term economic gain without consideration for the wider environment, infrastructure, social concerns, and long-term sustainable growth. We feel that any strategy needs ambition, and must breathe life into our ailing town centre.\nThe Town does not make full use of its existing assets such as the rivers, its cultural attractions, and suffers under problems created by the lack of any form of sustainable transport policy. Maidstone deserves better.\nIn response we have produced this document, an alternative vision for Maidstone Town Centre. It builds on the work of previous discussions to look beyond and make Maidstone Town Centre a place that we can all be proud.\nWe are keen to receive feedback, both positive and negative. You may leave feedback on www.maidstonelibdems.co.uk/TownCentreStrategy/ or by emailing hello@maidstonelibdems.co.uk.\nMaidstone Liberal Democrats",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors_cllr-brian-clark/content_30.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_camden-street-play-area-reopens/content_75.html": "Camden Street Play Area reopens\nThe Maidstone Borough Council parks team have done a fantastic job in upgrading the Camden Street Play Area. Informed to the proposed upgrade earlier in the year East Ward Lib Dem Councillor Richard Conyard contacted the parks team and requested a number of additional changes including seating and greenery which the parks team are providing.\nNow the park it is open councillors have inspected the work and it was great to see children laughing and enjoying the new facilities.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_in-council-july-23/content_99.html": "In Council July '23\nThroughout July various committees have been discussing the parts relevant to their focus of the Biodiversity and Climate Change Action Plan Update. Coming in at nearly 60 pages it had been hoped that Maidstone Borough Council had achieved significant progress on the many action points to help achieve “Net Zero” by 2030. This unfortunately wasn’t the case with of the 38 actions set out only 2 had been completed, 9 underway, and the remaining 27 points either under investigation, planned, or not even started. This obviously begs the question of how seriously it is being taken.\nWith progress hampered, many of the actions running behind schedule, and certain elements of reporting, particularly financial, set out to encourage inaction (e.g., estimating prices to migrate council owned vehicles to green alternatives being reported as the total figure rather than going for another 100% petrol /diesel), more needs to be done if we have a hope of hitting these targets.\nPlanning, Infrastructure and Economic Development\nThe primary business outside of the Climate Change Action Plan would have been to discuss the proposals to expand the quarry on Hermitage Lane into an adjoining 50 hectares of woodland at Oaken Wood. However, with new documentation being presented that day this discussion has been deferred until the next meeting.\nHousing, Health, and the Environment\nThis meeting saw the first of two reviews into the renewal of the Public Space Protection Order (PSPO), to guard against begging and drinking within the town centre which has been in place since 2017. Your Lib Dem Councillors in and around the town centre are more than familiar with the good work the Town Centre Taskforce does in this regard with bringing vulnerable people into schemes that can help them off the streets and back into safety, only using the PSPO as a matter of last resort, and as such provided this approach remains the same, we are supportive of renewal.\nOne area that was of concern was the matter of legality raised by the Liberty organisation and their concern PSPOs and their use in criminalising behaviours associated with poverty. Whilst sympathising with Liberty’s concerns we know through the application of the PSPO for the past 6 years it is only used as a matter of last resort. On noting that any appeal once passed would be at the High Court and likely very expensive Cllr. Richard Conyard asked when the last legal advice was received given challenges to other councils since this was implemented in 2017 in relation to a proposed amendment to approve provided the legal team used by the council felt everything was still legal 6 years later to mitigate risk and potential costs. The amendment was defeated with the Conservative councillors and Chairman Denise Joy voting against proposing that the legality be double checked.\nCorporate Services\nThe Mid Term Financial Strategy report provided the rather sombre news that projections for 2024/25 are a £925,000 funding shortfall and 2025/26 this increasing to £4.5 million. Whilst the proposed council tax rises have been widely reported, these projected deficits have not. Since there is a legal obligation to “balance the books” depending on any new funding from central government (generally released in December), there may be a need for significant savings. We shall be keeping a close eye on this and doing our best to ensure those most vulnerable are protected.\nIn the meeting it was formally announced that the proposal to turn the Archbishop’s Palace into a wine destination had been shelved when the commercial partner dropped the project. It has now been proposed to pursue turning it into a wedding venue from a split vote. Cllr. Richard Conyard who abstained said:\n“I think this would be a fantastic venue for weddings, and as proposed would also keep access open for members of the public. My abstention unfortunately is because of the private papers where I am uncomfortable with the figures and route proposed. Given the deficit we have seen from the previous point I am unsure that the financial detail of the proposal is in the best long-term interests of the residents of Maidstone, and it is a pity that more time could not be given over to this.”\nOverview and Scrutiny\nThe PSPO against drinking alcoholic beverages and begging in the town centre had a second outing in Overview and Scrutiny, where it was proposed and voted for that the additional legal review is sought before enacting the PSPO. This was passed by all members apart from Cllr. Hastie who voted as previously not to seek additional legal advice.\nCllr. Clive English said: “I am glad that we were able to move, and this time get approval for the additional legal advice from our in-house team. It makes complete sense to spend the tiniest of extra time now than face the potential of expensive legal battles in the future.”\nFull Council\nThe largest discussion at full council was the motion by the Green Party to create a “Declarations of the Rights of the River Medway and it’s tributaries”, by 2025 and the amendment by the Lib Dems to pick on the tributary with which Maidstone Borough Council has most control, the River Len, and create a programme of improvements starting almost immediately. The detail of which can be read in our news article on the alliance between the Green Party and the Conservatives dash hopes of cleaning up the River Len. After many different votes this has now moved through to the Overview and Scrutiny committee, we have created a petition that can be signed here.\nAudit, Governance, and Standards\nThe biggest talking point was the (as of the time of the meeting), still unsigned audit of the 2021/22 accounts. This led a little life into potentially the driest committee meeting (approximately 240 pages of accounts, audits, treasury statements etc.). Presently the council and the members of the committee are at odds with the auditors over paying additional funds to carry out non-required steps that the auditor wishes to carry out. Members voted to send a response demanding that these were dropped by senior management from the auditors and to provide an answer within 14 days.\nCabinet\nTo close of the month Lib Dem group leader Clive English attended the cabinet meeting as a visitor. Since the previous cabinet meeting was cancelled there were a backlog of decisions to be made by the Conservative executive.\nCllr. English spoke in favour of the allocation of CIL funding as suggested by the committee for the St Faith’s Community Centre and highlighted that there may be a shortfall and topping up funds were agreed if required. The cabinet rejected the proposal for improvements to Linton Crossroads, despite being supported by KCC and forming part of the Local Plan review; this decision is being called in (challenged for further discussion).\nThe proposals for the Archbishop’s Palace were also approved by cabinet. This decision will also be called in, not because there is an issue with it becoming a wedding venue, but because the figures proposed by Maidstone Borough Council, but kept private from the public, need further examination.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_concerns-grow-that-the-maidstone-local-plan-may-hit-the-rocks-as-government-inspector-adjourns-hearing/content_84.html": "Concerns grow that the Maidstone Local Plan may hit the Rocks as Government Inspector adjourns hearing\nMBC Officers suggested that the documents could be accepted and then considered at a later stage, but after seeking input from presenters, the inspector concluded there was insufficient time to digest the content and decided to adjourn the hearing to November.\nThe delay will mean the local plan update cannot be adopted before the 5-year anniversary of the existing local plan on 27th October. Failing to have an update in place at this milestone could severely impact Maidstone’s “five year housing supply” and its ability to defend planning refusal decisions at appeal.\nCllr Brian Clark commented, \"During the local plan process the Chairman of the Strategic Planning Committee David Buton sought unsuccessfully to defeat our proposal to maximise public consultation by keeping Regulation 18b, and refused to accept any extension to the subsequent Regulation 19 public consultation,\". He continued, “That need to rush this half baked plan through at all costs, with key documentation only now being submitted, has added delay and uncertainty and could ultimately leave the borough with no plan at all.\"\nCllr Clive English stated,”I have made clear my grave concerns about the soundness of the local plan ahead of submission to the public inspector. It was clear that the evidence base for the garden city schemes of Lidsing and Heathlands was severely lacking, but events in the town hall last week, with the goal posts still moving during the inspector’s hearing, really show how far we are from where we need to be.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_kent-county-councillors/content_33.html": "Geoff Samme - Kent County Councillor for Maidstone North East\nGeoff Samme has been an active member of the local Liberal Democrat team for nearly 30 years and is proud to represent Maidstone North East on Kent County Council.\nAged 57, Geoff has lived in Maidstone since he was three years old—first in Moncktons Lane and now in Vinters Park, where he continues to live today. He was educated at Maidstone Grammar School before going on to earn a degree in Economics and Statistics from University College London. After qualifying as a Chartered Accountant, Geoff held senior financial roles in a number of local businesses.\nGeoff’s long-standing commitment to the Liberal Democrats has seen him campaign alongside numerous councillors across Maidstone for the past 28 years. Last year, he chose to retire early from a successful career to dedicate his time to campaigning in the Borough Council elections, demonstrating his strong commitment to local representation and community engagement.\nGeoff’s top priority is clear: to support and serve the local community. Whether it’s by improving infrastructure, protecting services, or addressing residents’ day-to-day concerns, he is determined to be an accessible and effective voice for Maidstone North East at County Hall.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_congratulations-councillor-passmore/content_95.html": "Congratulations Councillor Passmore!\nAfter a hard-fought campaign and a nail-biting conclusion Maidstone Liberal Democrats are happy to introduce Kent County Council’s newest councillor Chris Passmore for the Maidstone Central Division.\nWith all candidates and their supporters working hard to win votes the final result came down to the wire with Chris polling 1,860 votes to the Green Party candidate Stuart Jeffery polling 1,849 votes. With the result being so close a recount was requested before the final result was announced at approximately 2:20am Friday 7th July.\nChris said:\n“I am delighted to have successfully held the seat for the Liberal Democrats thanks to an impressive team effort from local and regional activists. There are a number of very significant environmental, social and economic challenges we face and I am committed to work constructively to get the best outcomes for all the residents of Maidstone.”\nThe by-election was called because of the death of Dan Daley in March 2023 who served as a County Councillor for over 20 years. The next Kent County Council elections will be in May 2025.\nThe Maidstone Liberal Democrat party would like to pass on their heartfelt congratulations to Chris and we all look forward to serving the residents of Maidstone together.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_page-9/content_55.html": "Water\nIt will not be news to anyone that Maidstone Borough is suffering major problems in many areas of the Borough with failing water supply infrastructure, inadequate sewage disposal, collapsing drains and sewers, and grossly polluted watercourses. Whilst the Liberal Democrats do not control Maidstone Council, we are using every lever we have at our disposal to address this issue, including supporting a water-cycle policy motion to the Full council meeting of 20th July and successfully proposing a more technical motion at Planning Committee on 21st July.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_three-new-nature-reserves-for-maidstone/content_94.html": "Three new nature reserves for Maidstone\nNatural England has approved three new nature reserves for Maidstone at Allington Millennium Green, Fant and the combined site of Weavering Heath, Five Acre and Wents Wood.\nMaidstone Borough Councils’ Parks and Open Spaces Team applied for the new nature reserves which brings the total to six for the borough.\nNature Reserves are open to the public welcoming all visitors to connect with nature and be inspired by the fantastic wildlife, habitats, geology and landscapes.\nNationally they were first established to protect some of the UK’s most important habitats, species and geology, and to encourage learning.\nChris Passmore the Liberal Democrat candidate for Maidstone Central division in the upcomming by-election said:\n“I am delighted that over 4 hectares of open space have now been given additional protection as nature reserves with the Maidstone Central Division.\nThese spaces are not only essential for wildlife but also for the well being of local residents who can observe and enjoy the natural environment within a few minutes walk of our homes, rather than having to get in a car.\nThe MBC Parks and Open Spaces team should be congratulated for their hard work in getting these nature reserves approved to add to the three in Maidstone that are already classified as nature reserves.”",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors_cllr-tony-harwood/content_9.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_calls-to-get-a-grip-on-hmo-parking/content_79.html": "Calls to get a grip on HMO parking\nOver the last few years Maidstone has seen many Planning applications to subdivide properties in the Urban area, often into House of Multiple Occupation. These often cause serious problems because they do not come with enough parking spaces. The Planning Committee often cannot refuse these because the Council has no relevant policies to require sufficient parking.\nAt the Planning Committee meeting on Thursday night Liberal; Democrat Councillor Clive English proposed that the Planning Committee request the Cabinet Member for Planning and Regeneration to commission the work needed to put in place a firm policy to prevent the subdivision and extension of urban properties in areas with inadequate parking. The motion was agreed unanimously.\nClive said: “We need to get a grip on this issue once and for all and commission the work to get the evidence of parking pressure in these areas so that we can finally put policies in place to prevent inappropriate development.”",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_hedley-street-play-area-renovated/content_82.html": "Hedley Street Play Area Renovated\nAfter quite some time the Hedley Street Play Area has now been refurbished by Golding Homes, and a fantastic job they have done of it too!\nShortly after last May's elections councillor Richard Conyard was contacted by a local resident in June highlighting the dilapidated state of the play area and the issues it was causing for their children playing there. Tracking down those responsible was rather tricky since all signage stated it was run by Maidstone Borough Council, however these were from the early 2000's. Having found out the ownership was with Golding Homes Cllr. Conyard worked with their Homes Team to get the play area refurbished. Although it has taken quite some time and lots of work, not least overcoming supply chain issues the park is now ready for the summer.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_consultation-on-kent-mineral-site-plan-hermitage-quarry/content_96.html": "Consultation on Kent Mineral site plan – Hermitage Quarry\nAs part of Kent County Councils ongoing update of the Kent Minerals and Waste Plan, a number of changes are out to consultation.\nOnly one location has been nominated a a potential site for the proposed extraction of Hard rock which is south and West of Hermitage Quarry in Aylesford.\nOur position as Liberal Democrats is that this proposal includes Oaken Wood which is Ancient Woodland and is protected by the Government’s National Planning Policy Framework as an “irreplaceable habitat”. We do not see that the benefits can be mitigated, and this will result in a significant loss to our local environment and to Kent.\nKent County Council are now consulting on the proposal which will end on the 25th of July so please take your chance to have your say.\nGo to www.kent.gov.uk/mineralsandwaste for the information and scroll down to the questionnaire.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors_cllr-dave-naghi/content_4.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors_cllr-michael-thompson/content_29.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_cabinet-decisions-scrutinised/content_81.html": "Cabinet decisions scrutinised\nCabinet asked to reconsider its decision on Key Junctions.\nRecently the Cabinet decided against the advice of the Planning Infrastructure and Economic Development Advisory Committee not to fund improvements to Linton Crossroads, on the grounds that other improvements were more important to deal with congestion, such as Fountain Lane. However, the Cabinet failed to provide a clear indication of how or when the alternative projects could be brought forward. As a result, Lib Dem Councillors Clive English and Dave Naghi along with Independent Councillor Steve Munford called in the decision to the Council’s Overview and Scrutiny Committee.\nAfter an in-depth discussion the Committee resolved by 10 votes to 3 with 2 abstentions to ask the Cabinet to reconsider funding Linton Crossroads at this time and to take action to bring forward proposals to improve the junctions at Fountain Lane and Hart Street.\nSpeaking in the debate Clive English stressed that the decision made by the Cabinet risked none of the junction improvements coming forward at all. Whilst Dave Naghi reminded the Committee of the poor safety record of the current Linton Crossroads and the need to address this. Finally, Ashleigh Kimmance called for action to speed up progress on the Fountain Lane Junction.\nAs a result of the Committee’s decision the decision not to award funding will now have to be reconsidered by the Cabinet\nArchbishops Palace\nAt the same meeting the Overview and Scrutiny Committee considered another call in to look at the proposed use of the Palace as a wedding venue. There was no issue with the proposed use, but the Committee wished to reassure itself of the details of the financial arrangements. The nature of the figures presented in private within the original policy advisory committee suggested a specific business model that certain councillors felt uncomfortable accepting that level of risk for the residents of Maidstone.\nThe proposal is still some way from a final package and the Committee’s questions were satisfactorily answered at this stage with the concerns from multiple councillors being noted. Lib Dem Councillors will keep an eye on the project as it progresses to see if any further action is needed.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_volunteer/content_23.html": "Become a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_search/content_31.html": "About Maidstone Lib Dems\nAbout Maidstone Liberal Democrats The Liberal Democrats have a rich history of representing and fighting for the interests of the people of Maidstone. As a party, we are proud to serve the…\nAbout Maidstone Liberal Democrats The Liberal Democrats have a rich history of representing and fighting for the interests of the people of Maidstone. As a party, we are proud to serve the…\nGeoff Samme - Kent County Councillor for Maidstone North East Geoff Samme has been an active member of the local Liberal Democrat team for nearly 30 years and is proud to represent Maidstone North…\nGeoff joins 11 other Lib Dems on KCC\nScheme hindered by requirement for mass-developments\nBringing forward new policies to protect our Landscape & Green spaces\nNew plans set to tackle local housing challenges\nCllr. Simon Wales Loose and Linton Ward email: SimonWales@Maidstone.gov.uk Simon was elected to represent Loose and Linton Ward in May 2024. He deals regularly with highways, planning, parking…\nCllr. Mark Naghi Grove Green and Vinters Park Ward email: MarkNaghi@Maidstone.gov.uk",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_pot-hole-fishing/content_92.html": "Pot hole fishing\nWhile Maidstone’s Joint Transport Board meeting is once again cancelled due to “lack of business”, Conservatives running the highways authority are extending local leisure pursuits to residents.\nThe photo local resident Cllr Brian Clark, Lib Dem South Ward, can be seen in Anglesey Avenue taking time out from his busy schedule of fault reporting to try his hand at fishing.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_leeds-langley-bypass-southern-relief-road/content_22.html": "Leeds Langley Bypass (Southern Relief Road)\nThis proposal is once again causing considerable comment.\nProposals to safeguard land for a new Leeds-Langley Road were included in Maidstone Council’s draft Local Plan Review document. However, this proposal was rejected by the Governments Local Plan Inspector following an Examination in Public, and the proposal did not therefore feature in the 2024 Adopted Local Plan Review voted through by Conservative councillors in spring 2024.\nFurther, Maidstone Borough Council is not the Highway Authority and Kent County Council has made it clear that after the latest two year review and attempts to find a suitable route, that the Leeds-Langley Road does not meet current criteria for progressing and funding new roads. This means that if such a road were ever to be seriously considered it would need to be funded entirely by developer contributions.\nIt is all too clear that the scale of new residential development required to fund a new road would generate so much additional traffic that any perceived local benefit from a new Leeds-Langley Road would be wiped out. When the loss of countryside and additional strain on overstretched local services are factored in the viability of such a scheme is further undermined.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_unholy-alliance-of-conservative-and-green-councillors-dashes-river-len-clean-up-hopes/content_85.html": "'Unholy alliance' of Conservative and Green councillors dashes River Len clean-up hopes\nAn ambitious Lib Dem proposal to establish an innovative River Len Stakeholder Task Force to tackle the worsening pollution and wildlife decline affecting the River Len and its chalk stream tributaries was rejected by a coalition of Conservative and Green Councillors at a full meeting of Maidstone Borough Council last night.\nThe proposal moved by Lib Dem Group Leader Cllr. Clive English (High Street Ward) and seconded by Cllr. Tony Harwood (North Ward) was supported by Independent and Labour councillors but opposed by the Conservatives and Greens.\nThe final vote was 17 in favour of launching a River Len Stakeholder Task Force, 22 against, with two abstentions.\nIf agreed, the River Len Stakeholder Task Force would have comprised local landowners and their representatives, water companies, the Environment Agency, Kent Wildlife Trust, South East Rivers Trust and other influential players under the chairmanship of the Leader of the Council.\nThe vision for the Task Force was:\n- Progressive removal and/or bypassing of manmade barriers to ecological movement i.e. restoring the right to a natural flow;\n- Setting measurable targets and achieving continuous improvement across flow rates and water quality (including mitigating current pathways for diffuse pollutants including agricultural and highway run-off);\n- Enhancing and recreating riparian habitats along the course of the River Len and its tributaries, including wet woodland, marsh and fen, wet heathland, flood meadow, ponds and ditches; and\n- Restoration, expansion and reintroductions of declining or lost riparian flora and fauna associated with the River Len, including migratory fish, DesMoulin’s Whorl Snail, White-clawed Crayfish, White-legged Damselfly, Water Shrew, Water Vole, Otter, Common Snipe, Lapwing, Woodcock, Large Bittercress, Southern Marsh Orchid and Black Poplar.\nCllr. English stated: \"The River Len flows for its entire course through Maidstone Borough and the Council owns key sections at Mote Park, Downswood and parts of the town centre and therefore has a genuine ability to influence a better future.\"\nCllr. Harwood added: \"I am deeply saddened that an unholy alliance of Conservatives and Green councillors voted to sink this practical environmental initiative that was based-on proven approaches elsewhere in the UK and Europe.\"\nHe continued:\"The River Len is heavily modified by man-made structures from its source in Lenham through to its confluence with the River Medway at the Archbishop’s Palace Gardens. The resultant impeded flows exacerbate pollution from wastewater and other sources, such as agricultural and highway runoff.\"\nConcluding: \"Some of the tributaries of the River Len such as the Hollingbourne and Lilk Streams are even classified as chalk streams, as they rise at spring-lines at the foot of the North Downs, while others including the Fairbourne Stream emerge from the dip slope of the Greensand Ridge.\"\nThe proposal was in response to attempt to establish a 'Declaration on the Rights of the River Medway and its tributaries' by the Green Party, and concerns raised by Cllr. Conyard who said:\n\"I am deeply sympathetic to the aims originally set out and disappointed that Clive and Tony's sensible amendment did not get passed since it was a practical way to seek improvements now rather than in a few years time. The concept of Rights of Nature, and more specifically Rights of Rivers are a potential legal quagmire since the focus is to give locus standi or as per the councils briefing notes to councillors 'personhood' under law. I do not wish to be in a position where I have to tell a resident or family that the service they rely on has been cut, or the team they need is understaffed because money has been diverted to legal fees because of something I voted in when better options were available.\"\nFinally after much discussion and a procedural motion it was ensured that the Overview and Scrutiny Committee will be tasked with taking forward practical improvements to the management of Maidstone’s rivers.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_tory-plans-to-close-tovil-recycling-centre-scrapped/content_54.html": "Tory plans to close Tovil Recycling Centre scrapped\nFollowing strong opposition from local Lib Dems and other groups, the horrific plan by Kent County Council to close the Tovil Centre and three others in Kent has been scrapped.\nSimon Wales commented, “Our thanks to all those who opposed the scheme and in particular the 1600 people who signed our petition against the closure. In the end even the Conservatives realised it was short sighted and would result in long term problems including a serious risk of increased fly tipping.\"\nAnthony Hook added in an interview with the Kent Messenger:\n“It’s great news but I’ll be advising our campaigners to stay vigilant. I’m not sure we can trust them [those in favour of the proposal].\n“I can’t believe that they’ve had a sudden Road to Damascus conversion so they might try to get the closures back in some other form.”\nCllr Richard Conyard who set-up the petition for the Liberal Democrats in Maidstone added: \"I am glad that the voices of the public have been heard and grateful for the work done by everyone opposing this. It should not take the threat of electoral defeat however to do the right thing.\"",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_lib-dems-move-to-help-residents-with-parking/content_63.html": "Lib Dems Move To Help Residents With Parking\nAt February’s Strategic Planning Committee Maidstone Lib Dems call for a fairer approach to Town Centre parking in light of Park and Ride Services ceasing on 19th Feb, while cancelling the price increase planned for town centre parking permits.\nCllr Clive English, speaking as a visiting member suggested that there are opportunities to improve parking for residents and visitors. He explained that the initiative where residents have been allowed to use parking permits in MBC car parks has been successful, although further improvements could be made with consideration of hours of operation and in which car parks permits could be used.\nHe also suggested that council had the opportunity to help new residents moving into town centre developments. While these residents do not have access to parking permits relying instead on high priced (£357 per annum) night-time season tickets, MBC could choose to reduce the cost and still maintain revenues, as it would encourage more residents to buy season tickets.\nThe committee agreed to cancel the price increase and following discussion and an amendment proposal by Cllr Brian Clark reiterating concerns raised by Cllr English on parking permits and season tickets, the chairman agreed to raise these with officers and bring these back to a future committee.\nCllr Clive English said: “Car parking in Maidstone for residents can be a nightmare and any improvements will be welcome. There are large parts of the town centre that do not, despite previous requests to MBC, have the right to apply for permits. The current pricing of overnight permits delivers only a slight discount on the normal price and I hope that a reasonable price can be suggested for residents for parking in our under utilised car parks.”\nRichard Conyard who has been pushing for improvements in East Ward continued: \"In the urban areas across the borough parking is a major issue, and residents deserve better. I'd like to thank Cllrs. Clive English, Brian Clark, and David Naghi in pushing for improvements. The apparent support from councillors across parties is also welcome and I hope the officers can bring back options that put benefits to the residents of Maidstone front and centre.\"",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors_cllr-richard-conyard/content_32.html": "Cllr. Richard Conyard\nPenenden Heath Ward\nRichard was became a councillor of East Ward in 2022. A local to the ward (Brewer Street), Richard has a keen interest in improving the local area and facilities for residents since as he states he is one of them! Local projects he has helped to move forward include improvements to play areas as well as gaining access for residents to approximately an additional 100 parking spaces overnight.\nRichard presently sits on two committees; the Overview and Scrutiny Committee and the Planning, Infrastructure and Economic Development Comittee.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_can-you-spare-some-time-and-help-improve-green-spaces/content_86.html": "Can you spare some time and help improve green spaces?\nAny budding gardeners with some free time on their hands are being encouraged to get involved with volunteering opportunities to help improve sites around Maidstone town centre.\nMaidstone Borough Council (MBC) is working with local charity - Involve Kent - on a ‘Green Spaces’ project. Funded by the UK Shared Prosperity Fund, which brings together local residents to help improve areas in their community whilst boosting their own wellbeing.\nVolunteers are needed to help out at the Amphitheatre every Tuesday and Friday throughout the rest of November. Help is welcomed from as many volunteers as possible to plant bulbs, remove dead lavender plants and replace with new ones. The box hedge needs to be removed as it has blight and a new laurel hedge needs to be planted in its place. Gaps need to be filled in the existing planting with groups of new rose bushes and help with lots of weeding and to spread a layer of mulch to supress further weed growth.\nAreas currently being improved include the courtyard spaces at Maidstone Museum, the gardens at Trinity, the Community Support Centre at Marsham Street and the Amphitheatre. The volunteer team has already been out and about in the town centre, refreshing the planters on Week Street and clearing the flowerbeds on the riverside to make them look tidier. In the coming weeks, the team will be starting at new sites including the wooded area at Camden Street / Woollett Street, where they will be planting bulbs and shrubs as well as adding some bug hotels to encourage wildlife.\nCouncillor Richard Conyard who worked with Involve Kent to make the Camden Street / Woollet Street site available said: \"The work that Involve Kent are doing is fantastic. I would encourage anyone who would like to volunteer to contact them and we can each do our little bit to make Maidstone better.\"\nSam Phillips, Involve’s Partnerships and Community Projects Manager says: “Involve Kent is thrilled to be working in partnership with Maidstone Borough Council on this exciting project. It’s fantastic to be able to offer local residents the opportunity to get involved and play a central part in developing and improving town centre green spaces. We would love to hear from anyone interested in helping make a difference to a green space near you.”\nTo find out more about Green Spaces you can email: grow@involvekent.org.uk or call 03000 810 005.\nThis project – Green Spaces received funding from the UK Government through the UK Shared Prosperity Fund. Information about UKSPF can be found at:",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_hildenborough-crescent-sink-hole/content_58.html": "Hildenborough Crescent Sink hole\nThe reappearance of this sink hole in July has led to both the closure of the road and the significant concern of residents that it could get larger if not addressed.\nCllr Cynthia Robertson (Allington) supported by her KCC colleagues Cllrs Ian Chittenden and Chris Passmore met with KCC engineers as well as pressed KCC officers to achieve an early resolution to the legal discussions between KCC and South East Water as to who is responsible for the ‘void’.\nLocal residents were kept updated to the situation with the distribution of a Street Letter dated 12 August.\nThis pressure was ultimately successful with KCC officers agreeing to commence the repair of the collapse on 29 August.\nCllr Cynthia Robertson comments:\n“It is not acceptable for KCC and South East Water to continue to argue indefinitely over who is responsible for the sink hole whilst local residents and businesses are at risk from no practical action being taken. We are delighted that KCC will now begin to properly repair this sink hole so that it will not reoccur.”",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_local-government-responsibilities/content_12.html": "Different levels of local government work together to maintain and improve the local area. With each tier being distinct it can be confusing as to which level is responsible for what.\nThe following list provides an overview of the responsibilities of each level of our local government:\nLocal Parish Councils\nFor those areas with a Parish Council, their responsibilities are aligned with smaller local services such as allotments, parks, community centres and war memorials.\nMaidstone Borough Council (MBC)\nAreas responsible for:\n- Environmental Health\n- Housing\n- Leisure and Recreation\n- Local Taxation Collection\n- Planning Applications\n- Waste Collection\nYou can report common problems in your area including fly tipping, liter, dogs mess etc. directly to MBC on their reporting page.\nKent County Council (KCC)\nAreas responsible for:\n- Education\n- Highways\n- Libraries\n- Passenger Transport\n- Social Care\n- Strategic Planning\n- Transport and Transport Planning\n- Waste Disposal\nYou can report most highways problems directly to KCC including potholes, drainage, street signs on their reporting page.\nLocal Members of Parliament\nThe responsibilities of our local Members of Parliament are to represent local concerns in the House of Commons to the Government to ensure that the people of Maidstone are listened to as part of the running of this country.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_focus-archive_maidstone-central/content_43.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_lib-dems-to-lead-scrutiny/content_91.html": "Lib Dems To Lead Scrutiny\nThe committee's primary responsibilities are somewhat different from previous incarnations under the Council's previous Cabinet and Overview/Scrutiny System Pre-2014 as pre decision Scrutiny of proposals by the Cabinet will now be done by the new Policy Advisory Committees aligned to Cabinet Portfolio's. The new Committee will focus on undertaking major reviews of areas of the Council's work or other areas of significant public interest and holding the Cabinet to account for decisions via Post decision scrutiny. The Committee will continue in its role as the Council's Crime and Disorder Panel.\nThe new Committee will have a challenging role as it seeks to address some of the most pressing issues in the Borough but will strive to put the residents of Maidstone at the centre of all of its considerations.\nCllr English said: \"Whilst we would not have chosen to go back to the Cabinet System. There are some advantages in an Overview and Scrutiny Committee that is prepared to take its role seriously and work on a non-partisan basis to improve our Borough As Chairman I will seek to build a consensus for\naddressing some of the pressing issues facing Maidstone.\"\nAt the Committee's first meeting on Tuesday 21st a detailed and in-depth discussion by Councillors from all parties agreed to scope 4 areas to bring forward for inclusion in the work Programme for the year: Public safety and Enforcement, The Water Cycle (supply and disposal of), the Council's waste strategy and health inequality.:\nThis does not preclude additional items from being added through the year, but put a focus on those where most benefit to Borough residents could be achieved.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_water/content_59.html": "Water\nIt will not be news to anyone that Maidstone Borough is suffering major problems in many areas of the Borough with failing water supply infrastructure, inadequate sewage disposal, collapsing drains and sewers, and grossly polluted watercourses. Whilst the Liberal Democrats do not control Maidstone Council, we are using every lever we have at our disposal to address this issue, including supporting a water-cycle policy motion to the Full council meeting of 20th July and successfully proposing a more technical motion at Planning Committee on 21st July.\nThe Council's new Overview and Scrutiny Committee, chaired by Liberal Democrat Leader Clive English, has taken the issue of water supply and disposal to the top of the political agenda by proposing it as one of its main areas of inquiry this financial year and is aiming to use this very public process to make some much needed progress on infrastructure investment and cleaning up our rivers. Cllr. Clive English stated: \"Recent water pipe leaks, supply disruption and destructive pollution incidents have shown once again that our water utilities and their regulation are in need of urgent reform.\"",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk/content_1.html": "Geoff Samme Elected as County Councillor for Maidstone North East\nGeoff joins 11 other Lib Dems on KCC\nOn the 8th of December we released our vision for Maidstone Town Centre. To read more and have your say please visit our town centre strategy page.\nWe are happy to release our vision for protecting Maidstone's rural character. To read more please visit our protecting and restoring Maidstone Borough's rural character page.\nGeoff joins 11 other Lib Dems on KCC\nScheme hindered by requirement for mass-developments\nBringing forward new policies to protect our Landscape & Green spaces\nNew plans set to tackle local housing challenges\nFollowing a Defence Review, it was announced in 2016 that Invicta Park Barracks, home to the 36 Engineers Regiment and the King's Gurkha Engineers, would close in 2029.\nWe aim to make this development different by enabling delivery of high-quality green space, medical facilities and ensuring that local residents benefit from any new affordable accommodation.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_revised-scheme-for-former-royal-mail-sorting-office-approved/content_15.html": "Revised scheme for former Royal Mail Sorting Office approved\nDuring preparation of the current controversial Maidstone Local Plan Review under the previous Council the Sorting Office site was allocated up to 500 flats and commercial development.\nFollowing expressions of concern by local residents and councillors regarding quality-of-life issues, a scheme eventually came forward for 217 units, but this was still a cramped and poorly designed proposal with little useable green space. It was overwhelmingly rejected by the Planning Committee who sought big changes.\nSince then, the new Maidstone Council Cabinet took the whole scheme away and redesigned the proposal, removing the central tower block and inserting a large park (with space for trees, sport and play) at the centre of the site, and reducing the number of units down to 180. The Council is now negotiating with Homes England to secure affordable housing for local people and with the NHS to obtain much-needed town centre medical facilities.\nAt the most recent Planning Committee meeting the revised scheme was approved unanimously by the Committee.\nCllr. Tony Harwood Cabinet Member for Planning at Maidstone Council stated:\n\"I am under no illusions regarding the challenges arising from the trend towards high density housing in the town.\n\"We aim to make this development different by enabling delivery of high-quality green space, medical facilities and ensuring that local residents benefit from any new affordable accommodation\".",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_campaigns_become-a-street-champion/content_73.html": "Have you got what it takes to become a Street Champion?\nAre you fed up with the problems right on your doorstep? Would you like to help to get them fixed?\nAs councillors we are here to represent you and push to get these issues fixed for you. Most of us do a weekly \"Ward Walk\" where we will pick on part of our patch to record and report any issues we spot, including:\n- Reporting fly-tipping\n- Reporting potholes\n- Reporting faulty signs\n- Reporting overgrown vegetation\n- Reporting issues with litter bins\nAs well as anything else we spot. Since most of us hold full-time jobs to be able to cover every street in our Wards can take weeks!\nThis is where you can come in! Are you willing to become an extra set of eyes and ears for your local councillors and candidates? If we know about issue we can get them reported and chased, and the quicker we can get to work on it the quicker we can try to get it fixed.\nAs a Street Champion you’ll:\n- Get regular updates on progress on reported issues directly to your email.\n- Get to guide how we work to improve where you live.\nAs a Street Champion your details will never be shared to the public unless you choose to do so, but you'll become an invaluable reasource in improving the wellbeing of your community.\nSign-up to become a Street Champion\nWe will need your email address and telephone number to be able to contact you.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_towncentrestrategy/content_3.html": "Maidstone's Alternate Town Centre Vision\nTown Centres across the country face many challenges including the decline of traditional retail and office employment activities. Maidstone is no exception to this.\nIn the autumn of 2022 councillors, on the advice of MBC officers, voted to approve the commissioning of a Town Centre Strategy for Maidstone. It was to provide a plan to the year 2050 and build a thriving town centre for years beyond.\nDuring the formation of the official draft town centre strategy councillors across all parties, primarily those from town centre wards, were invited to provide feedback through a mixture of walks, user group meetings, and briefings. Despite providing in-depth feedback, as of the time of writing, no response to the feedback has been received.\nWhilst the draft strategy does have a number of beneficial points we do not believe what has been produced, so far, is a blueprint to rejuvenate our town centre. The delay in the release of this document, originally it was due to be available earlier this year, is understandable given the complexity, but frustrating. We strongly feel that it is critical that what is finally adopted be in the best interests of Maidstone.\nMaidstone has tended to focus on short-term economic gain without consideration for the wider environment, infrastructure, social concerns, and long-term sustainable growth. We feel that any strategy needs ambition, and must breathe life into our ailing town centre.\nThe Town does not make full use of its existing assets such as the rivers, its cultural attractions, and suffers under problems created by the lack of any form of sustainable transport policy. Maidstone deserves better.\nIn response we have produced this document, an alternative vision for Maidstone Town Centre. It builds on the work of previous discussions to look beyond and make Maidstone Town Centre a place that we can all be proud.\nWe are keen to receive feedback, both positive and negative. You may leave feedback on www.maidstonelibdems.co.uk/TownCentreStrategy/ or by emailing hello@maidstonelibdems.co.uk.\nMaidstone Liberal Democrats",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors_cllr-clive-english/content_24.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_in-council-august-23/content_47.html": "In Council August '23\nAugust traditionally is a light month for council meetings, with many councillors and officers away on their summer holidays it can be difficult to get the required numbers of people and business organised. This does not mean however that work stops, in our many Focus newsletters there is often a line “Working for you all year round”, and this is true. In this edition of In Council rather than talk about the two committee meetings this month (which can be read about: https://www.maidstonelibdems.co.uk/news/article/cabinet-decisions-scrutinised and https://www.maidstonelibdems.co.uk/news/article/update-on-proposed-newnham-court-aldi ), we’d like to take the time to talk about the other work we do for residents throughout the year.\nOur role as councillors both borough and county is not only to represent you in the official meetings, it is also to be there to help solve issues and look after our areas. This can be as simple as reporting and chasing the repair of potholes, litter, broken street lighting, etc. or it can be helping to push forward local improvements. The remainder of this update will be looking at some of the more interesting areas of work that your councillors have undertaken that whilst not necessarily newsworthy in themselves can give an insight into the types of work we do daily.\nCouncillor Clark gets his rock on\nWorking with North Loose Residents Association (NLRA), Cllr. Brian Clark helped with essential footpath maintenance by arranging for 15 tonnes of crushed rock to be made available. The footpath near Five Acre Wood School is used for access, but when it rains it can be impassable. Volunteers from the NLRA and Five Acre Wood School undertook the work, but were having difficulty getting the materials, Brian interceded with KCC and the work is now progressing.\nBrian Clark commented: “These efforts show how we all can play our part and work together, even in this time of cutbacks. A strong volunteer community effort, helped by materials that would otherwise be sitting in storage, has led to the best of outcomes. I’d like to pass on my thanks to the volunteers for their hard work.”\nMeeting with Maidstone Mosque\nCllr. Dinesh Khadka recently had a fruitful meeting with leaders from Maidstone Mosque to discuss issues the mosque was facing, but the opportunity the mosque brings for the local area and wider engagement.\nDinesh Khadka said: “It is great working with the local community. Those at Maidstone Mosque play a vital role within that part of our community and reaching out to wider parts of Maidstone. It is imperative to understand the challenges and I am extremely appreciative to get opportunities to meet like this so we can work for the betterment of Maidstone.”\nAnti-Social Behaviour is not on\nAs a group we take community safety and wellbeing extremely seriously, and work very closely with the officers at MBC and the police. One of the main routes of keeping up to date and feeding back is through the “Ward Cluster Meetings”, where under guidance we look to continually improve this aspect of Maidstone, for those of us in fulltime employment they can be tricky to attend (often rescheduling lunch breaks so we can make the meetings), however it is a point of pride in our group that where we represent we will have a presence in these meetings and help look after the wellbeing of our residents.\nCllr. Clive English leader of the Liberal Democrat Group on the council said: “Our aim is to ensure that the Council takes robust action to reassure residents and businesses that anti-social behaviour will not be tolerated. No matter what type of anti-social behaviour it is I am grateful to all of our group for their continued efforts of working with the council officers and the police to, through best practice methods, reduce undesired behaviours and make Maidstone feel like a safe and vibrant place.”\nOf course, sometimes issues are a little more urgent than scheduled meetings will allow as Cllr. Richard Conyard found out when helping residents of Union Street:\n“It certainly was one of the more interesting reports of anti-social behaviour to come my way, whist the individuals involved were carrying out the unfortunately typical: shouting, fighting, and smashing of glass and other people’s property; this must be the first case I’ve had where someone decided to repeatedly stop traffic raised their arms in a mock crucifixion style and proclaim to be Jesus. Whilst it was reported too late to catch the individuals in the act a big thank you needs to go to the council officers and police officers of the Town Centre Task Force for providing a presence to deter further issues and route of escalation should this occur again.”\nHayle Park keeps growing\nThose involved in Hayle Park will often see Cllrs. Paul Wilby, Derek Mortimer, and Brian Clark covered in mud and getting their hands dirty along with the other volunteers. They also have been working for many years now to secure Woodland at Mount Ararat. The lease has now been drawn up, and subject to final legal review this should now be added to the land managed by the trust removing the final barrier to obtaining Local Nature Reserve status with Natural England.\nPaul Wilby said: “Overcoming this, hopefully, last hurdle to gain Local Nature Reserve status is fantastic news not only for the park, but also for local residents and those that have discovered this jewel. Hayle Park is a wonderful asset to Maidstone and it’s a pleasure to be part of its workings.”\nOvercoming confusion\nLet’s face it, dealing with the many different parts of the council can be confusing, at times it even confuses the most veteran of us councillors. We are here to help though, and because often these issues can be personal our help is confidential. Across the year the most common area we have helped people and families navigate the complex processes of housing and council tax. Because the system must cater for the many varied circumstances of those needing to use it, understanding the best routes can be tricky, but it is something we’re here to help with.\nCllr Ashleigh Kimmance commented: “It is an unfortunate truth that those residents who are often in the most need are sometimes faced with the toughest of barriers to getting help because of the complexities of their often unique requirements, housing can be especially hard. It is because of the difficulty and the necessity that I find this area of my work some of the most fulfilling when successful because whilst it might only be one family at a time it has made a real difference.”\nLooking after local\nHopefully the above has provided further insight into the more interesting areas of councillor work that aren’t conducted in the council chambers. There still of course is the equally important, but even less newsworthy areas of:\n- Potholes\n- Litter bins\n- Fly-tipping\n- Graffiti\n- Overgrown vegetation\nAugust saw the launch of our Street Champion community initiative were we are inviting everyone to become a Street Champion so we can get to know you, the problems you face in your area so we can either solve them, or when larger start to solve them, and ask you to become an extra set of eyes and ears for us so we can do even more work on your behalf. The final word of this update therefore has to be a huge thank you to all the Street Champions that have already signed up, and if you haven’t and this update has whet your appetite you can find out more and sign-up here.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors_cllr-simon-wales/content_28.html": "Cllr. Simon Wales\nLoose and Linton Ward\nemail: SimonWales@Maidstone.gov.uk\nSimon was elected to represent Loose and Linton Ward in May 2024. He deals regularly with highways, planning, parking and other issues in the ward and attends both Loose and Linton Parish Councils. He is a trustee of the Linton Almshouses and of Citizens Advice Maidstone, and is on the committee of Making a Dementia Friendly Maidstone.\nHe is one of the eight cabinet members at Maidstone Borough Council - his portfolio being Housing and Homelessness. He sits on the Licensing Committee, and has chaired licensing hearings. He is also Chair of the Cobtree Manor Estate Charity Committee and is also an active member of the Maidstone Beauvais Twinning Association where his degree in modern languages has been useful!.\nHe is a volunteer guide for the National Trust at both Stoneacre and Sissinghurst Castle Garden.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_single-use-vape-ban-welcomed/content_60.html": "Single use vape ban welcomed\nLocal Lib Dem health and environment campaigner Councillor Tony Harwood has welcomed the Government's announcement that disposable vapes are to be banned. This long overdue decision follows his more than two years of national and local campaigning (including a petition to Parliament) on the harm this technology inflicts on young people and the environment. Tony was one of the first in the UK to air concerns that disposable vapes are enabling nicotine addiction across a whole new generation of young people, while contaminating our environment with 5 million+ disposable vapes each week! The presence of so many vape shops in the County Town and number of discarded disposable vapes littering our streets and green spaces betray the scale of the problem.\nTony states: \"I only wish Government had acted sooner, when the addiction and single use plastic waste problems caused by disposable vapes became obvious in local communities. Continuing:\" It was obvious that the cosseted 'Westminster bubble' simply had no idea what was going on in the real world.\"",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_in-council-october-23/content_53.html": "In Council October '23\nAfter various contentious issues in September the chamber in October returned to normal day-to-day business. The issue of Oaken Wood is back with KCC, requested changes to the Biodiversity and Climate Change plan are with MBC officers to make and were not expected to be released, and despite an all councillor briefing on the Town Centre Strategy in September this has been delayed whilst changes are being made after a reaction that could be most kindly described as tepid.\nCommunities, Leisure, and Arts October 3rd\nThe running of Maidstone Leisure Centre, Mote Park Outdoor Adventure, and Lockmeadow Health Club was the primary business of this committee. Since no agreement had been reached with the current operator on an extension to their contract this will now be going out to competitive tender for operations after August 2024.\nPlanning, Infrastructure and Economic Development October 4th\nAfter the controversy of recent PIED PAC meetings Octobers was in comparison sedate. The only points of note being a response to the Governments proposals for reforming plan making and an official response to Medway Unitary Authority’s local plan. Whilst the detail of their local plan is presently being worked upon councillors advised that the approach to say that we look forward to working closely with them especially in the areas of joint infrastructure and where we border.\nHousing, Health and the Environment October 10th and October 30th\nThe HHE PAC had two relatively short meetings in October. The first on the 10th dealt with a recent motion about replacement bins which coincided with the policy being changed after frank exchanges from councillors, additional housing purchases for the 1,000 affordable homes policy and the adoption of the Air Quality Action Plan. Since time is required to gather information about replacement bins following the policy change a report should be made available after January, the purchasing of additional affordable housing was approved, and Air Quality Action Plan was adopted.\nThe meeting on the 30th perhaps holds the record for the shortest meeting at 11 minutes despite being a potentially thorny issue. Granada House at the bottom of Gabriels Hill is presently in the process of being renovated to ensure it is up to regulation. However, no contractor could be found to deliver the next stage of the project within the allocated budget, or even close to it. If this were funded directly by Maidstone taxpayers this would have been a huge issue leading to some very difficult budget decisions.\nThe work however is being funded by central government from the Local Authority Housing Fund due to expire next year, and with the original budget seemingly unrealistic the same fund would cover the difference. Cllr. Conyard managed to ask the first question to cut to the heart of the matter:\n“Would the requested increase in funds negatively impact any other council projects or applications to the fund?”\nWith the answer being a very definite no the matter swiftly moved to a vote to approve.\nCorporate Services October 11th\nAlthough the main item on the agenda for the Corporate Services Policy Advisory Committee was rubber stamping the suggested renewal of the Council Tax reduction scheme this was not the main topic of discussion. Since the 12th of July members of this committee have made clear that the Biodiversity and Climate Change plan from the council was not good enough, it contains many worthwhile schemes, but no clear path to deliver them. Members of the committee were promised by the cabinet member responsible that an update report with a clear path would be created and released at the next scheduled meeting in November.\nOverview and Scrutiny October 17th\nScrutiny this month started to investigate Environmental and Waste Crime Enforcement. This is ongoing work and whilst further information has been requested for the next meeting it is too soon to make any considered suggestions on improvement. Crime of this nature is something that all councillors take seriously, and members are looking forward to being able to make firm suggestions to improve this area for everyone.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_where-is-the-political-leadership-as-kent-drowns-in-a-tide-of-stinking-sewage/content_69.html": "Where Is The Political Leadership As Kent Drowns In A Tide Of Stinking Sewage?\nLast October Maidstone's hapless MPs Helen Grant and Helen Whately voted down an amendment to the Environment Bill that would have stopped the dumping of sewage into rivers and coastal waters. Many of the Parliamentary supporters of continued sewage dumping by the water companies cited cost as their justification for putting profit before the health of our environment.\nThis financial excuse has now been blown out of the sewage-filled water by new data from River Action UK showing how the 22 water company bosses paid themselves £24.8 million in 2021/22. Average water company executive salaries and bonuses rose by 21% between 2020/21 and 2021/22.\nThe monopolised private water company business-model is clearly not designed to further the national interest, but rather to enrich their shareholders who laughed all the way to the bank with dividends of £72 billion between 1991 and 2019 (source: Financial Times). Meanwhile, not a single new reservoir has been built in thirty years and drinking water leakage rates stand at 20% (the equivalent figure in Germany is just 5%).\nLocal Conservative-run councils are also to blame for the stinking tide of filth blighting Kent's beaches, rivers and even local roads and footways. Lack of investment in Kent Highways drainage infrastructure means that clean rainwater runs straight into sewers increasing flow rates by some 30 times, causing them to overload and discharge sewage into the environment.\nLocal planners are equally part of the problem by prioritising delivery of new housing over critical infrastructures and allowing developers to connect into already overloaded sewerage networks.\nEnlightened forward-thinking local highways drainage and planning policies are urgently needed if Kent's watercourses and beaches are to be saved from the deluge of raw sewage and resultant toxic algal blooms - which will only increase as climate change bites and the Conservative Government's 'build build build' dogma prevails. Sadly, Maidstone Council's draft Local Plan is pathetically weak on environmental protection.\nLeader of MBC Liberal Democrat Group Cllr. Clive English states: \"The stench of sewage has become the norm in many parts of the County Town, while the quality of the town centre stretch of the River Len has declined disastrously in recent years.\" He continues: \"All those organisations and agencies with influence over water policy must be brought together to deliver the investment and action that is so desperately needed\"",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors/content_25.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_update-on-campaign-to-protect-invicta-barracks/content_49.html": "Update On Campaign To Protect Invicta Barracks\nAs we enter a New Year we write to provide an update on our campaign to protect sylvan and historic parkland at Invicta Barracks from plans to asset strip the land for High-density housing and associated infrastructure.\nA significant change is the recent Government announcement that the military will not now vacate the site until 2029 - rather than 2027 as previously indicated. Based on this new situation North Ward's Lib Dem Councillors have formally asked on a technical 'deliverability' point that the site be removed from the Maidstone Borough Council Local Plan Review, which only runs up to 2031. Simultaneously, we have challenged at the highest level the unrealistic 1,300 unit housing yield sought for Invicta Barracks. Indeed, we thank all those residents who have supported this campaign by writing so powerfully to Maidstone Council as part of their Regulation 19 Local Plan Review consultation.\nFinally, the Ministry of Defence / Maidstone Borough Council development plans are so clearly unsustainable from historic, cultural, landscape and biodiversity perspectives that we have:\n• Applied to Historic England seeking listing of land surrounding the Grade II* Listed Park House as a nationally protected 'Historic Park and Garden'.\n• Asked the Government's wildlife watchdog Natural England to ensure that the significance of the Barracks site for wildlife is documented and taken into account in any plans.\n• Submitted a formal request to Maidstone Council that all trees and woodland on the site be plotted and those meeting the relevant criteria be legally protected by Tree Preservation Orders.\nYou can listen to the Kent Online podcast by on this page, the item starts at 9.57.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_campaigns_protecting-and-restoring-maidstone-boroughs-rural-character/content_8.html": "Protecting and Restoring Maidstone Borough’s Rural Character\nTo promote the preservation, restoration and re-creation of the rural nature of Maidstone Borough ensuring the future of the borough as a green and pleasant space and to support rural communities.\nThe Local Plan Review has drawn to a close. The objections to parts of the scheme have been raised, and unfortunately have not resulted in any amendments. This document seeks to look at parts of the Borough assess the existing protections and what further protections could be investigated, and what mitigation could be put in place before the Local Plan is reviewed again.\nBelow is a document that explores some of the protections that are already in place across the borough and ideas on three types of schemes we would look to implement to protect and restore Maidstone Borough's rural character.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_page-6/content_74.html": "Maidstone Liberal Democrats launch new community initiative\nDo you have what it takes to become a Street Champion?\nDo you have what it takes to become a Street Champion?\nWater quality improved after consistent campaigning.\nFind out a little about what your Lib Dem councillors have been up to in July\nConservative and Greens reject an ambitious Lib Dem proposal to heal the River Len\nAfter a hard-fought campaign and a nail-biting conclusion Maidstone Liberal Democrats are happy to introduce Kent County Council’s newest councillor Chris Passmore for the Maidstone Central Division.\nFind out a little about what your Lib Dem councillors have been doing in June.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_council-and-health-bosses-apologise-for-continued-failure-to-meet-the-needs-of-send-children-in-kent/content_62.html": "Council and health bosses apologise for continued failure to meet the needs of SEND children in Kent\nFollowing an inspection by the Office for Standards in Education (Ofsted) and the Care Quality Commission (CQC) in 2019 nine areas of weakness were identified.\nA written statement was submitted by KCC and NHS Kent and Medway as the accountable authorities which promised swift actions and that a new strategy would be implemented to improve support for children and young people with SEND and regain the trust of parents, carers and families.\nHowever, a follow up visit by Ofsted and CQC in September 2022 found that the local area has ‘not made sufficient progress’ in addressing the weaknesses previously identified.\nBetween 27 and 29 September inspectors spoke with children and young people with SEND, parents and carers, representatives from the parent/carer forum Parents and Carers Together (PACT), school leaders representing educational provision across the area and local authority and NHS staff.\nThey examined a range of information about the performance of the area in addressing the nine significant weaknesses identified during the initial 2019 inspection, including the area’s repositioning statement and self-evaluation.\nThe report found that the local area had not made sufficient progress in addressing the areas first identified in the 2019 report.\nKCC and NHS Kent and Medway are immediately implementing an Accelerated Progress Plan, focussing on key areas to rapidly address the significant problems identified by the inspectors.\n- New leadership - A new Corporate Director for our Children, Young People and Education service. Sarah Hammond is now in post and has an excellent record as Director of our Integrated Children’s Services, which this year have been judged by Ofsted as ‘outstanding’. We also have strong and collaborative leadership being undertaken within Kent’s schools, led by Christine McInnes, KCC’s Director of Education.\n- Renewed commitment to focus on the child – KCC had already recognised deficiencies in some of its processes and instigated a redesign to the way the service operates so that children, young people and their families are more involved in the decisions made about their support, and that they receive more timely interventions. We need to refocus our approach on children and specifically on the rights of the child, ensuring that they are provided with the education they need in a setting that is appropriate for each individual, preferably in their home community.\n- Improved parent experience - KCC will strive to provide a better experience for parents when they contact us, with the creation of a central new SEND enquiries hub next year. A single phone number and email address will provide a streamlined contact process, allowing the team to answer questions and provide updates for parents and for schools and settings more efficiently. Our current recruitment drive in SEND will see more permanent and experienced staff joining the team. A focus on experience of SEND either as a parent/carer or as a young person is key. KCC is also working on ways to provide more proactive communication both to parents who are requesting or have an assessment for an education, health and care plan (EHCP), and to those transferring to the next stage in their education. Jointly, KCC and NHS Kent and Medway will continue to work closely with Kent PACT, while also reaching out to other family forums to make sure we listen to as many parents and carers across Kent as possible.\n- Strengthening SEND provision in mainstream schools – Every child has the right to be educated in their local community and be welcomed in mainstream settings where this is in their best interests, and we are building on the work already underway to support schools and settings to improve and build on their inclusive practice. This includes providing access to further training and development and supporting settings with techniques and resources they can use in class to be able to better support children and young people with SEND.\nDame Eileen Sills, the recently appointed Chief Nurse of the NHS Kent and Medway Integrated Care Board said: “We are truly sorry that the NHS continues to fail too many children and young people with special educational needs and disabilities in Kent.\n“We can also understand the frustration and anger felt by parents, carers and families in Kent revealed by this report. Many of the stories are heart-breaking. It should not be so hard to get the help needed especially as we know the Covid pandemic has already put additional pressures on people’s mental health.\n“Our staff have worked hard to make improvements and they are disappointed and frustrated that this hasn’t made it better for children and families.\n“As a new organisation we promise we will listen to the voices of parents, carers and families and then take action, with our partners in Kent County Council and the voluntary and community sector, to make the necessary improvements so children with special educational needs and disabilities get the support from the NHS they need to thrive.”",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_in-council-may-23/content_77.html": "In Council - May '23\nMay saw local elections in Maidstone, new councillors returned and a new Mayor. With the changes in the council this saw very little business done committee meetings, but rather the administrative side of setting councillors to sit on which committees and who will act as chairman and vice-chairman on those committees.\nMay 23rd saw most councillors attend ten back-to-back committee meetings selecting chairs and vice-chairs. The Conservatives and the Independent Group councillors voted to ensure that apart from the protected chairmanship of the Overview and Scrutiny Committee that the leader of the opposition (our Cllr. Clive English), all other positions handed to either Conservative or Independent councillors. Councillor English said after the meeting:\n“At the elections, the public voted to remove the Conservative’s majority. Consequently the Liberal Democrats, Labour and the Green Independent Alliance suggested that the committee chairs be shared on a proportionate basis among all the parties, including the Conservatives.”\n“This was rejected and the Independents voted with the Conservatives to freeze out everyone else. This has led to a situation where one single Independent councillor (Cllr Munford) is vice chairman of three committees, so keen were these two groups to monopolise the roles for themselves.”\n“This is profoundly unhealthy for democracy and unwise in principle and practice to try to run a hung council as if it were one with a majority administration voted in by the public, and to exclude a wide range of other viewpoints.”\nMore can be read on Kent Online: https://www.kentonline.co.uk/maidstone/news/it-s-a-stitch-up-tories-and-independents-accused-of-free-287697/\nTony Harwood and Clive English attended the 2nd stage examination of the Local Plan Review to put the case against a number of specific allocations, including Lidsing and to speak on a number of general policy issues including highways and, the lack of affordable housing. Further written comments have been made on several other issues including the allocation at Invicta barracks, which we continue to believe allocates far too much housing for the site.\nFurther submissions have been made to Maidstone Borough Council (MBC), regarding the draft Design and Sustainability plan. Specifically, the suggestions concern the subdivision of houses often to form HMO’s, in often very unsuitable road where there is insufficient or no parking.\nWith Kent County Council (KCC), looking to make savings by closing or reducing services Tovil Tip has come under threat. Councillors across the group have been making their feelings known in the press and have set-up a petition to stop KCC causing an explosion of fly-tipping by closing the service at Tovil. More can be read about this: https://www.maidstonelibdems.co.uk/news/article/lib-dems-fight-to-save-tovil-tip\nMay also saw various bus routes scheduled for closure or reduction in service. Cllr. Richard Conyard contacted the Commercial Director of Arriva UK to see if a solution could be found specifically for the cancelled 55 route to Ringlestone. Whilst unfortunately unsuccessful Richard has put forward a proposal that public transport and the decreasing levels of service be addressed by the Overview and Scrutiny Committee (decision to be made 20th of June).",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news/content_20.html": "Geoff Samme Elected as County Councillor for Maidstone North East\nGeoff joins 11 other Lib Dems on KCC\nGeoff joins 11 other Lib Dems on KCC\nScheme hindered by requirement for mass-developments\nBringing forward new policies to protect our Landscape & Green spaces\nNew plans set to tackle local housing challenges\nFollowing a Defence Review, it was announced in 2016 that Invicta Park Barracks, home to the 36 Engineers Regiment and the King's Gurkha Engineers, would close in 2029.\nWe aim to make this development different by enabling delivery of high-quality green space, medical facilities and ensuring that local residents benefit from any new affordable accommodation.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_focus-archive_north-ward-focus-september-2023/content_16.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors_cllr-joe-higson/content_17.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors_cllr-rob-field/content_34.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_contact/content_13.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_cabinet-member-goes-against-advice/content_48.html": "Cabinet member goes against advice\nWednesday evening saw Maidstone Council’s Planning, Infrastructure and Economic Development committee meet to discuss amongst other items Maidstone Borough Council’s formal response to KCC regarding the expansion of Hermitage Lane Quarry. Councillors were met by protesters as they arrived for the meeting campaigning against expansion of the quarry, and the weak draft response proposed by MBC and signed by Cllr. Paul Cooper (Conservative, Shepway North Ward, and Deputy Leader of the Council).\nThe meeting was a little more raucous than usual due to the passion felt about saving Oaken Wood. After several excellent speeches from the members of the Save Oaken Wood campaign and considered and well researched representations from visiting members Cllr. Tony Harwood (Lib Dem, North Ward), and Cllr. Stuart Jeffery (Green, Bridge Ward), arguing against expansion of the quarry the committee proceeded with lengthy discussions.\nMost opposition members spoke against the expansion and supporting the views of the 25,000 plus people who had signed the Woodland Trust petition, including Lib Dem councillors Clive English and Richard Conyard. Before Vanessa Jones (Independent, Boxley Ward), brought forward the motion that the weak response be retracted and replaced with text in alignment with the response made by the Woodland Trust which succeeded by a vote of 7 to 2.\nThis Friday (8th September), Cllr. Paul Cooper has issued an amended letter to KCC that runs contrary to the proposal voted through, is little stronger than the first, and falls someway short of the more robust responses from other bodies including the Woodland Trust and Forestry Commission.\nCllr. Richard Conyard said: “I am bitterly disappointed in this decision. Not only does this go against the opinions of thousands of residents in Maidstone, the members of Save Oaken Wood who took time out to let us know their valuable opinions, but it makes a mockery of the advisory committee who after hours of reading and debate and a clear majority vote find that vote completely ignored. My sympathies are with the campaigners who thought they had a glimmer of hope only to have it snatched away by those clearly out of touch with the public, opposition councillors and even some members of their own party.”\nCllr. Clive English commented: “The Cabinet Member still seems to think one can simply replace ancient woodland after quarrying takes place. Sadly, for everyone this is not the case, once the damage is done it is done.\"\nHe went on to say: \"There is a worrying pattern emerging of the advisory committees taking considerable time to debate issues and make recommendations only for the Cabinet to ignore them and to throw the Committee's advice straight in the waste basket, as seen recently with the Cabinet decision not to fund works at Linton Crossroads. The Cabinet system will not survive if this continues, as it was this arrogant refusal to listen to anyone else that brought it down in discredit in 2014.”",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_donate/content_21.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the window\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_protecting-our-countryside-from-development/content_14.html": "Protecting our Countryside from Development\nLiberal Democrats voted against the controversial Local Plan for housing that the Conservatives pushed through to adoption just before the last MBC Elections. We voted against the plan because it chose to build on some very sensitive locations but also because we knew it might fall apart very quickly after adoption. Now it has begun to do so, and the Conservatives are clearly looking to avoid taking the blame.\nSadly, Conservatives have placed most of the development in a small number of highly controversial, major sites. These not only take much longer to deliver than smaller more dispersed sites, but face the risk not being delivered at all. Included are the Invicta Barracks which the MoD have given no assurances that they will vacate, Heathlands, where major national level infrastructure, beyond the control of the borough, is required ahead of development and Lidsing, a sensitive and highly controversial allocated site at the edge of the borough.\nAs a result, the council now faces the risk of losing its 5-year housing supply not being able to deliver houses quickly enough to meet government targets. This will lead to more sites being required to meet the shortfall in housing delivery\nAs we have learned from experience, it will certainly make it harder to turn down development, where applications refused by Maidstone have been approved at appeal by the government to compensate for the lack of 5-year housing supply (the so-called “Developer’s Charter”)\nWe are trying to mitigate this damage inflicted on us by the last Conservative administration by bringing forward new policies to protect the Landscape and our Green spaces which is now at heightened risk, including a major initiative to protect the Greensand Ridge to the South of the Town.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_article_invicta-park-barracks-development-update/content_11.html": "Invicta Park Barracks – development update\nFollowing a Defence Review, it was announced in 2016 that Invicta Park Barracks, home to the 36 Engineers Regiment and the King's Gurkha Engineers, would close in 2029.\nThe Government made clear an intention to redevelop this historic site for housing and Maidstone Borough Council subsequently allocated the Barracks for at least 1,300 new homes and a secondary school within their 2024 Local Plan Review document.\nYour local Liberal Democrat councillors gave evidence at the Hearings for the Local Plan Review, where they gave powerful evidence on the historic significance of the parkland and Park House. They also emphasised the profound natural beauty and wildlife importance of its surviving sylvan parkland and woodland to the Hearing Inspector and the Government’s wildlife watchdog, Natural England. The site’s associations with Tudor monarchs, the celebrated Lushington family and poet laureate Alfred Lord Tennyson, alongside the environmental sensitivity of the parkland, makes Invicta Park Barracks a very challenging proposition for any development, let alone for a massive1.300 new homes and a school.\nThis allocation, together with even larger strategic developments at Lidsing and in Lenham Heath, were forced over the line at the tail-end of the last administration at Maidstone Borough Council, just before they were swept from power in the May 2024 local elections.\nIn recognition of the very special nature of Invicta Park Barracks, the new administration established an influential stakeholders steering group, which is tasked with drafting a Supplementary Planning Document (SPD) that addresses all of the sensitivities associated with this historic, wildlife-rich parkland site. The new Maidstone Council Cabinet Member for Planning Policy and Management has also ensured that Tree Preservation Orders will be implemented following detailed survey work.\nThe first meetings of the steering group have now been held, including a site tour, and briefings from the Defence Infrastructure Organisation and other key stakeholders. It is hoped that the Supplementary Planning Document can be completed in the next six months to “lock-in” long-term protection for the historic and natural wonders of this site and ensure the highest quality for any new development – whatever the future holds for local government in Kent.\nYour local borough and county councillors all sit on the new steering group, and we will report back regularly on progress.\nLiberal Democrat County Councillor Ian Chittenden commented:\n\"North Maidstone's elected councillors have fought long and hard to save the barracks and protect its historic parkland and wildlife.\n“We accept that the Local Plan Review means that we will have to accept some development, but the Supplementary Planning Document provides an opportunity to protect and enhance the best features of the site including the Grade II* Listed Park House, walled garden and extensive areas of wood pasture and woodland.”",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_maidstone_maidstone-borough-councillors_cllr-mark-naghi/content_6.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maidstonelibdems_co_uk_/https_www_maidstonelibdems_co_uk_news_page-7/content_76.html": "Consultation on Kent Mineral site plan – Hermitage Quarry\nAs part of Kent County Councils ongoing update of the Kent Minerals and Waste Plan, a number of changes are out to consultation.\nAs part of Kent County Councils ongoing update of the Kent Minerals and Waste Plan, a number of changes are out to consultation.\nThe bus company Arriva will on 24 July withdraw the services they consider no longer financially viable following the £2.2m pa reduction in support for local bus services by the KCC Conservative Executive.\nNatural England has approved three new nature reserves for Maidstone at Allington Millennium Green, Fant and the combined site of Weavering Heath, Five Acre and Wents Wood.\nFind out a little about what your Lib Dem councillors have been up to in May.\nLib Dems Fight to save Tovil Household Waste and Recycling Centre from Tory Cull\nLib Dem Councillor Brian Clark starts an unusual hobby!"
}