{
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_iffley-road/content_46.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_john-skinner-election-result-and-press-release/content_2.html": "Press release from One St Mary's\n- petermcioxford\n- May 6, 2022\n- 3 min read\nUpdated: May 7, 2022\nThe campaign for a socially just and truly green policy of reducing pollution in our streets without carving up our communities will continue.\nJohn Skinner from a standing starting and with a small team behind him came a highly creditable third in the Oxford City Council election on May 5 with well over 400 votes. The seat was won by the Greens with Labour in second. The full result was Emily Kerr (Green) 893 votes, Mustafa Barcho (Lab) 574 John Skinner (Independent) 435 and Josie Procter (Lib Dems) 70.\nJohn gained 22% of the 1,972 votes cast in a result which saw none of the candidates achieve an overall majority, and neither Greens nor Labour willing to address the LTN issue in their campaigns. It is clear that the community remains divided over roads policy. The St Mary’s result reflected a strong showing by Independents across the city, and the re-election of Independent Saj Malik in Temple Cowley ward.\nAfter the poll John Skinner thanked all those who had voted for him and those who had worked to challenge two big party machines. He issued the following statement:\n\"We are proud of our campaign – as the only people to have addressed the issue of LTNs openly in this election. Although roads are a county matter, the city council has had a huge influence on the introduction of road barriers and the policy has been smuggled in with minimal public debate and in defiance of public feedback.\nThe introduction of the LTNs in East Oxford was purposely delayed until just after the election so that people would vote blind without experiencing the chaos that will follow. The Greens avoided all mention of LTNs in their election materials while Labour implied that they are in favour of a rethink.\nThis is supposed to be a trial – but it has no baseline and no stated aims and therefore no way to judge success or failure except for shouting on social media and selective interviews. We will see the reality in misery for many and increased pollution.\nThe people who lose most are those with the least influence in the city.\n- They live on the major roads where the traffic will increase pollution and so increase danger to their health and wellbeing.\n- They ride on the buses that will be delayed by traffic jams.\n- They drive from outside the city to work in our NHS and schools and to keep the city running.\n- They are small businesses who provide services to our homes and communities.\n- They have no vote because they cannot afford to live here.\nMeanwhile some who have cars in East Oxford and drive where other people live see no problem in voting to keep ‘outsiders’ from ‘their’ roads.\nLTNs do not discriminate between those who need to drive and those who don’t. They exclude people based only on where they live. They discriminate against elderly and disabled people and carers.\nThe bus gates the county is now planning will complete the process of dividing our city into separate isolated enclaves. We believe the Quickways being introduced on our major roads will increase danger for cyclists and encourage speeding. The county and city will waste millions on these schemes and the schemes will fail. At that point, the city will blame the county; the county will blame the city and the parties now in coalition will blame each other.\nReducing pollution and unnecessary car use means engaging with those who drive cars – not treating them as enemies or rats. Our campaign for a socially just and truly green policy of reducing pollution will continue.\"\n(Pictures: Peter McIntyre)",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_notes-from-your-doorstep-green-party-identikit-leaflets/content_30.html": "Notes from Your Doorstep\n- skinnerje\n- Apr 1, 2022\n- 1 min read\nAnthony Cheke spotted these identikit leaflets from the Green Party.\nJohn Skinner: \"It's interesting to note the robotic copying of their statements and their unwillingness to mention or defend their LTN policy.\"\nRead Anthony's post on Nextdoor: https://bit.ly/3988UbW\nVote John Skinner, Independent\n@onestmarys",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_bus-gates-oxford/content_14.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed/content_23.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nLTNs prove a barrier too far for much loved East Oxford hardware store, Silvester's\nMuch loved East Oxford store Silvester's is to close as the barriers blocking roads across East Oxford have pushed it over the edge\npetermcioxford\nMay 27, 20223 min read\n174 views\nA call to pause LTNs and Quickways\nPausing schemes while consultations are undertaken is a way to bring the community back together, given the strength of local feeling.\npetermcioxford\nMay 17, 20222 min read\n51 views\nPress release from One St Mary's\nThe campaign continues for a socially just and truly green policy of reducing pollution in our streets without carving up our communities.\npetermcioxford\nMay 6, 20223 min read\n161 views\nLast minute appeal to stop LTNs in East Oxford\nLast minute appeals were made at a street meeting this week to stop the LTNs being introduced in East Oxford.\npetermcioxford\nMay 3, 20221 min read\n83 views\nLTNs drive up emissions per journey\nCheck out these everyday scenarios and see how CO2 emissions will increase after the introduction of ltns and busgates.\nSarah\nApr 29, 20222 min read\n360 views\nBus Gates and LTNs to divide and gridlock our city\nWhat you need to know about plans for bus gates and LTNs with a map illustrating how they will divide and gridlock Oxford.\nskinnerje\nApr 26, 20221 min read\n915 views\nUnintended consequences: will East Oxford LTNs make streets less safe?\nIt is wise to consider the unintended consequences of traffic schemes. Impacts of East Oxford LTNs that planners have failed to foresee.\npetermcioxford\nApr 26, 20223 min read\n167 views\nNoe from Your Doorstep - Sunday 20t February\nbottom of page",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_registertovote/content_33.html": "Register to Vote!\n- Lise Bosher\n- Mar 2, 2022\n- 1 min read\nUpdated: Apr 1, 2022\nTo be able to vote in the local elections on 5th May 2022, you must register online, or on a paper form, to the Elections Office, by midnight Thursday 14th April 2022.\nFor a postal vote apply by 5pm on Tuesday 19th April 2022, or for a proxy (someone to vote for you) apply by 5pm on Tuesday 26th April 2022. In both cases the Elections Office require a paper form.\nYou can vote if you're registered to vote, 18 years or over, and a British, Irish or European Union citizen, or a Commonwealth citizen who has leave to enter or remain in the UK, or who does not require such leave.\nNo fixed address? You can still register to vote by declaring a local connection.\nIn hospital? You can still register to vote using your home address.\nRegister online: https://www.gov.uk/register-to-vote\nOr from Elections Office, Telephone: 01865 249811\nElections Office: Elections Team, Town Hall, St Aldate's, Oxford, OX1 1BX\nEmail: elections@oxford.gov.uk",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_categories_the-ltn-story-so-far/content_20.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_unintended_consequences-will_eastoxford_ltns_make_streets_less_safe/content_21.html": "Unintended consequences: will East Oxford LTNs make streets less safe?\n- petermcioxford\n- Apr 26, 2022\n- 3 min read\nIt is wise to consider the unintended consequences of traffic schemes. East Oxford LTNs have been introduced without proper consultation and we explore impacts the planners have failed to foresee.\nThere is a charming picture of Magdalen Road on a now expired website about Low Traffic Neighbourhoods (LTNs) that shows it as an architect’s dream – people sipping lattes outside the Rusty Bicycle, wide pavements and no cars! No bicycles either for that matter or even any walkers (active travel has been suspended!). Trees drawn in this picture are smaller than the real trees that exist on Magdalen Road today.\nThis was how the LTNs were being sold in Oxford back in 2019/20 in a discussion to a small charmed circle of supporters.\nIt illustrates the gulf between the PR campaign and the grimier reality. There will still be cars parked on Magdalen Road and some of these side roads will experience an increase in passing traffic – including large delivery lorries diverted to navigate their way past a nursery school.\nLook at the map and consider a delivery lorry coming into this end of St Mary’s area from the Iffley Road. It will enter either Magdalen Road or Howard Street, both will be two way traffic – with parked cars, two motor traffic flows and bicycles (and scooters).\nHaving made its drop where does the delivery lorry go?\nIf it came up Howard Street it will turn left into Golden Road then Hertford Street, drive past Comper Foundation School and Nursery, and return to Iffley Road via Magdalen Road. If it enters via Magdalen Road it will turn right into Hertford Street (also passing the nursery) and return down Howard Street.\nAbove: Barriers will force traffic coming up Magdalen Road to turn right into Hertford Street past this tree. How long will the tree survive turns being made by large delivery vehicles? Chicanes, barriers and two way traffic will make this anything but a ‘quietway’.\nAbove: Comper Foundation School – will become a through route for diverted traffic. The best schemes protect schools – this one actively channels traffic past it.\nCatherine Street, Percy Street and Charles Street will also be affected if traffic gets caught up and people start looking for a way out, and by lorries trying to navigate unsuitable turns. U-turns are impossible on either Magdalen Road or Howard Street.\nHurst Street and St Mary’s Road are also vulnerable to new streams of traffic. These roads are currently relatively quiet but narrowed by parked cars on either side. Under the new plan anything that enters from Iffley Road via James Street or Bullingdon Road can pass down Hurst Street and leave by Magdalen Road or wiggle through to Howard Street. Anything entering from Cowley Road can make a similar manoeuvre down St Mary’s Road. Some traffic may do this just to try to bypass jams on the major roads.\nThe scheme is sold to people living in St Mary’s as making these streets quiet (even if it pollutes Cowley Road and Iffley Road) but that may turn out to be a fiction.\nAnd remember that these streets are also being advertised as “quietways” for cyclists. The likelihood is they will become less quiet and less safe for cyclists than they are now.\nPictures above show Howard Street and Magdalen Road. There are no turning places and the chicanes, parked cars and the speed bumps make safe two-way traffic difficult to envisage. These pictures were taken on a weekday morning between 7 and 8 am before LTNs. Note the lack of traffic.\nWhat is true on this side of Iffley Road may also be true on the other side. Will traffic try to avoid queues on Iffley Road by using Parker Street, Warwick Street and Stratford Street?\nIt is wise to consider the unintended consequences of traffic schemes. This scheme has been introduced without proper consultation and with impacts the planners fail to foresee. In an age of supermarket and internet deliveries, and bin lorries forced into reversing (e.g. Leopold St & Crown St), it is highly unlikely that the PR sales pitch of an area with no traffic will be achieved.\nVote John Skinner, Independent\n@onestmarys",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_anneliese-dodds/content_38.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_are-east-oxford-ltns-really-a-trial/content_12.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_greater-emissions/content_54.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_quickways-danger-for-cyclists/content_52.html": "Quickways bring added dangers to East Oxford\n- petermcioxford\n- Apr 1, 2022\n- 2 min read\nQUICKWAYS - ultra-wide cycle lanes on major routes in East Oxford – are presented as a way to make cyclists feel safer and more confident and therefore increase the number of people who cycle. Is this true? Or will the Quickways actually increase dangers for cyclists, pedestrians and (even) for motorists.\nStep one: barriers block all motor traffic from passing through East Oxford side streets\nThis sends all of this traffic onto Cowley Road, Iffley Road and St Clement’s and a huge amount of extra traffic around the Plain, accepted as one of the most dangerous places in the city for cyclists.\nStep two: the council creates Quickways on the same roads they have just filled with traffic.\nThis forces cars, vans, buses and lorries to compete for space on narrower roads, divided from cyclists by nothing more substantial than a white line or other marking.\nStep three: Quickways encourage speed\nAccording to the Country Council’s own website Quickways encourage speed; not safe cycling. They will have a “design speed of up to 20mph … to provide a direct faster route into the centre and are generally used by more confident cyclists.”\nLess confident cyclists are recommended to use “Quietways” which are simply side roads which do not go to the city centre and have a signpost but no safety measures. Side streets will still experience traffic from people who live there plus all the vans and lorries doing deliveries etc. many of whom will be stressed because of the convoluted routes and difficult turns they have to make.\nOne of the (loaded) County Council consultation questions was about the safety of an 8 year old on a bike. No parent could feel that an 8-year-old child would be safe cycling through these streets alone before or after an LTN. The narrow streets are not easy either for nervous cyclists since bicycles and cars have to navigate their way around each other when they meet.\nOn Quickways a nervous cyclist will share the lane with cyclists going at top speed, electric scooters and electric bicycles, alongside stressed drivers, who may be forced into the cycle lane to avoid head on collisions. There will be no extra crossing points for pedestrians and (so far at least) no safer path through The Plain. There will probably be vans and lorries unloading in the lane because – where else can they go?\nSo what do we need?\nMost cycling safety experts recommend physically separating cyclists and cars by something more substantial than a painted line. But the Quickways –as with so many of Oxford’s traffic plans – appear to have been designed mainly for lycra clad cyclists – certainly not for nervous cyclists, pedestrians or drivers.\n20mph speed limits and advanced signals for cyclists at traffic lights are good steps that help all cyclists, if they are enforced. But the City and County Councils have lost their way on both traffic and cycling policy in East Oxford. They ignore the views of most cyclists as well as residents and have allowed their policies to be driven by external pressure groups.\nJohn Skinner will argue for enforcement of speed limits, and a rethink to prioritise safer designs for cycle routes, not those that promote speed.",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_no-through-route-to-city-hospitals-from-east-oxford/content_27.html": "No through route to City Hospitals from East Oxford\n- petermcioxford\n- Mar 1, 2022\n- 4 min read\nOxfordshire County Council plans to put in place a final barrier to reduce East Oxford to an enclave for anyone who relies on their car.\nEven before the LTNs have been installed across East Oxford, the county has announced it also plans to stop cars from this area driving up Headington Hill or down Marston Road.\nThere will be no legal route to drive from East Oxford to the city’s hospitals in Headington (Churchill, John Radcliffe and Nuffield Orthopaedic Centre) except via the ring road, a much longer journey on roads likely to be choked with displaced traffic.\nThe county plan announced in February – 5 traffic filters that split Oxford into a series of separate enclaves where it is impossible to drive from one part of a city to another without travelling by the ring road. The blue area is the workplace parking levy.\nBus gates on key roads\nA “traffic filter” bus gate is planned in St Clement’s before the junction with Marston Road – blocking private cars from passing to Headington Hill or Marston Road – or entering East Oxford from those directions. Others are planned for Hollow Way and Marston Ferry Road, with three more in city centre streets, one of which will block the science area.\nThese measures announced on 18 February 2022 were not included in the recent consultation about “low traffic neighbourhood” barriers (LTNs). They have, however, been a long time objective of the “Liveable Streets” pressure group that exerts an uncanny influence on the county and city council mind-sets.\n“Consultation” on this and a number of other measures will take place later this year but the council is already saying they will be implemented in 2023 or 2024\nThis is not a trial!\nIt gives the lie to the claim that the LTNs in East Oxford are an experiment and will be withdrawn if they do not work.\nIn the most recent consultation 73% of respondents objected or had concerns about the Cowley LTN but these barriers have not been withdrawn.\nInstead the County Council cancelled the decision meeting due on 24th February at which both sides of the debate were due to speak – including John Skinner, the independent candidate for this ward. The decision will now be taken by the full seven person County Council Cabinet.\nThis meeting it is likely to be after the city council elections so that the ruling parties do not have to face the electorate after defying the result of their own consultation.\nIndeed, John Skinner is predicting that the barriers due to be installed across East Oxford in March or April will also be delayed until after the election.\nIf all these plans go ahead people living in St Mary’s will only be able to drive along either Iffley or Cowley Roads and exit the area through the ring road. Iffley Fields residents will have the Iffley Road as their only exit route and only away from town.\nThose in the rest of St Mary’s will have only the Cowley Road or the Iffley Road, depending on which side of the barriers they are parked.\nZero Emission charges not for the rich\nThe new County Council plans also included extending the Zero Emission Zone to cover a wider area of the city centre, including Longwall Street across Magdalen Bridge. Unless you live in the area or have a blue badge, drivers will pay £10 a day from next year if they pass through in a car or van which does not have the lowest emission rates – rising to £20 a day in 2025.\nThey could of course buy a new car – with reduced rates for low emission vehicles like the KIA Soul (£35,000 on the road) or the BMW iX Sport (£69,000 on the road).\nIn other words, those with money do not face the penalty.\nParking levy could hit schools\nA third measure is to extend a workplace parking levy, charging all employers that have more than 11 parking places. With no exemptions announced so far, that would include, for example, St Mary and John School where many teaching and support staff who cannot afford to buy homes in Oxford drive in from outlying towns.\nDespite what the council claims, barriers in East Oxford are not an experiment. There are no firm time scales, no set objectives and no criteria for what constitutes success or failure. The ‘experiment’ in Cowley, has attracted a petition of more than 3,000 people to have barriers removed, but has been endlessly extended. However, disastrous the outcome proponents claim they will work if given more time and more restrictions. The only way to change this approach is to vote out councillors who support them.\nA key plank of John Skinner’s election campaign is for local meetings to come up with better plans to slow traffic and reduce unnecessary journeys without punishing those who need their cars: real consultation – not a sham process that excludes vital steps and is anyway ignored.\nVoice your concerns with John Skinner on Twitter:\n@onestmarys",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_notes-from-your-doorstep-thursday-10th-march/content_42.html": "Notes from Your Doorstep\n- petermcioxford\n- Mar 19, 2022\n- 1 min read\nJohn Skinner is going door-to-door talking with residents in St Mary's.\nDoorstep conversations bring you up with the reality of people’s lives and the impact of bad policy making.\nParking is a recurring issue\nA couple I was speaking to noticed how a neighbour with a disability often has to park her car several streets away and then hobble to and from home, because their road was full of parked cars. The pressure on our side streets will be made worse when all the parking spaces on Cowley and Iffley Roads are removed to make way for “Quickways” (bringing added danger to the main roads).\nI am looking closely at schemes in force in Cambridge where both Cambridge University and Anglia Ruskin (their equivalent to Brookes) require students to register their cars and display a licence which does not give parking rights. Cambridge University students can be fined up to £175 for having a car within 10 miles of the city centre without carrying the University Licence, and these are only issued on the recommendation of the student’s tutor (e.g on medical grounds). Oxford University for many years had a ban on students bringing cars into the city – but if this still exists it is not enforced.\nFind out more about the Cambridge University Scheme:\nFind out more about the Cambridge Anglia Ruskin Scheme (Section H. Keeping or driving a car in Cambridge) :\nWould restricting student cars be fair or discriminatory?\nGiven the huge pressure on parking, this is something we should discuss. If elected I will explore options for a Cambridge style scheme in our city.\nTell me what you think:\n@onestmarys",
  "https_www_onestmarys_org_/https_www_onestmarys_org_profile_skinnerje_profile/content_28.html": null,
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_notes-from-your-doorstep-19th-march/content_43.html": "Notes from Your Doorstep\n- petermcioxford\n- Mar 15, 2022\n- 1 min read\nNotes from conversations this week as John goes door-to-door talking with residents in St Mary's.\nInsulation and carbon emissions in our homes\nThe need to insulate our homes is a strong issue. People are waking up to the need to cut their bills and carbon emissions. Doing this work can be expensive but is cost effective and has no downside. John is going to press the council to speed up its work plans on council houses and to make sure that this is not only about solar panels – insulating the houses should be a major priority and there should be more central support and advice.\nJohn is following up with one resident who wants to see Oxford City Council support a kind of self-build scheme under which groups of residents can insulate their own homes, working together. The council could offer training and materials at cost and provide scaffolding to the Library of Things in Oxford which can then be borrowed by households. A buildings control inspector could be seconded to oversee the scheme and check that work is done to high standards. Another resident is waiting for the council to start work to insulate her council house. The work seems to progress slowly with endless meetings and visits and long delays.\nWe will only mention the following exchange about LTNs:\n“Hello. I am canvassing on behalf of John Skinner.”\n“Sorry, but I am a Green Party member.”\n“OK, so you are pretty happy with the LTN proposal then?”\nPause: “No, not really.” Closes door thoughtfully.\n@onestmarys",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_st-clements/content_17.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_silvester-s/content_41.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_may-2nd-demonstration-against-ltns-in-east-oxford/content_22.html": "Last minute appeal to stop LTNs in East Oxford\n- petermcioxford\n- May 3, 2022\n- 1 min read\nLast minute appeals were made on Monday before this week’s city council election to stop the LTNs being introduced in East Oxford.\nOn Monday 2nd May a street meeting was held in Donnington Ward on the corner of Golden Road and Howard Street where barriers are due to be installed. Speakers included Sajjad Malik Oxford City Councillor for Temple Cowley, who warned that Oxford would become completely divided if the barriers and bus gates go ahead and that public transport was inadequate. Ping Low who runs the Goldfish Bowl in Magdalen Road warned of the impact on local business and the difficulties the barriers would make for customers and suppliers.\nA small counter demonstration in support of LTNs took place on the other side of the road – leading to some well managed and civil exchanges of views!\nPictures: Peter McIntyre",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_increased-congestion/content_16.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_thoughts-on-an-equitable-traffic-solution-in-east-oxford/content_60.html": "Thoughts on an equitable traffic solution in East Oxford\n- Anthony Cheke\n- Feb 15, 2022\n- 5 min read\nBackground\nLike any other problem, finding a solution to actual or perceived traffic problems requires both research into the causes and intelligent devising and implementation of solutions, if any are required.\nIn East Oxford some residents in some streets perceive a problem with excess through traffic, often described pejoratively as ‘rat-running’. What constitutes too much traffic in any given street is a matter of opinion, and indeed frequently disputed. Those who consider traffic is excessive often advocate for road closures to create cul-de-sacs, euphemistically ‘low traffic neighbourhoods’ (LTNs), whereas those who consider the traffic acceptable or essential want roads to stay open. The ‘closure’ lobby tends to regard all through traffic as unnecessary, the ‘keep open’ lobby consider it includes vital/important local communication.\nThe problem is that there is no meaningful data on the proportions of traffic that is local (‘local’ is itself a question of perception), or from outside that could use other routes as easily. Also there is no information on why people make these journeys, and to what extent they are ‘essential’ or ‘trivial’; closure advocates assume the latter, ‘open’ advocates the former.\nAlthough everyone agrees to some extent on access for emergency vehicles, the importance of efficient circulation of delivery vehicles and taxis is not considered important by ‘closure’ advocates, who also downplay the negative effects of closures on the elderly and those with restricted mobility whose ability to turn to cycling or walking may be limited or non-existent. ‘Closure’ advocates also downplay the inconveniences of extra time, distance, pollution and congestion if a necessary car journey is made (heavy shopping, hospital, visit to tip etc.) on the grounds that all residences are still accessible, although ‘you may have to find a slightly different route’ as County Council documents somewhat disingenuously explain. The fact that traffic is forced onto roads peripheral to the LTNs, most of which are also residential, creating new problems there is generally ignored by ‘closure’ advocates, or it is assumed to ‘evaporate’ once people increasingly take to walking and cycling.\n‘Open’ advocates tend to stress access, communication and convenience over the negative effects of pollution, speeding, risk to children in residential streets, and also argue that the perceived traffic excess is not objectively a major issue, at least in most streets to be closed. They also make the point that residents do not ‘own’ their streets, which are communication thoroughfares for all (local and beyond), and many under threat of closure are very important local link roads.\nAlthough the problems, real or perceived, vary from street to street, in general both points of view, which tend to become strongly polarised, have some merit. Any solution therefore needs to be acceptable to reasonable people from both perspectives, and that requires research to identify the drivers (no pun intended) of traffic movements in and around the affected streets, to look at alternative mitigation methods, and devise more imaginative solutions than simply closing off roads.\nAlthough some ‘closure’ advocates invoke combatting climate change and curbing CO2 as gains from road closures, this is an irrelevance on the global scale, as measures to deal with these overarching problems need governmental action; fiddling with bollards will solve nothing while ‘Rome burns’.\nResearch\nAlthough some data has been collected (mostly by private individuals) on through traffic numbers and turning movements. However this is confined to Divinity Road, Magdalen Road and James Street, and tells us nothing about why the cars are there, nor where they have come from or are going to. Furthermore the data collection has been within streets, so there is no link from the Magdalen Rd data to that collected in Divinity Rd. A car driving up Magdalen Road could be coming from Iffley Fields housing (e.g. Bedford St) to the Tesco carpark in Cowley Road for shopping, be driving from Radley to the John Radcliffe hospital, or be a parent from Southampton visiting a Brookes student in Pullen’s Lane accommodation. Any other route would make no sense for the Bedford St resident, but going via the ring road would add 35% distance (but not much time, if any) to the Radley resident’s journey, and a trivial amount to the visitor from Southampton (who could also perhaps use the park & ride). Hence knowledge of actual journey reasons and distances would inform the best way to manage the traffic.\nWhile stopping cars and asking for journey details would be prohibitively expensive, using numberplate recognition (ANPR) cameras on all inputs to the ring road and along it between exits, would, with computer analysis of movement data collected, give a clear idea of to what extent through traffic came from outside or inside Oxford. It could also distinguish between delivery vehicles and private cars. An ANPR-based system could then be set up to distinguish locally registered from outside-registered vehicles, and different (and flexible) regimes applied, as with the congestion charge in central London.\nANPR is also expensive, but once installed would be operative indefinitely, unlike one-off surveys which would have to be repeated every few years to discover changes in traffic movements. There is a significant privacy issue to be addressed – it would be useful to contact the GLC to discover how this is dealt with in London.\nFinding a solution that all can accept\nGiven that there is no general agreement on what amount of traffic is excessive, nor on the necessity to keep open local link roads, any viable solution must somehow accommodate the disparate views of ‘closers’ and ‘openers’.\nThe ‘closers’ want less traffic movement (and hence pollution), lower speeds and safer cycling/walking routes. The ‘openers’ want unrestricted movement, but are not opposed to lower speeds and cycling infrastructure improvement as long as roads stay open. Hence the crux is traffic movements through residential (but not radial) streets. With ANPR this can be managed as with the London congestion charge. All roads in designated for traffic reduction should have ANPR cameras at each end that can monitor speed and identify non-local traffic. Exceptions and exemptions can all be easily accommodated, and the definition of ‘local’ can be varied as necessary.\nMy initial suggestion (subject to prior research with ring-road ANPR) is that all vehicles registered to addresses within the ring-road should be exempt from restriction, as should emergency, refuse and delivery vehicles (subject to size restrictions), taxis, disabled badge holders, care workers, health visitors and probably other categories of essential workers. Electric vehicles would not be exempt (they still speed and drive through!). There would need to be provision for visitors – this could be on the same lines as visitor parking permits, each household having a limited annual allocation (to be applied for), though there would need to be an online system for exempting the visitor on the visit day. Speed would be limited to 20mph (as it is officially already) with the cameras at each end acting as average speed detectors.\nDetails of some streets being specifically cycle-priority ways would need further discussion.\nAll this would take longer to research and implement than the crude but simple use of road-closure LTNs, but would create much less division and hot air and have a flexible structure that could be adjusted as required through time.\nby Anthony Cheke 9/8/2021",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_categories_leaflets-window-posters-policy-do/content_44.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_hashtags_JohnS4StMarys/content_31.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_green-voice/content_58.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_profile_8321554d-22d0-4911-8ea7-55a4226b94a4_profile/content_49.html": null,
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_ltns-drive-up-emissions-per-journey/content_26.html": "LTNs drive up emissions per journey\n- Sarah\n- Apr 29, 2022\n- 2 min read\nUpdated: Apr 30, 2022\nI don’t know anyone who drives when it’s easier to walk or cycle or use public transport. There are times though when we need to use a car and that’s not going to change with the introduction of LTNs and busgates. I got to thinking about these occasions and how the LTNs and busgates will increase journey lengths which in turn will increase CO2 emissions.\nI found 3 examples which are real scenarios from the everyday and did the analysis with the help of Google Maps and a CO2 emissions online calculator. (see Background)\nExample #1\nYou live in Regent Street and each week you bring your elderly and frail relative to your house for Sunday lunch. It’s a highlight of their week. You collect them in the car from St John’s Care Home and take them back at the end of the afternoon.\nAt the moment the return journey is 1 mile which generates 0.21kg of CO2.\nWith LTNs the return journey will become 3 miles generating 0.62kg of CO2.\nThat’s an increase of 0.41kg of CO2\nThe St Mary’s LTN roughly trebles the CO2 emission.\nExample #2\nYou live in Crown Street. You’ve recycled everything you can in the allotted bins but when you have a clear-out you have stuff that you should take to the Redbridge Recycling Centre. This could be DIY materials, textiles, large hard plastic items, wood, or even just an excess of garden refuse as the brown bin is flowing over.\nAt the moment the shortest return journey is 3.8 miles which generates 0.79kg of CO2.\nWith LTNs the return journey will become 5 miles generating 1.04kg of CO2.\nThat’s an increase of 0.25kg of CO2.\nLTNs here increase emissions by about one third.\nExample #3\nYou live in Warwick Street and have a regular hospital appointment up at the Churchill. Cycling or walking isn’t an option here.\nAt the moment the return journey is 3.8 miles which generates 0.79kg of CO2.\nWith just LTNs the return journey will become 4.6 miles generating 0.96kg of CO2.\nThis is an increase of 0.17 kg of CO2.\nThe St Mary’s LTN adds more than 21.5% (one fifth) more CO2 emissions.\nWith the addition of busgates in St Clements as well as LTNs this return journey will become 9.8 miles via the ringroad generating 2.04 kg of CO2.\nThis is a staggering increase of 1.25kg of CO2.\nThat's one and a half times more CO2 emissions than at present!!\nMy conclusions\nMake no mistake, we all want to do the right thing for the planet, but the LTNs and busgates don’t do this. The Green Party doesn’t talk at all about the extra emissions that are going to arise from LTNs and busgates..\nThink Green, Act Green, VOTE INDEPENDENT!\nVote John Skinner, Independent\n@onestmarys\nBackground\nThe calculations I made assume the following:\n1) According to the RAC Foundation the UK’s average new car fuel consumption in 2020 was 5.4 litres per 100km for petrol vehicles (https://www.racfoundation.org/motoring-faqs/environment Q31). I use this in my calculations. Remember the emissions will change depending on the fuel type (diesel, electric) and the size of the engine (large car, van).\n2) CO2 emissions calculator: https://comcar.co.uk/emissions/footprint/\nTry this for yourself with your own journeys.\n3) All of the examples assume that the journeys are not made at peak-hours.",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_candidates-are-not-all-the-same/content_55.html": "top of page\nClick here\nfor all the latest updates\nOne\nSt Mary’s\nHome\nStay Informed\nSupport\nMore\nUse tab to navigate through the menu items.\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nAll Posts\nThe LTN Story So Far...\nFrequently Asked Questions\nNotes from Your Doorstep\nLeaflets, window posters, policy do\nSearch\nDon't sleepwalk into chaos...\nSarah\nApr 25, 2022\n0 min read\nRecent Posts\nSee All\nLTNs drive up emissions per journey\nGREENWASH - Do Green Party claims for St Mary’s road barriers stand up?\nNotes from Your Doorstep 20/2/2022\nbottom of page",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_quickways/content_11.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_john-skinner-campaign-window-poster-now-available/content_51.html": "Campaign Poster now available\n- Sarah\n- Mar 14, 2022\n- 1 min read\nUpdated: Mar 17, 2022\nIf you would like to support John Skinner, the Independent candidate for St Mary's Ward, by displaying a campaign poster in your window you can download one here or contact us to have one delivered.\nTel: 0772-690-6855\n.",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_categories_frequently-asked-questions/content_13.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_john-skinner-independent-candidate-for-st-mary-s/content_29.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_template-the-ultimate-guide-to-writing-the-ultimate-guide/content_36.html": "County delays LTN until after the election\n- petermcioxford\n- Mar 11, 2022\n- 2 min read\nUpdated: Mar 22, 2022\nOxfordshire County Council has pushed back the introduction of LTNs in East Oxford to just the other side of the May elections – so voters will not be able to “try before they buy.”\nThe county has begun distributing letters for the programme of works for the three East Oxford LTNs and Quickways. The LTNs were approved at a meeting on 16 December by the leader of the council acting on her own.\nSigns will start going up in mid-April with bollards and planters installed from mid-April to “early May”. The election is on May 5 so voters will not experience the reality of LTNs until after the city council elections.\nThere will then be six months of “consultation” which will not be binding on the county council which says its decision will depend on factors “including feedback received from the ETRO [experimental traffic regulation order] consultation, traffic congestion and air quality monitoring.” The council could extend the time period, make the LTN permanent or end the scheme. But despite all three of those factors going against the scheme in Cowley, the council just keeps on extending its ‘experimental’ status.\nThis delay had already been predicted by John Skinner, the independent candidate for St Mary’s. In his first leaflet he wrote. “I predict they will delay the East Oxford schemes until after the election but that once they are installed they intend them to be permanent.”\n“Quietways” - signposted cycle routes in East Oxford - will be introduced in June. But the timetable for Quickways (larger cycle lanes and restricted motor traffic lanes on Cowley and Iffley Roads Morrell Avenue, Warneford Lane, Marston Road and Henley Avenue/Rose Hill) has not been finalised.\nWork will start in April and go on “across the summer”. This means that the bulk of the consultation period for LTNs will happen before the full impact of all the changes is felt.\nThe only way to stop this happening is to vote for Independent candidates and send the county a message\nSpeaking after the council letter was sent out John Skinner said: “This is a predictable and cynical timetable. The County knows that their scheme will have horrendous impacts on the main roads and on local businesses or they would have ensured it was in place before the election. Some people will vote hoping for the best and if they don’t like what they see it will be too late. The only way to stop this happening is to vote for Independent candidates and send the county a message.”",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_bus_gates_ltns_map_of_road_closures/content_5.html": "Bus Gates and LTNs to divide and gridlock our city\n- skinnerje\n- Apr 26, 2022\n- 1 min read\nHere is what you need to know about getting around Oxford now that the County Council has announced plans alongside LTNs to install 'bus gates' on key arterial roads across Oxford.\nThis map shows the plans for bus-gates, and all the LTNs including the paused one in Headington. It illustrates the impact on anyone travelling in or out of the city.\nFive zones\nThe plans effectively divide Oxford into five zones\nNorth Oxford\nHeadington and Marston\nCowley, Temple Cowley, and Blackbird Leys\nIffley Road, Iffley, Rose Hill, and Abingdon Road\nBotley Road and Osney.\nIt’s possible to travel between Cowley and Iffley Road via the Plain but to traverse between any other sector the ring road has to be used.\nAccess to the Hospitals in Headington will have to be:\nvia Marsh Lane and Headley Way\nvia London Road, then either Windmill Road and old Road for the NOC or the Churchill or Headley Way for the JR\nvia the Slade, Old Road for the Churchill, or Windmill Road, London Road for the JR/NOC\nNo other route will be possible. This will have a major impact on the majority of hospital staff who do not live in Headington; it will also have a major impact on bus services with gridlock impacting access to the hospitals\nAccess to the M40 to London or Northbound from East Oxford\nThis will require a journey round the Ring Road which is already gridlocked. This will interfere with the A34 trunk route linking Southampton and Portsmouth to the North.\nOxford’s Housing is expensive so many workers have to travel in from the county towns such as Abingdon, Witney and Bicester; their journeys will be massively impacted.\nVote John Skinner, Independent\n@onestmarys",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_hashtags_cyclesafety/content_62.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_ltns-prove-a-barrier-too-far-for-much-loved-east-oxford-hardware-store-silvesters/content_10.html": "LTNs prove a barrier too far for much loved East Oxford hardware store, Silvester's\n- petermcioxford\n- May 27, 2022\n- 3 min read\nOne of the best loved stores in our area is to close next year– and the barriers blocking roads across East Oxford have pushed it over the edge. See the full interview with Stuart Silvester here:\nSilvester’s Stores has been a family run treasure-store in Magdalen Road for 112 years supplying thousands of different items to local residents and shoppers from all over Oxford. It will close at the end of March 2023 a victim of the hostile environment for small retailers in which the Low Traffic Neighbourhood barriers have been the final straw.\nStuart Silvester is the third generation to run this business, known throughout Oxford for gardening products, ironmongery, electrical equipment and household goods. In an interview for One St Mary’s Stuart explained why he is being forced to close down with key suppliers not willing to deliver past the road barriers.\n“LTN is the final straw for me because if I can’t get my compost delivered when gardening is my biggest selling item, and if I can’t get my winter fuel delivered when people want logs for the winter and I can‘t get my roses delivered because they always deliver on large trucks which they gear towards calling at garden centres, then to be honest it is not really worth my while.”\nWhen Silvester’s closes, Stuart expects it to be pulled down to make way for a new development – most likely student accommodation, he believes.\nHis grandfather started the business in Magdalen Road in 1910 and rented the current shop on the corner of Hurst Street from 1936. Stuart’s father who bought the premises in about 1954 at one time carried 32,000 different stock items and Stuart still carries 27,000 different lines on his shelves.\nThe LTN is not the only challenge he faces but it is the critical factor – since key suppliers have already told him they will not be able to deliver to him any longer. In particular his gardening business will be impossible to sustain he says, and it is that helps him survive.\nHe says customers to have to travel further to get gardening and hardware supplies that many will end up using the ring road to reach large stores.\n“We have lost all those fundamental key shops, the butchers, the bakers – all those of sort of shops. When I was a youngster, Magdalen Road you could literally buy anything down here. Now everything is becoming a service industry and it has just lost the character and the dynamic really.\nWhat would his father and grandfather think? “They would be quite horrified really, especially my Dad who worked until he was 91. It is the end of an era really.”\nSilvester’s is not the only casualty of Oxford’s LTN. Parchment Printers has already left East Oxford after 40 years citing “the LTNs and restricted parking” in Temple Cowley.\nWithin the first week of the LTNs several East Oxford postboxes had been sealed shut because the Post Office could no longer fetch the post in time for it to meet deadlines. They include “priority” postboxes in Cowley Road and Divinity Road and the postbox in Church Hill Road. It is expected that the Post Office will make collection times earlier – worsening the postal service from Oxford.\nInitial jams on the roads have been much as predicted. One parents reported taking 45 minutes to bring her three year old home from nursery at the Churchill, and buses reporting long delays throughout the area. Some of the worse jams are in the mornings on Iffley Road where it has taken up to half an hour to travel from Donnington Bridge to the Plain.",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_oxford-ltns/content_47.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_hashtags_ThePlain/content_64.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_east-oxford/content_4.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_quickways-removal-of-parking-iffley-road-cowley-road/content_9.html": "Notes from Your Doorstep\n- skinnerje\n- Apr 1, 2022\n- 2 min read\nUpdated: Apr 26, 2022\nPark and Writhe - what will Quickways do to our side streets?\nParking is often treated as a minor issue. Until someone parks so that you can hardly walk down the pavement or go anywhere with a buggie or a wheelchair. Or until it becomes impossible to park anywhere close to home.\nOne question I have after listening to people while canvassing is this: Did anyone from the city or county councils think about what will happen in our side streets when they remove 650 parking spaces from Cowley and Iffley Roads under the Quickways scheme?\nHere are some specific examples (blurred a bit to protect confidentiality) already experienced by people for whom car use is not a luxury and who pay for a permit.\nA mother returning home in the rain having to ask someone to look after her young children while she finds a space two streets away\nDoctors returning from a long shift in the early hours and finding nowhere to park.\nA patient returning from radiotherapy treatment faced with a long walk from car to home.\nA family carer who knows that when they take the grandchildren home to their parents, their parking space will be gone when they return\nAn on call mental health care worker unable to find a parking spot close to home\nSomeone with limited mobility struggling home after parking several streets away.\nCan we reduce the pressure on parking spaces? The Car Club is a great asset for people who may be able to give up their cars. Car sharing schemes will also help. Can we limit student car use/parking, as Cambridge appears to do?\nWe can work with residents on solutions. Or we can impose ill thought out and damaging policies like Quickways that make the situation worse, jam the main roads and make life even more dangerous for cyclists.\nIf you elect me to represent you in St Mary’s, I will work with you to find something better.\nVote John Skinner, Independent\n@onestmarys",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_parking/content_50.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_your-title-what-s-your-blog-about-13/content_48.html": "John Skinner, Independent Candidate for St Mary's -Campaign Launch\n- Sarah\n- Feb 20, 2022\n- 2 min read\nI launched my campaign this weekend to provide a real choice to residents, giving a voice to the majority who opposed the LTNs in the consultation but who also want social justice and a pollution free and safe ward.\nI have lived in St Mary’s for more than 40 years enjoying our shared sense of community and diversity.\nThese values are put at risk by divisive policies which are opposed by local people.\n“Low Traffic Neighbourhood” road closures will cause gridlock and export pollution to our neighbours. They threaten local shops and businesses at the very moment they most need our support.\nI strongly believe that we need to act to make our roads safer and quieter – and will work alongside all others who share these aims.\nI have tried to change Labour policy from the inside, but sadly, the political parties representing our area are in the grip of a dogmatic “one size fits all” policy and refuse to consider alternatives.\nI worked at the Oxford Radcliffe Hospitals for more than 20 years where many people rely on their cars to work and function.\nWe need supportive policies for those who can cycle, walk and use public transport. Instead we have cuts to bus services and a failure to engage with people’s real lives.\nOur campaign will explore effective alternatives to road closures – and how we can work together to make a difference.\nI am standing to provide a real choice to residents, giving a voice to the majority who opposed the LTNs in the consultation but also want social justice and a pollution free and safe ward. I back fair enforcement of rules to address problems of noise, parking, and rubbish strewn streets and am campaigning for the council to prioritise homes for key workers and for planning that sustains diversity in our neighbourhood. I will work with local groups tackling issues of poverty to highlight the causes of poverty and ensure that people do not go hungry.\nIn the coming weeks I shall be calling on everyone in St Mary's ward to introduce myself and my campaign. In the meantime if you would like to support us, volunteer, canvas or help leafletting, please get in touch.\nE-mail me at john.skinnerindependent@hotmail.com\nPhone me on 07726 906855\nSupport me on Twitter: stmarysltns@onestmarys",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_cowley-road/content_7.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_greenwash-green-party-claims-for-road-barriers-in-st-marys/content_25.html": "GREENWASH - Do Green Party claims for St Mary’s road barriers stand up?\n- skinnerje\n- Apr 14, 2022\n- 7 min read\nIn the current issue of Green Voice delivered through letterboxes in East Oxford, a number of highly contentious statements are made. We address them here.\nThe Green Party has been campaigning for a Low Traffic Neighbourhood in St Mary’s since 2019 – although most people did not hear about it until 2021. They campaigned through a series of Zoom calls starting in 2020 by which time the plans had already been drawn up and submitted to the Highways Department. In their consultation, the Greens reached a total of about 350 residents on Zoom and under 100 responses on a survey they sponsored. There was still extremely low awareness of these proposals at the time of the 2021 local elections. Plans were introduced by Oxfordshire County Council when it was under Conservative control and are now supported on the county by an alliance of Lib Dems, Labour and Greens all working together – so there is no effective dissent. This is the first election where there have been candidates opposed to the LTNs, including in St Mary’s.\nIn the current issue of Green Voice a number of highly contentious statements are made. We address them here. Our conclusion is that the claims are not backed by evidence and in some cases are demonstrably false. LTNs are not Green and residents who want to see healthier and less divided communities would be wise not to vote for them.\nGreen Voice (published by the Green Party “Spring- Winter edition”) – detailed rebuttal.\n1) What Problem is the LTN trying to address?\nGreen Voice: “Transport emits more climate-damaging CO2 than any other sector”\nThe Independent view: In the context of LTNs, this is a totally misleading statistic based on national data that includes air travel and motorway driving, including by heavy goods vehicles. Overall, transport emissions are responsible for 27% of the UK total emissions (2019 figures) with emissions from cars falling slightly immediately before the pandemic– mostly due to improved fuel efficiency. The biggest increase between 1990 and 2019 was in international air flights.[1] The City Council’s own climate emergency declaration says that 81% of the city’s carbon emissions come from energy and fuel use in buildings and that residential housing is the single largest carbon source with 29% of the total. The implication is that as we are saying improving Insulation would be the most effective way to reduce our carbon footprint.\nIt is likely that LTNs will make things worse because of the jams they will cause on main roads, meaning more cars with their engines running going nowhere. Vans and lorries, which emit more carbon than cars, will have longer journeys to reach houses within LTN areas to make deliveries or to carry out work. Small cars contribute the least and electric cars (which will also be blocked) contribute very little at the point of use. Oxfordshire County Council has nothing in place to measure the impact of LTNs on overall CO2 emissions.\nGreen Voice is FALSE/MISLEADING\nOur data comes from the Department of Transport statistics published in October 2021\n[1] (Provisional data for 2020 shows a big fall in carbon emissions from transport since 2019 – but that is been heavily affected by the pandemic – and will doubtless rise again.)\nGreen Voice: “Private car journeys make up the majority of these emissions”\nThe Independent View: Since cars make up 79% of road vehicle miles (2019 data), it is no surprise that they contribute most emissions. However they only produced 55% of overall emissions from roads, showing relative efficiency compared to vans, lorries and buses. How national data relates to emissions in Oxford is unknown. Trucks, vans and buses contribute disproportionately heavily to carbon emissions on our roads and the more they are stuck in traffic the more they will produce.\nGreen Voice is UNPROVEN/MISLEADING\nGreen Voice: “60% of short trips (under 2 miles) are made by car”\nThe Independent View: This is national DfT data, with little relevance to car use in Oxford, especially through LTN areas. Neither the County Council nor the City Council have researched where the vehicles passing through LTN areas start from or go to. Many people who work in Oxford live in the county towns and have to use a car to get to their work and live their lives. Their journeys are longer than two miles and often impossible by other means, and these are the ones LTNs disrupt most.\nFor traffic originating in East Oxford, this 60% claim seems daft. Almost nobody drives from St Mary’s into town unless they have impaired mobility or a pressing need to transport something. Some parents make short journeys by car because they have to carry more than one child, maybe to different schools, and will continue to do this (with longer journey times) after LTNs are brought in, as will people needing to carry bulky items. One thing LTNs certainly will do is to make car journeys longer. Evidence from the LTN consultation strongly suggests that that most short journeys are NOT made by car. This shows that 55% of respondents travel around East Oxford “most days” on foot, 30% travel most days by bike and only 29% do so by car. It is extremely unlikely that the car journeys were shorter than the journey by foot or on bikes.\nSource: https://mycouncil.oxfordshire.gov.uk/documents/s56764/CMDHM_JUL2921R08%20-%20LTN%20Annex%204.pd\nGreen Voice is DEMONSTRABLY FALSE\nGreen Voice: “There is good evidence to support that local businesses will benefit from more walking and cycling”\nThe Independent View: In the consultation for East Oxford, 77% of local business / organisation / groups said it was important to keep local roads open. Only 4 businesses in the consultation believed that the impact on their business would be positive. Shops in Templar’s square in the existing Cowley LTN area report lower footfall and delays in transport to the centre. Businesses will be damaged and some may close because of the LTNs. What ‘good evidence’ are they citing?\nGreen Voice is FALSE/DELUSIONAL\n2) What do local residents think?\nGreen Voice: “More residents in East Oxford supported the introduction of a Low Traffic Scheme than opposed it”\nThe Independent View: Oxford is opposed to the LTNs including the one planned for St Mary’s. Of those who responded to the consultation 55% opposed LTNs and only 34% supported, (97% of respondents were from Oxford). Of the three East Oxford LTNs St Mary’s had the biggest negative reaction. If only the 400 or so people from St Mary’s who took part (21% of 2,010) are counted then 52% were in favour and 47% were opposed. However, it makes no sense to count in this way as it specifically excludes those most affected – including those who live just across the ward boundaries and those who have to drive into or across it to reach their place of work. (Imagine if residents of one road within St Mary’s suggested blocking residents of their neighbouring road from access, and did not include their neighbours’ votes in consultation!). Of those who live outside the LTN areas, 38% were regular visitors to the area, 29% worked there, 20% visited for social or leisure activities and 5% had friends or family there. Of residents who drove through a proposed LTN area more did so to access work, education or social or recreation than used it as a “short cut” to somewhere else.\nOxford is against the LTN and this is the first election where any candidate opposing the LTN has stood.\nGreen Voice is TRUE ONLY IF YOU CHERRY PICK THE VOTING – FALSE IF YOU COUNT ALL THE VOTES\nGreen Voice: \"The South Fulham low traffic neighbourhood was only supported by 13% and is now supported by 90%\"\nThe Independent View: The South Fulham Traffic, Congestion and Pollution reduction scheme is not an LTN. There are no barriers. Residents can go anywhere, WITH cameras to monitor ACCESS. The council changed the scheme because they listened to their residents. In the revised scheme, all residents and car owners within the area pass freely. Relatives, carers, deliveries and other road users can get free day passes. You can book visitor access on the day even after they have left.\nDetails are here:\nGreen Voice is FALSE & MAKES AN OWN GOAL – South Fulham does not have an LTN of the sort proposed here\nGreen Voice: \"What other benefits do Low Traffic Neighbourhoods bring?\"\nThe Independent View: The Greens cite “areas in London”. They usually roll out the example of Waltham Forest. There the LTNs were supported by massive investment and started without the large cycling and walking population that exists in Oxford. They spent over £30m. They introduced 22 km of segregated cycle tracks; 40 barriers and 100 major junction changes. They planted over 700 trees and put in 300 new bike hangers. In East Oxford we get ugly planters, no trees and unsightly plastic bike racks. Meanwhile, some councils are removing LTNs because of the impact (Greenwich, Ealing, West Sussex, Liverpool, Brighton). Harrow council said they had suffered “reputational damage” after they installed LTNs. In Ealing analysis by the council installed found saw no material change in air quality but evidence of increased congestion on nearby streets.\nGreen Voice is FALSE\nGreen Voice: \"What Changes will they bring to East Oxford and Will Traffic be moved onto the main roads\". The assertion is that “it is expected to lead to a 70% drop in car traffic between Cowley and Iffley Road and that in the short term there may be some displaced traffic”\nThe Independent View: Difficult to know what they mean. If barriers are in place then through traffic will of course drop by 100%. Deliveries will still be needed and residents will still need to go about their business and they will only be unable to move through the area without reverting to Cowley or Iffley Roads. With only the main roads open to through traffic, then we can expect gridlock (and extra traffic at the Plain) increased pollution and damaged businesses. The Greens have no evidence that displaced traffic will be short term –relying on their “evaporation” theory by which traffic mysteriously disappears and does not move elsewhere.\nGreen Voice is MEANINGLESS/FALSE\nGreen Voice: “If the LTN scheme does not deliver reductions in congestion, pollution and accidents it is unlikely to progress beyond the trial”\nThe Independent View: The LTNs are only the first of a series of restrictions being planned including bus gates to separate Oxford into a series of enclaves which cannot be reached from each other by car. Those responsible for pushing this agenda have already decided to close their minds to opposition and seem to respond only to lobby groups. The Cowley LTN has delivered increased pollution, increased congestion and has been opposed by 67% of those responding to the consultation; it is being kept through a series of extensions and delays to decision making. If it was a trial there would be stated endpoints and measurable outcomes. There are none. When the LTNs deliver gridlock and extra pollution the proponents will simply say they need more time and more restrictions. The council undoubtedly intend this to be permanent – the talk of a trial is a sham designed to make it look like we have a choice.\nThe Independent conclusion: Missing from Green Voice\nThere is no discussion in Green Voice of alternative schemes (including those the Green Party dismissed in 2020 and 2021 to have a slow traffic area). They say nothing about enforcing the 20mph speed limit which is what people most want on the doorstep. Making our roads safer does not mean closing them down.",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_doctors-concern-at-delays-reaching-hospitals/content_35.html": "Notes from Your Doorstep\n- petermcioxford\n- Feb 28, 2022\n- 2 min read\nJohn is going door-to-door asking residents of St Mary's about their concerns as well as asking for their support.\nDoctors concern at delays in reaching hospitals\nTwo junior doctors living in the Iffley Fields part of St Mary’s have expressed concern about delays in getting to work after road barriers (LTNs) are introduced. Fears have been increased by the news that as well as blocking roads throughout St Mary’s the council has plans for a “bus gate” in St Clement’s to prevent cars travelling from East Oxford up Headington Hill or down Marston Road.\nDrivers from this ward and St Clement’s will only be able to reach the Headington hospitals by travelling around the road road, which adds miles to their journey and is jammed at busy times.\nOne doctor works shifts at hospitals in Reading– she will vote for an Independent candidate because “no-one listens”. Another junior doctor works at hospitals in Headington. \"I’m on call regularly covering three hospitals and I get called out at night. Why do I have to go round the ring road?”\nTheir comments were made to John Skinner as the candidate canvassed in the area.\nA couple who have disabilities use their car for hospital appointments and to visit relatives. They have a Blue Badge to allow them to park but fear that they will find it more difficult to get about. Their lives will become more confined. \"How much pollution is caused by sitting in queues waiting to get to places?\"\nA builder said that his work would also be disrupted and was totally supportive of the campaign to stop the LTNs. “How can I carry my tools on the bus?”\nEven those who do not have a car can see that the LTN plan will not work. “It is not fair to push all the pollution onto the main roads,” one resident told us.\nFollow John Skinner on Twitter:\n@onestmarys",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_hashtags_Quickways/content_57.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_increased-community-divisions/content_24.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_a-problem-moved-is-not-a-problem-solved/content_61.html": "A problem moved is not a problem solved\n- Lise Bosher\n- Feb 15, 2022\n- 1 min read\nby Lise Bosher, St Mary's Resident\nWhen I was teaching Forest School in East Oxford we used part of Iffley Fields made available by the council Park Rangers. The children loved our sessions outdoors in the trees.\nThen a decision was taken to clean up South Park and to crack down on drug users there. This was successful in narrow terms. The drug trade moved out of South Park …. to Meadow Lane and Iffley Fields where users left their needles. Our Forest School area became too dangerous to use.\nI learnt something. Moving a problem is not the same as solving it. I feel the same about my home area. Moving cars out of the East Oxford ‘wedge’ that includes St Mary’s will move more pollution to Cowley Road, Iffley Road, St Clement’s etc.\nWhen making changes the effects need to be modelled for the whole city. It is not fair simply to move a problem from one patch to another.",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_student-cars/content_53.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_notes-from-your-doorstep-sunday-20th-february/content_56.html": "Notes from Your Doorstep\n- petermcioxford\n- Feb 22, 2022\n- 2 min read\nJohn Skinner is going door-to-door asking residents of St Mary’s about their concerns as well as asking for their support. He will be filing regular notes from the doorstep.\nMany residents are concerned about what will happen all roads between Iffley Road and Cowley Road are blocked to motor traffic.\nSeveral ask how local people (and NHS workers) will be able to get to hospitals in Headington. One simply described the traffic plans as “nutty”.\nShop keepers on Cowley Road have some big worries.\nOne mentioned his father had campaigned against road closures in the 1980s and he has already lost parking spaces near the shop. \"I am really worried about the consequences of the LTNs. My father campaigned against the closures in the 1980s when he ran the shop. I have had to stop selling anything bulky because it is already impossible for people to pick things up.\" This shopkeeper is himself a cyclist but believes there will be continuous gridlock. Another felt the council should think again when traders are just beginning to recover from the impact of the pandemic. One specialist food store has customers from all over the county to buy foods from around the world. They won’t come if they cannot park, he says.\nThere is widespread concern about safety\nMany people in our area use their bikes as a key form of transport and there is widespread concern about safety. The Plain is one pressure point where one resident felt there should be a 5mph limit. There is support in our area for car share schemes (which John also supports).\nIt is not all about traffic\nThere were many complaints about rubbish and lack of bins. In Iffley Fields there is a strong tradition of helping others – with community action on litter, supporting food banks (and stopping food waste) and supporting voluntary organisations that work with homeless people or people with addictions.\nA number of residents expressed their opposition to the development of housing on fields next to Meadow Lane in Iffley Village.\nFollow John Skinner on Twitter:\n@onestmarys",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_policy-on-parking-in-east-oxford/content_19.html": "Policy on parking in East Oxford\n- skinnerje\n- Apr 14, 2022\n- 6 min read\nParking is one of the key issues facing residents in East Oxford who own cars and who often face real difficulty in finding anywhere to park close to home. Their fears are exacerbated by the impact of the Quickways.\nThe Problem\nQuickways mean that 650 parking spaces will be lost with none replaced. (Details of lost spaces are included as Appendix 1 ). I wrote to the responsible Councillors, (Duncan Enright and Tim Bearder) asking how residents should deal with this and one responded by referring me to the Council’s website demonstrating how much they care.\nThe number of permits issued has remained reasonably static over the past 5 years and the number of visitor permits has also remained consistent. However a higher number of residential permits are issued in East Oxford and Divinity Road compared other parts of the area, perhaps reflecting the high number of student HMOs. Anecdotally there are concerns about the abuse of the residents’ visitor scheme to provide open-ended permission for an extra car in student households. A review of policy is needed to ensure that the visitor permit system is fair and not abused.\nResidents Parking Permits Issued\n2015 2016 2017 2018 2019 2020 2021\nDivinity (DV) 612 585 546 529 535 572 563\nEast Oxford (EO) 923 901 829 752 773 798 850\nIffley Fields (FS) 0 0 0 468 444 446 447\nMagdalen North (MN) 537 451 409 421 417 456 481\nMagdalen South (RH) 0 0 0 0 482 505 522\nIssued Residential Visitor\nPermits Issued* 2015 2016 2017 2018 2019 2020 2021\nDivinity (DV) 1168 982 930 888 877 817 917\nEast Oxford (EO) 1750 1660 1517 1357 1443 1216 1414\nIffley Fields (FS) 0 0 0 536 407 457 517\nMagdalen North (MN) 922 733 693 632 749 582 727\nMagdalen South (RH) 0 0 0 0 771 626 706\n*Visitor permits are issued in batches of 25, so the ‘number’ issued is actually the number of batches. Car owners are allowed one ‘free’ batch with their permit, plus a further batch, for a fee, on request. Carless households can request also visitor permits. Note that in Divinity and EO particularly, the number of permit batches greatly exceeds the number of car permits, suggesting a lot of extra requests are made.\nWorkplace Parking Levies\nThere is a contrast in the way different groups of people are being treated in Oxford. Many teachers, nurses, teaching assistants and other key workers do not earn enough to live in the city and have to travel by car from outlying towns to work. The city is about to impose levies on workplace parking and there seem to be no exemptions. Headteachers and NHS Managers have raised concerns that payments will come out of their budgets, reducing funding for education and care. The parking levy also has a big impact on businesses, that are requesting more consultation. This contrasts with a relaxed laissez faire policy on student parking across the city.\nStudents with Cars\nBoth Universities used to discourage students from bringing cars to Oxford. Today they just do not permit cars in university halls of residence and turn a blind eye to cars elsewhere. This chimes with the council’s own policy. (See Appendix 4.) The only controls are that the student must be the registered keeper, and provide proof of residence and a council tax exemption certificate. Would it not be possible to have a more structured policy so that a student should have some justification for keeping a car in the city? The large number of student owned cars in residential areas across East Oxford is evident in the way parking problems are eased during vacations. If the council considers it legitimate to remove 650 car parking spaces for people living or working on designated Quickways, surely it is legitimate to ask for some review of criteria for the right to a parking space on East Oxford streets and timely to approach the universities to establish joint policies.\nCambridge students are required to make a commitment that they will not bring motor vehicles other than mopeds into the city. Cambridge University requires any student who wishes to have a car to apply for a university licence. The Senior Proctor can fine students £175 if they breach the regulations. Similar policies apply to Anglia Ruskin University and cover their campuses in both Cambridge and Chelmsford. (See Appendix 2. See Appendix 3.)\nIf elected I will argue for talks between the local councils and both universities to agree a policy on undergraduate student car use in the city, linked to a fair policy on the issue of visitor permits and joined-up enforcement. Criteria of need can be set through discussion with student bodies, with the student requiring permission from their college or university.\nAppendix 1 - Estimated number of car parking spaces lost (Source Oxford County Council)\nSt Clement’s Street 10\nChurch Cowley Road/Between Towns Road 91\nCowley Road/Oxford Road 195\nIffley Road/Henley Avenue/Rose Hill 132\nMarston Road 37\nMorrell Avenue/Warneford Lane 135\nDonnington Bridge Road 49\nTotal 649\nAppendix 2: Cambridge University regulations on Student’s use of Motor Vehicles.\nMotor Vehicles\nMembers of the University “in statu pupillari” who are in residence in term or in the Long Vacation period of residence are required to have a University Motor Licence if they wish to keep motor vehicles (other than mopeds) within 10 miles of Great St Mary's Church. Students who have MA status or who are members of the Senate do not currently require a licence. Licences are issued under the authority of the Senior Proctor, who has the power to impose a fine of up to £175 for breaching the regulations on the keeping and using of motor vehicles and to suspend or revoke licences.\nThe issue of a licence is conditional upon meeting certain requirements relating to insurance and the availability of authorised parking. A motor licence is not a parking permit and does not entitle the holder to park on university premises without separate authority. Licences will only be issued upon recommendation from a College Tutor and they are only available to undergraduates who have not already kept 9 terms if they meet particular conditions.\nAppendix 3: Anglia Ruskin University (extract of the regulations on Car use)\nH. Keeping or driving a car in Cambridge\n19. No full-time student (except approved disabled students, students whose permanent family home is within the City of Cambridge or students that need a vehicle for placement reasons) will be allowed to keep or drive a motor vehicle, other than a moped or motorcycle, in the City of Cambridge.\n20. The Office of the Director of Student Services will issue you a permit if you may keep or drive a motor vehicle, in line with the above paragraph. These permits will only be allowed for a certain period to reduce the possibility of non-authorised copying or use. You need to apply for a permit and prove you are entitled to a permit in line with the above paragraph.\nI. Parking cars and driving on campus\n21. You cannot park a car, cycle, e-scooter or motorcycle depending on the campus concerned, anywhere other than in designated areas. You must also keep to on-campus speed restrictions.\n22. Student parking at the Cambridge or Chelmsford campus is restricted to cycles, motorcycles and drivers with an accessibility (“blue”) badge.\n23. If you are a disabled student or have a temporary impairment you can apply to Student Services for a temporary parking permit to access Accessibility bays at our Chelmsford campus. These permits will only be allowed for a certain time period to reduce the possibility of non-authorised copying or use. You will need to apply for a permit and provide medical evidence confirming your disability.\n24. Residential Services, security and other members of our staff will carry out spot checks to make sure that nobody is breaking parking control regulations on the campus concerned\n25. Privately owned e-scooters are illegal to use other than on private land which must not be accessible to the public. The use of privately owned e-scooters is prohibited on all ARU campuses.\n26. We will investigate all claims of the regulations being broken and, where appropriate, take necessary disciplinary action under the Student Disciplinary Procedure\nAppendix 4 – Oxford's weak policy on student parking\nInformation for students moving to a controlled parking zone:\nTo apply for a parking permit, your vehicle must be registered in your name at the address within the zone you are applying for. You'll need:\nproof of address\nthe vehicle registration certificate (V5C).\nBeing the named driver on an insurance policy will not qualify you for a parking permit.\nProof of address for students:\nYou can use one of the following documents.\nYour fully signed termed tenancy agreement (should be signed by yourself, the letting agency and witnessed)\nYour Council Tax student exemption certificate\nA recently dated utility bill or financial statement",
  "https_www_onestmarys_org_/https_www_onestmarys_org_profile_petermcioxford_profile/content_3.html": null,
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_a-call-to-pause-ltns-and-quickways/content_39.html": "A call to pause LTNs and Quickways\n- petermcioxford\n- May 17, 2022\n- 2 min read\nUpdated: May 19, 2022\nThe recent city elections were the most divisive in years. Nine independents stood across East Oxford, the area most affected by road barriers, and threatened by ‘bus gates’ and Quickways. While only one Independent was elected, we came second in seven of the nine seats contested and together won 30% of the vote in seats where an independent stood, more than any party other than Labour. This is a highly significant result as most of us were starting from scratch with limited resources. Despite their advantages, the share of the vote taken by incumbent parties fell. It is clear that Independents struck a chord with the electorate in putting forward policies to reduce congestion and pollution without damaging essential movement through the city.\nOne reason why LTN and traffic policies have become so divisive is that the both City and County Councils listened extensively and privately to lobbyists from Oxfordshire Liveable Streets and Cyclox without engaging those on the other side of the argument who also want greater safety on the roads and reductions in pollution. We have appealed to the ruling Labour group on the City Council to recognise this, with limited response so far.\nWe are calling for a pause to the implementation of the current LTNs and Quickways and a wider consultation to establish a policy that can work for all in the community.\nPausing schemes while consultations are undertaken would be a way to bring the community back together, given the strength of the views and the feelings that many people have of being disregarded. Labour canvassers were assuring people on the doorstep that they understood their concerns about the LTNs, bus gates and other changes and would “sort it out”. The Greens avoided mentioning LTNs even once in their election material. There is no mandate for these changes amongst the people who live here and those most affected by barriers.\nWe all want greater safety on the roads. However, the county adopts a slogan “Vision Zero” (zero fatalities for cyclists) while at the same time creating “Quickways,” encouraging cyclists to travel “quickly” on the very same roads where the LTNs will channel vastly increased motor traffic. It is an absurd and dangerous policy.\nThe Independents will monitor and highlight the disruption and damage these changes do to lives. If our councils continue not to listen, our movement can only grow.",
  "https_www_onestmarys_org_/https_www_onestmarys_org_profile_8f741aa8-6ecd-4665-b652-cf2f0e794135_profile/content_65.html": null,
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_who-supports-road-barriers-in-east-oxford/content_15.html": "Who \"owns\" road barriers in East Oxford?\n- skinnerje\n- Apr 2, 2022\n- 4 min read\nWho supports the barriers that are about to divide our community –bringing massive disruption community conflict and increases in traffic jams and pollution? It is increasingly difficult to understand where both the main parties in this ward stand on the most significant issue in this election –Low Traffic Neighbourhoods across East Oxford.\nBackground\nThis policy was introduced by the Conservatives when they ran the county council and fast-tracked by the Lib Dems, Labour and Greens when they took over in coalition. Our Green city councillors were deeply involved in planning barriers for East Oxford and our Labour County Councillor has been vehement in support of LTNs. But now? Neither Labour nor the Greens seem to want to own the monster they helped to create.\nWhat does our MP think?\nOxford East Labour MP Anneliese Dodds has called on the county council to delay implementation. She supports LTNs “in principle” but is concerned that the current plans “will worsen congestion on arterial routes used by buses in Oxford, further negatively impact bus uptake in East Oxford and increase division around active and public transport measures in Oxford’s communities.”\nThe Labour Party always used to name-check “hard working families”. In her letter to Council leader Liz Leffman (as reported in the Oxford Times) Anneliese Dodds does not mention ‘car’; or ‘van’, or ‘delivery vehicle’, or ‘tradesperson’, or ‘parent’, or ‘health worker’ or ‘teacher’. None of these register today on our MP’s concerns about LTNs unless they travel by bus or cycle.\nAnnaliese Dodds’ solution is to delay LTNs until the county has installed bus gates across the city. These bus gates (electronic barriers as in the High Street) split our city into five zones which cannot reach each other by car or van except via the ring road, increasing the length of journeys and pollution, and putting the Headington hospitals out of easy reach by car to East Oxford residents. After that, our MP wants the LTNs as well.\nIn advance of the city elections Anneliese Dodds wants to give the impression of being an LTN sceptic while Labour canvassers on the doorstep assure residents that “Annaliese will sort it out”. Meanwhile our Labour County Councillor Damian Haywood prefers to impose these changes rather than consult properly with residents and those who service the area.\nIncreased congestion and increased community divisions\nThese are exactly what we have been highlighting for months. And this will not only affect bus passengers. What about people who need to use their cars to get to work at the city hospitals, or at city schools? What about busy parents who drop their children at school and then go to work? What about people with restricted mobility who need to access shops and health services? They cannot all cycle, and they cannot all use buses, especially as cuts to bus services, like the 16, go ahead and the county stands by and watches. And then there are delivery drivers, postal workers, care workers, bin lorries...\nJust to be clear. I strongly believe in reducing car use and increasing use of bicycles and public transport. But I am acutely aware that there are people who need to use cars and that many of them service our city and are not our enemies.\nTo create a transport policy that works and that reduce pollution we have to engage with all road users and have a plan that commands support – not one foisted on one section of the community, who had virtually nil involvement in its planning and whose views are being completely disregarded. We have to respect each other on the roads and in policy making. Currently, we have a recipe for community conflict, greater emissions and pollution.\nCan we believe that LTNs are only a trial?\nBoth Labour and the Greens try to persuade East Oxford residents that the LTNs are only a trial and they “should give it a go”. But who will be the jury in this trial, and what will be the evidence?\nCowley residents were told their LTNs were a 6 month trial. The ‘trial’ is now in its second year. They were told pollution would be reduced – the county’s own evidence is that it has increased. They were told that road traffic would “evaporate”; the county evidence is that it has increased. Nor have the Cowley LTNs increased cycling or walking as promised.\nWhen consulted, 63% of residents opposed the LTN with less than a quarter in support. However, the Green and Labour parties both supported the County Council recommendation that the scheme become permanent. At the last moment, the Cowley decision was delayed so that it could be taken after the election. If this is how they treat Cowley residents why would we in East Oxford be any different?\nI challenge the Green and Labour candidates to publish the criteria by which they will measure East Oxford LTNs.\nWill they think it successful if Cowley Road, Iffley Road and St Clements are gridlocked for much of the day? Will they think it a success when these vehicles emit pollution into St Mary’s environment? Will they think it successful if buses are delayed making them unusable for commuters?\nThe public have already said they don’t want the LTN; if they vote against again will candidates Emily Kerr and Mustafa Barcho, promise to respect the result?\nIn the latest Green Party leaflet, Emily Kerr talks about cycling safety and climate change, but does not mention LTNs at all. “Don’t mention the wall,” seems to be the current Green strategy.\nSigns have already started appearing at the end of roads in St Mary’s warning motorists to “check your route”. But far from manning (or womaning) the barricades, it appears that both Labour and the Greens are checking their lines of retreat.\nI predict that if the LTNs are implemented, when they fail, everyone will blame each other. The city will blame the county, the political parties will blame each other.\nThe eleven Independent candidates across the City are each addressing these issues in a way that recognises their ward’s own unique needs. In our ward there is only one candidate committed to fighting for a new traffic plan that will make our roads safer and reduce emissions and that recognises the diversity of our communities and the diversity of our needs.\nVote John Skinner Independent Candidate for St MARY’S.",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_green-party/content_59.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_support/content_6.html": "Click here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nPolicy Pledges\nI have lived in St Mary’s for more than 40 years enjoying our shared sense of community and diversity.\nI am standing in the Oxford City Council election to prevent divisive policies being imposed on our diverse community.\n-\nI support policies and investment to help people to cycle, walk and to use public transport. I oppose road barriers, cuts to bus services, and a failure to engage with people’s lives.\n-\nI will work alongside all those who want to make our roads safer and quieter - recognising that cars are still vital for many.\n-\nI oppose LTN barriers as they cause gridlock, increase journey length and export pollution to our neighbours. They are not green or fair.\n-\nI strongly support 20mph speed limits – but they only work if they are enforced. Stopping speeding traffic will be a top priority.\n-\nI support policies that help local shops and businesses to recover.\n-\nI back fair enforcement of rules to address problems of noise, parking, and rubbish strewn streets.\n-\nI will press the council to support people to insulate their homes to address higher fuel bills and reduce pollution.\n-\nI will work with local groups tackling issues of poverty to highlight the causes of poverty and ensure that people do not go hungry.\n-\nI will campaign for the council to prioritise homes for key workers and for planning that sustains diversity in our neighbourhood.\n-\nI will work for social justice and social inclusion and listen to local voices.\nLet’s make St Mary’s flourish!\nPlease help by supporting my campaign\nContact me by email\nTo support us, volunteer, canvas or help leafletting please email:\nContact me by phone\nTel. 0772-690-6855\nEast Oxford is a diverse community\nOxford Food Hub\nThe centre of surplus food redistribution in Oxfordshire, rescuing surplus food from wholesalers, supermarkets, restaurants and more, and redistributing it to charities and community organisations across Oxfordshire.\nSupported by donations, find out how you can get involved.\nThere are many community initiatives that help to make East Oxford a diverse and vibrant community. We have included just two of these where you can get involved.\nPlease note that this does not mean that these organisations endorse One St Mary's or John Skinner and his campaign.\nEast Oxford Community Centre\nUsed by a wide range of groups, from dance, yoga and tai chi classes, East Oxford Community Centre is a community venue for classes, worship, meetings, gigs and more.\nTry something new.\nhttps://www.facebook.com/eastoxfordcc",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_rosie-rawle/content_45.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_post_slow-traffic-neighbourhood-a-democratic-alternative-to-road-closures/content_63.html": "Slow traffic neighbourhood - a democratic alternative to road closures\n- petermcioxford\n- Feb 15, 2022\n- 2 min read\nUpdated: Feb 19, 2022\nby Peter McIntyre, St Mary’s Resident\nWhat is a slow traffic neighbourhood?\nA slow traffic neighbourhood aims to reduce speed, increase safety, encourage cycling and walking and reduce harmful emissions. It is based on a code of practice agreed between community residents, local authorities, police, and road users, especially those who drive for a living.\nThe aim of the code is to change behaviour and make life safer for pedestrians and cyclists by agreeing practices binding on all road users. The central right in this ‘social contract’ is to use the roads; the central obligation is to keep to speed limits, use roads safely and treat each other with care and consideration.\nThe code would be drawn up by the council(s), community representatives including councillors, police officers, professional drivers (delivery firms, taxi drivers, building trade skilled workers, etc) and cycling groups. Consultation is through public meetings, group meetings and on line.\nIt’s an AGREEMENT – not imposed from above.\nWhat is different in the slow traffic neighbourhood?\nThe 20mph speed limit becomes a priority for local policing (supported by cameras) with zero tolerance for speeding or aggressive behaviour\nPedestrians have right of way at crossing points, including at raised ‘humps’ in the road, with clear signs and road markings\nCyclists have right of way on internal roads with a requirement for cars and vans to slow down for cyclists, give room to pass and not to overtake on the most narrow roads\nResidents and businesses that regularly use the area sign up to the code to drive safely and with consideration. They have a voice in agreeing the content.\nThe slow traffic neighbourhood is clearly badged at all entrance roads and large 20mph limit signs on the surface of the roads - there are raised crossing points at all entrances.\nAdvantages of a slow traffic neighbourhood\nIt makes roads safer and it gives rights to residents and careful users\nIt focuses on changing behaviour, not obstructing roads\nIt supports and encourages cycling and walking and careful, considerate drivers.\nIt works through collaboration\nThrough-routes remain open and accessible to those who use them safely\nThe rules are the same for everyone: it does not set one road user against another or residents against neighbours\nIt reduces pollution inside the area and does not increase pollution outside it\nIt encourages citizens to play a role in education and enforcement\nThis outline can be enriched through local discussion.\nNB: I submitted ideas towards the slow traffic neighbourhood in 2020 and sent councillors a proposal in early 2021. I made a formal submission to the County Council Cabinet in July 2021.\nThere has never been any serious engagement. Councillors did not want to hear about alternatives to barriers. One local councillor told me it would be worse if cars travelled slowly because you could fit more cars into the road!",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_emily-kerr/content_32.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_categories_notes-from-your-doorstep/content_8.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org/content_1.html": "Click here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nJohn Skinner\nYour Independent\nCandidate\nWelcome to the One St Mary's website. We supported John Skinner as the Independent Oxford Alliance candidate in the St Mary's City Council Election on Thursday 2nd May 2024\nJohn is standing again in the 2024 Elections along with nine other Independents. Please help John for this campaign and vote for him on May 2nd.\nLast time from a standing start John came a highly creditable third with 435 votes, this time people have had experience of the LTNs and on the doorstep there is significant support for Independent candidates and the messages they have been raising.\nThe campaign for a socially just and truly green policy of reducing pollution in our streets without carving up our communities will continue.\nLet's make St Mary's flourish!\nKeep Oxford Moving\nWe are One St Mary's\nOne St Mary's campaigns to develop community solutions - including alternatives to road closures.\nOne St Mary's:\n-\nSupports moves to enforce speed limits\n-\nPromotes cycling and walking\n-\nIs in favour of inclusive consultation for all current and future local traffic plans\n-\nOpposes LTNs that threaten jobs and businesses\n-\nPromotes a contract for considerate and safe road use – by all road users\nStories from the Hustings\n(All stories from residents and businesses have been shared by us with their consent, with some requests for anonymity)\nSarah, Hurst Street\n\"I don't believe that traffic on the Iffley Rd is going to just evaporate. The LTN changes advertised in the consultation will make Hurst St and Catherine St a through-run for road-users to avoid the gridlock. More traffic on our side streets isn't a solution.\"\nDriving instructor living in St Mary’s\n“LTNs will make my life and business very difficult. Trade in Cowley Centre has been massively reduced by what they have done there.”\nShopkeeper, Cowley Road\n\"I am really worried about the consequences of the LTNs. My father campaigned against the closures in the 1980s when he ran the shop. I have had to stop selling anything bulky because it is already impossible for people to pick things up.\"",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_success-criteria-challenge/content_37.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_magdalen-road/content_34.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_stay-informed_tags_road-barriers/content_18.html": "top of page\nClick here for all the latest updates\nFor social justice & inclusion -Let's Make St Mary's Flourish!\nStay Informed\nNews and Views from the Campaign\nNoe from Your Doorstep - Sunday 20t February\nbottom of page\nClick here for all the latest updates\nNews and Views from the Campaign",
  "https_www_onestmarys_org_/https_www_onestmarys_org_profile_one-st-marys_profile/content_40.html": null
}