{
  "https_www_catherinefookes_com_/https_www_catherinefookes_com/content_1.html": "top of page\nWorking Tirelessly for\nMonmouthshire\nTogether, we can build a stronger, fairer, greener Monmouthshire.\n\"I have been proud to call Monmouthshire my home for over 25 years. Now, as your MP, I’m working tirelessly for the people of Monmouthshire. I’m always listening to your concerns, taking actions on the issues that matter to you, and fighting your corner in Westminster every day.\"\nFollow me on social media:\nMonmouthshire Survey!\nAs your MP, I want to make sure I’m focusing on the local and national issues that matter most to you – so I can represent you as best as possible.\nMarch Newsletter\nReceive monthly updates of my work as your MP\nbottom of page",
  "https_www_catherinefookes_com_/https_www_catherinefookes_com_about/content_2.html": "About | Amdanaf\nYour Member of Parliament for Monmouthshire\nIt is a privilege to have been elected as the Member of Parliament for Monmouthshire. I am incredibly grateful for the trust you have placed in me, and I promise to work tirelessly on your behalf.\nMy focus is always on listening to your concerns, taking action on the issues that matter to you, and fighting your corner in Westminster.\nMonmouthshire has been my home for 25 years, and now as your MP, I am committed to making it a stronger, fairer, and greener place for everyone.\nWhether it’s supporting local businesses, cleaning up our rivers, or fighting for fairness, I will continue to do everything I can to ensure that everyone in our community can thrive.\nMy Experience\nBefore becoming your MP, I served as the Chief Executive of a national Women and Equalities charity, where I worked to improve the lives of women and families across Wales and the UK.\nLocally, I was a county councillor, where I championed policies to improve our public services and support local communities.\nI also served as a Governor at my son’s school, Monmouth Comprehensive, ensuring that our children receive the best possible education.\nMy Priorities\nBoosting the Economy\nMonmouthshire is home to many incredible businesses, from family-run shops to exciting startups. I will work to ensure that they have the support they need to grow and thrive while creating well-paid jobs for local people.\nProtecting our Environment\nMonmouthshire is, in my view, the most beautiful part of the UK. Our stunning River Usk and River Wye are central to that beauty, but they are under serious threat from pollution. Urgent action is needed to clean up our rivers and protect our natural environment for future generations.\nFighting for Fairness\nI have spent my career advocating for women’s rights and tackling inequality, and I will continue this fight in Parliament to make sure that everyone in Monmouthshire has the chance to succeed, regardless of their background.\nI will always to listen to your concerns, work hard on your behalf, and stand up for Monmouthshire every day. If you ever need support or want to share your thoughts, please don’t hesitate to get in touch.",
  "https_www_catherinefookes_com_/https_www_catherinefookes_com_blog/content_4.html": "top of page\nNews | Newyddion\nSearch\nCatherine Fookes Selected to Scrutinise Crucial Rivers Bill\nCatherine Fookes, Member of Parliament for Monmouthshire, is delighted to announce her selection as a member of the Water (Special...\ncatherinefookes\nJan 192 min read\n14 views\n0 comments\nCatherine Fookes Addresses Misleading National Inquiry Amendment Vote\nI want to address some misleading claims about the vote on the Children’s Wellbeing and Schools Bill and the amendment proposed by the...\ncatherinefookes\nJan 193 min read\n12 views\n0 comments\nCatherine Fookes Urges UK Government to Introduce Bereavement Pay for Pregnancy Loss Before 24 Weeks\nCatherine Fookes, MP for Monmouthshire and Member of the Women and Equalities Committee, is calling on the UK Government to extend...\ncatherinefookes\nJan 192 min read\n7 views\n0 comments\nCatherine Fookes Leads Westminster Hall Debate on Water Quality in Rivers\nCatherine Fookes, MP for Monmouthshire, led a Westminster Hall debate to address the urgent issue of poor water quality in the UK’s...\ncatherinefookes\nJan 193 min read\n1 view\n0 comments\nbottom of page",
  "https_www_catherinefookes_com_/https_www_catherinefookes_com_post_catherine-fookes-selected-to-scrutinise-crucial-rivers-bill/content_6.html": "Catherine Fookes Selected to Scrutinise Crucial Rivers Bill\n- catherinefookes\n- Jan 19\n- 2 min read\nCatherine Fookes, Member of Parliament for Monmouthshire, is delighted to announce her selection as a member of the Water (Special Measures) Bill [Lords] Committee. This will see her play a key role in reviewing and scrutinising legislation aimed at improving water quality and protecting rivers across the country.\nThe Water (Special Measures) Bill is a piece of legislation designed to tackle water pollution, hold water companies accountable, and ensure long-term strategies for safeguarding waterways. The committee’s role is to examine the bill and recommend any necessary amendments to ensure it’s effectiveness.\nCatherine Fookes MP commented:\n“Cleaning up our rivers is one of my top priorities as your MP, and I’m proud to have been selected to help shape this vital piece of legislation. Our rivers have been neglected for far too long, and this bill is an opportunity to deliver real tangible action to protect them for future generations. I will work hard to ensure the legislation is as effective as possible.”\nCatherine has long been a vocal advocate for stronger environmental protections and as MP has worked closely with community groups, environmental organisations, and local residents to address concerns about pollution and water quality in Monmouthshire.\nMost recently, Catherine secured the first ever cross-border meeting to tackle pollution in the River Wye, involving Emma Hardy MP (Water Minister), Welsh Government and the cross border Wye Catchment Partnership.\n“Living in Monmouthshire for over 25 years, I have witnessed first-hand the damage that harmful pollution has on our rivers, this bill is a critical step toward holding water companies accountable for harmful pollution in rivers across Monmouthshire and the UK” she added. “I’m encouraging my fellow residents to share their views on this issue with me so I can take them forward as we scrutinise the Water (Special Measures) bill.”\nResidents can contact Catherine’s office by emailing catherine.fookes.mp@parliament.uk with their thoughts on the Water (Special Measures) Bill.",
  "https_www_catherinefookes_com_/https_www_catherinefookes_com_contact-3/content_3.html": "top of page\nHow can I help? | Sut alla i helpu?\nIf you live in Monmouthshire and you're my constituent, I'm here to listen to your concerns and help you with any issues you may face. You can contact me through email, phone or letter.\nAddress\nHouse of Commons, London, SW1A OAA\nPhone\n01291 200139\nSocial Media\nReceive monthly updates of my work as your MP\nbottom of page",
  "https_www_catherinefookes_com_/https_www_catherinefookes_com_post_catherine-fookes-leads-westminster-hall-debate-on-water-quality-in-rivers/content_7.html": "Catherine Fookes Leads Westminster Hall Debate on Water Quality in Rivers\n- catherinefookes\n- Jan 19\n- 3 min read\nCatherine Fookes, MP for Monmouthshire, led a Westminster Hall debate to address the urgent issue of poor water quality in the UK’s rivers, lakes, and seas. As a vocal advocate for stronger environmental protections for our rivers, Catherine highlighted the decline of the UK’s rivers, particularly River’s Wye and Usk in her constituency of Monmouthshire where she has lived for 25 years. In her speech, she called for decisive action to clean up all waterways.\n“This decline in the health of our water quality is staggering and desperately needs action to repair.” Catherine remarked during the debate. “Parents are too scared to let their kids run helter skelter into the local stream or river or lake, for fear that they will get an ear, eye or stomach infection, encounter a wet wipe, sewage or something much worse.”\nDuring her speech, Catherine highlighted the pressing issues affecting Monmouthshire’s rivers, including the Wye and Usk, which have seen a significant decline in water quality due to high levels of phosphate pollution. This pollution has at times led to algal blooms that then starve the fish, plants and invertebrates of oxygen.\nKey points from Catherine's speech:\nThe state of Monmouthshire’s rivers: The Usk and Wye are among the most polluted rivers in the UK, in 2022 Natural Resources Wales research showed the River Usk had the highest incidence of phosphate pollution of the 9 Welsh Special Areas of Conservation (SAC) designated rivers.\nThe role of agricultural and sewage pollution: Catherine called for urgent measures to address the main sources of pollution, including diffuse agricultural runoff and sewage discharge with 83% of phosphates in the Wye coming from diffuse agricultural sources.\nThe Labour Government’s progress: Catherine praised the government’s initiatives, such as the Water Special Measures Bill and the establishment of the Water Commission, which aim to tackle illegal sewage dumping and hold water companies accountable. However, she stressed the need for further action to address agricultural pollution and enforce existing regulations.\nCommunity efforts: Catherine mentioned the amazing efforts of local campaign groups, such as Save the River Usk led by Angela Jones, Save the Wye, Friends of the River Wye, and the Wye and Usk Foundation, and others for their brilliant work in advocating for cleaner rivers and holding authorities accountable.\nCatherine also pointed out there had been no cross-border collaboration under the previous Conservative Government and welcomed the way the UK Labour Government is working with the Welsh Labour Government to support an integrated Wye Catchment Management Plan for restoring water quality across the UK.\n“We have been left a very difficult legacy due to inaction from the Tories and also the Liberal Democrats when they were in coalition. It will take much work by Government to clear up the mess in our rivers lakes and seas and fix the broken system.” Catherine concluded. “But I am confident working cross border and in partnership with all those involved, as the Wye Catchment Partnership aims to do, we can clean up our water ways once and for all.”\nCatherine Fookes is the Member of Parliament for Monmouthshire. Catherine is dedicated to working tirelessly for Monmouthshire, supporting local residents and standing up for them in Parliament. Her key priorities include strengthening the economy, protecting the environment, and advancing women’s rights and equality. Catherine is also a member of the Water (Special Measures) Bill [Lords] Committee and Women and Equalities Committee in Parliament.",
  "https_www_catherinefookes_com_/https_www_catherinefookes_com_post_catherine-fookes-urges-uk-government-to-introduce-bereavement-pay-for-pregnancy-loss-before-24-weeks/content_5.html": "Catherine Fookes Urges UK Government to Introduce Bereavement Pay for Pregnancy Loss Before 24 Weeks\n- catherinefookes\n- Jan 19\n- 2 min read\nCatherine Fookes, MP for Monmouthshire and Member of the Women and Equalities Committee, is calling on the UK Government to extend parental bereavement leave and pay to include women who experience pregnancy loss before 24 weeks, such as miscarriages, ectopic pregnancies, and IVF failures.\nReleased today, The WEC committee’s latest report Equality at Work: Miscarriage and Bereavement Leave, sets out the recommendations to better support women and families who experience pre-24-week pregnancy losses.\nCatherine Fookes said:\n“Pregnancy loss can be devastating experiences for women and their families, yet women are currently only given statutory parental bereavement leave and pay if they either had a child under 18 pass away, or a still birth after 24 weeks of pregnancy. Yet the report shows that more than one in five pregnancies end before 24 weeks and the grief experienced by women and their partners is no different to bereavement after 24 weeks. This needs to change.”\nThe Committee's recommendations include:\nExtending statutory parental bereavement leave and pay to include pre-24-week pregnancy losses, such as miscarriage, ectopic pregnancies, and IVF failures.\nAddressing the inadequacy of sick leave as the default option, which fails to provide the dignity and support bereaved workers need.\nWork with organisations like Advisory, Conciliation and Arbitration Service (Acas) and the Trades Union Congress to promote the benefits of flexible and generous leave policies for pre-24 week-pregnancy loss.\n\"As the report shows, the case for statutory bereavement leave is overwhelming. We must ensure that no women and their families are better supported during periods of immense grief and distress. The UK Government now has the opportunity to take a compassionate step forward by supporting our recommendations and include pre-24-week pregnancy losses in bereavement leave legislation.\"\nAbout Catherine Fookes MP\nCatherine Fookes is the Member of Parliament for Monmouthshire. Catherine is dedicated to working tirelessly for Monmouthshire, supporting local residents and standing up for them in Parliament. Her key priorities include strengthening the economy, protecting the environment, and advancing women’s rights and equality.",
  "https_www_catherinefookes_com_/https_www_catherinefookes_com_post_catherine-fookes-addresses-misleading-national-inquiry-amendment-vote/content_8.html": "Catherine Fookes Addresses Misleading National Inquiry Amendment Vote\n- catherinefookes\n- Jan 19\n- 3 min read\nI want to address some misleading claims about the vote on the Children’s Wellbeing and Schools Bill and the amendment proposed by the Conservatives.\nFirst of all, let me be clear - I am, and always will be, committed to protecting women and young girls from violence and sexual abuse. As a member of the Women and Equalities Committee and former CEO of a Women’s Equality charity, protecting and supporting women and girls has always been one of my top priorities.\nThe Children’s Wellbeing and Schools Bill which I voted for on January 8th includes vital measures to support children in England through limiting school uniform costs, introducing free breakfast clubs, and improving children’s social care by ensuring Councils maintain a ‘children not in school register’ to protect children that are home schooled.\nHowever, the Conservatives tabled an amendment that would have thrown out the entire Bill.\nThe amendment was a political stunt by the Conservative party. It was trickery on the British public who are rightly concerned about this issue. The amendment would not have created an inquiry into child sexual exploitation. Instead, it would have killed a bill designed to help children and families.\nThey wanted to force Labour MP’s, including myself, into a vote against their amendment so they could publicise it across media without any context. It’s unauthentic, dishonest and deeply disappointing. Child abuse and the existence of grooming gangs is horrific and should never be used as a political football.\nThe Government remains fully committed to tackling exploitation and protecting vulnerable children, but this amendment was not the way to do it. The Government has accepted the need for action on the 20 recommendations proposed by the Independent Inquiry into Child Sexual Abuse (IICSA) and the Home Secretary has already announced that government will:\nLegislate to make it mandatory to report abuse, making it an offence with professional and criminal sanctions to fail to report or to cover up child sexual abuse.\nLegislate to make grooming an aggravating factor in the sentencing of child sexual offences, to ensure the punishment fits the terrible crime.\nOverhaul the way information and evidence is gathered on child sexual abuse by introducing a ‘single child identifier’ and through a strengthened police performance framework, with new standards on public protection, child abuse and exploitation.\nIn opposition, Labour called for a national independent inquiry into child sexual abuse and supported the establishment of the IICSA, expertly led by Professor Alexis Jay, when it was launched in 2014 by the previous Government.\nOver seven years, the IICSA engaged with more than 7,000 victims and survivors, processed 2 million pages of evidence, and published 61 reports and publications. Yet the previous Government failed to implement a single one of the 20 recommendations from the final IICSA report.\nIISCA also ran a specific investigation strand into child sexual exploitation by organised networks, which ran for two years and produced a separate report and recommendations in February 2022. That report concluded that police forces and local councils were still failing to tackle this serious crime and set out further recommendations for change, yet far too little progress has been made.\nThe Conservatives had two years to action these recommendations, they actioned none.\nThe Leader of the Conservatives has never once mentioned this issue in Parliament until she felt it was politically opportune to do so. The Labour Government are doing more in just six months to implement these recommendations than the Conservatives did in two whole years.\nI voted for the Children’s well-being and Schools Bill because we must enhance protection for children and deliver justice for the victims of evil crimes of the grooming gangs.\nI rejected the amendment that would have stopped this legislation moving forward and I will continue to work hard in Parliament to ensure that the further recommendations from the IICSA report are delivered.\nPolitical posturing serves no-one. We need action for victims and this is what the Labour Government is focused on."
}