{
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_2025_04_23_dorset-nhs-sites-to-receive-2-million-for-solar-panel-installations/content_6.html": "Lloyd Hatton, Labour MP for South Dorset, has welcomed news that NHS sites in Dorset will receive over £2 million from Great British Energy – the Government’s publicly owned clean energy company – to install solar panels on buildings, cutting energy costs and supporting the transition to clean energy.\nLocally, University Hospitals Dorset NHS Foundation Trust will receive £928,000, while Dorset Healthcare University NHS Foundation Trust will benefit from £1,369,000. This investment is expected to generate estimated savings of £45,000 per year per site, reducing pressure on energy bills and allowing more funding to be directed towards patient care.\nThe first solar panels are expected to be installed by the end of summer 2025.\nIn addition to this project, the Labour Government has announced £12 million in funding for local authorities and community energy groups to develop clean energy initiatives, including onshore wind, rooftop solar, and hydropower.\nWelcoming this new investment, Lloyd Hatton said: “This is great news for our local NHS. By investing in solar panels for our hospitals, we are lowering energy costs and using the savings to deliver better care for patients.\n“With Great British Energy, the Government is doing right by taxpayers and the environment.”",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_surgeries-and-events/content_16.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_tag_eden-portland/content_23.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_latest-news/content_3.html": "Latest news stories\nSearch by a free text phrase, a category or a tag. For example, to see all press releases about my Westminster work, select the Westminster category.\nSearch news stories\nLatest news\nDORSET NHS SITES TO RECEIVE £2 MILLION FOR SOLAR PANEL INSTALLATIONS\nLloyd Hatton, Labour MP for South Dorset, has welcomed news that NHS sites in Dorset will receive over £2 million from Great British Energy –\nLLOYD WELCOMES PAY RISE FOR WORKING FAMILIES, NEW DEFENCE INVESTMENT AND SUPPORT FOR NHS IN SPRING STATEMENT\nLloyd Hatton, Labour MP for South Dorset, has today welcomed measures announced in the Spring Statement that will deliver tangible benefits for working families,\nLloyd Hatton Urges Ministers to Deliver School Projects\nLloyd Hatton, Labour MP for South Dorset, has today urged the Secretary of State for Education to rebuild Dorset Studio School and open the proposed SEND special school at the Osprey Quay site on Portland.\nLloyd Hatton MP to Host ‘Water Forum’ Community Meeting at Sailing Academy to Mobilise Local Water Users\nLloyd Hatton, Labour MP for South Dorset, is set to hold a community meeting to hear from local people about how we can protect and clean up Dorset’s beaches and rivers.\nSouth Dorset MP Invites Ministers to Support Eden Portland Proposals\nLloyd Hatton, Labour MP for South Dorset, has urged Ministers to meet with the team behind Eden Portland and Dorset Council to support the proposed development.\nLloyd Hatton MP Joins Dorset MPs to Tackle ‘Dental Desert’ in Dorset and Secure More NHS Dentist Appointments\nLloyd Hatton, MP for South Dorset, has joined fellow Dorset Labour MPs Jessica Toale (Bournemouth West), Neil Duncan-Jordan (Poole), and Tom Hayes (Bournemouth East) to push for more action to tackle the county’s lack of NHS dentist appointments.\nLangton Matravers Primary School Set To Be Among The First To Open Free Breakfast Club\nSchool children in Langton Matravers and the surrounding villages will soon benefit from Labour’s free breakfast club at St. George’s CofE Primary School.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_tag_rivers/content_22.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_tag_send/content_20.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_tag_biodiversity/content_18.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_contact/content_8.html": "Contact me\nYou can email me at lloyd.hatton.mp@parliament.uk or write to me at:\nHouse of Commons, London, SW1 1AA\nWhen you contact me, please ensure that you include your contact details including your postal address. Please note I can only respond to constituents living in South Dorset.\nAcceptable Behaviour Statement\nI am committed to supporting my constituents in a timely and professional manner. Urgent casework will be prioritised, and I aim to respond within 1-2 weeks wherever possible. Non-urgent correspondence, including those about Westminster issues, may take longer to receive a reply.\nI do not expect my staff to tolerate abusive or aggressive behaviour under any circumstances. If such behaviour occurs, I reserve the right to end communication. Thank you for your understanding and cooperation.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_tag_education/content_15.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_2025_03_07_lloyd-hatton-mp-to-host-water-forum-community-meeting-at-sailing-academy-to-mobilise-local-water-users/content_17.html": "Lloyd Hatton MP to Host ‘Water Forum’ Community Meeting at Sailing Academy to Mobilise Local Water Users\n7 March 2025\nLloyd Hatton, Labour MP for South Dorset, is set to hold a community meeting on Thursday 13 March at the Weymouth and Portland National Sailing Academy to hear from local people about how we can protect and clean up Dorset’s beaches and rivers.\nSet to join Lloyd at the event will be representatives from Surfers Against Sewage, Dorset Coast Forum and Litter Free Dorset, alongside local proactive Town Councillors.\nThe event on Thursday will begin at 6:30pm at the Academy, in the Spinnakers room, and all local water users are encouraged to join Mr Hatton. This ‘water forum’ event is an opportunity to raise concerns, ask questions and – most importantly – put forward a plan of action for protecting our coastline and riverways.\nSpeaking on the upcoming event, Mr Hatton comments: “We want to hear from all water users across South Dorset. Whether you are a sea swimmer, dog walker, rower or sailor, please feel free to come along and contribute.”\nHe continues: “The goal of this event is to get the local community together and to listen to their concerns regarding water-related issues – such as sewage spills, bathing water status, litter and plastics waste or blue flag accreditation in Weymouth. Working as a community, we can clean up our beaches and rivers.”",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_tag_nhs/content_9.html": "DORSET NHS SITES TO RECEIVE £2 MILLION FOR SOLAR PANEL INSTALLATIONS\nLloyd Hatton, Labour MP for South Dorset, has welcomed news that NHS sites in Dorset will receive over £2 million from Great British Energy – the Government’s publicly owned clean energy company – to install solar panels on buildings, cutting energy costs and supporting the transition to clean energy. Locally, University Hospitals Dorset NHS Foundation […]\nLloyd Hatton MP Joins Dorset MPs to Tackle ‘Dental Desert’ in Dorset and Secure More NHS Dentist Appointments\nLloyd Hatton, MP for South Dorset, has joined fellow Dorset Labour MPs Jessica Toale (Bournemouth West), Neil Duncan-Jordan (Poole), and Tom Hayes (Bournemouth East) to push for more action to tackle the county’s lack of NHS dentist appointments.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_2025_01_26_langton-matravers-primary-school-set-to-be-among-the-first-to-open-free-breakfast-club/content_13.html": "Langton Matravers Primary School Set To Be Among The First To Open Free Breakfast Club\n26 January 2025\nFamilies and school children living in Langton Matravers and the surrounding villages will soon benefit from Labour’s free breakfast club at St. George’s CofE Primary School.\nThe school has been selected as one of the first schools to participate in a national pilot scheme starting in April. The Labour Government’s free breakfast clubs aim to ensure that every child starts the school day well-fed and ready to learn, while also putting money back into parents’ pockets.\nThe pilot scheme will offer all primary-aged children at St. George’s CofE Primary School a nutritious breakfast and at least 30 minutes of free childcare each morning. Research has shown that breakfast clubs can positively impact children’s behaviour, attendance, and academic achievement. They also provide an opportunity for pupils to socialise and prepare for the school day in a supportive environment.\nFree breakfast clubs are also part of Labour’s broader effort to support families with the cost of living – meaning many parents will save up to £450 a year.\nPrimary schools have been chosen from across the country to help refine and shape the free breakfast clubs programme, which will be rolled out to every primary school in the near future.\nKaty Astle, Headteacher at St. George’s CofE Primary School, said: “”We are delighted to have been chosen as one of the early adopter schools. For our school, we are keen to do everything we can to support our children and by providing a healthy breakfast and a supportive start to the day will be hugely beneficial. This will add further value to our current provision by offering breakfast club to all our children, which will support their wellbeing, provide additional opportunities to socialise with friends and time for children to settle in so they are ready to learn.”\nLloyd Hatton, Labour MP for South Dorset, has also welcomed the news, saying: “It’s fantastic that St. George’s school will be one of the first to open a free breakfast club. This will make a real difference to local families – supporting childrens’ education while easing financial pressures at home as well. And soon every primary school in South Dorset will have a free breakfast club.”\nSt. George’s CofE Primary School will begin offering the free breakfast club from April, and further updates on the programme’s rollout will be published in due course.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_2025_03_10_lloyd-hatton-mp-urges-ministers-to-deliver-key-school-projects/content_10.html": "Lloyd Hatton Urges Ministers to Deliver School Projects\n10 March 2025\nLloyd Hatton, Labour MP for South Dorset, has today urged the Secretary of State for Education to work at pace to deliver two school projects locally – rebuilding Dorset Studio School’s school buildings and opening the proposed SEND special school at the Osprey Quay site on Portland.\nThe previous government had expressed an interest in rebuilding the school buildings at Dorset Studio School, near to Kingston Maurward College. However, the last government failed to release the funding required or ever deliver the project. This means progress rebuilding the school came to a standstill last year, because the proposed funding support had not been delivered by the Department for Education.\nSpeaking in the House of Commons today, Mr Hatton highlighted the urgent need for Dorset Studio School to secure a new home, particularly given its high percentage of pupils with special educational needs and disabilities (SEND). Lloyd has already met with the relevant Minister’s team to push for the proposals at Dorset Studio School to get the ‘green light’.\nMr Hatton also raised concerns about the much-delayed SEND special school at the Osprey Quay site on Portland, which was first pledged in 2019. For too long, the Osprey Quay school site has sat unused, despite the urgent need for more SEND school places across South Dorset. Mr Hatton has written to the relevant Ministers, calling for the proposed school at Osprey Quay to finally open its doors.\nIn Parliament, Mr Hatton asked the Minister: “The previous Conservative Government failed to build much-needed new school buildings at Dorset Studio School and failed – for years – to open the proposed Osprey Quay special school for children with SEND.\n“Dorset Studio School urgently needs a new home, and families across Weymouth and Portland would benefit hugely from a special SEND school at the Osprey Quay site. So can the Minister outline what steps they are taking to get these two key school projects over the line?”\nThe lack of progress on these essential projects has left local families frustrated, with many struggling to secure a suitable school place for their child. Mr Hatton will continue to urge the Government to prioritise these two projects and provide a timeline for funding and delivery.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_tag_sewage/content_21.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_2025_04_23_lloyd-welcomes-pay-rise-for-working-families-new-defence-investment-and-support-for-nhs-in-spring-statement/content_5.html": "Lloyd Hatton, Labour MP for South Dorset, has today welcomed measures announced in the Spring Statement that will deliver tangible benefits for working families, Britain’s armed forces personnel, and the NHS.\nAs part of the Spring Statement, the Chancellor of the Exchequer confirmed that millions of working families will receive a pay rise in real terms, from next week. With the National Living Wage set to increase by 6.7% from April.\nSeparately, nurses, teachers, police officers, and armed forces personnel have already been awarded a real term pay rise, following years of salary cutbacks. Today, the Chancellor re-committed to ensuring key public sector workers are properly paid.\nFollowing this announcement, Lloyd said: “Families across South Dorset are receiving a long overdue pay boost from April, this Labour Government is making sure that pay slips always keep up with the cost of living.”\nToday, the Chancellor also confirmed a fully funded £2.2 billion increase in defence spending from next month. This comes after the Government set out the biggest sustained increase in defence spending since the Cold War, in February. Spending on defence will increase to 2.5% of GDP from April 2027, with an ambition to reach 3% in the next parliament. South Dorset is home to a proud armed forces community and many supply-chain businesses that support defence industries are set to benefit.\nFollowing new defence investment announced by the Government, Lloyd added: “This new investment means improved housing for military families, new investment and jobs for businesses in South Dorset supporting the armed forces, and a clear commitment to investing in Britain’s national security.”\nThis Government has already committed to increasing NHS spending nationally by £25.7 billion from 2024-2025. Locally, the NHS is also receiving a significant boost. Dorset County Hospital is moving ahead with plans for a new Emergency Department and Critical Care Unit after being awarded £100 million from the new Government.\nFollowing the Statement, Lloyd set out: “The Government is already delivering record investment – and much-needed reforms – across our cherished NHS. We are feeling the benefits on the ground with new emergency facilities under construction at Dorset County Hospital and NHS waiting lists falling for the last five months.”",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_press-coverage/content_4.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk/content_1.html": "Surgeries and Events\nCome to one of my upcoming events.\nLatest News\nView all my latest press releases.\nPress Coverage\nView all my latest press releases.\nBorn and raised in South Dorset\nI am honoured to serve as the area’s first homegrown Member of Parliament. With a population of around 100,000, the South Dorset constituency includes the large towns of Weymouth, Swanage and the Isle of Portland; as well as Crossways, Wool and Chickerell.\nGenerations of my family have their roots in South Dorset. I grew up in Weymouth, attending Holy Trinity and All Saints schools.\nMy first job was at the Marlboro fish and chip shop near Town Bridge, and weekends were pretty much spent on the rugby pitch at Weymouth RFC.\nChampioning what matters to you\nThat’s why I’m 100% committed to be a local champion for our fantastic communities.\nI’m working closely with the Labour government on my Plan for South Dorset. This is about me standing up for our community in ways that matter to you, such as championing our community hospitals and securing investment for key local services.\nWorking hard in Westminster\nIn Westminster, I promote South Dorset’s interests tirelessly, making sure our voices are heard at the highest levels.\nI am passionate about fair taxation, so that everyone – including the super-rich – pays their dues.\nMy other campaigns include tackling white-collar crime, corruption and cronyism.\nI will always stand up for taxpayers – challenging waste and making sure that every penny counts.\nWatch my maiden speech\nI was honoured to give my maiden speech in the House of Commons on 13 November 2024.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_2025_01_26_elementor-5170/content_7.html": "Lloyd Hatton MP Joins Dorset MPs to Tackle ‘Dental Desert’ in Dorset and Secure More NHS Dentist Appointments\n26 January 2025\nLloyd Hatton, MP for South Dorset, has joined fellow Dorset Labour MPs Jessica Toale (Bournemouth West), Neil Duncan-Jordan (Poole), and Tom Hayes (Bournemouth East) to push for more action to tackle the county’s lack of NHS dentist appointments.\nAccess to NHS dentistry has become a postcode lottery across the country. And the South West region is the worst in the country for access to dentists – with 99.1% not accepting new adult NHS patients. Locally, almost 60% of Dorset adults and 47% of children have not seen an NHS dentist in the past year with no dentist in South Dorset currently accepting new NHS patients.\nIn response to the crisis, all four Dorset Labour MPs have sent a joint letter to the Secretary of State for Health and Social Care, Wes Streeting, calling for urgent action to address the lack of appointments in the county.\nOn the letter, Mr Hatton said: “I have had countless conversations with constiteunts who have struggled to access NHS dental care. With the unavailability of new appointments, many patients are having to go as far as Southampton or Bristol to access the services they require.\n“This is unacceptable, I will do everything I can to secure additional NHS dentists appointments here in South Dorset. And I will continue to work with the Health Secretary to get the right outcome for our community.”\nHe continues: “Patients should be able to recieve both routine and emergency dental care close to their homes, without having to worry about the extra financial and time costs that come with travelling long distances to see a dentist.”\nEarlier this month, Lloyd Hatton also spoke alongside Chief Medical Officer, Sir Chris Whitty, in a Public Accounts Committee session about the dental crisis. This session was dedicated to exploring the failure to recover NHS dental care up until now.\nAt the session, Mr Hatton commented: “Recruitment is a huge issue.One of my constituents, a sergeant stationed in Bovington Camp, has said he is unable to get himself, his wife or his three children registered, despite serving in the Armed Forces. It’s good to see ‘golden hello’ incentives for new dentists, but these need to be targeted at the areas with the greatest need.”\nAll four Labour MPs welcomed the recent government announcement that patients across the country are set to benefit from 700,000 extra urgent appointments – 13,569 of which are allocated to Dorset, but this does not tackle the lack of access for constituent to routine NHS dental check-ups and appointments.\nMoving forward, the four Dorset MPs have requested a meeting with the Heath Secretary to discuss this matter further, and have invited Mr Streeting to Dorset to speak with patients and dentists first-hand to understand the extent of the crisis.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_tag_beaches/content_19.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_2025_02_04_south-dorset-mp-invites-ministers-to-support-eden-portland-proposals/content_12.html": "South Dorset MP Invites Ministers to Support Eden Portland Proposals\n4 February 2025\nLloyd Hatton, Labour MP for South Dorset, has urged Ministers to meet with the team behind Eden Portland and Dorset Council to support the proposed development.\nEden Portland is an ambitious project that seeks to repurpose Albion Stone’s Jordans Mine into a unique subterranean visitor attraction dedicated to biodiversity, education and ecological research.\nInspired by the success of the Eden Project in Cornwall and the upcoming Eden Project Morecambe, this proposed development promises to boost inward investment, enhance the local tourism industry, and create well-paid jobs.\nSpeaking in the House of Commons yesterday, Lloyd Hatton said: “Eden Portland is an exciting proposal for my community. Much like the Eden Project and Eden Project Morecambe, it would be a hub for education, science, and ecology. If delivered, Eden Portland would boost investment, strengthen our tourism industry, and create well-paid jobs for local people.\nI know Ministers agree that this could be a real success story, so will they meet with myself and the team at Eden Portland, alongside colleagues at the Department for Digital, Culture, Media and Sport, to discuss how we can back this exciting project?”\nMr Hatton is working closely with the team backing Eden Portland and is continuing to lobby the Government to explore how it can best support the project and ensure its success.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_cookie-policy/content_11.html": "This Cookie Policy was last updated on 31 March 2025 and applies to citizens and legal permanent residents of the United Kingdom.\n1. Introduction\nOur website, https://lloydhatton.co.uk (hereinafter: \"the website\") uses cookies and other related technologies (for convenience all technologies are referred to as \"cookies\"). Cookies are also placed by third parties we have engaged. In the document below we inform you about the use of cookies on our website.\n2. What are cookies?\nA cookie is a small simple file that is sent along with pages of this website and stored by your browser on the hard drive of your computer or another device. The information stored therein may be returned to our servers or to the servers of the relevant third parties during a subsequent visit.\n3. What are scripts?\nA script is a piece of program code that is used to make our website function properly and interactively. This code is executed on our server or on your device.\n4. What is a web beacon?\nA web beacon (or a pixel tag) is a small, invisible piece of text or image on a website that is used to monitor traffic on a website. In order to do this, various data about you is stored using web beacons.\n5. Cookies\n5.1 Technical or functional cookies\nSome cookies ensure that certain parts of the website work properly and that your user preferences remain known. By placing functional cookies, we make it easier for you to visit our website. This way, you do not need to repeatedly enter the same information when visiting our website and, for example, the items remain in your shopping cart until you have paid. We may place these cookies without your consent.\n5.2 Statistics cookies\nWe use statistics cookies to optimize the website experience for our users. With these statistics cookies we get insights in the usage of our website. We ask your permission to place statistics cookies.\n5.3 Marketing/Tracking cookies\nMarketing/Tracking cookies are cookies or any other form of local storage, used to create user profiles to display advertising or to track the user on this website or across several websites for similar marketing purposes.\n6. Placed cookies\n7. Consent\nWhen you visit our website for the first time, we will show you a pop-up with an explanation about cookies. As soon as you click on \"Save preferences\", you consent to us using the categories of cookies and plug-ins you selected in the pop-up, as described in this Cookie Policy. You can disable the use of cookies via your browser, but please note that our website may no longer work properly.\n7.1 Manage your consent settings\n8. Enabling/disabling and deleting cookies\nYou can use your internet browser to automatically or manually delete cookies. You can also specify that certain cookies may not be placed. Another option is to change the settings of your internet browser so that you receive a message each time a cookie is placed. For more information about these options, please refer to the instructions in the Help section of your browser.\nPlease note that our website may not work properly if all cookies are disabled. If you do delete the cookies in your browser, they will be placed again after your consent when you visit our website again.\n9. Your rights with respect to personal data\nYou have the following rights with respect to your personal data:\n- You have the right to know why your personal data is needed, what will happen to it, and how long it will be retained for.\n- Right of access: You have the right to access your personal data that is known to us.\n- Right to rectification: you have the right to supplement, correct, have deleted or blocked your personal data whenever you wish.\n- If you give us your consent to process your data, you have the right to revoke that consent and to have your personal data deleted.\n- Right to transfer your data: you have the right to request all your personal data from the controller and transfer it in its entirety to another controller.\n- Right to object: you may object to the processing of your data. We comply with this, unless there are justified grounds for processing.\nTo exercise these rights, please contact us. Please refer to the contact details at the bottom of this Cookie Policy. If you have a complaint about how we handle your data, we would like to hear from you, but you also have the right to submit a complaint to the supervisory authority (the Information Commissioner's Office (ICO)).\n10. Contact details\nFor questions and/or comments about our Cookie Policy and this statement, please contact us by using the following contact details:\nLloyd Hatton MP\nHouse of Commons, London SW1A 0AA\nUnited Kingdom\nWebsite: https://lloydhatton.co.uk\nEmail: lloyd.hatton.mp@ex.comparliament.uk\nThis Cookie Policy was synchronised with cookiedatabase.org on 31 March 2025.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_sign-up-to-newsletter/content_14.html": "To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nFunctional\nAlways active\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nPreferences\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nStatistics\nThe technical storage or access that is used exclusively for statistical purposes.The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nMarketing\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.",
  "https_lloydhatton_co_uk_/https_lloydhatton_co_uk_privacy-policy/content_2.html": "Introduction\nWelcome to the official website of Lloyd Hatton, Member of Parliament for South Dorset. We are committed to protecting your privacy and personal information. This Privacy Policy explains how we collect, use, and safeguard your data when you visit our website or contact us through our online form.\nInformation we collect\nWe may collect the following types of personal information when you use our contact form:\n- Name\n- Email address\n- Postal address\n- Phone number\n- Any other information you choose to provide in your message\nHow we use your information\nWe use the information you provide to:\n- Respond to your enquiries or requests\n- Provide constituent services\n- Keep you informed about relevant local issues and events\n- Improve our website and services\nData protection\nWe take the security of your personal information seriously. To protect your data, we:\n- Use secure, encrypted connections (HTTPS) for all website traffic\n- Limit access to personal information to authorised staff members only\n- Regularly update our security measures to protect against unauthorised access\nData storage and retention\nWe use the Forminator WordPress plugin to manage our contact form. Forminator stores form submissions in the WordPress database.\nWe retain your personal information only for as long as necessary to fulfil the purposes for which it was collected, or as required by law.\nYour rights\nUnder the UK General Data Protection Regulation (GDPR), you have the right to:\n- Access your personal data\n- Rectify inaccurate personal data\n- Request erasure of your personal data\n- Object to processing of your personal data\n- Request restriction of processing your personal data\n- Request transfer of your personal data\n- Withdraw consent\nTo exercise these rights, please contact us using the details provided below.\nThird-party links\nOur website contains links to third-party websites. We are not responsible for the privacy practices or content of these sites.\nChanges to this Privacy Policy\nWe may update this Privacy Policy page from time to time.\nContact us\nIf you have any questions about this Privacy Policy, please contact me.\nPlease also see our Cookie Policy."
}