{
  "http_andrewforlabourwrexham_org_uk_/http_andrewforlabourwrexham_org_uk_cdn-cgi_l_email-protection/content_2.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_andrewforlabourwrexham_org_uk_/http_andrewforlabourwrexham_org_uk_privacy-policy/content_3.html": "PRIVACY POLICY\nThis “Privacy Policy” sets out information relating to how we use personal information relating to constituents and visitors to this website.\nWHAT’S INCLUDED IN THIS PRIVACY NOTICE?\nANDREW RANGER MP\nThis document (“privacy notice”) sets out information relating to how we will use personal information relating to visitors to this website. It also sets out information about what rights individuals have in relation to their personal information and various other matters required under data protection law.\nIn particular, this privacy notice provides information about how you can object to our use of your personal information, how you can withdraw any permissions you have given to enable us to process your personal information, and how you can make a complaint.\nWHO DOES THIS PRIVACY NOTICE APPLY TO?\nThis privacy notice applies to visitors to this website.\nOne of our key roles as campaigners is to raise issues on behalf of people. As such we will often collect and use personal information as part of our role. From time to time we will also contact people to ask them to complete surveys to gather information and opinions on matters..\nIn the sections below, when referring to visitors to this website we will use the terms “you” or “your”.\nWHAT’S OUR APPROACH TO PRIVACY?\nWe take your privacy extremely seriously and want you to feel confident that your personal information is safe in our hands.\nWe will only use your personal information in accordance with the data protection law applicable to England and Wales from time to time.\nUnder data protection law, when we use your personal information, we will be acting as a data controller. Essentially, this means that we will be making decisions about how to use your personal information and why.\nBelow, we summarise the main rules that apply to us as a data controller under data protection law when we use your personal information:\n- We must be upfront about how we intend to use your personal information and must use your personal information fairly. Providing privacy information to individuals (such as in this privacy notice) is one aspect of using personal information fairly.\n- We must only use your personal information if we have a legal basis to do so under data protection law. These legal bases include:\n- That you have consented to our use of your personal information;\n- That our use of your personal information is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in us.\n- We must only use certain types of sensitive personal information, also referred to as special category personal information (such as information relating to your health, racial or ethnic origin, political opinions, or criminal convictions) if we can also satisfy one of the conditions for processing this type of information set out in data protection law. These conditions include:\n- That you have given us your explicit consent to use the information; and\n- That the processing is necessary for reasons of substantial public interest.\n- We are only permitted to share your personal information with others in certain circumstances and if we take steps to ensure that your personal information will be secure.\n- Generally speaking, we must only use your personal information for the specific purposes we have told you about. If we want to use your personal information for other purposes, we need to contact you again to tell you about this.\n- We must not hold more personal information than we need for the purposes we have told you about and must not retain your personal information for longer than is necessary for those purposes (this is known as the “retention period”). We must also dispose of any information that we no longer need securely.\n- We must ensure that appropriate security measures are in place to protect your personal information.\n- We must act in accordance with your rights under data protection law.\n- We must not transfer your personal information outside the European Economic Area (“EEA”) unless certain safeguards are in place. One such safeguard is that the personal data is only transferred to a country that has been approved by the European Commission as having an acceptable level of data protection law.\nHOW WILL WE USE YOUR PERSONAL INFORMATION?\nHow we will use your personal information, the legal bases we will rely upon, how long we will keep your personal information and other details are set out below.\nSURVEYS\nWhat personal information we will use\n- Your name;\n- Your address;\n- Your contact details (email address, telephone number etc);\n- Your opinions or other personal information provided by you in the survey.\nHow we will obtain the personal information\n- Provided by you when you complete the survey.\nWhat purposes we will use the personal information for\n- To obtain information relevant to inform;\nThe legal grounds we rely upon\n- Our use of your personal information in connection with the purposes set out above is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in us.\nHow long we retain the personal information and why\n- We will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. If you have consented to receive information about our work, we will only retain your personal information so long as you ask not to be contacted further. We will regularly review the personal information we hold to ensure that its use is necessary and proportionate.\nWHEN WILL W EUSE YOUR PERSONAL INFORMATON FOR DIRECT MARKETING?\nIn addition to data protection law, if we use your personal information for direct marketing purposes, we may also be subject to additional rules that regulate direct marketing. The term “direct marketing” essentially means directing marketing material or political campaign communications at a particular individual.\nTo ensure compliance with both data protection laws and the specific rules relating to direct marketing, we will only use your personal information to provide you with political campaign information, whether by telephone, email, text or other forms of electronic communication [or by post] if you have given us your specific consent to do so.\nOur legal basis for such processing under data protection law will therefore be that you have given your consent to process your personal data for direct marketing purposes.\nWe will retain your personal information unless and until you inform us that you no longer wish to receive direct marketing information from us. You can ask us to stop sending direct marketing to you at any time by contacting us using the details set out in the section below titled –\n“How can you get in touch with us?”\nIP ADDRESSES AND COOKIES\nWhen visiting and interacting with most websites and services delivered via the internet, when you visit our website, the technology used on our website, and via the hosting provider(s) we use, gathers certain information and stores it in log files.\nThis information includes Internet Protocol (IP) addresses, operating system, browser version, cookie details, the content you viewed on our website, system and configuration information, and locale and language preferences. This information gathered will only be used to monitor and ensure the security of our website and the data kept on it and/or to make website improvements for the benefit of visitors to our website. We collect and use Log Data to operate, maintain and improve upon the information we provide to visitors to our website. For example, Log Data can help to detect new security threats on our website, identify malicious third parties, and provide more robust security protection for all users that visit and communicate with us via our website.\nOur website may use cookies and other information gathering technologies for a variety of purposes, such as providing us with information about how visitors interact with the content on our website and to allow us to improve upon the services and/or information on our website for the benefit of all users. You can control how websites use cookies by configuring your browser’s privacy settings (please refer to your browser’s help section to learn more about cookie controls). If you choose to disable cookies entirely, the services and/or information provided on our website may not function properly.\nNEWSLETTERS\nWhat personal information we will use\n- Your name;\n- Your contact details (postal address, email address, telephone number etc.);\nHow we will obtain the personal information\n- Provided by you.\nWhat purposes we will use the personal information for\n- To provide you with newsletters about the work we undertake.\nThe legal grounds we rely upon\n- You have given your consent\nOR - Our use of your personal information in connection with the purposes set out above is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in us. This is because the processing of your personal data by us will be to provide you, by post, with communications about our work, an activity which we consider promotes democratic engagement\nHow long we retain the personal information and why\nUntil you tell us that you no longer wish to receive newsletters and updates from us. You can ask us to stop sending direct marketing to you at any time by contacting us using the details set out in the section below titled – “How can you get in touch with us?”\nWHEN WILL WE SHARE YOUR PERSONAL INFORMATION WITH OTHERS?\nSometimes, we will need to share your personal information with others. This section sets out details of who we will share your personal information with and why. It also tells you about our legal basis for doing so under data protection law and steps we will take to protect your personal information.\nORGANISATIONS WHO CAN ASSIST WITH YOUR CASE\nWho are these Organisations?\n- We will share such of your personal information as is necessary with organisations who can assist with your enquiry.\nWhy we need to share your personal information with them\n- To assist with your enquiry or to obtain information relevant to your enquiry.\nThe legal bases we rely upon when sharing your personal information\n- Sharing of personal data with such organisations will be necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in us.\nWhat precautions do we take?\n- We will only share personal data as is necessary and will take steps to determine that the organisations are aware of the importance of protecting personal data.\nPROVIDERS OF INFORMATION TECHNOLOGY SERVICES\nWho will we be sharing your personal information with?\n- Suppliers of information technology products and services such as:\n- We work with other companies to help run our website. These companies provide services to help us to maintain our website, deliver support to our constituents, provide communications support and maintain administrative and security support on our behalf. These Service Providers may only process personal information pursuant to instruction and in compliance with our Privacy Policy and other applicable confidentiality, security measures and regulations. We do not permit any Service Providers to use any personal information we share with them for their own marketing purposes or for any other purpose than in connection with the services they provide to us.\nWhy we need to share your personal information with such providers\n- We use suppliers of information technology products and services in connection with the supply, maintenance and/or improvement of our IT network, and the creation, development hosting and maintenance of our website.\nThe legal bases we rely upon when sharing your personal information\n- We rely upon our legitimate interests in ensuring that our work is managed efficiently and our IT system can function properly and efficiently and that our IT network is secure.\nWhat precautions do we take?\n- We enter into contracts with our IT providers which require them to put appropriate security measures in place and which restrict their use of your personal information.\nOTHER THIRD PARTIES\nWe may also need to share your personal information with others in the following circumstances:\nLegal or regulatory requirements\nOn occasion, we may be required to disclose your personal information to organisations such as the courts or the police to comply with legal obligations we are subject to and/or to prevent fraud or crime.\nSafeguarding\nOn occasion, we may need to disclose your personal information to other organisations such as the local authority or the police for safeguarding purposes in the substantial public interest.\nProfessional advice and legal action\nWe may need to disclose your personal information to our professional advisers (for example, lawyers and accountants) in connection with the provision by them of professional advice and/or the establishment or defence of legal claims.\nWHAT RIGHTS DO YOU HAVE UNDER DATA PROTECTION LAW?\nUnder data protection law, you have a number of different rights relating to the use of your personal information. The information below contains a summary of those rights and our obligations. More information about your rights and our obligations can be found on the ICO website https://ico.org.uk/.\nYour rights – What this involves – What our obligations are\nA right of access\nThis is a right to obtain access to your personal data and various supplementary information.\n- We must provide you with a copy of your personal information and the other supplementary information without undue delay and in any event within 1 month of receipt of your request;\n- We cannot charge you for doing so save in specific circumstances (such as where you request further copies of your personal information).\nA right to have personal data rectified\nThis is a right to have your personal information rectified if it is inaccurate or incomplete.\n- We must rectify any inaccurate or incomplete information without undue delay and in any event within 1 month of receipt of your request;\n- If we have disclosed your personal information to others, we must (subject to certain exceptions) contact the recipients to inform them, that your personal information requires rectification.\nA right to erasure\nThis is a right to have your personal information deleted or removed. This right only applies in certain circumstances (such as where we no longer need the personal information for the purposes for which it was collected). We have the right to refuse to delete or remove your personal data in certain circumstances.\n- If this right applies, we must delete or remove your personal information without undue delay and in any event within 1 month of receipt of your request;\n- If we have disclosed your personal information to others, we must (subject to certain exceptions) contact then recipients to inform them that your personal information must be erased.\nA right to object\nThis is a right to object to the use of your personal information. The right applies in certain specific circumstances only. You can use this right to challenge our use of your personal information based on our legitimate interests or where the processing is necessary for the performance of a task in the public interest or in the exercise of official authority vested in us. You can also use this right to object to use of your personal information for direct marketing\n- If you object to us using your personal information for direct marketing, We must stop using your personal information in this way as soon as we receive your request.\n- If you object to other uses of your personal information, whether we have to stop using your personal information will depend on the particular circumstances.\nA right to restrict processing\nThis is a right to ‘block’ or suppress processing of your personal information. This right applies in various circumstances, including where you contest the accuracy of your information).\n- If we are required to restrict our processing of your personal information we will be able to store it but not otherwise use it.\n- We may only retain enough information about you to ensure that the restriction is respected in future.\n- We have disclosed your personal information to others, we must (subject to certain exceptions) contact them to tell them about the restriction on use.\nIf you wish to exercise any of your rights, you can make a request by contacting us using the details set out in the section below titled –\n“How can you get in touch with us?”\nIf you request the exercise of any of your rights we are entitled to ask you to provide us with any information that may be necessary to confirm your identity.\nYOUR RIGHT TO WITHDRAW CONSENT\nIf you have given us your consent to use any of your personal information, you can withdraw your consent at any time. To do so, please contact us using the details set out in the section below titled – “How can you get in touch with us?”\nHOW CAN YOU GET IN TOUCH WITH US?\nYou can get in touch with us in the following ways:\nEmail address: [email protected]\nWe are the persons overseeing compliance with data protection law an this privacy notice. If you have any questions about this privacy notice, how your personal information is handled or if you wish to make a complaint, please contact us.\nRIGHT TO COMPLAIN TO THE INFORMATION COMMISSIONER’S OFFICER\nIf we are unable to deal with a complaint to your satisfaction or if you are unhappy with the way we are using your personal data, you also have the right to make a complaint at any time to the UK’s supervisory authority for data protection issues, the Information Commissioner’s Office.\nCHANGES TO THIS PRIVACY NOTICE\nWe may update this privacy notice from time to time. If we make any substantial updates, We will provide you with a new privacy notice. We may also notify you in other ways from time to time about the processing of your personal information.\nIn effect: 17/02/25\nGET IN TOUCH\nAs your MP for Wrexham, I can help you with or offer advice on issues, such as; benefits, tax, housing, environment, business and other areas.\nI would love to hear from you about what you think my priorities should be as your MP and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n01978 788854\n-",
  "http_andrewforlabourwrexham_org_uk_/http_andrewforlabourwrexham_org_uk/content_1.html": "Do you need help on local issues? Get in touch today.\nAbout Me\nCampaigns\nFollow on Social Media\nLatest News\nKeep updated on the latest news, campaigns and my work on behalf of voters in Wrexham.\n-\nWales Questions 30/04/2025 – Trailblazer Programme North Wales\nAt Wales Questions 30th April 2024, Andrew Ranger MP asked about the first Wales Trailblazer programme.\n01/05/2025Read More -\nNew S4C chair – Press Release\nCommittee endorses Delyth Evans as new S4C Chair Report publication: Appointment of Delyth Evans as S4C Chair Wrexham MP Andrew Ranger was part of the Welsh Affairs Committee who endorsed Delyth Evans as the Government’s preferred candidate to Chair Welsh language broadcaster S4C. S4C is a wholly Welsh language channel broadcasting programmes across a range\n28/04/2025Read More -\nWritten Question to the Secretary of State for Work and Pensions\nQuestion: To ask the Secretary of State for Work and Pensions, what steps she has taken to support people from disadvantaged socio-economic backgrounds in accessing employment opportunities. (43524) Tabled on: 02 April 2025 Answer: Alison McGovern: The Get Britain Working White Paper focuses on building a thriving labour market, reducing economic inactivity and increasing the\n11/04/2025Read More\nVideos & Media\nWe aim to make the Labour Party and our community engagement activities accessible to everybody. On this page you’ll find videos about our latest campaigns and constituency events.\nGET IN TOUCH\nAs your MP for Wrexham, I can help you with or offer advice on issues, such as; benefits, tax, housing, environment, business and other areas.\nI would love to hear from you about what you think my priorities should be as your MP and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n01978 788854\n-\nA huge thank you to @Gwersyllt Park Cricket Club and particularly Mark and Amy for showing me the fantastic new pavilion and The Parc Community Hub. The plans for how the Hub will support the community are brilliant and I'm really looking forward to see how they develop.\nIt was also the ideal venue to hold my Gwersyllt surgery and thank you to everyone who came to speak with me. ... See MoreSee Less\nFootball governance is something we know a lot about here in Wrexham. Together with a group of MPs and with the support of Wrexham AFC, we have written to the Prime Minister to thank him for his continued support of the Football Governance Bill, which has its second reading today, and to emphasise why this Bill is so important. It aims to deliver an independent football regulator that will “protect and promote the sustainability of English football.\" As the letter says, \"the football pyramid must provide a sustainable future for clubs and their supporters, delivering sporting jeopardy without financial catastrophe.\"\nLeader Live\nWrexham.com\nPhoto credit: Wrexham AFC ... See MoreSee Less\nOn Workers' Memorial Day, we remember all those who have lost their lives to work-related illness or injury.\nKey to keeping people safe at work is a strong, organised union in every workplace.\nRemember the dead, fight for the living! #IWMD25 @The_TUC ... See MoreSee Less\nBooking is now open for my constituency surgery in Marchwiel. If you have an issue that you would like to discuss, please email or telephone my office for an appointment. ... See MoreSee Less\nHuge congratulations to Wrexham AFC on their historic back to back to back promotions.\nWhat a fantastic result! Well done to all the players, the management and the owners.\nChampionship here we come! 🎉🎉\n#WxmAFCWE ARE GOING UP 😍\n🔴⚪️ #WxmAFC ... See MoreSee Less\nA big weekend of football for Wrexham.\nTomorrow, Wrexham AFC Women will contest the Bute Energy Welsh Cup final at Rodney Parade in Newport. What a fantastic achievement to reach the final for 2 consecutive seasons and wishing the team good luck for the final!\nAnd today... eyes will be on the Cae Ras for the 5.30pm kick off. With Wycombe kicking off earlier it could be another dramatic day for Wrexham AFC\nEnjoy your weekend everyone.\n... See MoreSee Less\nWrexham striker Abbie Iddenden on her scoring streak, this weekend’s cup final and why the cameras help\nwww.nytimes.com\nWrexham's women will battle Cardiff City's for cup glory on Sunday, the same as last season. But things feel very different this time...🏃♀️🏃It's a big weekend of running this weekend with the Wrexham 10K and Manchester Marathon on Sunday. Good luck to everyone taking part including Wrexham AFC's Humphrey Ker who is raising funds for the wonderful Wrexham Miners Project.\n... See MoreSee Less\nHumphrey Ker still 'astonished' by 'level of interest' Americans show Wrexham\nwww.leaderlive.co.uk\nHumphrey Ker says he is still 'astonished' by the level of interest shown in the club by Americans.I was delighted to talk about Wrexham Carnival of Words in this week's @Leader Live along with why reading and literacy is a national priority.\n... See MoreSee Less\nAndrew Ranger MP shares all the information for this years Wrexham Carnival of words\nwww.leaderlive.co.uk\nAt the end of this week, Wrexham will welcome the Carnival of Words once again. This annual event aims to share a love of reading and books with…Today OFCOM has published its Children's Codes which are part of the UK Government's Online Safety Act. They include over 40 measures to cover areas such as social media, search engines and online gaming. A watershed moment, aiming to create a safer online world for our children. ... See MoreSee Less\nOfcom sets out new codes of practice to protect children online\nnews.sky.com\nTechnology Secretary Peter Kyle calls it a \"watershed moment\" that will help tackle \"lawless, poisonous environments\" and hold social media firms to account."
}