{
  "https_joannareeves_co_uk_/https_joannareeves_co_uk/content_1.html": "THE CONSERVATIVE PARTY: THE QUESTIONS WE NEED TO ANSWER\nAs we enter the week of the first big political test since the disastrous general election of 2024, it seems clear that both Reform and the Lib Dems are going to profit from the electorate’s frustration with both the Conservative opposition and the Labour government....\nA LOOK AT THE CONSERVATIVE PARTY BOARD\nI have been concerned that the structure of the Conservative Party is little known to ordinary members. Clearly, 2024’s general election was utterly woeful for the Party. We have some excellent people at grassroots and not only do they need to be heard, they need to...\nA Light on the Structure of the Conservative Party\nOne of the most surprising aspects of the Conservative Party is that so few people know how the various parts of the Party fit together. And as well as being surprising, to my mind this cloudiness of function acts as a suppressant to the proper functioning – and...\nJoanna has been Chair of Holborn and St Pancras Conservative Association since 2020, guiding the Association through Covid and out the other side, opposing the Leader of the Opposition and now the Prime Minister.\nShe ran to become Chair of the National Conservative Convention in 2024, receiving attention and coverage from the press due to her bold and outspoken campaign.\nShe stood for Parliament in the 2024 General Election, in Hackney South and Shoreditch.\nJoanna is Chair of the Macmillan Cancer Support Annual Ball, now raising over £500k each year at the Victoria and Albert Museum.\nJoanna founded and chairs Conservative Friends of Neurodiversity and is Director of the Fellowship of Conservative Friends of Education.\nJoanna is a member of the committee of the United and Cecil Club (a major Conservative fundraising group). She is a member of the Carlton Club.\nHaving graduated in Modern Languages and History from St Catharine’s College Cambridge Joanna took a PGCE at St Hilda’s College Oxford. She has been Chair of the St Catharine’s College Cambridge Alumni Society.\nJoanna is a former teacher of Modern Languages. She has been been married to Martin since 1995 and they have two sons in their early twenties."
}