{
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_ian-smith-your-independent-voice-for-change/content_6.html": "Decisions affecting our future have been made for far too long by people who are not aware of the needs and priorities of our region. The capital and the South East have had their interests given priority by a centralised political system centred in London, with Northern cities and regions being disregarded in spite of their historical contributions to the prosperity and international stature of our country.\nWe have a rare chance on May 2nd to alter this story. It’s an opportunity to take back control from London and deal with the problems that really concern us, establishing a future based on our common goals and values.\nMy vision is very clear: I see a region that is united, ambitious, egalitarian, and environmentally sensitive. In my ideal world, a thriving City Region would produce highly skilled, valuable jobs in the industries of the future while guaranteeing that all young people had access to the training and education required to realise their full potential.\nPrioritising equity and inclusivity will help to ensure that every person and community benefits from our shared wealth. In addition, we have to carefully balance development and preservation in our future planning so that we may embrace progress while preserving our legacy.\nI think we should use our creative abilities and natural resources to change the world. We have the ability to set the standard, whether it’s by using renewable energy sources or our proficiency in industries like digital innovation and life sciences.\nThe history and economic success of our area have been based on connectedness via infrastructure and maritime trade. By updating our digital infrastructure, modernising our transport systems, and putting us at the vanguard of a brand-new high-speed rail network for the North, I’m dedicated to reviving these linkages.\nAs a group of six boroughs with a common history and set of principles, we understand that our power comes from working together. As the Metro Mayor, I promise to support every community and make sure that everyone’s voice is heard. I have significant roots in this area, so I can personally attest to its prospects and challenges.\nRestoring the relationship between politics and the people it represents is the goal of devolution, not merely creating another level of government. It’s about identifying the reasons behind the decline in public confidence in politicians and acting to restore it. I’m putting myself forward to run for Metro Mayor because of this.\nIan Smith\nVote Independent",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_the-businessman/content_7.html": "Past 10 years serving the community in Bootle & Formby. Self proclaimed green voice! No greenwashing!",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_news_page_2/content_10.html": "Philanthropy in Politics: A Look at Sefton’s Unique Approach\nHighlight the philanthropist’s influence on local politics in Sefton, discussing how their commitment to social causes is reflected in policy decisions and community development initiatives.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_category_most-recent_page_2/content_29.html": "Liverpool News The Philanthropist A personal commitment of £20,000 will be set aside to start a refurbishment fund for Orrell Mount Park to enhance the facilities for the wellbeing Read More » 19 April 2023",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_what-is-the-green-revolution/content_14.html": "Skip to content\nFacebook-f\nInstagram\nTwitter\nContact Us\nMost Recent\nLocal News\nLiverpool News\nNews Archives\nMost Recent\nLocal News\nLiverpool News\nNews Archives\nLocal News\nWhat is the green revolution?\nBy\nThe Editor\nApril 19, 2023\nNext Article\nArticles You Might Like\nThe Strand £32.5 Million, what next?\nThe Editor\n19 April 2023\nThe Philanthropist\nThe Editor\n19 April 2023\nThe Entrepreneur\nThe Editor\n19 April 2023\nShare This Article\nMore Stories\nQ and A at The CASA\n11 April 2024\nRead More\nCall for Immediate Ceasefire\n11 April 2024\nRead More",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_philanthropy-in-politics-a-look-at-seftons-unique-approach/content_5.html": "Highlight the philanthropist’s influence on local politics in Sefton, discussing how their commitment to social causes is reflected in policy decisions and community development initiatives.\nHighlight the philanthropist’s influence on local politics in Sefton, discussing how their commitment to social causes is reflected in policy decisions and community development initiatives.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk/content_3.html": "Call for Immediate Ceasefire\nMy Commitment and passion to stop the Genocide of Palestinian people in Gaza has been supported from day one of the weekly marches through our City centre.\nMy Commitment and passion to stop the Genocide of Palestinian people in Gaza has been supported from day one of the weekly marches through our City centre.\nBy filling in the form you consent to receiving our Monthly Enewsletter direct to your inbox. Thanks again for your support!\nPossibly the last vote before photo ID is required\nDecisions affecting our future have been made for far too\nLaunch of Champian website, newsletter and the Warm Pub Network.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_the-strand-32-5-million-what-next/content_4.html": "Skip to content\nFacebook-f\nInstagram\nTwitter\nContact Us\nMost Recent\nLocal News\nLiverpool News\nNews Archives\nMost Recent\nLocal News\nLiverpool News\nNews Archives\nMerseyside News\n,\nMost Recent\nThe Strand £32.5 Million, what next?\nBy\nThe Editor\nApril 19, 2023\nNext Article\nArticles You Might Like\nThe Philanthropist\nThe Editor\n19 April 2023\nThe Entrepreneur\nThe Editor\n19 April 2023\nSefton’s Council Meetings Unveiled: Behind the Scenes\nThe Editor\n17 January 2024\nShare This Article\nMore Stories\nQ and A at The CASA\n11 April 2024\nRead More\nCall for Immediate Ceasefire\n11 April 2024\nRead More",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_railway-sidings-wildlife-destroyed-why/content_8.html": "Years of wandering and enhancing the acres of wildlife and forestry of Galsworthy Avenue railway sidings came to a crashing halt and destroyed in two days! WHY?\nWho can justify this mindless destruction ?\nWhat are the plans?\nAnswers to be sought.\nYears of wandering and enhancing the acres of wildlife and forestry of Galsworthy Avenue railway sidings came to a crashing halt and destroyed in two days! WHY?\nWho can justify this mindless destruction ?\nWhat are the plans?\nAnswers to be sought.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_category_liverpool-news/content_16.html": "Liverpool News\nThe CEO Founder (No Greenwashing)\nSafebuy UK (not Facebook) seeking an independent audit and ringfencing of loss making Sefton council companies.\nSafebuy UK (not Facebook) seeking an independent audit and ringfencing of loss making Sefton council companies.\nA personal commitment of £20,000 will be set aside to start a refurbishment fund for Orrell Mount Park to enhance the facilities for the wellbeing\nPast 10 years serving the community in Bootle & Formby. Self proclaimed green voice! No greenwashing!\nPossibly the last vote before photo ID is required",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_category_local-news/content_17.html": "Local News\nVoter Apathy. How do we change?\nAfter 3 by elections and 30,000 leaflets highlighting the Corruption, Nepotism, Cronyism and a culture of bullying within council ranks has led to nothing. My\nAfter 3 by elections and 30,000 leaflets highlighting the Corruption, Nepotism, Cronyism and a culture of bullying within council ranks has led to nothing. My\nHighlight the philanthropist’s influence on local politics in Sefton, discussing how their commitment to social causes is reflected in policy decisions and community development initiatives.\nTake readers behind the scenes of Sefton’s council meetings, shedding light on the councillor’s active role in shaping local policies and engaging in political discourse.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_the-philanthropist/content_24.html": "A personal commitment of £20,000 will be set aside to start a refurbishment fund for Orrell Mount Park to enhance the facilities for the wellbeing of local residents and community.\nA personal commitment of £20,000 will be set aside to start a refurbishment fund for Orrell Mount Park to enhance the facilities for the wellbeing of local residents and community.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_the-entrepreneur/content_25.html": "Launch of Champian website, newsletter and the Warm Pub Network. What’s good and bad in Bootle…You have your say!",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_q-and-a-at-the-casa/content_22.html": "Skip to content\nFacebook-f\nInstagram\nTwitter\nContact Us\nMost Recent\nLocal News\nLiverpool News\nNews Archives\nMost Recent\nLocal News\nLiverpool News\nNews Archives\nMost Recent\nQ and A at The CASA\nBy\nChris_M\nApril 11, 2024\nWednesday 17th 7.30 to 9.30\nHome of Socialist Values.The CASA.\nIan Smith Q and A\nPrevious Article\nArticles You Might Like\nThe Strand £32.5 Million, what next?\nThe Editor\n19 April 2023\nThe Philanthropist\nThe Editor\n19 April 2023\nThe Entrepreneur\nThe Editor\n19 April 2023\nShare This Article\nMore Stories\nCall for Immediate Ceasefire\n11 April 2024\nRead More\nVoter Apathy. How do we change?\n9 April 2024\nRead More",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_news/content_9.html": "Q and A at The CASA\nWednesday 17th 7.30 to 9.30 Home of Socialist Values.The CASA. Ian Smith Q and A\nWednesday 17th 7.30 to 9.30 Home of Socialist Values.The CASA. Ian Smith Q and A\nMy Commitment and passion to stop the Genocide of Palestinian people in Gaza has been supported from day one of the weekly marches through our City centre.\nAfter 3 by elections and 30,000 leaflets highlighting the Corruption, Nepotism, Cronyism and a culture of bullying within council ranks has led to nothing. My\nWithout doubt my political journey developed from a devotion to stop the ridiculous access road ripping through Rimrose Valley Country Park and protecting a vital\nMy desire to see an end to rough sleeping is inspired by Brian Philips and the many organisations, volunteers and outreach personnel who feed, clothe\nDuring the last 18 months I have stood independently in 3 local by elections to try and make a change in local politics and a\nOrrell Mount Park and Pavillion sits in the heart of Bootle and is now in its 8th year of unwanted dereliction and neglect by Sefton\nSefton has a unique parcel of land that can form the Litherland Loop. This is a vision and a 2 year study to connect the\nYears of wandering and enhancing the acres of wildlife and forestry of Galsworthy Avenue railway sidings came to a crashing halt and destroyed in two\nDecisions affecting our future have been made for far too long by people who are not aware of the needs and priorities of our region.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_privacy-policy/content_21.html": "This privacy policy sets out how Champian uses and protects any information that you give Champian when you use this website.\nChampian is committed to ensuring that your privacy is protected. Should we ask you to provide certain information by which you can be identified when using this website, then you can be assured that it will only be used in accordance with this privacy statement.\nChampian may change this policy from time to time by updating this page. You should check this page from time to time to ensure that you are happy with any changes. This policy is effective from June 2018.\nWhat we collect\nWe may collect the following information:\n- Name and job title\n- Contact information including email address\n- Demographic information such as postcode, preferences and interests\n- Other information relevant to customer surveys and/or offers\nWhat we do with the information we gather\nWe require this information to understand your needs and provide you with a better service, and in particular for the following reasons:\n- Internal record keeping.\n- We may use the information to improve our products and services.\n- We may periodically send promotional emails about new products, special offers or other information which we think you may find interesting using the email address which you have provided.\n- From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, phone, fax or mail. We may use the information to customise the website according to your interests.\nSecurity\nWe are committed to ensuring that your information is secure. In order to prevent unauthorised access or disclosure, we have put in place suitable physical, electronic and managerial procedures to safeguard and secure the information we collect online.\nHow we use cookies\nA cookie is a small file which asks permission to be placed on your computer’s hard drive. Once you agree, the file is added and the cookie helps analyse web traffic or lets you know when you visit a particular site. Cookies allow web applications to respond to you as an individual. The web application can tailor its operations to your needs, likes and dislikes by gathering and remembering information about your preferences.\nWe use traffic log cookies to identify which pages are being used. This helps us analyse data about web page traffic and improve our website in order to tailor it to customer needs. We only use this information for statistical analysis purposes and then the data is removed from the system.\nOverall, cookies help us provide you with a better website, by enabling us to monitor which pages you find useful and which you do not. A cookie in no way gives us access to your computer or any information about you, other than the data you choose to share with us.\nYou can choose to accept or decline cookies. Most web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. This may prevent you from taking full advantage of the website.\nLinks to other websites\nOur website may contain links to other websites of interest. However, once you have used these links to leave our site, you should note that we do not have any control over that other website. Therefore, we cannot be responsible for the protection and privacy of any information which you provide whilst visiting such sites and such sites are not governed by this privacy statement. You should exercise caution and look at the privacy statement applicable to the website in question.\nControlling your personal information\nYou may choose to restrict the collection or use of your personal information in the following ways:\n- Whenever you are asked to fill in a form on the website, look for the box that you can click to indicate that you do not want the information to be used by anybody for direct marketing purposes\n- If you have previously agreed to us using your personal information for direct marketing purposes, you may change your mind at any time by writing to us.\n- We will not sell, distribute or lease your personal information to third parties unless we have your permission or are required by law to do so. We may use your personal information to send you promotional information about third parties which we think you may find interesting if you tell us that you wish this to happen.\nYou may request details of personal information which we hold about you under the Data Protection Act 1998. A small fee will be payable. If you would like a copy of the information held on you please write to –\nIf you believe that any information we are holding on you is incorrect or incomplete, please write to or email us as soon as possible, at the above address. We will promptly correct any information found to be incorrect.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_the-litherland-loop/content_23.html": "Sefton has a unique parcel of land that can form the Litherland Loop.\nThis is a vision and a 2 year study to connect the disused railway and the Leeds / Liverpool canal stretching from Bootle to Aintree and surrounding areas with a designated rail trail cycle and footpath.\nHighways without Hypocrisy!\nA long term goal to a net zero decentralised energy zone.\nThe Litherland Loop is a unique area to achieve this goal.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_category_most-recent/content_27.html": "Q and A at The CASA\nWednesday 17th 7.30 to 9.30 Home of Socialist Values.The CASA. Ian Smith Q and A\nWednesday 17th 7.30 to 9.30 Home of Socialist Values.The CASA. Ian Smith Q and A\nWithout doubt my political journey developed from a devotion to stop the ridiculous access road ripping through Rimrose Valley Country Park and protecting a vital\nMy desire to see an end to rough sleeping is inspired by Brian Philips and the many organisations, volunteers and outreach personnel who feed, clothe\nDuring the last 18 months I have stood independently in 3 local by elections to try and make a change in local politics and a\nOrrell Mount Park and Pavillion sits in the heart of Bootle and is now in its 8th year of unwanted dereliction and neglect by Sefton\nSefton has a unique parcel of land that can form the Litherland Loop. This is a vision and a 2 year study to connect the\nYears of wandering and enhancing the acres of wildlife and forestry of Galsworthy Avenue railway sidings came to a crashing halt and destroyed in two\nDecisions affecting our future have been made for far too long by people who are not aware of the needs and priorities of our region.\nTake readers behind the scenes of Sefton’s council meetings, shedding light on the councillor’s active role in shaping local policies and engaging in political discourse.\nLaunch of Champian website, newsletter and the Warm Pub Network. What’s good and bad in Bootle…You have your say!",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_terms-conditions/content_20.html": "Welcome to our website. If you continue to browse and use this website you are agreeing to comply with and be bound by the following terms and conditions of use, which together with our privacy policy govern Champian relationship with you in relation to this website.\nThe term “Champian” or “us” or “we” refers to the owner of the website.\nThe use of this website is subject to the following terms of use:\nThe content of the pages of this website is for your general information and use only. It is subject to change without notice.\nNeither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law.\nYour use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements.\nThis website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these terms and conditions.\nAll trademarks reproduced in this website, which are not the property of, or licensed to the operator, are acknowledged on the website.\nUnauthorised use of this website may give to a claim for damages and/or be a criminal offence.\nFrom time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s).\nYou may not create a link to this website from another website or document without Champian prior written consent.\nYour use of this website and any dispute arising out of such use of the website is subject to the laws of England and Wales.\nWebsite Disclaimer\nThe information contained in this website is for general information purposes only. The information is provided by Champian and whilst we endeavour to keep the information up-to-date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.\nIn no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of or in connection with the use of this website.\nThrough this website you are able to link to other websites which are not under the control of Champian. We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them.\nEvery effort is made to keep the website up and running smoothly. However, Champian takes no responsibility for and will not be liable for the website being temporarily unavailable due to technical issues beyond our control.\nCOPYRIGHT NOTICE\nThis website and its content is copyright of “Champian” – © “Champian” 2024.\nAny redistribution or reproduction of part or all of the contents in any form is prohibited other than the following:\nYou may print or download to a local hard disk extracts for your personal and non-commercial use only. You may copy the content to individual third parties for their personal use, but only if you acknowledge the website as the source of the material\nYou may not, except with our express written permission, distribute or commercially exploit the content. Nor may you transmit it or store it in any other website or other form of electronic retrieval system.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_seftons-council-meetings-unveiled-behind-the-scenes/content_26.html": "Take readers behind the scenes of Sefton’s council meetings, shedding light on the councillor’s active role in shaping local policies and engaging in political discourse.\nTake readers behind the scenes of Sefton’s council meetings, shedding light on the councillor’s active role in shaping local policies and engaging in political discourse.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_call-for-immediate-ceasfire/content_19.html": "My Commitment and passion to stop the Genocide of Palestinian people in Gaza has been supported from day one of the weekly marches through our City centre.\nMy vision and dream is to see the stopping of Arms sailing from the river mersey that is aiding and abetting war crimes.\nLiverpool City Region should not stand on the wrong side of history!\nLiverpool City Region should not be complicit in war crimes or Genocide happening in Gaza.\nImmediate Ceasefire now! End the occupation!",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_voter-apathy-how-do-we-change/content_12.html": "After 3 by elections and 30,000 leaflets highlighting the Corruption, Nepotism, Cronyism and a culture of bullying within council ranks has led to nothing.\nMy pledges to tackle fly tipping, rat infested alleyways and a domestic refuse with a service fit for purpose has led to nothing.\nThe question is how do we make change ?\nVote the same, We get the same!\nMake your vote count.\nNo more Voter Apathy.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_ian-smith-who-am-i/content_1.html": "During the last 18 months I have stood independently in 3 local by elections to try and make a change in local politics and a system embedded with Nepotism and Cronyism.\nI am standing again for a fourth time in Litherland Ward, Bootle, Sefton and standing as your Metro Mayor for the Liverpool City Region combined Authority to make Change!\nI wish to see change in a the culture of councillors to represent the communities they are elected in and root out the self serving individuals that outweigh the current administration.\nI thrive for open and transparent discussion to resolve issues and stand by my socialist principles.\nMy Labour membership will NOT be renewed.\nI am NOT Starmers Labour!\nI am an Independent Socialist Person – IAN SMITH",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_homeless-no-more-a-safe-refuge-for-all/content_11.html": "My desire to see an end to rough sleeping is inspired by Brian Philips and the many organisations, volunteers and outreach personnel who feed, clothe and communicate with the misplaced and misunderstood in our society.\nI see far too many empty buildings, houses and land that could tackle the problem head on.\nThe people who care can make change with boots on the ground mentality.\nA safe refuge for all and a universal basic income is a starting point.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_supplying-the-warm-pub-network/content_13.html": "Skip to content\nFacebook-f\nInstagram\nTwitter\nContact Us\nMost Recent\nLocal News\nLiverpool News\nNews Archives\nMost Recent\nLocal News\nLiverpool News\nNews Archives\nLocal News\nSupplying the Warm Pub Network\nBy\nThe Editor\nApril 19, 2023\nSupporting Ian in Netherton & Orrell\nPrevious Article\nNext Article\nArticles You Might Like\nThe Strand £32.5 Million, what next?\nThe Editor\n19 April 2023\nThe Philanthropist\nThe Editor\n19 April 2023\nThe Entrepreneur\nThe Editor\n19 April 2023\nShare This Article\nMore Stories\nQ and A at The CASA\n11 April 2024\nRead More\nCall for Immediate Ceasefire\n11 April 2024\nRead More",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_netherton-orrell-by-election-thursday-16th-feb/content_15.html": "Skip to content\nFacebook-f\nInstagram\nTwitter\nContact Us\nMost Recent\nLocal News\nLiverpool News\nNews Archives\nMost Recent\nLocal News\nLiverpool News\nNews Archives\nLiverpool News\nNetherton & Orrell By-Election Thursday 16th Feb\nBy\nThe Editor\nApril 19, 2023\nPossibly the last vote before photo ID is required\nNext Article\nArticles You Might Like\nThe Strand £32.5 Million, what next?\nThe Editor\n19 April 2023\nThe Philanthropist\nThe Editor\n19 April 2023\nThe Entrepreneur\nThe Editor\n19 April 2023\nShare This Article\nMore Stories\nQ and A at The CASA\n11 April 2024\nRead More\nCall for Immediate Ceasefire\n11 April 2024\nRead More",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_my-local-park-silcocks-and-what-it-means-to-me/content_2.html": "Orrell Mount Park and Pavillion sits in the heart of Bootle and is now in its 8th year of unwanted dereliction and neglect by Sefton Council.\nMy philanthropic pledges to enhance and maintain our local park and to refurbish the pavillion for community use has been hindered and blocked by self serving councillors unwilling to represent the residents who elect them.\nMy commitment to enhancing the park and Pavillion for the benefit of local residents remains steadfast as an Entrepeneur, philanthropist or your councillor if elected.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_the-ceo-founder-no-greenwashing/content_28.html": "Safebuy UK (not Facebook) seeking an independent audit and ringfencing of loss making Sefton council companies.",
  "https_champian_co_uk_ian-smith-who-am-i_/https_champian_co_uk_rimrose-valley-park/content_18.html": "Without doubt my political journey developed from a devotion to stop the ridiculous access road ripping through Rimrose Valley Country Park and protecting a vital green space from development or destruction.\nMy commitment to enhance, protect and maintain green spaces is endless and unwavering to the army of volunteers within our communities."
}