{
  "https_olliepearsonforcentraldevon_co_uk_/https_olliepearsonforcentraldevon_co_uk/content_1.html": "\"Thank you to everyone who voted for me on 4 July. I am so grateful for all your support.\"\nOllie Pearson, Labour's Candidate for Central Devon\nWe were being straight with you. Only we could have defeated the Tories at this election.\n\"this was a once in a generation chance for real change in Devon\"\nOllie Pearson\nLabour Parliamentary Candidate\nCentral Devon\nOnly Labour could beat the Tories in Central Devon\nHere in Central Devon, the only party that could beat the Tories on July 4 2024 was Labour. We were neck and neck in the polls, so a vote for Labour was a vote for real change.\n2019 election result\nIn the 2019 General Election Labour was the only party with any chance of defeating the Tories who got 32,095 votes.\nA vote for the other parties failed to deliver the change we needed in Central Devon on 4 July 2024.\nLabour's 2024 Manifesto - Change\nWe can stop the chaos, turn the page, and start to rebuild our country.\nMuch of what Britain has been through in the past 14 years is explained by a Conservative failure to face the future.\nPolitics should be driven by a sense of service to the country, not considerations of party or self-interest. If you elect Labour on 4 July, we will show that politics can be about serving the country.\nLabour believes if you work hard then – whoever you are, wherever you started in life – Britain is a country that will respect your contribution and give you a fair chance to get on.\nFive national missions – A new Britain\n- Where wealth is created in every community.\n- Where the golden opportunity of clean British power is harnessed for lower bills and to tackle the Climate Crisis.\n- Where your town or village has been revitalised and everyone feels safe to walk the streets.\n- Where you can go to work and know you will be treated with dignity and respect and where children are equipped with the skills to thrive in the future.\n- Where our NHS is once again at the cutting edge of healthcare.\nAbout Ollie\n“I’m Ollie and I’ve lived and worked in Devon for more than 20 years. As well as building and running a successful small business, I am proud to have been a local Labour councillor helping to make a real difference to my community.\nI love Devon, it’s my home and it’s where I belong, the moor and the sea are the places I like to spend any free time I have. Central Devon is a place defined by Dartmoor, its villages and towns, its beauty, history and tranquillity, but also the challenges that come along with that geography – connectivity, housing, local health services and opportunities for our people – young and old. A better future for Central Devon means protecting and enhancing our fragile environment, providing great local health services and building a local economy that works for everyone.\nI’m standing to be Central Devon’s next MP, to stop the chaos the Conservatives have brought to our country over the past 14 years. I’m standing to give a voice to everyone who wants a change. The Labour Party has fully-funded plans for the environment, public services and our economy. I will work hard for your vote on 4 July and continue that work as your MP.”\n“I was born in 1980, in Leicester, and as a child growing up in the Midlands in the 1980’s things were bleak – two of my years in junior school were spent in a cold, crumbling prefab class room (temporary since the early 1970’s). New nets for the goal posts on the school playing field were not on the shopping list – the highest priority for education spending was maintaining the photocopier so we could share the one or two beaten up text books our hard-working teachers had to make do with.\nIt’s fair to say that Labour in power from 1997 transformed both school buildings and education to the extent that in the early 2000s, at Leicester University, some of the best and brightest people around me were choosing to go into teaching because of the Labour Government’s commitment to Education. You could tell a similar story about so many aspects of public life, Sure Start, hospital building, NHS waiting times and much more. Growing up when and where I did, I saw a huge difference between the results of Labour and the Conservatives in power.\nIn 2009 with another Conservative government on the horizon, I decided it was time to step up and I joined the Labour Party to try and help keep great local MPs, like Ben Bradshaw in Exeter, in office. But also to campaign against what I feared was to come. Unfortunately, my worst fears back then came true – with years of austerity and low economic growth, we then faced a chaotic hard Brexit and a disastrous mini budget. After 14 years of Tory government, almost everything got worse for almost everyone – from falling living standards to the highest tax burden this country has seen in 70 years. Many of those friends I mentioned, who at university were inspired to become teachers have left the profession due to the pressures and underfunding of these last 14 years. The ones that have stayed are my heroes.”\n“I am passionate about our environment, and I’m passionate about the life and energy of our communities, about music the arts, sports and the outdoors. I am determined to make the services we all rely on the best they can be.\nAs an Exeter City Councillor, I saw what a difference Labour could make. I was proud to be part of building and funding Exeter’s St Sidwell’s Point Leisure Centre, getting a new contract in place to pay the real living wage to our council cleaning staff and protecting funding for our community organisations. I want to make a real difference for Central Devon – for our villages, towns and farming communities. With a Labour MP and a Labour Government we can get our future back.”"
}