{
  "https_www_aontu_ie/https_www_aontu_ie_privacy-policy/content_4.html": "Privacy Policy\nAontú is committed to protecting and respecting your privacy, security and confidentiality. This Privacy Statement sets out how we collect, use, process and disclose the personal data (“Data”) that we collect from you, or that you provide to us, on our website (“Site”). This Privacy Statement should be read in conjunction with our Cookie Policy.\nWe only collect Data about you on the Site which you volunteer when you use our online Contact Us forms, if you make a purchase, donation, decide to become a member or if you report a problem with our Site. When you contact us, we may keep a record of that correspondence. We also collect Data automatically when you access our Site, as explained in our Cookie Policy. You can adjust and update your cookie preferences on our cookie preferences page, and you can withdraw your consent at any time.\nWe make no attempt to identify individual visitors or to associate the technical details we collect with any individual. We may use your Data to comply with any legal obligations.\nPersonal Information Use\nWe will collect your payment information to pay for any Services you have requested from us. We may share your information with third parties such as payment gateways in order to provide our online services and donation facilities. Credit and debit card information is processed directly by payment providers who perform payment services on our behalf. Occasionally, our employees receive payment information from customers over the phone. When this occurs, the payment information is entered as instructed into the relevant payment system and all other copies are permanently deleted.\nWe will use your personal information to carry out our obligations arising from any contract you as our customer have entered into with us, including sending important notices such as communications relating to payment, delivery services, changes to our terms, conditions, and policies and to notify you about changes to our service. We may notify you by phone, post, email, SMS text or through other digital media depending on the content of the notification and your preferred contact mechanism.\nThe legal basis for this processing is in carrying out a contract for the supply of goods and services, consent and in the legitimate interests of the organisation.\nWe will also use your personal information to provide you with welcome emails to help you get the most out of the service, and rewards which may include competitions, events and other offers that are available to our members and guests.\nThe legal basis for this data processing is in the legitimate interests of the organisation.\nWe may occasionally send informational emails about news, updates and upcoming events to the email address you have provided – we will only do so with your prior informed clear consent. We have an interest in making sure our communications are relevant for you. You may at any time choose not to receive communications from us by following the unsubscribe instructions included at the end of each email communication.\nThe legal basis for this data processing is consent and in the legitimate interests of the organisation.\nThe personal information of members and membership applicants to Aontú will be used by Aontú for the contractual purpose of registering (or re-registering) and maintaining membership records. This membership data will be retained by Aontú for such period as the membership subsists, and for up to six months afterwards so that confirmation of membership cessation may be finalised. If a member decides to resign by writing to Aontú their personal data will then be erased.\nThe legal basis for this data processing is consent and in the legitimate interests of the organisation.\nThe personal data of members will also be used for administrative purposes to maintain membership records including cumann attendance, meeting minutes, event attendance, voting records, communication and notification of events which may be held by Aontú.\nThe legal basis for this data processing is in the legitimate interests of the organisation.\nEvents, Petitions, Polls and Surveys\nWe conduct raffles, events, surveys, petitions and polls to produce original research and run events. Your participation is entirely voluntary. You may consent to Aontú contacting you at the email address provided to participate in this research or event as part of an informed and transparent consent process. We make every effort to ensure the resulting information is anonymised by dealing with the information in the aggregate.\nWe will not disclose your Data to third parties unless you have consented to this disclosure. Otherwise we will only disclose your Data if we believe in good faith that we are required to disclose it in order to comply with any applicable law, a summons, a search warrant, a court or regulatory order or other statutory or legal requirement.\nIf you have any questions or concerns regarding how your Data is processed via this Site, please contact us at info@aontu.ie or write to us at Aontú, Irish Unity Centre, 8 Market Sq, Navan, Co Meath, Ireland. All requests will be dealt with promptly and efficiently.\nThe legal basis for this data processing is in the legitimate interests of the organisation.\nUse of Cookies\nCookies are small data files that allow websites to recognise repeat visitors and are used to facilitate visitor navigation and experience of the website. The cookie does this by assigning a unique user number to the visitor. You should be aware that most browsers are initially configured to accept cookies, but you are entitled to refuse to accept cookies. You can adjust and update your cookie preferences on our cookie preferences page, and you can withdraw your consent at any time.\nAontú uses a hit counter called Matomo which may put cookies on your system for the purposes of recording repeat visits to the site and collect information about visitor behaviour on our website. Matomo stores information about what pages you visit, how long you are on the site, how you got here and what you click on. This data is collected via a JavaScript in the pages of our site and is not tied to personally identifiable information. This is important because two different people visiting are separate from the same person visiting twice. This information is anonymised and stored locally, it does not leave the European Union at any point and is transferred to no third parties for processing.\nIf you have any queries about how we process your personal data on this Site, please send an email to: dpo@aontu.ie\nThe legal basis for this processing is consent and in the legitimate interests of the organisation.\nAutomated decision making processes\nThe information you submit to Aontú will not be subjected to any automated decision making processes except to the extent that members may be organised by profession, location or related criteria in order to contact them with information about relevant events that may be of interest to them.\nThe legal basis for this processing is in the legitimate interests of the organisation.\nData storage and retention\nAontú retains your information to fulfil the purposes for which it was collected and for no longer than is required to comply with our operational and legal obligations. If we enter into a legal contract with you, we will hold the relevant information for seven years from the date of completion of this contract in reference to the statute of limitations for a legal claim under contract. Payment information is retained for six years to comply with Revenue Commissioner regulations.\nYour rights\nThese are your rights under data protection legislation, which may be exercised free of charge:\n- To ask for a copy of the information we hold about you, to be provided in a commonly used format\n- To have your personal information transmitted to another data controller in a commonly used format, where this is technically possible\n- To update any inaccurate information we hold about you with the correct information\n- To erase any personal information we hold about you, with exceptions specified by legislation\n- To withdraw your consent to data processing where it was previously given\n- To restrict your information being processed\n- You have the right not to have your information automatically processed in such a way that it may result in a legal or otherwise undesired effect upon you\n- To object to how we use your information, where it is being used for the legitimate operation of Aontú\n- You have the right to lodge a complaint with the Data Protection Commissioners if you are concerned about how your data is being processed\nWhere can I get advice or make a complaint\nWe have a Data Protection Officer who makes sure we respect your rights and comply with the law. If you have any concerns or questions about how we look after your personal information, please contact our Data Protection Officer at\nAontú Data Protection Officer\nIrish Unity Centre\n8 Market Square\nNavan\nCo Meath\nIreland\nEmail: dpo@aontu.ie\nTelephone:\nDublin: 01 618 3564\nNavan: 046 90 23472\nData Controller\nThe data controller responsible for decisions regarding the information collected on this website is Peadar Tóibín, who can be contacted at Peadar.Toibin@oireachtas.ie.\nBasis for data collection:\nAll data collected by Aontú about its members is gathered on a contractual basis for the proper functioning of the party, except where required by law such as by the Revenue Commissioners for purchases and payments made to Aontú and by the statute of limitations for a legal claim under contract. If the correct information is not supplied, members may miss out on events and opportunities such as those outlined above.\nChanges to this privacy notice\nThis privacy notice may be updated to reflect changes in our services and how we comply with data protection legislation. We encourage you to review this notice on a regular basis.",
  "https_www_aontu_ie/https_www_aontu_ie_cookie-policy/content_3.html": "Cookie policy\nYou can adjust your cookie settings on our cookie preferences page.\nCookies\nCookies are small text files stored in a prearranged location on your computer or browsing device, which may be a phone, laptop or tablet, among others, when you visit a website. Not every website places cookies, but most of them do. This text file usually contains a unique identifier which is compared with other information to determine for example, whether or not you have last visited, or whether you would like to see the contents of the site in English or Irish.\nWhich cookies are used and the reasons Aontú uses cookies\n- Cookies are placed to determine which language you’d like to be shown content, which is a necessary cookie for the function of the site.\n- Cookies are placed to determine whether or not you may be logged in to our systems, which is a necessary cookie for the function of the site.\n- We use an online shop called woocommerce which is a very popular online retail platform. This system places necessary and functional cookies on your system when you make orders and visit the shop. These cookies will expire after a few hours, on the same day, or at the latest in two days time. These cookies are stored locally and not passed on to any third parties for processing.\n- Woocommerce also places a single text cookie to check that cookies can be placed, which is necessary and functional. These cookies are stored locally and not passed on to any third parties for processing.\n- Our payment processor, Stripe, (the company which takes your credit card details) may also place necessary, functional and short lived cookies on your computer.\n- Cookies are placed to track how many people are visiting our site and which parts of the site they are visiting. This information is anonymised and aggregated and stored fully within the EU, and not passed on to any third parties for processing. We do not use Google services or allow Google to place cookies through our system.\nAll cookies may be blocked by your browser settings, but if all cookies are blocked the site may not function properly. Required functional cookies do not store any personally identifiable information.\nIf you would like to adjust your cookie settings on your browser, these may be useful links:\nChanges to this cookie policy\nThis cookie policy notice may be updated to reflect changes in our services and how we comply with data protection legislation. We encourage you to review this notice on a regular basis.",
  "https_www_aontu_ie/https_www_aontu_ie/content_1.html": "#AONTÚACCOUNTABILITY\nAontú\n#AONTÚACCOUNTABILITY\nAontú is a grassroots all-Ireland movement, dedicated to Life, Unity and Economic Justice for all. We are Ireland’s fastest growing political movement.\nIn recent years Aontú successfully fought two referendums. We won 8 council seats in the local elections. Aontú surpassed Labour, the Soc Dems and PbP in votes in the European election. We challenged the political establishment in the general elections in the north.\nAontú achieved the highest increase in votes of any party in the general election. We increased our Dáil representation with the addition of Paul Lawless TD in Mayo. Just under 100,000 people have given Aontú their 1st preference vote in the last general elections north and south.\nThat progress has been down to our candidates, membership, and supporters. Thousands of Aontú members are working throughout the country to make their communities and this country a better place. Aontú is the best organised opposition to the damage and waste of this government.\nThere is a growing chasm between the political establishment and the people. There is a political bubble in Ireland which separates the elite from the people they are meant to serve. On so many different issues Aontú is the only party listening to the people. Aontú has injected common sense back into the political debate. We have prioritised bread and butter politics, like housing and the cost-of-living crisis, in a system that is distracted by woke culture wars. We have sought to protect hard pressed families from the government-imposed Cost of Living crisis.\nIrish people have suffered significantly from the lack of infrastructure. Hundreds of thousands of families do not have safe secure home. The National Children’s Hospital is an example of much needed health infrastructure delivered at a snail’s pace ballooning out of all cost controls. The reason for this, is that the Irish political establishment is an accountability free zone. No one is ever held to account. Aontú is seeks to change this. There must be a cost to senior politicians and civil servants for wasting taxpayers’ money. Aontú will ensure accountability.\nIssues\nEconomic Justice\nFix Political Culture\nUnified Economy\nRegional Development\nRight to life\nBrexit & Irish Unity\nLatest News\nLOW PAID WORKERS DESERVE MORE THAN SMUG PATRONISING WORDS ON INTERNATIONAL WORKERS DAY\n“People who are travelling to work from Cavan especially plasterers, plumbers, and electricians end up paying around €2000 a year on tolls. They don’t have any option to try and avoid this payment or any steps they can take to reduce this financial hardship. They have...\nCAVAN GENERAL HOSPITAL –DANGEROUSLY UNDERSTAFFED HEALTH SERVICE LEADS TO DRAMATIC CANCELLATION OF OUTPATIENT APPOINTMENTS – O’REILLY\nA dramatic 54% increase in cancelled outpatient appointments at Cavan General Hospital in the past year is a “devastating inditement of a dangerously understaffed health service” . Aontú Senator Sarah O’Reilly has revealed that 1,048 appointments were cancelled in...\nA victory for women and common sense – Senator O’Reilly\n“A victory for common sense, for women and for those who are unafraid to put their heads above the parapet to defend the rights of those who are being eroded by ideology”. That’s how Aontú Senator Sarah O’Reilly has described the recent ruling by the British Supreme...\nThe Irish political system is radically broken\nThroughout Ireland, many people are now afraid to say what they feel, many are afraid to respectfully engage on a range of different topics. Many feel there is a new censorship and a new political correctness in Ireland, that opposition to the establishment is being deleted.\nRespectful opposition is not the enemy. Respectful opposition is a critical element of a functional democracy. Aontú will have the backbone to stand up, without fear, for you.",
  "https_www_aontu_ie/https_www_aontu_ie_terms-and-conditions/content_2.html": "Terms and Conditions\nIMPORTANT\nPlease read the following information carefully as it sets out the terms and conditions which governs the sale of products on this website. By purchasing items on this site you will be deemed to have accepted these terms and conditions of sale and our privacy policy.\n1. Goods\nSubject as hereinafter provided, Aontú warrants that all goods promoted for sale on this site are of satisfactory quality. Specifications on this website of the goods to be sold are not intended to be binding and are intended only to give a general description of the goods. In all other respects, and to the maximum extent permissible, Aontú makes no other warranties or promises about the goods, and any implied warranties are excluded.\nThe warranty contained above is subject to the following conditions: (i) the goods must be stored in appropriate conditions; if you do not store them in appropriate conditions we cannot be held responsible for faults or problems that arise as a result; (ii) any claim by you in respect of any shortages and/or defects in the goods must be notified to us in accordance with these terms and conditions, stating the nature of the shortage/defect and quoting the invoice no.; if you fail to notify us you will be deemed to have accepted the goods.\n2. Availability\nAll goods are offered for sale subject to availability. Aontú regrets that occasionally it may be impossible to complete an order if stock runs out or is withdrawn for any reason. If there is a problem we will let you know as soon as we can and will refund in full any money that you have already paid to Aontú in respect of the goods in question. The price of the goods shall be the price listed on our website on the date of your order, inclusive of any VAT which may be payable by you. All prices displayed on the website are quoted in Euro and must be paid in full, including delivery charges (which are separately stated at the time of your order). Customers, and not Aontú, are responsible for the payment of any applicable customs duties or taxes in their own country, and failure to pay customs duties or taxes is likely to result in your package being destroyed.\n3. Ordering\nBy clicking on the ADD TO CART button whenever you see an item you would like to buy. Adding an item to your basket does not commit you to buy as you can always remove it later. You can review the contents of your basket at any time by clicking the VIEW CART button. Once you have found all the items you need, go to the checkout and pay for your purchases by following the simple instructions given there. Please ensure that you include the following information with your order, as we cannot process your order without this information:\n• Name\n• E-mail address\n• Contact telephone number\n• Card type\n• Full name as displayed on the card, the credit card\n• Number, and expiry date of the card\n• Billing address\n• Delivery address (This need not be the same as the billing address)\n• Items you require\nBy clicking the Confirm button on the Confirm & Purchase Screen, you agree to these terms and conditions. Please carefully check your personal details and details of the goods to be provided before clicking the Confirm button. By completing and submitting the electronic order form you are making an offer to purchase goods which, if accepted by us, will result in a binding contract.\nYou are responsible for ensuring the accuracy of your order and we shall supply you, subject to availability, with the quantity and specification of goods set out in your order. While your card may be debited before the contract is formed, if the order is ultimately rejected, a full refund will be made immediately.\nShould you notice that any details are incorrect, after you have placed your order, you should contact us without delay in order to amend any inaccurate details. We cannot guarantee that we will be able to make any such amendments and do not accept any responsibility in this regard.\n4. Acceptance of orders\nAll orders are subject to acceptance by Aontú.\nOnce we have received your order we will confirm all the details by e-mail and advise you whether or not the item(s) you require are in stock.\n5. Delivery\nWe aim to deliver your order within 21 days. However delays may occur if the items you have ordered are out of stock. You will be advised of stock availability when we process your order.\nThe delivery charges that apply to your purchases are specified in Euro.\nIn the event that some of the items you have ordered are out of out of stock we may send your order to you by two or more deliveries. You will only pay one delivery charge. We will meet any additional delivery charges.\nIf your goods do not arrive within the time specified above please contact us at shop@aontu.ie quoting the receipt number, which you will receive following completion of the checkout process.\nPlease retain the invoice and shipping notice, which will be sent separately, as it will be required should you decide to return any product under our returns and refunds policy, set out below.\n6. Prices\nPrices are set out at in Euro. Aontú reserves the right to change its prices at any time. Irrespective of any change of prices, you will be charged the price which was specified for the good when you ordered.\n7. Payment\nYou can pay by credit card. All credit card purchases are subject to validation and credit checks.\n8. Right of Withdrawal and Refunds\nWe seek to ensure that you are happy with your purchases. If you are unhappy with any item which you have purchased from us please contact Aontú Shop at shop@aontu.ie within 7 days of delivery of the item(s) to you and advise us that you have goods to return. We will give you a full refund provided that the good(s) which you wish to return is unused, complete and is in a re-saleable condition. Goods which are returned for a refund must be returned with the invoice. Your statutory rights are not affected.\nWhere any valid claim in respect of any goods sold by Aontú which is based on any defect in the quality or condition of the goods or their failure to meet specification is notified to Aontú, Aontú shall be entitled to replace the goods (or the part in question) free of charge or, at the sole discretion of Aontú, refund the price of the goods (or a proportionate part of the price), but Aontú shall have no further liability to the purchaser.\n9. Events outside our control\nWe will not be liable or responsible for any failure to perform, or delay in performance of, any of our obligations under a contract that is caused by events outside our reasonable control (Force Majeure Event).\nA Force Majeure Event includes any act, event, non-happening, omission or accident beyond our reasonable control and includes in particular (without limitation) the following:\n• strikes, lock-outs or other industrial action.\n• civil commotion, riot, invasion, terrorist attack or threat of terrorist attack, war (whether declared or not) or threat or preparation for war.\n• fire, explosion, storm, flood, earthquake, subsidence, epidemic or other natural disaster.\n• impossibility of the use of railways, shipping, aircraft, motor transport or other means of public or private transport.\n• impossibility of the use of public or private telecommunications networks.\n• the acts, decrees, legislation, regulations or restrictions of any government.\nOur performance under any contract is deemed to be suspended for the period that the Force Majeure Event continues, and we will have an extension of time for performance for the duration of that period. We will use our reasonable endeavours to bring the Force Majeure Event to a close or to find a solution by which our obligations under the contract may be performed despite the Force Majeure Event.\n10. Comments\nIf you have any complaints or comments about Aontú’s on-line shop or any items supplied to you please contact usat shop@aontu.ie\n11. Exclusion of Warranty\nSubject to the paragraph below, Aontú makes no warranty or representation as to the quality of any goods sold or their fitness for a particular purpose or their conformity with any description or sample and Aontú shall not be responsible for damage or loss of any kind whatsoever (including loss of profits and consequential damages) caused directly or indirectly by the goods supplied.\nConsumer Protection: The exemptions from the provisions of Sections 13, 14 and 15 of the Sale of Goods Act 1893 (“the 1893 Act”) (as inserted by Section 10 of the Sale of Goods and Supply of Services Act 1980 (“the 1980 Act”) contained in Clause 9.1 shall, in all cases other than a contract for the international sale of goods (as defined in the 1980 Act) be subject to the restrictions on such exemptions contained in Section 55(4) of the 1893 Act (as inserted by Section 22 of the 1980 Act).\n12. Privacy Policy\nFor details of our privacy policy, click here\n13. Governing Law\nThese terms and conditions are governed by the laws of Ireland."
}