{
  "https_www_collectiveactionbh_org_uk/https_www_collectiveactionbh_org_uk_index_php_2025_03_18_cabh-welcome-guide/content_2.html": "Who are Collective Action Brighton Hove?\nCollective Action was established in 2024 following the campaign to elect an independent parliamentary candidate, Tanushka Marah – for Hove & Portslade constituency. Tanushka stood on a platform of peace and social justice and won 3048 votes from a standing start 6 week before the election on the 4th July!\nAs Collective Action, we continue to stand by the campaign’s pledges and values –\n- Decent housing for all. Rent controls. Build and buy back council housing.\n- Tax the super-rich to solve the cost of living crisis. Fight Labour’s cuts to public services.\n- Free Palestine – no weapons to Israel. Sanctions against apartheid, genocide and occupation of Palestinian lands.\n- End the Wars. No more billions for conflict – use the money to support public services.\n- Bring back the Winter Fuel allowance, and introduce a windfall tax on the rip-off energy companies.\n- We own it! Bring energy firms, Southern Water, Royal Mail, rail and buses back into public ownership.\n- Save our NHS. End the Labour-Tory privatisation. Pay our care workers, nurses and doctors fairly.\n- Invest in real green jobs and industries in the UK. The climate emergency is real. No new runways at Gatwick + Heathrow.\n- Fight racism. Safe passage for refugees fleeing war and persecution.\nFrom a successful campaign we have moved on to become part of a national movement – Collective – to establish a democratic party based on these values, as set out by Jeremy Corbyn when he was leader of the Labour Party, and now as part of the Independent Alliance in parliament.\nFOR THE MANY NOT THE FEW!\nAre you one of those people who flocked to Corbyn rallies here and throughout the country? Are you now looking for a political home? Well, here it is! Join us and work together for the many and not the few! This country and the world have become a dangerous place where the few rule for their own interests NOT ours. Let’s get together and make this country a place where working people matter.\nJoin us in our fight for Peace, Justice and Equality for all.\nAims\nWe aim to build a popular movement of struggle in Brighton, Hove and Portslade for socialism and climate justice, and against the inequality, oppression and destruction of the planet generated by capitalism and empire.\nAims for Brighton & Hove City\n- Fight local and parliamentary elections, supporting candidates aligned with our aims, on the basis of the 5 pillars of Tanushka’s election manifesto: a free Palestine and end to funding for wars; tax the rich to save our NHS and public services; housing for everyone; climate action; and a real pay rise for all.\n- Campaign in our communities against cuts, persistent inequality, low wages, privatisation, landlordism, the collapse of public services; for the benefit and flourishing of all, as opposed to the wealth of the few.\n- Fight for decent public housing, council house building and the improvement of existing housing stock; end homelessness.\n- Campaign against climate change and ecological destruction with a focus on local issues and the need for a just transition to sustainability and biodiversity.\n- Fight for liberation with all the oppressed against misogyny, homophobia, transphobia, and racism of all kinds; an injury to one is an injury to all.\n- Combat fascism; counter the false message pushed by the fascists in which migrants and refugees are blamed when in fact burgeoning inequality and the billionaire class have created the current political and economic crisis.\n- Push back against political disillusion and build belief not just in the possibility, but the necessity of transition to green, common-sense socialism.\n- Support non-voters and the most marginalised in the city.\n- Support workers’ campaigns and specifically strike action by trade unionists in the city.\n- Link up with the labour movement, trade unions, tenant’s organisations and other left/green campaigns to build a city-wide assembly of working-class resistance to Labour misrule.\n- Build CABH across the city by inviting those we connect with in our campaigns to join us in building a united front.\n- Prioritise growing participation in CABH in the working class, and among BAME and other oppressed groups.\n- Promote and build faith in democratic participation through people’s assemblies (and other means) to overhaul the broken political system.\nAims National – England, Wales, Scotland\n- Join with other left parties and campaigns to form a united front both to mobilise for socialism and climate justice, and to contest elections.\n- In due course create a strong socialist political movement capable of defeating the capitalist parties and winning national elections.\n- Uphold the right to self-determination of the three nations.\n- through a combination of mass mobilisation and electoral work force major concessions from the state and move decisively towards a green transition to socialism.\n- Bring back essential infrastructure and services (e.g. energy, water, education, communications, healthcare, transport) into well organised public ownership under worker’s control.\nAims International\n- Fight racism and war in a united front with others.\n- Campaign against imperialism and its horrific consequences, importantly ending the ongoing genocide in Israel-Palestine.\n- End the arms trade which services and supports imperialism and the drive to war.\n- Seek alliances with left/green forces across the world to build an international movement for socialism, the reversal of climate change and an end to the global rule of capital.\nCulture & Approach\n- INCLUSION – doors are open – everyone welcome.\n- RESILIENCE – be kind! we support each other’s endurance and self-care; we don’t tolerate abusive or bullying behaviour.\n- ACTION – be brave! everything is possible – focus on action.\nHow We Work\n- Continually welcome new activists and build ever-increasing participation our movement.\n- Work together in supportive comradely ways, in respectful listening spaces, we recognise the differences between us as a group strength, use inclusive language and wherever possible find common ground.\n- Centre the concerns of the local community in our work, supporting constituents, working class and non-voters, to build participation in the struggle.\n- Educate both ourselves and the wider community about anti-racism, anti-war, socialism and climate justice and other related issues.\n- Use cultural creative activities as methods of inspiration, influence and community building.\n- Enabling Empowering Encouraging: facilitating the initiative of members, building trust and saying yes to ideas (but not propping up failing ones), encourage responsibility to be taken.\n- Use self-sustaining processes to build resilience in the community, and construct mutual aid practices across the movement.\n- People want to contribute; it is healthy and generative for everyone to take on some responsibility so when people suggest things, we say ‘yes!’ and encourage that. Facilitators consider asking members, “what would you like to do?” and “what do you need?”\n- Group wisdom is more brilliant than any one of us: talking makes us happy, we all want to be heard.\n- We seek solidarity over unity – We make room for dissent, respect difference, hold ongoing debate and share our different voices. Seeking authenticity means multiple views are held respectfully; speaking with one voice may mean some people have to take a position they don’t agree with. Inauthenticity can lead to distrust.\n- When policies are decided, people may agree the common position but can also politely, openly dissent from it.\n- We actively mitigate against arguments being ‘won’ merely by enforcing a view, because a person’s may have more confidence and conviction, privilege, providing them with an advantage, a majority view, a loud voice, skills at interrupting.",
  "https_www_collectiveactionbh_org_uk/https_www_collectiveactionbh_org_uk/content_1.html": "In 2025, it’s time to fightback\nSick of the politics of endless cuts for us and tax breaks for the rich? Feel no one is doing anything except promoting hate? It’s time to fightback against broken billionaire Britain and the Labour-Tory forever wars.\nCollective Action developed from the independent general election campaign in Hove & Portslade which won over 3000 votes. We are fighting locally for a better life for all. We won’t wait for corrupt politicians to do it. Come along to our meetings; tell us what you want to see happen. Together we will make the change.\nWhat Collective Action Brighton & Hove stands for\nLatest\n- Disability campaigner David Maples slams Labour-run council for “failing disabled people in Brighton and Hove”At a disability-focused hustings, David Maples — a disability campaigner and independent socialist candidate in the Westbourne and Poets’ Corner by-election — criticised Brighton and Hove City Council\n- Vote David MaplesVote for David Maples, Independent Socialist for the Westbourne and Poets Corner bye-election. Promoted by Callum Joyce on behalf of David Maples c/o Community Base\n- Housing for People not ProfitIn early February members of Collective Action set up a stall and spoke to people about the housing crisis in the city, calling for the council to take action. We also joined ACORN in a solidarity action in Hanover in support of an 80 year old resident facing a no fault eviction."
}