{
  "https_www_stephencummins_org_uk_/https_www_stephencummins_org_uk/content_1.html": "We’ll be very busy, the last few months we’ve been meeting, planning and strategizing. There’ll be more to see here. For now, we’ve made progress with the Dog Friendly Beach Campaign (https://www.facebook.com/southenddogfriendlybeach). I wrote to our new MP David Burton-Sampson about two months ago and he responded yesterday and it’s actually quite hopeful!\nHe said the council are reconsidering a beach for us dog people. To counter Nature England, who had blocked East Beach, they may ban dogs on Two Tree Island which makes a lot of sense because of all the flocking and nesting birds there.\nChalkwell/Cinder Path is also on the cards, but I think we should get a petition together from people around there who are in favour to counter those who are against. Just have to be organised.\nAnyone who lives in the Chalkwell willing to get a petition together?\nSo the campaign goes into 2025 with some hope of progress!\nLabour and the Lib Dems are in coilition in the Southend-on-Sea City Council right now so the time is right for us to work out this solution.\nWe’ve a number of social events going on, so come along, all welcome.\nChalkwell Beach Chat every month Saturday 26th October (and the last Saturday of each month) at the Saltwater Beach Café, 111 Chalkwell Esplanade, Westcliff-on-Sea SS0 8JJ (between the beach & Chalkwell Station), 9am-12 noon, meet to discuss issues affecting the community, politics or just for a tea, coffee or ice cream and a chat. Politics in a Pub Sunday, 27th October at The Old Walnut Tree Pub, Southchurch Boulevard, Southend-on-Sea SS2 4XA (on the corner of Lifstan Way), 6-9pm. Monthly meeting at the Anne Boleyn pub in Rochford Saturday, 9th November (and the second Saturday of each month) at the Anne Boleyn Pub, 93 Southend Road, Rochford SS4 1HU (on the corner of Sutton Road), 11.30am until 1pm-ish. To discuss politics over a drink (coffee/tea or whatever)! Southend Liberal Democrats Annual General Meeting Monday, 11th November, commencing at 7.30 pm, at Leigh Community Centre, 71-73 Elm Road, Leigh-on-Sea SS9 1SP. If you need to drive, there is a car park behind the Community Centre that is free in the evening. We are delighted to announce that Stephen Robinson, leader of Chelmsford City Council and agent for Marie Goldman who was elected as Liberal Democrat MP for Chelmsford\nThey even suspended seven of their own MPs who voted for it’s removal. Our two Southend Labour MPs voted to keep it too. We Lib Dems all voted to remove the limit. But what is this cap and why is it bad?\nA family in Southend entitled to claim universal credit of 22k a year with three children would be about £280 a month better off with the cap removed.\nThese aren’t scroungers either, more than half have one adult working. Half are single parents struggling to survive. Now you see why so many have to use food banks.\nBefore you ask, it would cost over £3.4 billion a year and could be paid for by higher taxes on very, very rich individuals and on Corporations who pay little to no tax. Starbucks made £150 million last year and paid about 4 million in tax. If you or I earned that, the government would take about half of it, about £70 million. Instead, Starbucks profits go to the very wealthy shareholders outside the UK. Also, it would only increase the welfare budget by 3%.\nIt is the UK’s children who suffer and it is hard to measure the impact of that on them individually and on us as a society, but it doesn’t need to happen it was a political choice by our new government. One that baffles me.\nThis form is a good example of a complex and difficult to complete ‘consulation’. There is a simpler version. But the questions are leading to get the response they want.\nIt reminded me of Humphrey explaining to Bernard how to manipulate responses to a government opinion poll on national service. Instructive and Entertaining.\nFirst, you are sent to this long and complicated page. Then you click this link to go through to a 4 page, 39 question survey. I barely managed it and I’m a good detail person. The gist is, we need a case by case assessment of people’s needs. It has to be done by a social worker from the local authority because they can look at their overall situation, their families needs and any other needs like mental health, risk, education etc. Only refer to a doctor if necessary to get a medical assessment. The quality of a person’s life and what they need can’t be captured in a form.\nHere is what I put as answers to the questions.\nChapter 1 PIP Overview and assessment reform\nWhat are your views on an assessment that places more emphasis on condition rather than the functional impact of a condition on the person?\nPrefer an assessment on the full impact of a condition on an individual and their family. a full, direct and non-inferential description of all relevant dimensions of the person’s life and disability, for example, work capacity, including health condition, impairments, functional limitations, necessary accommodations and personal and environmental factors. This is based on the principle that all citizens in need are entitled to receive social security benefits and social services – regardless of their participation in the labour market.\nWhat are your views on people receiving PIP without an assessment if they have specific health conditions or a disability as evidenced by a healthcare professional?\nThat would be an ideal scenario. It is best if each person is assessed as an individual by professionals in their own community. Where a disability is for life and is not going to change, it makes sense not to put someone into the PIP assessment process. The assessment process should be decided and arranged at the discretion of a case-specific social worker working for the local authority (LA), according to the circumstances and needs of the claimant. The social worker takes into account the report from the doctor etc, and is the final decision maker. That person’s social worker generates the report. The claimant does not have to fill out a long form.\nWhat are your views on PIP claimants not being subject to an award review if they have a specific health condition or disability as evidenced by a healthcare professional?\nThe social worker has the power to order a medical examination of the claimant by a healthcare professional. This approach is faster and better.\nDo you agree or disagree on making provision of evidence or a formal diagnosis by a medical expert a mandatory requirement for eligibility for PIP?\n(agree/disagree/don’t know)\nThe social worker should have the final decision even in the case where medical evidence has been sought from healthcare professionals. The decision to get a medical assessment is up to the social worker. So not mandatory.\nIn relation to Question 4, please explain your answer and provide evidence or your opinion to support further development of our approach.\nThe process should be that the claimant makes a basic paper application, whereupon claimants are assigned to a social worker employed by the LA. Social workers are responsible for case management, and for working with claimants to assess their needs. The nature of the assessment is decided on a case-by-case basis at the discretion of the social worker. Depending on the nature of the claimants condition(s), the social worker decides what evidence is necessary – and makes arrangements for this to be produced and collected. This may involve, for example, requesting notes from the claimant’s GP, or setting up face-to-face meetings with the claimant and appropriate healthcare professionals.\nA functional assessment tool can be used in order to assess the claimant’s functional abilities. In cases where need is obvious (for example if a claimant doesn’t have legs), assessment may be made by the social worker, on the basis of a meeting with the client, and with little or no outside evidence required. Even in the case where medical evidence has been sought from healthcare professionals, social workers are responsible for the final decision on an award. This is similar to how Section 7 reports are prepared by CAFCASS or LA social workers for Family Court care arrangement recommendations/orders.\n6.How could we prevent the provision of evidence or a formal diagnosis by a medical expert from impacting the NHS? Please explain your answer and provide evidence or your opinion to support further development of our approach.\nMedical assessment should only be required if Social Worker deems it necessary, thus reducing burden on the NHS.\nDo you agree or disagree that eligibility for PIP should be based more on condition?\n(agree/disagree/don’t know)\nHow could we determine eligibility for the following conditions?\nConditions that fluctuate\nConditions that vary in severity\nConditions that might be cured or have access to better/new/novel treatments over time Please explain your answer and provide evidence or your opinion to support further development in our approach. In Denmark, the approach is condition based. Benefits are awarded on a fixed-term rolling basis. The Municipality (AKA Local Authority) has a responsibility to ‘follow-up’ on whether the benefit addresses claimants’ needs. This usually involves an annual meeting with the Municipality, where claimants’ situation and needs are reviewed. Claimants are encouraged to provide evidence of larger costs alongside 2-3 months’ worth of relevant receipts – though, there is no obligation to do so. We could follow this approach.\nChapter 2 PIP – Eligibility Reform\nDo you think the need for an aid or appliance is a good/bad indicator of extra ongoing costs and why?\nThe need for an aid or appliance is generally a good indicator of extra ongoing costs associated with disability. These costs are not limited to the initial purchase but also include maintenance, consumables, and related supports necessary for the individual’s daily life and independence. Recognising this need helps ensure that financial assistance is appropriately targeted, supporting both the immediate and long-term needs of individuals with disabilities.\nDo you think the need for prompting is a good/bad indicator of extra ongoing costs and why?\nThe need for prompting is generally a good indicator of extra ongoing costs related to disability. This need highlights the requirement for continuous support, supervision, and specialised care, all of which contribute to increased financial burdens. Recognising the necessity for prompting helps ensure that disability benefits are appropriately allocated, addressing both immediate and long-term support needs to enhance the quality of life for individuals with disabilities.\nDo you think people who accumulate low points across activities have the same level of extra costs as those who score highly in one or more activities?\nThe answer here can be nuanced. Ultimately, both scenarios can lead to significant extra costs, but the nature and distribution of these costs differ. An effective disability benefits system should consider both cumulative low-level impairments and concentrated high-level impairments to ensure fair support for all individuals.\nDo you think any of the PIP activities measure similar functions and could be merged?\nNot merged, changed to the conditions/disability approach, away from the functional limitation approach.\nDo you think any of the PIP activities should be removed or re-written and why? They should be replaced with a one-to-one assessment by a qualified social worker. This is to reflect a full, direct and non-inferential description of all relevant dimensions of the person’s life and disability, for example, work capacity, including health condition, impairments, functional environmental factors, limitations and personal and environmental factors.\nShould we consider adding any new activities? If so, which activities should be added and why?\nNo, do not agree with the functional limitation approach. We should also not use private contracted assessors for this.\nDo you think the current entitlement thresholds levels are set at the right levels to define the need for Government financial support and why?\nWhether the current entitlement thresholds are set at the right levels depends on balancing the need to provide adequate support to all individuals with disabilities against the practical limitations of budget and administrative feasibility. There are valid arguments on both sides, suggesting the need for ongoing evaluation and adjustment.\nTo improve the system, the government could:\nRegularly update assessment criteria and thresholds to reflect current understanding and costs of disabilities.\nProvide clearer guidance and assistance during the application process.\nAdopt a holistic approach that considers the diverse impacts of disabilities rather than relying on rigid point-based systems. An effective disability benefits system should be dynamic, responsive to changing needs, and rooted in understanding the lived experiences of people with disabilities.\n16 .What are your views on changing the length of the current three-month qualifying period for PIP which is used to establish that the functional effects of a health condition or impairment have been present for a certain time period before entitlement can start?\nIt has to be done on a case-by-case approach to address individual circumstances more effectively. Shortening the period might allow people to receive support sooner who have suddenly become disabled, which can be crucial for those whose conditions cause immediate and severe impacts on their daily lives. For people born with or having enduring conditions, being assessed as such could prevent constant red tape for them and administrative cost for the local authority.\nWhat are your views on retaining, removing, or changing the length of the current nine-month prospective test which is used to determine if the functional effects of a health condition or impairment are likely to continue long-term?\nRemove it. Assessment has to be done on a case-by-case approach to address individual circumstances more effectively.\nChapter 3 PIP – What do we provide support for?\nPIP provides a contribution towards extra costs. Which extra costs incurred by disabled people are the most important for a new scheme to address? Please rank the following options in your order of importance (with 1 being the most important and 10 being the least important). Please drag and drop the answers to rank them. A list of health care issues\nDescription automatically generated\n19.In relation to Question 18, please explain your answer and tell us about any other important kinds of cost not listed above.\nIt has to be done on a case-by-case approach to address individual circumstances more effectively.\n20. What are the benefits and disadvantages of moving to a new system for PIP claimants?\nA catalogue/ shop scheme\nBenefits\nDisadvantages\nOther Please explain your answer and provide evidence or your opinion to support further development of our approach.\nIt has to be done on a case-by-case approach to address individual circumstances more effectively.\n21. What are the benefits and disadvantages of moving to a new system for PIP claimants?\nA voucher scheme\nBenefits\nDisadvantages\nOther Please explain your answer and provide evidence or your opinion to support further development of our approach.\nA terrible idea. It has to be done on a case-by-case approach to address individual circumstances more effectively.\n22. What are the benefits and disadvantages of moving to a new system for PIP claimants?\nA receipt-based system\nBenefits\nDisadvantages\nOther Please explain your answer and provide evidence or your opinion to support further development of our approach.\nA terrible idea. It has to be done on a case-by-case approach to address individual circumstances more effectively.\n23. What are the benefits and disadvantages of moving to a new system for PIP claimants?\nOne-off grants\nBenefits\nDisadvantages\nOther Please explain your answer and provide evidence or your opinion to support further development of our approach.\nA terrible idea. It has to be done on a case-by-case approach to address individual circumstances more effectively.\nIf PIP could no longer be used to determine eligibility to passport to other benefits and services, what alternative ways could service providers use to determine disability status?\nIt has to be done on a case-by-case approach to address individual circumstances more effectively.\nIf PIP could no longer be used as the eligibility criteria to additional financial support in Universal Credit, what alternative ways of determining eligibility should we use?\nIt has to be done on a case-by-case approach to address individual circumstances more effectively.\nAre there specific groups of people whose needs are not being met by the current PIP provision and have a need for a greater level of support? What form should this support take (e.g., help with specific extra costs, access to improved healthcare such as mental health provision or enhanced local authority support such as care packages and respite)?\nParents who are carers for children with life-long disabilities. They should be assessed as a family as their needs will be complex. It has to be done on a case-by-case approach to address individual circumstances more effectively.\nInstead of cash payment, are there some people who would benefit more from improved access to support or treatment (for example, respite care, mental health provision or physiotherapy)?\nIt has to be done on a case-by-case approach to address individual circumstances more effectively.\nChapter 4 PIP – Aligning Support\nDo people already receive support from local authorities or the NHS with the need/costs that come with having a disability or health condition?\nNot enough due to underfunding by central government. Centrally provided funding and legislation but delegation of authority to Local Authorities.\n29. In relation to Question 28, please explain your answer and provide evidence or your opinion to support further development of our approach.\nThis approach works well in other countries such as Denmark. The functional approach and using private companies for assessment like Capita is expensive, dehumanising and ultimately ineffective. It would be best if each person were assessed as an individual: the assessment process should be decided and arranged at the discretion of a case-specific social worker working for the local authority (LA), according to the circumstances and needs of the claimant. The social worker is the final decision maker.\nThat person’s social worker generates the report. The claimant does not have to fill out a long form.\n30.Which of the following do local authorities or the NHS help with? Equipment and aids Medical products Personal assistance (e.g., help with household tasks) Health services Social care Respite Transport Utility Costs\nAll of these except Utility costs.\n31. In relation to Question 30, please explain your answer and provide evidence or your opinion to support further development of our approach.\nLocal authorities or the NHS help with the following:\nEquipment and aids: Yes, local authorities and the NHS provide equipment and aids to help individuals with disabilities or long-term health conditions manage daily activities.\nMedical products: Yes, the NHS supplies medical products such as medications, bandages, and other healthcare items.\nPersonal assistance (e.g., help with household tasks): Yes, local authorities provide personal assistance for tasks like cleaning, cooking, and personal care through social care services.\nHealth services: Yes, the NHS provides a wide range of health services, including medical treatments, consultations, and therapies.\nSocial care: Yes, local authorities provide social care services, which include support for daily living activities, personal care, and assistance for those with disabilities or long-term conditions.\nRespite: Yes, local authorities offer respite care services to provide temporary relief for caregivers of individuals with disabilities or long-term health conditions.\nTransport: Yes, local authorities sometimes provide transport services for individuals who have difficulty accessing public transportation due to their health conditions or disabilities.\nUtility Costs: No, local authorities and the NHS typically do not assist with utility costs. This is usually managed through separate welfare benefits or specific grants and schemes.\nIn summary, local authorities and the NHS help with equipment and aids, medical products, personal assistance, health services, social care, respite, and transport, but generally do not assist with utility costs.\n32.Which needs/costs that come with having a disability or health condition could local areas help with further? Equipment and aids Medical products Personal assistance (e.g., help with household tasks) Health services Social care Respite Transport Utility Costs\nLocal authorities or the NHS should help with the following. What does ‘local areas’ refer to?\nIn relation to Question 32, please explain your answer and provide evidence or your opinion to support further development of our approach.\nEquipment and aids: Yes, local authorities and the NHS provide equipment and aids to help individuals with disabilities or long-term health conditions manage daily activities.\nMedical products: Yes, the NHS supplies medical products such as medications, bandages, and other healthcare items.\nPersonal assistance (e.g., help with household tasks): Yes, local authorities provide personal assistance for tasks like cleaning, cooking, and personal care through social care services.\nHealth services: Yes, the NHS provides a wide range of health services, including medical treatments, consultations, and therapies.\nSocial care: Yes, local authorities provide social care services, which include support for daily living activities, personal care, and assistance for those with disabilities or long-term conditions.\nRespite: Yes, local authorities offer respite care services to provide temporary relief for caregivers of individuals with disabilities or long-term health conditions.\nTransport: Yes, local authorities sometimes provide transport services for individuals who have difficulty accessing public transportation due to their health conditions or disabilities.\nUtility Costs: No, local authorities and the NHS typically do not assist with utility costs. This is usually managed through separate welfare benefits or specific grants and schemes.\nIn summary, local authorities and the NHS help with equipment and aids, medical products, personal assistance, health services, social care, respite, and transport, but generally do not assist with utility costs.\nIf we align the support offered by PIP into existing local authority and NHS services, how could this improve things for disabled people and people with health conditions?\nThe LA could provide PIP payments based on a one-to-one assessment by a qualified social worker. This is to reflect a full, direct and non-inferential description of all relevant dimensions of the person’s life and disability, for example, work capacity, including health condition, impairments, functional environmental factors, limitations and personal and environmental factors.\nDo you think aligning PIP with local authority and NHS services could reduce the number of assessments a person with a disability or health condition would have to undergo? Would this help to reduce duplication?\nOnly if the LA could provide PIP payments based on a one-to-one assessment by a qualified social worker. This is to reflect a full, direct and non-inferential description of all relevant dimensions of the person’s life and disability, for example, work capacity, including health condition, impairments, functional limitations and personal and environmental factors.\nWhat disability support services in your community are the most important services or support to deliver?\nThere is no one support service that is more important than another.\nEquipment and aids: Yes, local authorities and the NHS provide equipment and aids to help individuals with disabilities or long-term health conditions manage daily activities.\nMedical products: Yes, the NHS supplies medical products such as medications, bandages, and other healthcare items.\nPersonal assistance (e.g., help with household tasks): Yes, local authorities provide personal assistance for tasks like cleaning, cooking, and personal care through social care services.\nHealth services: Yes, the NHS provides a wide range of health services, including medical treatments, consultations, and therapies.\nSocial care: Yes, local authorities provide social care services, which include support for daily living activities, personal care, and assistance for those with disabilities or long-term conditions.\nRespite: Yes, local authorities offer respite care services to provide temporary relief for caregivers of individuals with disabilities or long-term health conditions.\nTransport: Yes, local authorities sometimes provide transport services for individuals who have difficulty accessing public transportation due to their health conditions or disabilities.\nUtility Costs: No, local authorities and the NHS typically do not assist with utility costs. This is usually managed through separate welfare benefits or specific grants and schemes. In summary, local authorities and the NHS help with equipment and aids, medical products, personal assistance, health services, social care, respite, and transport, but generally do not assist with utility costs.\nHow much flexibility should local areas have to decide their priorities in supporting people with disabilities and health conditions?\nThe LA could provide PIP payments based on a one-to-one assessment by a qualified social worker. This is to reflect a full, direct and non-inferential (a statement of fact) description of all relevant dimensions of the person’s life and disability, for example, work capacity, including health condition, impairments, functional environmental factors, limitations and personal and environmental factors.\nWhat capacity and capability would be required to better align PIP with local authority and NHS services?\nThe LA could provide PIP payments based on a one-to-one assessment by a qualified social worker. This is to reflect a full, direct and non-inferential description of all relevant dimensions of the person’s life and disability, for example, work capacity, including health condition, impairments, functional environmental factors. limitations and personal and environmental factors.\nCompulsory Question\nFor analytical purposes, please answer this question before submitting your response.\n39. Are you an individual or an organisation supporting claimants applying for PIP?\nWhat wasn’t in the King’s Speech today? Not Colin Firth anyway. The real King’s Speech!\n1. Social Care. No mention of helping carers. A cross-party review on reform options is taking place though seemingly, so that will involve us Liberal Democrats.\n2. Cleaning up our water. OK, banning bonuses and and making bosses liable, but what has really changed to stop sewage?\n3. The two child benefit cap that’s been there 8 years. This is really a big one. Not scrapped. That’s the number one thing that could have stopped poverty in families. Reform of universal credit generally would have been good to see.\n4. More on NHS reform and reducing queues.\n5. Nothing on compensation for the Postal Workers or WASPI women.\nWhat was good to see?\n1. Banning conversion therapy. The state should not tell people who they can or cannot be.\n2. Employment rights. End to zero hour contracts.\n3. Investing in renewable energy. The power of countries like Russia comes from their oil, we have to break that.\n4. Halving violence against women and girls.\n5. Mental Health Act reforms.\n6. Devolution. More power to local government means more democracy.\n7. The football regulator is good news for Southend United.\nI think people are hungry for change: if they don’t see the cost of living improving and availability of doctors and dentists getting better, all these other good things will not convince them they’re much better off.\nLiberalism is the opposite of Facism or Communism. It emphasises the freedom of the individual over the collective. That is not to say it is purely self-interested. Democracy means all people are equal and deserve to be treated as such. That’s why we are Liberal Democrats.\nThat’s the law in the UK too. I get to say who or what I am and so does everyone else and no-one gets to tell anyone else who can can or can’t be. It is all laid out in The Equality Act 2010.\nMy freedom can’t impinge on your freedom, but also vice versa. The key word is equality. It doesn’t matter how a person identifies themselves. That is their business and their right.\nYou have a right to say what you believe so long as it doesn’t take away someone else’s right to be who they are. Freedom of speech is not absolute.\nThat is the foundation of a liberal democracy. Be proud of who you are, don’t be ashamed or make anyone else feel ashamed. We all have the same rights to be ourselves but we’re not free to oppress anyone else.\nYou can’t make one group of people more safe by making another group less safe. That’s not freedom or equality.\nI will fight to defend anyone’s rights but not at someone elses expense. Simple as that. As George Orwell pointed out in Animal Farm in 1945, if one group wins their freedom but begins to oppress another group, they become as bad as the original oppressors. Let’s not do that.\nI’m doing my bit to champion any marginalised group and after LGBTQ+ Pride last month, this month it is us disabled people the largest minority group in the UK. I met Beth, Robbie and Luca from Making Care Fair this morning to make a little video advocating for what they need. I’ll post it here when finished. I’ve listed some things below but basically someone with a Learning Difficulty should be receiving what a person over 65 receives. That’s equity as well as equality.\nA person with a Learning Disability is not like someone like me who has physical/mobility issues. They just find certain things harder to do and this will never change for them, but they can be supported to live better lives. We as a society cannot just ignore them because we don’t understand them. We all have human rights and they have the same ones.\nSo what do people with Learning Disabilities find it harder to do?\nUnderstand Written Information: Reading and understanding instructions, forms, and signs.\nManage Finances: Budgeting, paying bills, and handling money.\nUse Public Transport: Figuring out schedules, routes, and buying tickets.\nCommunicate: Expressing themselves and understanding others.\nFind and Keep Jobs: Understanding job tasks and interacting at work.\nLearn: Keeping up with school or training.\nDo Daily Tasks: Cooking, cleaning, and personal hygiene.\nAccess Healthcare: Understanding medical advice and following treatments.\nSocialise: Making friends and joining in community activities.\nUse Services: Navigating systems for benefits, housing, and support.\nThey need clear information, support, and inclusive practices to live fulfilling lives.\nHere is what needs to be done for them by ALL of us working to influence change:\nEstablish permanent disability recognition to simplify benefit access.\nReform or protect PIP to ensure it remains non-means tested.\nEnsure living expenses are covered before local authorities take PIP contributions.\nStandardize Disability Related Expenditure limits across local authorities.\nSimplify council forms and prevent backdated payment demands.\nEqualize the minimum income guarantee for all ages.\nImprove support for carers based on campaign feedback.\nAllow adults with disabilities to use the buses ANY time.\nThese actions aim to create a more inclusive, supportive community for everyone.\nOver 3000 of you voted for me and thank you to you all. And to all on the local Lib Dem team: Steve, Billy, Roger, Nina, Granville, Chris, Bob and our Lib Dem councillors Paul, Rob, Dave and Carol.\nAnd of course my long-suffering wife Jane.\nCongratulations to David and commiserations to Anna and my fellow candidates Peter, Tilly, James, Tom, Lara and Jason. I got to talk to you all and you’re all lovely people!\nI continue to be a local community champion despite no winning the seat this time. I’m still a Liberal Democrat and will stand up for our values as best I can. I’m going to focus on our community with learning difficulties and the food banks first as that’s where I see the most need.\nI’ll help our new MP David however best I can. Him and his party have the power now to change how the water companies act, how our NHS and its patients are treated and funding for our local council and all the services it provides. I’ve also offered Bayo our MP in Southend East all the help I can. It is one community not separated really by political lines. We’re a coalition on the council too.\nThe Liberal Democrats have become a large block in parliament again and we’ve a responsibility to prove we deserve to be there. I’ll work with the national party and our MPs on what we are pushing for there. Such as our emergency funding for the NHS bill. Victoria Collins, who’s a new LibDem MP in Harpenden and Berkhamsted, will hit the ground running. She’s holding Thames Water to account for what they’re doing. Their sewage dumping flows down to us as well as what Anglian Water is doing.\nChange is in the air and I’ll do my bit to help bring it about.\nYou might say ‘hey Stephen, you sound Irish, how could you be supporting armed forces day? Today, I’m thinking of my Great-grandfather who never came back to my Great-grandmother and their children. Henry Cummins’ name is on the Menin Gate and was killed in the Ypres Salient of The Great War. His remains never found, but commemorated every day with a last post with the other 40,000 on that cenetaph. He was in the Leinster regiment. The conflict between Ireland and the UK is over now and I want to remember the past but not relive it.\nSo today, on Armed Forces Day in the UK, we should:\nHonour Service Members: Recognize the bravery and dedication of those in the Army, Navy, and Air Force.\nRemember Veterans: Pay tribute to veterans for their past service and ongoing contributions.\nSupport Families: Acknowledge the sacrifices made by military families.\nReflect on History: Understand the historical role of the Armed Forces in securing peace and security.\nEngage with the Community: Participate in local events to show support.\nRaise Awareness: Learn about the challenges faced by military personnel.\nSupport Charities: Consider donating to organisations that help service members and their families.\nPromote Peace: Reflect on the efforts made by the Armed Forces to maintain peace.\nBy focusing on these aspects, we can show our appreciation and support for the men and women who serve our country. Like Abraham Lincoln said at Gettysburg that we should resolve that the dead shall not have died in vain and we should dedicate ourselves to …\n“a new birth of freedom – and that government of the people, by the people, for the people, shall not perish from the earth.“"
}