{
  "https_www_daverowntreeformidsussex_com_/https_www_daverowntreeformidsussex_com/content_1.html": "Mid Sussex has been let down by the Conservatives Let me show you what I can do.\nHelp me deliver change in Mid Sussex\nFrom Haywards Heath to Burgess Hill to Hassocks and Hurstpierpoint, together, we can secure a brighter future for Mid Sussex\nOnly Labour can beat the Conservatives here\nMid Sussex Voting Intention Spring 2024\nSource: Survation x Best for Britain Voting Intention MRP March 2024 Fieldwork 8th – 22nd March 2024\nMake your vote count to beat the Conservatives\nMy vision for a better future for Mid Sussex\nMake new housing work for everyone\nBuild the right houses in the right places, while investing in new schools, roads, and vital infrastructure to make the new housing work better for everyone.\nGet businesses & communities thriving again\nInvest in jobs for the future as well as town centre regeneration projects. Revitalise arts and community spaces to bring people together and create local jobs.\nRebuild our National Health Service\nCut hospital waiting times, invest in local care centres, end the 8am scramble for GP appointments, fix NHS dentistry so it works for both dentists and patients.\n“My passion is working in the community, bringing people together and solving problems.”\nMy life has had its share of highs and lows. I headlined Wembley Stadium with Blur in 2023, but in the 1980s I was homeless and hopeless. The experience stayed with me and kept me grounded through my later success.\nNow my passion is working in the community, bringing people together and solving problems. 14 years of Conservative government has left the UK in a desperate state. Public services are barely working, and we’ve had a succession of Prime Ministers acting as if the rules don’t apply to them.\nWe can do better.\nAs part of a Labour government, I want to help rebuild Mid Sussex and the UK. Transform the NHS, revitalise public services, and create water, power and rail networks that put consumers first, not shareholders. But I can only do this with your help. Mid Sussex needs a Labour MP working as part of a Labour government.\nThe latest polling shows that the Lib Dems are now a distant third place, and only Labour can beat the Conservatives. Even if you’ve never voted Labour before,\nI’d ask that you give me a chance to show you what I can do.\nI served as a County Councillor for 4 years, helping residents access children’s services and social care, and rolling out fast broadband internet.\nLawyer\nI’m a qualified criminal lawyer and have worked at the sharp end of the criminal justice system. I helped lead the campaign against Conservative cuts to legal aid.\nCharity Volunteer\nI set up an event that raised over £100,000 for healthcare for refugees in the Middle East. More widely, I work with charities based around legal and drug policy issues.\nAnimal Welfare Campaigner\nI care for a beautiful rescue dog, two wonderful feral cats and four affectionate orphaned sheep whilst raising money to help fund a wildlife hospital.\nSupport our campaign\nWe’re being let down by the Conservatives\nOnly Labour can beat the Conservatives in Mid Sussex. Every contribution to our local Labour Party will help make a difference to elect Labour representatives locally.\nOnly Labour can beat the Conservatives in Mid Sussex. Every contribution to our local Labour Party will help make a difference to elect Labour representatives locally.",
  "https_www_daverowntreeformidsussex_com_/https_www_daverowntreeformidsussex_com_get-involved/content_2.html": "Together, we can create a constituency that works for everyone. Get involved, make your voice heard and be part of the change you want to see."
}