{
  "https_www_davidburtonsampson_co_uk_/https_www_davidburtonsampson_co_uk/content_1.html": "David Burton-Sampson\nWe need your consent to load the translations\nWe use a third-party service to translate the website content that may collect data about your activity. Please review the details in the privacy policy and accept the service to view the translations.",
  "https_www_davidburtonsampson_co_uk_/https_www_davidburtonsampson_co_uk_about-me/content_3.html": "I have lived in Essex since 1999 and I am happily married to Mark and Dog Daddy to Lotti, our crazy dalmatian.\nGrowing up in Liverpool in the 1980's in a one parent family during the Thatcher years was tough. Despite the horrendous government of the day and the financial challenges we faced, my Mum set me on the right path and made sure I had every opportunity to get on in life.\nThere is no doubt that my Labour values today are firmly rooted in my working class upbringing.\nI finished my education and entered the world of work near the start of the last Labour Government. The opportunities available to me then were vastly different to those facing our young people and our country today.\nI know the difference a Labour Government can make and right now we need this new Government more than ever.\nMy deep passion in life is fighting for equality and inclusion for the many in our society, challenging injustice and enabling people to thrive. I have a proven track record of making a difference for people’s lives.\nI commit now to fighting for the residents of Southend West & Leigh so they have the opportunities to access the services and support they need to live a healthier, happier and fairer life.\nWe need your consent to load the translations\nWe use a third-party service to translate the website content that may collect data about your activity. Please review the details in the privacy policy and accept the service to view the translations.",
  "https_www_davidburtonsampson_co_uk_/https_www_davidburtonsampson_co_uk_privacy-notice/content_5.html": "Our contact details\nName: David Burton-Sampson\nAddress: 268 Sutton Road, Southend-On-Sea, SS2 5ET\nPhone Number: 01702 619 868\nE-mail: david@davidburtonsampson.co.uk\nThe type of personal information we collect\nWe currently collect and process the following information:\n· Personal identifiers, contacts and characteristics (for example, name and contact details)\nHow we get the personal information and why we have it\nMost of the personal information we process is provided to us directly by you for one of the following reasons:\nTo add you to our list of supporters.\nTo contact you to provide you with information.\nWe use the information that you have given us in order to keep in contact with you with news and updates on my campaign.\nWe do not share your information with any other organisation.\nUnder the UK General Data Protection Regulation (UK GDPR), the lawful bases we rely on for processing this information are:\n(a) Your consent. You are able to remove your consent at any time. You can do this by contacting david@davidburtonsampson.co.uk\n(b) We have a contractual obligation.\n(c) We have a legal obligation.\n(d) We have a vital interest.\n(e) We need it to perform a public task.\n(f) We have a legitimate interest.\nHow we store your personal information\nYour information is securely stored.\nWe keep your personal information for no longer than 1 year after your relation with us has ended. We will then dispose your information by securely deleting it from your systems.\nWe need your consent to load the translations\nWe use a third-party service to translate the website content that may collect data about your activity. Please review the details in the privacy policy and accept the service to view the translations.",
  "https_www_davidburtonsampson_co_uk_/https_www_davidburtonsampson_co_uk_contact-me/content_2.html": "Telephone: 01702 619 868\nE-mail: david.burtonsampson.mp@parliament.uk\nWe need your consent to load the translations\nWe use a third-party service to translate the website content that may collect data about your activity. Please review the details in the privacy policy and accept the service to view the translations.",
  "https_www_davidburtonsampson_co_uk_/https_www_davidburtonsampson_co_uk_my-pledges/content_4.html": "Not only do we need more people working in our NHS but we need better facilities. As the population of the city and the surrounding area has grown, the facilities needed to grow with it, and they haven't.\nI will make fighting for better health facilities for our area my top priority. We need to build an NHS fit for the future, driving down patient waiting lists, and the ground work to creating this change must start now.\nIt's time to build the type of homes that our residents need. High quality social housing is a must and we need reforms now to enable our councils to build and reduce our waiting lists for those most in need.\nHelping first time buyers on to the housing ladder is a must too through support schemes and genuine affordable housing. Let's get Britain building!\nI will work with our local schools to ensure they are fit for purpose, resourced with the right levels of competently trained teaching and support staff, equipped with a curriculum that sets our young people up with the skills they need to harness the opportunities they dream of for their future.\nI will harness our new city status to drive greater inward investment, ensuring economic growth and most importantly creating more quality, local jobs for local people.\nAs a small business owner I understand the needs of SME's in Southend & Leigh and I will embed myself further within the Business Community, showing them that Labour is on their side.\nI have a proven track record of creating environments through various projects to drive greater acceptance and belonging for those from diverse backgrounds.\nFrom founding Basildon Pride, working with The Jo Cox Foundation to creating More in Common Basildon Borough and setting up a Hate Speech Working Group with the outcome of driving greater community cohesion through a range of activities, I will do all I can to tackle discrimination at its core and stand up for greater inclusion for all in our society.\nI will ensure that Southend & Leigh benefit from Labour's National Wealth Fund and the environmental benefits it will drive, including green infrastructure and jobs.\nI will fight to protect our coast from the scourge of sewage dumping and ensure that the water companies responsible are held to account.\nDavid talks about his commitment to engage with residents, doctors, nurse and NHS Leaders now to formulate a plan for local healthcare improvements.\nWe want to see the type of homes our residents need being built. David talks about his commitment to working with local housebuilders to start to achieve this goal.\nDavid commits to standing up for Southend & Leigh and it's residents whilst driving inward investment, creating good quality jobs.\nDavid shares how Labour will invest in schools and ensure they have a curriculum that's fit for purpose\nDavid discusses his plans to drive forward a cleaner and greener future for our city.\nWe need your consent to load the translations\nWe use a third-party service to translate the website content that may collect data about your activity. Please review the details in the privacy policy and accept the service to view the translations."
}