{
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_basingstoke-north/content_12.html": "Basingstoke North\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Norden. If you have any issues or concerns you’d like us to look into, please get in touch.\nYou will find more details about us on the Borough website.\nAs your Conservative team, we bring together parish, borough, county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally.\nCommunicating With You\nYour local Conservative Team communicates regularly with residents through InTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news_local-entrepreneur-shares-her-story-mp-maria/content_36.html": "Maria Miller MP for Basingstoke met local entrepreneur Natalie Chapple who founded Glisten Cosmetics based in Crockford Lane in Chineham.\nThe company, originally setup in 2017 in Natalie’s garage as a side hustle, took off in 2020 during the COVID pandemic when on-line shopping became the only option for a time. Glisten Cosmetics now has 12 employees and a turnover of over £2.5M and uses on-line influencers to promote and market their signature Wet Liners products. With the products now in 35 HMV stores nationwide as well as being available on-line, Glisten Cosmetics export across the world with 80% of sales going overseas.\nMaria said, “Natalie’s story is inspirational and like that of other Basingstoke entrepreneurs who so often start their new business from home, balancing it alongside their day job. Small businesses like Glisten Cosmetics are the back bone of Basingstoke's successful and vibrant business community with over 90% of Basingstoke businesses employing 10 people or fewer.\n\"Natalie’s drive and passion for her company Glisten Cosmetics is testament to her entrepreneurial spirit and confidence to grow her business to new exciting levels with new products and designs being marketed such as The Glisten Cosmetics advent calendar which sold out in just 12 days. With licensing deals in the pipeline and the prospect of a standalone store in London, Natalie aims to grow her business to new heights, by consolidating and expanding sensibly”.\n\"Glisten Cosmetics is growing because of a significant growth in overseas sales. Anyone wanting to know more about support available for businesses to grow their overseas sales can look at Access international market export support - GOV.UK (www.gov.uk).\"\nBasingstoke is a great place to live, work and invest. The town has a vibrant economy and is the most productive place in Hampshire, with workers paid over £5,500 more per year than the UK average.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_about-rss/content_21.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news_maria-miller-presents-her-pregnancy-and-maternity-redundancy-bill-parliament-today-calling/content_38.html": "Today, former Women and Equalities Minister Maria Miller presents her Pregnancy and Maternity (Redundancy) Bill to Parliament in a Ten Minute Rule Motion. The Bill seeks to stop employers from being able to make a woman redundant from the point that she notifies them that she is pregnant until six months after the end of her maternity leave, except in in specified circumstances; and for connected purposes.\nResearch by the Equalities and Human Rights Commission in 2016 showed that one in 20 women are made redundant while pregnant or on maternity leave, and that yearly 54,000 pregnant women feel they have no alternative but to leave their job when they are pregnant.\nMrs Miller’s Bill comes amid heightened concerns that the Coronavirus crisis may generate a new wave of pregnancy and maternity discrimination, including unfair redundancies of new and expectant mothers. Research from the universities of Cambridge, Oxford and Zurich has also found that women in the UK are four percentage points more likely to have lost their job than men in the wake of the pandemic, with 17% of women newly unemployed compared to 13% of men from mid-March to mid-April.\nMaria Miller said, ‘Women are integral to the success of the UK economy, but research shows that women all too often experience unlawful discrimination after becoming pregnant. It’s vital that we retain female talent in the workforce by protecting them employers who flout the law.’\n‘The protections my Bill propose aim to achieve equality for women in the workplace and would also help address the gender pay gap. The EHRC has shown that pregnancy and maternity-related discrimination results in job losses and a cost to women of between £47-£113 million a year. The costs to the taxpayer are also significant, as the Government forgo taxes and pay increased benefits to the tune of £14 million and £17 million. By retaining female talent in the workplace, productivity in the UK economy would increase. Businesses would also be saved the significant costs of recruiting new talent. Protecting women from unfair discrimination is not only an issue of equality; the economic argument for it is unmistakeable, too.’\nThis Bill has strong-cross party support, including notable Conservative women MPs such as Chair of the Women and Equalities Select Committee Caroline Nokes, Flick Drummond, Karen Bradley, Sally Ann Hart, Virginia Crosbie, and Nickie Aiken.\nDirector of Maternity Action Rosalind Bragg also welcomed the provisions of the Bill: ‘Maternity Action is really pleased that Maria Miller is presenting her Bill in parliament again. This Bill will give both employers and women clarity on their rights and obligations. Women are rightly worried that they are going to lose their jobs because they are pregnant, and few women have the financial resources to fight for justice at tribunal. The Bill would be a welcome measure to stop redundancy being used as a backdoor route for forcing pregnant women and new mothers out of their jobs.’",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_basingstoke-north-west/content_33.html": "Basingstoke North West\nArun Mummalaneni\nBasingstoke North West Division covers Rooksdown, Buckskin and Winklebury. Arun is known as one of the most committed community leaders in Basingstoke, raising thousands of pounds for local charities and community causes and during covid-19 pandemic, he's organised a community kitchen for NHS and vaccination centre volunteers.\nHe has also helped organise 'World Party in the Park', Interfaith Walk and International Language Days and in 2019, was awarded Volunteer of the year for his services.\nHe works as an Information Security Expert delivering services to the Ministry of Defence. He's a school Governor at Kings Furlong and also serves at various charities such as Basingstoke Voluntary Action (BVA) and is a member of the Police Independent Advisory Group. Find out more about him.\nCommunicating With You\nYour local Conservative Team communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news_engineering-still-basingstoke-strength-robotic-innovation-lg-motion/content_17.html": "Local MP Maria Miller dropped into Basingstoke engineering business LG Motion in Telford Road to see their work in robotics. Maria opened the businesses' original factory in Bessemer Park in 2005. Since then local business owner Gary Livingstone has expanded and diversified, working with a range of clients from film to aerospace.\nMaria said, \"It has been incredible to watch the development of Gary's business, which is now routinely using hi-tech robots for precision tasks. I was shown how they operate by some of the company’s apprentices. With clients from the film, aerospace, and space industry including locally AWE, Gary has also received an Innovate UK Grant of £1Million in conjunction with Surrey University to research autonomous robot food picking.\"\nGarry, who studied at BCoT with an engineering apprenticeship, now runs a multitude of businesses including LG Motion, MiniTec and Precision Acoustics, is continuing to invest and expand with an additional £500,000 in infrastructure and investment on the shop floor and a further £250,000 investment for automated cutting and storage machinery.\nGary said, “Basingstoke is a dynamic hub providing us with a fantastic blend of innovation and accessibility to resources.\n“The town's commitment to technological advancement and a thriving business ecosystem makes it an exciting area for industrial ventures. Its strategic location fosters collaboration across sectors, connecting businesses to a diverse talent pool and key markets that enable growth.\n“In Basingstoke, success is fuelled by a supportive business community with forward-thinking leaders, ensuring opportunity and prosperity for enterprises”.\nMaria added, “Basingstoke is a vibrant economy, and businesses like LG Motion who employ 26 people on site is one of the many successful businesses that have made Basingstoke their home providing local highly skilled jobs for local residents”.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news_local-mp-maria-miller-catches-oakley-stitchers-find-out-what-drives-charity-inbox/content_23.html": "So Much More than Stitching! Local MP Maria Miller catches up with Oakley Stitchers to find out what drives the charity.\nMaria said, “I met Caroline Worley, one of the driving forces behind local charity Oakley Stitchers, at a recent community Christmas event. Volunteers with Oakley Stitchers use their hobbies and skills to come together to help others by knitting a range of different things that provide practical help and support to people managing a wide range of health conditions, this includes ‘Knitted knockers’ and ‘aqua knockers’ for women who have had mastectomies.\nThe not-for-profit charity can provide materials, knitting, sewing and crochet patterns to craft groups, workshops, and community groups. This allows people to use their hobbies for a purpose by producing items that are then sent to hospital units and organisations around the UK.”\nCaroline said, “The items we provide are often a lifeline for people who are going through a tough patch. We support areas such as: breast cancer with our knitted knockers and aqua knockers, surgical wards with drain bags and pressure relief pillows, and Zip2PICC hoodies for chemotherapy/dialysis patients”.\nMaria went in ti say, “I was intrigued to learn about the ‘aqua knockers’ made with the netting from wedding dresses, that can be used whilst swimming, and also the PICC line protectors protect PICC lines from catching when getting dressed or moving around.\nLocal charities like Oakley stitchers fulfil an important role ensuring that cancer patients can continue their lives with confidence whilst volunteers are able to put their skills to good use.”\nTo find out more about Oakley Stitchers and how to get involved go to: www.oakleystitchers.org.uk",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_brookvale-and-kings-furlong/content_9.html": "Your Conservative team in Brookvale and Kings Furlong\nThank you to everyone who voted for us in the May 2023 elections. Cllr Arun Mummalaneni continues to serve as your Borough Councillor and County Councillor for Basingstoke North West.\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Brookvale and Kings Furlong. If you have any issues or concerns you’d like us to look into, please get in touch.\nVisit our Ward Facebook Page for other updates.\nYou will find more details about us on the Borough website.\nAs your Conservative team, we bring together the borough, the county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally.\nCommunicating With You\nYour local Conservative team in Brookvale and Kings Furlong communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news_mp-backs-hampshire-police-and-crime-commissioner-call-zero-tolerance-shoplifting/content_15.html": "Donna Jones, the Police & Crime Commissioner (PCC), for Hampshire and the IOW joined local MP Maria Miller, Basingstoke retailers and local business to discuss how to more effectively tackle crime against business, particularly shoplifting.\nMaria said, \"Shoppers and people who work in retail outlets are worried about being caught in a shoplifting incident. As well as the loss of stock to the retail owner, staff and shoppers are facing potentially threatening situations. They need to be certain the Police will be there if they are needed. That's why I am backing our Police and Crime Commissioner's approach. In line with the national Retail Crime Action Plan published by the National Police Chiefs' Council, Donna Jones is continuing to push a zero-tolerance approach in Hampshire and on the Isle of Wight, with increased levels of additional monitored CCTV installations and facial recognition software already being rolled out.\"\nDonna said, “My commitment to ensure Hampshire & Isle of Wight Constabulary has 650 more police officers than it did three years ago also means there is a lot more opportunity for police to focus on crimes that matter most to communities.”",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news_skyline-plaza-incident-follow-meeting/content_27.html": "Following an incident at Skyline Plaza and the extended closure of Alencon Link Maria Miller MP convened a meeting with police, ambulance officers and local Councillor Arun Mummalaneni to discuss the length of time that the road was closed and residents were unable to enter and leave their homes, and whether the processes used could be adapted in the future.\nMaria said, “The Police and Ambulance service provided a comprehensive briefing to me and Cllr Mummalaneni following concerns raised by local residents. From that briefing meeting it was clear that to resolve the situation safely, time was needed for the Police to safely enter the premises concerned. At all times the safety of resident and the general public were of paramount concern. This meant, unfortunately, that Alencon Link had to be closed for an extended period.\n“Thankfully these types of incidences are very rare and the police and ambulance service briefing demonstrated that they had followed the correct procedures and protocols to ensure a safe conclusion to a very troubling incident”.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_basing-and-upton-grey/content_25.html": "Your County Councillor Elaine Still is working hard for you. If you have any issues or concerns you’d like us to look into, please get in touch.\nYou will find more details about us on the Borough website.\nAs your Conservative team, we bring together parish, borough, county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally.\nCommunicating With You\nYour Conservative Councillors communicate regularly with residents through inTouch and are often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please call one of your councillors using the details on the left sidebar or use the Contact button above to send us a message.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news_kemis-statement-ukraine/content_31.html": "Tweet Monday, 3 March, 2025 National News Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_basingstoke-south-east/content_22.html": "Basingstoke South East\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Norden. If you have any issues or concerns you’d like us to look into, please get in touch.\nYou will find more details about us on the Borough website.\nAs your Conservative team, we bring together parish, borough, county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally\nCommunicating With You\nYour local Conservative Team communicates regularly with residents through InTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouchon your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_get-postal-vote/content_6.html": "If you will be away on polling day, at work or on holiday, are physically unable or just don't have the time to get to a polling station to vote in person, you can still exercise your democratic right to vote. You may have moved house since the electoral register was drawn up and have not yet joined the register at your new address.\nYou can choose either to vote by post or to appoint someone else - a proxy - to vote on your behalf. Anyone can vote by post nowadays and you don't need a special reason. Provided you will be around to receive your postal ballot during the last ten days of the election campaign, you can vote in the comfort of your own home and post your ballot paper back to the council.\nAnd, if you forget and leave it until the last minute, provided you have followed all the instructions and sealed the ballot paper and declaration of identity in their envelopes, you can take your postal ballot to the council offices or your local polling station.\nTo find out more about voting by post, please visit the Government's official site at: http://www.aboutmyvote.co.uk\nFrom this site, you can download an application form to vote by post. Simply print the form out, complete the details and send it to the local Electoral Registration Officer at the local council's offices.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_accessibility/content_11.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_cookies/content_18.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_loddon/content_7.html": "Loddon\nElaine Still\nElaine is one of the best-known Councillors in this area and more details about her are available from Hampshire county council\nCovering Chineham, Sherfield Park, Basing, Lychpit and the villages of Mapledurwell, Nately Scures, Newnham, and Up Nately, Elaine has represented the Loddon Division since 2005. During that time she has built a reputation for being a hard-working and caring Councillor. Her qualities have been recognised by her appointment to many senior positions including (in 2018) being made Chairman of the County Council, a role that gave her the opportunity to see first-hand how the County's many communities work to make Hampshire such a fine place in which to live.\nElaine brings to the role of County Councillor a caring approach matched by a wealth of experience, and these enable her to be successful in representing you effectively. She is passionate about many important issues that affect your quality of life including the environment, climate change, culture, and the arts. If re-elected, Elaine will continue to work tirelessly to protect the Loddon valley from over-development and to be a strong and effective voice for you on the County Council.\nCommunicating With You\nYour local Conservative Team in Loddon communicates regularly with residents through InTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_popley/content_26.html": "Your Conservative team in Popley\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Popley. If you have any issues or concerns you’d like us to look into, please get in touch.\nAs your Conservative team, we continue to support the Conservative team across parishes, the borough, the county and Maria Miller MP, to make things happen locally.\nCommunicating With You\nYour local Conservative Team communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_winklebury-and-manydown/content_10.html": "Your Conservative team in Winklebury and Manydown\nBorough Cllr Abigail Compton-Burnett continues to work for you as well as Cllr Arun Mummalaneni as County Councillor for Basingstoke North West.\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Winklebury and Manydown If you have any issues or concerns you’d like us to look into, please get in touch.\nYou will find more details about us on the Borough website.\nDownload our latest InTouch here.\nAs your Conservative team, we bring together parishes, the borough, the county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally.\nCommunicating With You\nYour local Conservative Team communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_privacy/content_2.html": "This document outlines how Basingstoke Conservatives processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Basingstoke Conservatives\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Basingstoke Conservatives.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Basingstoke Conservatives, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Basingstoke Conservatives via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_kempshott/content_39.html": "Your Conservative team in Kempshott and Buckskin\nBorough Cllrs Sean Dillow, Richard Court and Hayley Eachus continue to work for you as well as County Councillor Arun Mummalaneni.\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Kempsott and Buckskin. If you have any issues or concerns you’d like us to look into, please get in touch.\nYou will find more details about us on the Borough website.\nAs your Conservative team, we bring together parishes, the borough, the county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally.\nCommunicating With You\nYour Kempshott and Buckskin Conservative Team communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news/content_13.html": "Basingstoke: UK home to one of the biggest global coffee brands Monday, 18 December, 2023 Lavazza is one of the biggest coffee companies in the world and their UK business to business home is Basingstoke. A family run business with a 3 billion Euro turnover, Lavazza in Basingstoke markets and sells coffee vending machines for the workplaces and offices. Maria said, \"Lavazza's business to business operation is one of Basingstoke's big employers with around 300 employees. Basingstoke’s... Local News\nLocal MP Maria Miller catches up with Oakley Stitchers to find out what drives the charity. Inbox 18th December 2023 So Much More than Stitching! Local MP Maria Miller catches up with Oakley Stitchers to find out what drives the charity. Maria said, “I met Caroline Worley, one... Local News\nMP backs Hampshire Police and Crime Commissioner call for zero tolerance on shoplifting 15th December 2023 Donna Jones, the Police & Crime Commissioner (PCC), for Hampshire and the IOW joined local MP Maria Miller, Basingstoke retailers and local business to discuss... Local News\nArena’s brand-new Business Centre says Basingstoke is open for business 15th December 2023 Maria said, \"Last week I visited Arena's newest, state of the art serviced offices ahead of their official opening for business. It was great to see how Arena... Local News\nMP meets Volunteers at Basingstoke Foodbank event in Chineham Tesco 14th December 2023 “Basingstoke Foodbank held a Big Collection event on the first weekend of December and it was a pleasure to meet the volunteers, Jane Stubbs the new Chineham... Local News\nEngineering still a Basingstoke strength: Robotic innovation at LG Motion 14th December 2023 Local MP Maria Miller dropped into Basingstoke engineering business LG Motion in Telford Road to see their work in robotics. Maria opened the businesses'... Local News\nMP visits another ‘Good’ Basingstoke school - Chiltern Primary school 13th December 2023 Local MP Maria Miller met Head Teacher Nathan Gazzard, staff and members of the School Council when she visited Chiltern Primary School, rated 'Good' by Ofsted... Local News\nSupporting the Basingstoke and Deane Disability Forum Xmas Party 13th December 2023 Maria said, “As a patron of the Basingstoke & District Disability Forum it was an honour to attend their annual Christmas Party held at Popley Fields Community... Local News\nLocal entrepreneur shares her story with MP Maria 28th November 2023 Maria Miller MP for Basingstoke met local entrepreneur Natalie Chapple who founded Glisten Cosmetics based in Crockford Lane in Chineham. The company... Local News\nSkyline Plaza incident – follow up meeting. 28th November 2023 Following an incident at Skyline Plaza and the extended closure of Alencon Link Maria Miller MP convened a meeting with police, ambulance officers and local... Local News\nThe Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news_conservative-partys-final-party-election-broadcast/content_19.html": "Tweet Tuesday, 29 April, 2025 National News Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are\nConservative response to Labour's Emergency Budget Wednesday, 26 March, 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/http_www_basingstokeconservatives_org_uk_people_arun/content_34.html": "Arun, having made Basingstoke his home for the past 15 years with his wife and two daughters has gained a deep understanding of the needs of this town.\nAn alumna of University of Winchester, his professional role as an Information Security Expert is one of the important business sectors here in Basingstoke.\nHe is an award-winning community champion and leader featured on BBC whose ability to bring people together and drive change is truly remarkable and exemplary.\nHe is passionate about supporting Basingstoke's diverse communities in fostering a better borough for all. He's proven to be a team player and a leader who can engage and pursue agendas to fruition.\nWhy you should VOTE FOR ARUN MUMMALA NENI?\nDO YOU HAVE A POSTAL VOTE?\nThe deadline to apply for a postal vote in England for the elections on 6th May 2021 is 5pm on Tuesday 20th April 2021. You must also be registered to vote by midnight on Monday 19th April 2021.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_basingstoke-central/content_4.html": "Basingstoke Central\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Norden. If you have any issues or concerns you’d like us to look into, please get in touch.\nYou will find more details about us on the Borough website.\nAs your Conservative team, we bring together parish, borough, county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally.\nCommunicating With You\nYour local Conservative Team communicates regularly with residents through InTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver IInTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news_category_Westminster-News/content_30.html": "Maria Miller presents her Pregnancy and Maternity (Redundancy) Bill to Parliament today, calling for stronger protections for new and expectant mothers at work 8th July 2020 Today, former Women and Equalities Minister Maria Miller presents her Pregnancy and Maternity (Redundancy) Bill to Parliament in a Ten Minute Rule Motion. The... Westminster News",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news_kemi-launches-policy-renewal-programme/content_35.html": "Tweet Tuesday, 18 March, 2025 National News At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_events_feed/content_29.html": null,
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_eastrop-and-grove/content_32.html": "Your Conservative team in Eastrop and Grove\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Eastrop and Grove. If you have any issues or concerns you’d like us to look into, please get in touch.\nAs your Conservative team, we continue to support the Conservative team across parishes, the borough, the county and Maria Miller MP, to make things happen locally.\nCommunicating With You\nYour local Conservative Team n Eastrop and Grove communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news_feed/content_37.html": null,
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_kempshott-and-buckskin/content_20.html": "Your Conservative team in Kempshott and Buckskin\nBorough Cllrs Sean Dillow, Richard Court and Hayley Eachus continue to work for you as well as County Councillor Arun Mummalaneni.\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Kempsott and Buckskin. If you have any issues or concerns you’d like us to look into, please get in touch.\nYou will find more details about us on the Borough website.\nAs your Conservative team, we bring together parishes, the borough, the county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally.\nCommunicating With You\nYour Kempshott and Buckskin Conservative Team communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_campaigns_slow-it-down/content_24.html": "Basingstoke and Deane has played more than its’ fair share in housing the nation, with homes for an extra 150,000 people in the past five decades, double the rate of the rest of the country. The current Borough build rate has crept up to an unsustainable 1,200 new homes a year. This exceeds levels in the Local Plan, well beyond the needs of our community, stretching the capacity of the NHS and damaging the safety of our natural environment.\nOur community wants this rapid growth to slow down to give local services like our Hospital and GPs time to catch up with the increase in demand; and the Council time to form a better plan to protect the local natural environment. The next local plan must cut new house building levels in half, so we meet the needs of our own local residents, not those of other local authorities too.\nPlease sign up to stay up to date on this 'Slow it Down' campaign.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_brighton-hill/content_16.html": "Your Conservative team in Brighton Hill\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Brighton Hill. If you have any issues or concerns you’d like us to look into, please get in touch.\nAs your Conservative team, we continue to support the Conservative team across parishes, the borough, the county and Maria Miller MP, to make things happen locally.\nCommunicating With You\nYour local Conservative Team communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_news_kemis-speech-foreign-policy/content_28.html": "The Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/content_1.html": "Your Conservative team in Brookvale and Kings Furlong\nThank you to everyone who voted for us in the May 2023 elections. Cllr Arun Mummalaneni continues to serve as your Borough Councillor and County Councillor for Basingstoke North West.\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Brookvale and Kings Furlong. If you have any issues or concerns you’d like us to look into, please get in touch.\nVisit our Ward Facebook Page for other updates.\nYou will find more details about us on the Borough website.\nAs your Conservative team, we bring together the borough, the county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally.\nCommunicating With You\nYour local Conservative team in Brookvale and Kings Furlong communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_maria-miller-basingstoke/content_5.html": "Maria Miller first joined the Conservative Party in 1983 and has held a number of posts at local level. In 2001 she was the Parliamentary Candidate for Wolverhampton North East, the constituency neighbouring where she was born. Maria was selected as Parliamentary Spokesman for Basingstoke in May 2003 and first elected as Member of Parliament for Basingstoke in May 2005. She is an active campaigner on local issues and appears regularly in the Basingstoke media. She is a regular speaker at meetings of local groups including business groups and over 55s.\nMaria believes that we need a diverse mix of people with a wide range of skills in the House of Commons. She brings her experience as a working mother and in business to all aspects of her political work. She believes that it is vital for our system of Parliamentary democracy that politicians re-engage with all parts of the electorate. As part of this she is a regular visitor to schools and colleges in the Basingstoke area, discussing with students different aspects of the political process.\nIn December 2005, Maria was appointed as a Shadow Minister for Education. In November 2006, she was appointed Shadow Minister for Family Welfare, including the Child Support Agency and in 2007, she was appointed Shadow Minister for the Family.\nFollowing the General Election in 2010 and the formation of a coalition government, Maria was appointed Parliamentary Under Secretary of State at the Department for Work and Pensions. In September 2012, she was promoted to the Cabinet as Secretary of State for Culture, Media and Sport and resigned from this position in the spring of 2014. She remains a member of the Privy Council. After re-election in 2015 she was subsequently elected by her parliamentary colleagues to be the Chairman of the Women and Equalities Select Committee.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_chineham-and-sherfield-park/content_8.html": "Your Conservative team in Chineham and Sherfield Park\nBorough Cllrs Jenny Vaux, Paul Miller and Laura Edwards continue to work for you, as well as your County Councillor Elaine Still (l-r in photo above).\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Chineham Village, Sherfield Park, Aurum Green and part of Vyne Park. If you have any issues or concerns you’d like us to look into, please get in touch.\nYou will find more details about us on the Borough website.\nAs your Conservative team, we bring together parishes, the borough, the county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally.\nCommunicating With You\nYour Conservative team communicates regularly with residents through inTouch newsletters and would come out knocking on doors in' normal' times to hear residents' views. If you would like to raise any concerns or any reason, please contact any of us (contact details above). We would also love to hear from you If you would be able to deliver InTouch on your road.\nGet Social With Us\nPre-Covid, local Conservatives would also hold regular drinks, dinners and other events all year round, which we plan to restart when we can safely do so. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_norden/content_3.html": "Your Conservative team in Norden\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Norden. If you have any issues or concerns you’d like us to look into, please get in touch.\nYou will find more details about us on the Borough website.\nAs your Conservative team, we bring together parishes, the borough, the county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally.\nCommunicating With You\nYour local Conservative Team communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_brookvale-kings-furlong/https_www_basingstokeconservatives_org_uk_sherborne-st-john-and-rooksdown/content_14.html": "Your Conservative team in Sherborne St John and Rooksdown are\nCllrs Simon Bound, Jay Ganesh and David McIntyre continue to work for you.\nWhether you voted for us or not, we’re here to work for Sherborne St John and Rooksdown. If you have any issues or concerns you’d like us to look into, please get in touch.\nYou will find more details about us on the Borough website.\nAs your Conservative team, we bring together parishes, the borough, the county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally.\nCommunicating With You\nYour Sherborne St John and Rooksdown's Conservative Team communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us at [email protected].\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above."
}