{
  "https_www_reformukwgs_co_uk_sam-woods-brass-1/https_www_reformukwgs_co_uk_sam-woods-brass-1/content_1.html": "Welcome to Reform UK – Washington & Gateshead South\nWe’re building a movement for real change. No more empty promises just leaders who put people first.\nJoin us in shaping a better future:\n✅ Lower council tax\n✅ Safer streets\n✅ Local leadership that listens\nThis is more than politics.\nThis is about Family - Community - Country",
  "https_www_reformukwgs_co_uk_sam-woods-brass-1/https_www_reformukwgs_co_uk_promotional-material/content_2.html": "Promotional Material\nWe are dedicated to making positive changes locally and nationally, If you believe in openness, fairness, local and national government that works for everyone then please help spread the word about our campaign by downloading and displaying our promotional material to support your local candidate.\nDownloadable PDF`s\nTestimonials\nJoin the Movement for Political Reform\nBe a part of the change you wish to see. Join Reform UK today!",
  "https_www_reformukwgs_co_uk_sam-woods-brass-1/https_www_reformukwgs_co_uk_local-manifesto-2026/content_4.html": "Local Manifesto 2026\nWe are currently developing our Local manifesto for the 2026 Sunderland elections\nit reflects the voices and aspirations of the local community in Washington, Sunderland & Houghton\nYour priorities are our priorities\nInspiring a Generation\nWe are committed to working with the people of Washington to develop a manifesto that will inspire a generation. Our vision is to create a document that puts the local people first, addressing their needs and concerns\nPutting People First\nThrough community engagement programs, policy development initiatives, and local advocacy campaigns, we are dedicated to ensuring that our manifesto reflects the priorities of the local community. By putting people first, we aim to build a stronger Washington for all residents.\nJoin Us in Shaping the Future\nWe invite you to join us in shaping the future of Washington by getting involved in our local manifesto for the 2026 elections. Together, we can create a vision for our community that is both aspirational and achievable, making Washington a better place for all who call it home.",
  "https_www_reformukwgs_co_uk_sam-woods-brass-1/https_www_reformukwgs_co_uk_reported-sorted/content_3.html": "Report Local Problems\nIf you notice problems around our neighbourhood—whether it's a broken streetlight, potholes in our roads, or any local issue—please let us know.\nYour voice matters, and when you help us pinpoint areas that need attention, you're playing a crucial role in making our community a better place for everyone.\nIf you see something that needs fixing, report it, and rest assured our community campaigners will get it sorted!"
}