{
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_my-letter-to-lord-walney-about-his-meetings-with-fossil-fuel-companies/content_10.html": "menu\nI have written to Lord Walney, the government’s “independent” anti-extremism advisor, to ask if he has been meeting with the fossil fuel companies who are being challenged by the same peaceful protesters he’s labelling as extremists.\nThe government wouldn’t tell me, so I’m asking Lord Walney himself. I look forward to hearing a reply.\nhttps://carladenyer.co.uk//wp-content/uploads/2025/01/Walney-Letter-Dec24.pdf\nWalney-Letter-Dec24",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_letters/content_7.html": "What Carla stands for\nMeet Carla\nLetters\nNews\nPress & Contact Me\nGreen Party of England & Wales\nGet involved\nmenu\nPublic letters from Carla Denyer MPs\nLetters\nWho I've been writing to...\nMy letter to Bridget Phillipson MP about trans rights\n28.04.25\nLetters\nRead\nMy letter to Rachel Reeves about the financial challenges facing councils\n21.01.25\nLetters\nRead\nMy letter to Angela Rayner about billboards and adverts\n06.01.25\nLetters\nRead\nMy letter to Lord Walney about his meetings with fossil fuel companies\n06.01.25\nLetters\nRead\nMy letter with Sian Berry to Wes Streeting about puberty blockers\n19.07.24\nLetters\nRead",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_my-letter-to-angela-rayner-about-billboards-and-adverts/content_16.html": "menu\nI’ve written to Angela Rayner, the Secretary of State for Housing, Communities and Local Government, about billboards and digital adverts, asking her to do more to tackle the negative effect of outdoor advertising.\nElected Greens across the country have championed progressive new advertising policies, for example in places like Bristol, Sheffield and Edinburgh. When I was a local councillor in Bristol, I played a key role in securing the ban on advertising for junk food, alcohol, gambling and payday loans on council-owned billboards and advertising screens in Bristol.\nIt’s very promising to see councils implementing new policies to protect their residents from some of the impacts of consumerism, advertising, greenwashing and injustice. But that’s not enough. National planning laws need to change – they haven’t kept pace and it is clear that local authorities and communities need more power to object to harmful ads.\nChris Packham recently launched a petition asking for a national ban on fossil fuel advertising, it already has thousands of signatures. There is clear public support for more restrictions on advertising in public spaces and saying ‘no’ to greenwashing.\nOutdoor-Advertising",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_my-letter-with-sian-berry-to-wes-streeting-about-puberty-blockers/content_14.html": "menu\nToday, Sian Berry MP and I wrote to the Secretary of State for Health and Social Care, Wes Streeting, expressing our serious concerns about his recent statement on puberty blockers.\nTrans young people need support, not to have their healthcare used as a political football.\nMedical decisions are for patients and doctors, not politicians.\nLetter-to-Rt-Hon-Wes-Streeting-MP-19_07",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_pledge_an-end-to-the-housing-crisis/content_2.html": "Tackling the Climate Emergency\nLeading on urgent action to protect people and planet\nCarla has consistently championed the rights of renters and worked to prevent homelessness in her roles as Green Party councillor, as the Green Party’s former Housing spokesperson, and as a member of the ACORN community union.\nBelieving in the right to warm, safe, affordable housing for all, she has continually advocated for measures such as rent controls and landlord licensing. Since 2016, Carla has urged the Mayor and Cabinet to expand landlord licensing across the city. In 2019 this call was heeded for a selection of wards near the city centre, and in 2023 the Council consulted on extending the scheme further. She has also supported the student rent strike during the covid pandemic, and committed to abolishing feudal leasehold forms of home ownership and replacing them with a system that offers people choice and control.\nCarla has been vocal in her support and solidarity with the residents of Barton House, who were forced to evacuate their homes in Lawrence Hill in Bristol due to safety concerns. She joined growing calls for the council to pause the evacuated residents’ rent payments and called for an investigation into the handling of the incident.\nThis country needs public representatives with solutions that meet the challenge of the housing crisis. Carla is committed to measures which tackle the housing shortage while simultaneously protecting valuable green space for communities, reducing climate emissions, tackling fuel poverty and providing genuinely affordable homes.",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_category_letters/content_11.html": "What Carla stands for\nMeet Carla\nLetters\nNews\nPress & Contact Me\nGreen Party of England & Wales\nGet involved\nmenu\nLetters News\nRegions\nAll\nLetters\nMy letter to Bridget Phillipson MP about trans rights\n28.04.25\nLetters\nRead\nMy letter to Rachel Reeves about the financial challenges facing councils\n21.01.25\nLetters\nRead\nMy letter to Angela Rayner about billboards and adverts\n06.01.25\nLetters\nRead\nMy letter to Lord Walney about his meetings with fossil fuel companies\n06.01.25\nLetters\nRead\nMy letter with Sian Berry to Wes Streeting about puberty blockers\n19.07.24\nLetters\nRead",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_pledge_tackling-the-climate-emergency/content_5.html": "An End to the Housing Crisis\nEveryone in our city should have a safe, warm, affordable home\nThe world is waking up to the urgent need for climate action.\nCarla pioneered the first Climate Emergency motion in Europe, setting a precedent by committing Bristol to achieve carbon neutrality by 2030. This bold initiative has since inspired governments, councils, and businesses across the continent to follow suit.\nSince then Carla has continued advocating for climate action both in Bristol and nationally, saying no to any new oil and gas but yes to renewables, green jobs in a thriving green economy and retrofitting the UK’s cold and leaky housing.\nThe recent approval of the Rosebank oilfield shows we need Green MPs in Westminster more than ever. The Conservatives have given the go-ahead to Rosebank, the largest undrilled oilfield in the North Sea. Labour has said that they will not rescind the licence in Government. If Labour had the courage to say it would rescind the licence, it could render the investment unviable and the dangerous climate impact would be avoided. Neither political party is showing the climate leadership the world needs at this crucial moment in time.\nWe need people like Carla in Westminster to hold the government accountable to its environmental commitments and demand they treat the climate crisis with the urgency it requires.",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_pledge_fairer-and-greener-transport/content_6.html": "Tackling the Climate Emergency\nLeading on urgent action to protect people and planet\nEveryone in Bristol wants our transport system to work better. Accessible, reliable and affordable public transport is the foundation of a thriving city – connecting people to each other, education, work, and crucial services, whilst tackling congestion, air pollution and climate change all at the same time.\nCarla continues to lead the way on the campaign for fairer buses in Bristol through advocating for a franchising system similar to that in London and Manchester. This would give the local authority greater powers to set routes and frequencies rather than private companies cherry-picking the profitable routes while leaving other passengers out in the cold and some communities completely cut off. After years of campaigning by Carla, Bristol Green Party and a coalition of groups, the West of England Mayor has recently taken the first steps to considering bus franchising.\nAs your MP, Carla would continue to fight for a transport system that truly serves the needs of Bristol’s residents and the environment, not the profit of large companies.",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_my-letter-to-bridget-phillipson-mp-about-trans-rights/content_15.html": "menu\nI have written to the Minister for Women and Equalities, Bridget Phillipson MP, to ask for clarity on how the government will ensure trans people’s rights in the wake of the recent Supreme Court ruling and EHRC guidance.\nYou can read the full letter here:\nLetter 28.04.25 EHRC CD (1)",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk/content_1.html": "My pledge to you\nBristol is a city of unique opportunities. We have the potential to be a beacon to the rest of the country and the world, demonstrating how collective action can overcome even the most daunting challenges.\nOur city is talented, hard-working, imaginative, and kind – values that I will continue to embody as your MP. I remain dedicated to listening with an open mind and striving to help wherever I can. With my background as a renewable energy engineer, co-leader of the Green Party of England and Wales, and former Bristol City Councillor, I’ve dedicated my career to championing policies that will build a fairer, greener country.\nAs your MP, I will have the freedom to advocate for what is truly right for our city. I will not be swayed or coerced into supporting policies that do not benefit Bristol. My commitment is to listen to my constituents and vote with my conscience, ensuring your voices are heard in Parliament.\nA Green vote in Bristol Central has proven to be more than just a vote against the Tories. It is a mandate to hold Labour accountable to their promises and to champion progressive, green policies. Together, we will continue to fight for a fairer, greener future. A vote for hope has now become a vote for action.\nThank you for your trust and support. Let’s build a brighter future for Bristol together.",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_meet-carla/content_3.html": "Tackling the Climate Emergency\nLeading on urgent action to protect people and planet\nCarla Denyer was elected as MP for Bristol Central in July 2024. Her background is in engineering and she was elected as co-leader of the Green Party of England and Wales in 2021.\nI’ll be holding my next advice surgery on Saturday 10 May 2025.\nI’m here to help on a range of issues such as housing, healthcare, welfare benefits and asylum and immigration. Please get in touch by emailing a brief summary of your case to bristolcentraloffice@parliament.uk\nLimited slots available per session for Bristol Central constituents only.\nCarla moved to Bristol after university to work as an engineer. In 2015 she was elected as a local councillor, a role she was in for 9 years. In July 2024 she was elected as MP for Bristol Central with the biggest Green vote share in the country (24,539 votes, 56.6%).\nIn 2018, she wrote and proposed the first Climate Emergency declaration in Europe, setting an ambitious goal for Bristol to become carbon neutral by 2030. This bold initiative has since been adopted by 570 UK councils, the UK Parliament, and the Scottish and Welsh governments.\nAs a councillor and campaigner, social justice is at the heart of Carla’s work. Whether on renters’ rights or access to public transport and key services, Carla had consistently stood up for the people who need it the most.\nBefore entering politics, Carla was an engineer in the renewable energy industry, specialising in offshore and onshore wind energy. Working in the sector, she saw that the solutions to create a greener, safer future are already available; what is lacking is the will of our political leaders. The good news is that this is something we can change by electing more Greens at every level of Government.\nCarla Denyer is more than a politician; she is a dedicated advocate for the people of Bristol, for green policies, and for social justice.",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_my-letter-to-rachel-reeves-about-the-financial-challenges-facing-councils/content_13.html": "menu\nI’ve written to the Chancellor, Rachel Reeves, to express my concern about the financial challenges facing councils across the country, including in Bristol.\nPublic services have been cut to the bone, and we’re all feeling the impact. In my letter, I urged the Chancellor to implement a wealth tax, to properly fund our public services, rather than considering further cuts.\n250114-local-authority-finances-letter-1",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_privacy-policy/content_9.html": "This policy explains how Carla Denyer, her team and Bristol Green Party will protect any information you provide to us.\nBristol Green Party is the owner of the email list and its registered address is:\n2 Riverside Chapel\nCrews Hole Road\nBristol\nBS5 8FT\n- You can contact the website administrators in Bristol at EMAIL or call the Bristol Party on 07756 355 547\n- The information you provide to us will be used by us in order to maintain a register of supporters and supply you with updates on Carlas’s work as a mayoral candidate and/or mayor of Bristol and his campaigning on behalf of people in Bristol. It will not be used for other Green Party campaigns, or for national party news – which you can sign up to separately at www.greenparty.org.uk.\n- We will never voluntarily share your information with a third party, and will fight to the degree that we are able any legal or government action that attempts to obtain such data.\n- We will not transfer any information that we hold on you to any email or internet service provider outside the European Economic Area.\n- Under the Data Protection Act, you may at any time request a copy of all information we hold on you by writing to us at the above address.\n- Cookies may be used by us to provide you with customised information from our web site. A cookie is an element of data that a web site can send to your browser, which may then store it on your system. We use cookies so that we can give you a better experience when you return to our web site. Most web browsers automatically accept cookies. You do not have to accept cookies, and you should read the information that came with your browser software to see how you can set up your browser to notify you when you receive a cookie, this will give you the opportunity to decide whether to accept it. If you disable cookies from your browser you may not be able to access certain features of a particular web site.",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_get-involved/content_4.html": "There’s loads of ways you can help send Carla to Westminster:\n- Join us at an Action Weekend to get our message out to residents.\n- Help from home by calling members, writing content, entering data, helping out with social media, and so much more.\n- Share your creativity by taking photos, making videos, and designing graphics.\n- Make a monthly donation to keep the campaign running all the way until the election.\nWe have a dedicated, hard-working, and brilliant team of behind-the-scenes volunteers that help run our general election campaign.\nBut they need your help. We need more volunteers helping out behind the scenes if we’re going to make history in Bristol in 2024.\nThere’s a role for everyone and we want to facilitate finding the right and most impactful role for you. Whether you prefer working with other people or on independent tasks, enjoy hands-on activities or remote work, there’s a place for you in our team.\nBeing part of the #TeamCarla volunteer team is an incredibly rewarding experience. By signing up, you will be one of the individuals in a fantastic and growing team, that makes a special bit of history here in 2024. And most of all, it’s a great opportunity to meet new people and make new friends!\nIf you’d like to join the team, please fill out the form below and one of our team will be in touch very soon to discuss more.\nBefore you go, don’t forget to join the #TeamCarla WhatsApp group!\nJoin our WhatsApp group to get all the latest news from Carla’s campaign and a regularly updated schedule of upcoming events. We have over 500 #TeamCarla members already, but don’t worry, it’s an announcement-only group (which means minimum notifications!)\nJoin the group\nDonate to Bristol Green Party",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_press-contact-me/content_8.html": "menu\nFollow Carla:\nTwitter: @carla_denyer\nInstagram: @carladenyer\nFacebook: Carla Denyer for Bristol Central\nBlue Sky: @carladenyer.bsky.social\nPress enquiries\nEmail: press@greenparty.org.uk\nParliamentary matters and policy enquiries\nEmail: carla.denyer.mp@parliament.uk\nCasework and constituency enquiries\nEmail: bristolcentraloffice@parliament.uk\nPhone: 0117 440 3977",
  "https_carladenyer_co_uk_/https_carladenyer_co_uk_news/content_12.html": "Carla Denyer stands up for migrant health and care workers’ rights 11.12.24 Equality & Diversity Health Read\nGreens win 34 seats on Bristol City Council, largest ever number of Green seats on a UK Council 07.05.24 Read\nGreen Party local election launch: time to unlock policies that will create hundreds of thousands of affordable homes 04.04.24 Local Democracy Read\nGreen motion calls for empty buildings to be turned into homes to tackle housing crisis 04.01.24 Housing Read\nGreen Party announce Bristol MP candidates ahead of next year’s General Election 22.11.23 Constituency Read\nBristol school children delivered their petition for a ceasefire to Carla Denyer 22.11.23 Constituency Read\nAs Bristol ranks 7th on Climate Action, Greens say climate progress welcome, but improvements needed 13.11.23 Environment & Climate Change Read\nGreen Party co-leader Carla Denyer not re-standing as councillor to focus on becoming MP for Bristol Central 13.11.23 Constituency Read\n“Silence is complicity” Carla Denyer urges Bristol MP’s to call for ceasefire in Israel Gaza-Conflict 10.11.23 Read\nChannel 5 News spotlight MP candidate Carla Denyer in visit to Bristol ahead of next year’s general election 26.10.23 Local Democracy Read\nGreens call for above-ground mass transit as independent study shows it’s the right choice for Bristol 26.10.23 Transport Read"
}