{
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Wigan%20Pier%20Quarter/content_147.html": "Fly-tipping and Litter Cleaned Up at Trencherfield Mill Environment and Outdoors Fly-tipping and Litter Wigan Pier Quarter +\nPresenting Awards at More Than Words' Annual Celebration Ball Community Groups Culture Wigan Pier Quarter +\nHaig Street Car Park Transformed by Streetscene Works! Environment and Outdoors Reported It - Fixed It! Roads and Traffic Wigan Pier Quarter +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_12_christmas-day-dinner-at-st-james-church_html/content_268.html": "Today, we were blessed to attend the Christmas Dinner held at St James' Church, Poolstock, bringing together around 50 people from the local community, young and old.\nA HUGE thank you to Alison Brown for organising this dinner, and to the army of volunteers from the Faith Café for helping out! You have made it a magical day for so many people.\nWhilst we were there, we also presented funding for the Lifelines Dementia Friendly Choir, also based at St James’, to enable to the group to carry on its fantastic work.\nOnce again, thank you to all those involved, and we wish everyone a very Merry Christmas! We’re signing off for now, but we’ll be back in action after the New Year!\n- Cllr Draper, Cllr Callaghan & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_pothole-on-bold-street-reported-it_html/content_252.html": "Pothole on Bold Street: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps REPORTED IT, FIXED IT! The large pothole on Bold Street has now been filled in. Thank you to Wigan Council’s Highways Team for acting so quickly!- Cllr Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Housing/content_91.html": "Taking Part in an Estate Inspection Around Laithwaite Road Community Resilience and Safety Environment and Outdoors Housing Worsley Hall +\nAttending the Estate Inspection of Worsley Hall Central Community Resilience and Safety Environment and Outdoors Fly-tipping and Litter Housing Worsley Hall +\nTerrific Tiem Attending Worsley Hall Community Fun Day Community Groups Culture Housing Worsley Hall +\nWigan Council Launches Its Gardening Competition for Tenants! Announcements Environment and Outdoors Housing +\nPlanning Application Submitted for Vacant Hare and Hounds Pub Housing Pemberton Planning Applications +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_councillors-surgery-at-st-james-church_html/content_284.html": "Skip to main content\nCouncillors' Surgery at St James' Church - August 2024\nLovely to be back at St James' Church for this morning’s surgery! As a reminder, this surgery takes place on the second Saturday of the month, from 11am - 12pm. If you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Poolstock/content_190.html": "Poolstock Church Throws Open Its Doors to Feed People on Christmas Day Brighter Borough Funding Community Groups Culture Poolstock +\nOverhanging Vegetation Cut Back Along Swan Meadow Road Environment and Outdoors Poolstock Reported It - Fixed It! +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_04_attending-cotton-works-launch-at_html/content_122.html": "During the week, we were lucky enough to be invited to the Cotton Works launch event, which took place at Feast at the Mills.\nCotton Works will be a transformational new neighbourhood standing on the site of Eckersley Mills, which has lain dormant for over four decades and is the biggest undeveloped brownfield site outside of London.\nIt represents a £180-million investment from The Heaton Group, a fifth-generation, Wigan-based construction group, which will include:\nWigan’s first food hall, with seven independent food traders and live music.\n68,000 sq ft of office space with a range of amenities for employees.\nLeisure space, including a new home for Wigan Roller Rink.\nExtensive, landscaped green spaces in the public realm.\nAt the launch event, we heard details about the masterplan from those directly involved in the project, and then Warriors legend Kris Radlinksi gave a barnstorming speech about the promise our town holds.\nWe are very excited that this transformational project is taking place on our ward! It will help to bring enormous leisure, cultural and economic benefits, whilst preserving the mills that form an important part of our town’s industrial heritage.\nYou can read more about Cotton Works and see the master plan at: cotton-works.co.uk",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_jon-lister-recognised-for-20-years_html/content_78.html": "This afternoon, we were thrilled to recognise the dedication that our constituent, Jon Lister, has given to many of our local grassroots football clubs. Jon was presented with his award by the Mayor of Wigan, Cllr Kevin Anderson.\nFor over 20 years now, Jon has coached both children and adults, male and female. In his own words, Jon's main reason for this unwavering commitment to grassroots football is to give back to the community. He has a strong belief that the longer people are playing football, the better people they turn out to be.\nBeginning at Hawkley Bridge Juniors, Jon coached the team to win trophies in three seasons. After that, he joined Winstanley, and in the decade he was there, Jon's teams won the \"Fair Play\" Award for ten years running. In addition, Jon picked up the \"Coach of the Year\" Award whilst the team played in the Warrington League.\nWhilst at Winstanley, Jon also coached an adult team, which he took from a struggling team that was losing every week to a winning team. But more importantly, he brought together a group of young men to a form strong bond that still holds together to the present day! During the season that Jon left Winstanley, both of his teams won trophies and in doing so, created great memories for the players on both teams.\nAfter leaving Winstanley, Jon took a team of young lads to Ashton Town to test them at a higher level. Again, after a slow start, the team playing in the then-Lancashire league (Thursday Nights) finished the season as a winning team, along with John Eastham.\nThe next stop was Garswood United, who play in the Cheshire League, and onto a very different challenge, where Jon and John Eastham, brought together a club that had been struggling on and off the field. In the eight short months that followed, Jon led the team to 5th in the table; secured new kits for the players; had subs collected; and players were back in the bar after each game, leading to a club in a healthy position.\nJon then left with John Eastham to form AFC Wigan, with the aim of giving players of all abilities the chance to play football on Scot Lane pitches. After a lot of hard work, the club secured a license for the pitches. Jon's ultimate aim is to give the wider community pitches that players can be proud to be a part of: for now and for the future.\nThis is just a brief overview of Jon's involvement in local grassroots football over the last two decades: coaching hundreds of children and adults in our town; missing only a handful of training sessions; and never missing a league or friendly that his team has taken part in. And that is without mentioning Jon's two best qualities: his management skills, and the pure passion he has for all the players, coaches and parents that he meets.\nSo, to Jon, for putting your life and soul into grassroots football, we cannot thank you enough. Now as Chairman of AFC Wigan, and through your love of sport and football, you inspire and support people from all walks of life in our community, to bring out the very best in them.\nThe word \"legend\" is often used but in your case, there is no doubt that it is true. You are a true inspiration to many, and we applaud you!\n- Cllr Draper & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_worsley-hall-shops-noticeboard-updated_html/content_69.html": "This week, we’ve updated the Ridyard St noticeboard with some new posters about:\nWigan Borough Domestic Abuse Service;\n🧑🧑🧒🧒 Wigan Family Hubs;\n“Here For You” drop-in sessions;\nWigan Council’s “Keep It Clean” campaign.\nPlease comment below if you would like any information on other council/ community services!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02_attending-launch-of-seeing-things-art_html/content_67.html": "Last night, we were thrilled to be invited to the launch of the Seeing Things Art Exhibition, taking place at The Edge, Wigan.\nThe exhibition features the work of nine artists from Wigan and the North West, including canvas paintings, sculptures, interactive works and much more!\nWe would like to applaud all the artists for their exemplary work, and congratulate the curator, Matthew Wood, for bringing this cultural showpiece to the doorsteps of people in Wigan.\n- Cllr Draper & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_estate-walkabout-of-worsley-hall-north_html/content_117.html": "🏠 Yesterday morning, we were out on Worsley Hall for an estate inspection, with Jo (Neighbourhood Manager) and Katrina (Neighbourhood Tenant Officer).\n🗣️ We had the opportunity to speak to many tenants about the area and picked up casework. Working together to solve issues, improve the area and people's lives.\n💬 Please contact us concerning any issues you may have.\n- Cllr Draper & Cllr Callaghan",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_sad-milestone-for-waspi-women_html/content_153.html": "We have now reached the sad milestone of 250,000 deaths of WASPI women while waiting for pension compensation.\nWe are still here - WASPI and all 1950s born women - fighting for fast and fair compensation, fighting for justice.\nThink about this for a moment: one 1950s born woman dies every 13 minutes, before they reach pension age.\nThis could happen to one of your relatives your mum, wife, grandmother, aunty, cousin or friend.\nAs the WASPI Champion on behalf of Wigan Council I can say WE ARE NOT GOING AWAY till we get justice!\n- Cllr Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_04_one-last-push-speaking-to-residents-on_html/content_92.html": "On the eve of polling day, we have been out speaking to more constituents in Pemberton.\nOver the last 8 days of door-knocking, we have visited around 900 properties and spoken to almost 400 people directly.\nWe really appreciate everyone that has taken the time to talk to us, and to all those that are voting to re-elect Matt as local Councillor tomorrow!\nMake your plan to vote at iwillvote.org.uk and remember to bring photo ID with you! Polls are open 7am - 10pm.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02_large-pothole-on-sherwood-drive_html/content_188.html": "Large Pothole on Sherwood Drive: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps The large pothole on the speed bump at the bottom of Sherwood Drive has now been fully repaired. Thank you to the Highways Department for acting so swiftly!- Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_05_tree-rific-to-see-new-trees-planted-in_html/content_95.html": "Tree-rific to see some of the newly planted trees in between Warrington Rd and Victoria St, Newtown!\nAs part of Wigan Council’s Climate Change Strategy, the aim is to plant 1 million new trees across our borough by 2032 (originally 2030, delayed two years by Covid-19 pandemic).\nYou can read more about the Council’s plans at: https://www.wigan.gov.uk/Docs/PDF/Council/Strategies-Plans-and-Policies/climatechange/Outline-Climate-Change-Strategy.pdf",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07/content_63.html": "Vandalised Sign on Southgate: Reported It, Fixed It! Reported It - Fixed It! Roads and Traffic Wigan Pier Quarter +\nFly-tipping at Alexandra Park: Reported It, Fixed It! Environment and Outdoors Fly-tipping and Litter Newtown Reported It - Fixed It! +\nImprovements Made to Trencherfield Mill Environment and Outdoors Reported It - Fixed It! Wigan Pier Quarter +\nTraffic Lights on Warrington Road: Reported It, Fixed It! Newtown Reported It - Fixed It! Roads and Traffic +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09_working-together-with-council-officers_html/content_197.html": "Very productive day as we near the end of Douglas Ward’s “Our Town” Week!\nThis morning, we attended our regular surgery at Mount Zion and were joined by local police to offer advice and assistance to constituents. Thank you to Sergeant Aspinall and PC Lomas for taking the time to help out!\nToday’s meetings highlight how Councillors, Council Officers, police and residents can work together for the benefit of our local area, which we will continue to do all year round. As ever, a huge thank you to all involved!\nDon’t forget: there is one more Waste Amesty Day taking place at Trencherfield Mill tomorrow, from 9am - 2pm. Please come along if you have any excess household waste you need to dispose of.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_07_meadows-family-hub-closed-until-august_html/content_72.html": "REMINDER: The Meadows Family Hub is closed for urgent roof repairs until approximately 12th August, so our surgeries originally planned for Friday 5 July & Friday 2 August will not take place.\nFor the most up-to-date activity calendar, please visit Wigan Council's website:",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Litter%20Picking/content_41.html": "Another Eleven Bags of Litter Collected Around Prescott Street Environment and Outdoors Fly-tipping and Litter Litter Picking Wigan Pier Quarter +\nFourteen More Bags of Litter Collected Along Prescott Street and York Street Environment and Outdoors Fly-tipping and Litter Litter Picking Wigan Pier Quarter +\nLitter-Pick Around Newtown Working Men's Club and Anson Street Fly-tipping and Litter Litter Picking Newtown +\nWorsley Hall Welcomes \"Our Town\" Waste Amnesty Week Announcements Environment and Outdoors Fly-tipping and Litter Litter Picking Worsley Hall +\nTwo More Litter Picks Carried Out in Newtown Environment and Outdoors Fly-tipping and Litter Litter Picking Newtown +\nVery Productive Litter Pick in Newtown Environment and Outdoors Fly-tipping and Litter Litter Picking Newtown +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_11_having-ball-at-more-than-words-annual_html/content_282.html": "On Friday night, we had an absolute ball at More Than Words’ Annual Celebration Ball!\nIt was heart-warming to see all the students receive their accolades, including awards for Kindness to Others, Great Performer, Bravery, Star Baker and Music Stars, amongst others!\nThe students’ dance performances and drumming by Bom Ta Bom were absolutely terrific! It was so uplifting and formed part of an amazing night, with smiles and happiness at every table!\nWe cannot put into words how proud we are to support this group. To the staff and students: keep up the good work; we cannot wait to see what comes next!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_06_councillors-surgery-at-meadows-family_html/content_259.html": "❤️ Lovely to be back at The Meadows in Worsley Hall this morning to talk to local residents.\n🚨 Please note: the next two surgeries at The Meadows (planned for Friday 5th July and Friday 2nd August) will be cancelled due to building works taking place.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_12_visiting-montrose-hall-care-home-in_html/content_142.html": "This morning, we enjoyed a visit to Montrose Hall Care Home in Worsley Hall, to meet residents and staff there.\nThe home looks absolutely fantastic, decked out with Christmas decorations throughout, which residents have put up with the help of staff members.\nThe home is currently raising money to buy a replacement minibus, as their previous one failed its MOT. The replacement transport will make it possible residents to start going on day-trips again.\nTo help their efforts, we presented a donation of £500 from Unite the Union North West Branch 54 (Wigan). If you would like to make a donation, the home has also set up a GoFundMe page which you can view here: https://www.gofundme.com/f/montrose-mini-bus",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_05_supporting-more-than-words-danspiration_html/content_148.html": "What an amazing performance from More Than Words on a sunny Believe Square this afternoon!\nCllr. Draper & Cllr. Dawber went down to support the group and joined in with the dancing! Voting for their Danspiration project closes at noon TOMORROW.\nThere's still time to vote and help them win a share of £250k through the People's Projects.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_11_new-alley-gate-installed-on-ormskirk_html/content_260.html": "🎉 This afternoon, we were delighted to join residents on Ormskirk Road, to see the new alley gate that was installed earlier this month.\n🚓 We secured funding for the alley gate due to the exceptional circumstances of anti-social behaviour, littering and fly-tipping, that had been blighting residents in the area. The location also fit the criteria for a gate to be installed.\n🙌 We would like to say a huge thank you to Julie Clarke, Wigan Council Community Capacity Officer, for all the hard work she put into this project over many months.\n👏 In addition, we would like to applaud the efforts and determination of local residents, led by Tom, which were instrumental in delivering this project.\n✅ The area has already seen a reduction in anti-social behaviour, and we are pleased to have helped bring this about working with our constituents.\n- Cllr Draper, Cllr Callaghan & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_friends-of-alexandra-park-win-highest_html/content_279.html": "Congratulations to the Friends of Alexandra Park, who recently won a “Level 5 - Outstanding” Award in this year’s North West In Bloom competition!\nThe group’s dedicated volunteers - including John, Joe & Kevin - do a fabulous job of maintaining the park, bowling green and community garden all year round.\nA huge thank you to all within Friends of Alexandra Park! We look forward to continuing our work together to improve our precious outdoor spaces.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_11_hard-to-see-street-sign-on-hamilton_html/content_290.html": "Hard-To-See Street Sign on Hamilton Court: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps ✅ Old and hard-to-see sign on Hamilton Court reported, and now replaced by the Network Management Team.💚 Let's keep Douglas Ward looking its best!- Cllr Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_12_poolstock-church-throws-open-its-doors_html/content_55.html": "Today, we were blessed to attend the Christmas Day Lunch held at St James with St Thomas Church - Poolstock, bringing together over 60 people from the local community, young and old, an increase from last year’s event.\nA huge thank you to Rev Alison Brown and to the army of volunteers from the Faith Café for organising this dinner! You have made it a magical day for so many people.\nOnce again, thank you to all those involved, and we wish everyone a very Merry Christmas and a Happy New Year!\nThat’s a wrap for 2024: we’ll be back at our Councillors’ Surgery at The Meadows Family Hub on Friday 3rd January, 11am - 12noon.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_overhanging-vegetation-cut-back-along_html/content_214.html": "Recently, I had reports from local residents around Swan Meadow Road concerning overhanging vegetation, bushes and foliage, which was hindering members of the public walking on the footpath.\nI reported this to Wigan Council, who contacted the land owner, and the area has now been cut back, making the footpath much safer for pedestrians. Thank you to everyone involved!\n- Cllr Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_wishing-meadows-family-hub-very-happy_html/content_127.html": "This afternoon, it was lovely to be at The Meadows Family Hub to celebrate their first birthday, alongside staff, families and Cllr Jenny Bullen, Cabinet Member for Children and Families.\nFamily Hubs are a way of bringing together all the support a family may need, from pregnancy through to young people turning 19, or 25 if they have a Special Educational Need or Disability (SEND).\nTo find out more about how The Meadows can help your family, please visit: https://wigan.gov.uk/FamilyHubs",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Transport/content_166.html": "Road Closure on Warrington Road for Next Four Weeks Announcements Newtown Roads and Traffic Transport +\nOvergrown Vegetation on Southgate: Reported It, Fixed It! Environment and Outdoors Newtown Roads and Traffic Transport +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_09_kick-off-has-arrived-at-laithwaite-park_html/content_281.html": "Kick-off has arrived for Wigan Borough’s new football hubs, providing top-class facilities for local communities and grassroots teams.\nFollowing investment of more than £5m from Wigan Council and a £7.6m grant from the Football Foundation, the two facilities – at Laithwaite Park, Wigan, and Williams Fosters, Ince – are now open to the public.\nWith the pre-match waiting now over, we were pleased to be given a tour of Laithwaite Park’s facilities this week, by the operators Leisure United.\nThese state-of-the-art pitches and facilities will make a massive impact for sport, health and wellbeing in our borough.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_05_new-defib-installed-at-st-james-church_html/content_245.html": "Earlier today, we visited St James’ Church in Poolstock to see the newly-installed defibrillator that we have funded from our Brighter Borough pot.\nStudies have shown that the use of an AED defibrillator can increase someone’s chances of survival by 7 TIMES should they have a cardiac arrest.\nHopefully, no-one will find themselves in this situation. But if there is an emergency, this life-saving piece of equipment will be available to help!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_railings-re-installed-on-sherwood-drive_html/content_210.html": "Skip to main content\nRailings Re-Installed on Sherwood Drive, Improving Safety\nGreat to see the railings back in place on Sherwood Drive, after they had been crashed into and were lying in the grass! Thank you to the Highways Team for re-installing them so quickly.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_visiting-wigan-target-sports-club_html/content_42.html": "🎯 Last Monday, we had the opportunity to visit Wigan Target Sports Club and meet members at their state-of-the-art facility in Poolstock.\n🧱 Originally formed as Wigan Rifle Club in 1961, the group has had various bases over time, but built their current home in 2003. The two-storey building is bespoke-designed and consists of three target ranges: 10-metre for air rifle and pistol; 25-metre and 50-metre for firearms from .22 rimfire up to .455 centre fire pistol calibre, each with their own preparation rooms.\n📍 Amazingly, the club’s 50-metre indoor target range is one of only two in the UK (the other is in Bisley, Surrey). Because of this speciality, the club hires out the ranges for the training of the Olympic and Paralympic Squads, as well as Talent and Development Squads.\n🏁 It was in September 2003 that operations began at the current base, accompanied by a new name: Wigan Target Sports Club. Since then, the club has flourished with members regularly travelling from all over the country, participating in the various open competitions and shoulder to shoulder events.\n🙌 There are currently over 60 members, ranging from 15-85, male and female, all of whom participate equally in various competitions. In the last four years, the club has worked with British Shooting, who are responsible for coaching the national and international shooters.\n❤️ Whilst we were there, we had the chance to meet Olivia, a club member and recent silver medalist, who looks to have a bright future in the sport. It was great to see that all across the club, no matter someone’s age, gender, or physical ability, everyone is able to take part as equals and enjoy the sport.\n👏 A huge thank you to the club’s Secretary, Michael, for inviting us down, and to all the members who gave us a very warm welcome. We look forward to working with you going forwards.\n- Cllr Draper & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_overgrown-bushes-on-victoria-street_html/content_9.html": "🌳 On our rounds of the ward, we were notified of overgrown bushes on the corner between Victoria Street and Norfolk Street, Newtown.\n⚠️ They were overgrowing onto the pavement, as well as impeding the vision of drivers at the road junction.\n✅ We reported this to the Council and are pleased to say the Streetscene Team have done a terrific job of trimming it back!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_councillors-surgery-at-st-james-church_html/content_246.html": "Great to be back at St. James' Church for this morning’s surgery! Thank you to the residents who came over for a chat.\nAs a reminder, this surgery takes place on the second Saturday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!\n- Cllr Draper, Cllr Callaghan & Cllr Dawber\nAs a reminder, this surgery takes place on the second Saturday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!\n- Cllr Draper, Cllr Callaghan & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10/content_113.html": "Catching Up with Robin Park Indoor Bowling Club Brighter Borough Funding Community Groups Health Newtown Sports Clubs +\nImprovements Ongoing at Alexandra Park Bowling Green Brighter Borough Funding Community Groups Environment and Outdoors Newtown Sports Clubs +\nDon't Forget: Wigan's Recycling Centres Return to Winter Hours Announcements Environment and Outdoors Fly-tipping and Litter +\nDrive-Around of the Ward and Collecting Our Final Five Bags of Litter from Prescott Street Community Resilience and Safety Environment and Outdoors Fly-tipping and Litter Wigan Pier Quarter +\nPresenting Awards to Students at More Than Words' Graduation Awards Evening Community Groups Culture Wigan Pier Quarter +\nAnother Eleven Bags of Litter Collected Around Prescott Street Environment and Outdoors Fly-tipping and Litter Litter Picking Wigan Pier Quarter +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_solider-statue-lit-up-ahead-in_html/content_292.html": "Very poignant to see the light-up of the soldier statue situated in Alexandra Park Bowling Green this evening. It was lit up from 7pm - 9pm and looked terrific.\nWe’re so pleased to have organised this via Brighter Borough Funding allocated by Wigan Council, to allow us to remember all those we have lost in war. A huge thank you to Phil from Leisuretec UK for setting up the lighting!\nFriday 8th November, 10:30am\nAlexandra Park Bowling Green, Mitchell Street, Newtown. Followed by soup and a hot drink at St Mark’s Church Hub Café.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_09_taking-part-in-macmillan-coffee-morning_html/content_264.html": "Lovely to spend time at the Macmillan Coffee Morning hosted by More Than Words today!\nWe got to see the terrific performance by the students, and enjoyed a few games of bingo and the raffle!\nAll raising money for such an important cause.\n- Cllr Draper & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_12_warm-welcoming-spaces-in-our-local-area_html/content_239.html": "Warm, Welcoming Spaces: stay warm and see friendly faces, free of charge and without judgement!\nWith the arrival of winter, we want to remind you of the warm, welcoming spaces in operation across Wigan Borough, including ones in our local area.\nIn the Douglas Ward, there are now SIX of these warm hubs: Daffodils Dreams; Fur Clemt; Tom’s Pantry at St James with St Thomas Church; Community Grocery Wigan; Bramble House; Robin Park Leisure Centre.\nWarm hubs are part of Wigan Council’s “Here for You” campaign, designed to help residents who are feeling the pressure of rising costs. For more info, please visit: wigan.gov.uk/HereForYou",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_standing-alongside-striking-alcohol-and_html/content_231.html": "This morning, we joined the UNISON picket line at Coops Building, standing alongside striking drug and alcohol recovery staff who work for We Are With You (WAWY).\nStaff at the charity are subject to two different pay schemes. This two-tier workforce means that some are paid in line with NHS staff bands while others work under WAWY's own pay structure. The 3% pay offer for staff on NHS scheme falls well short of the 5.5% rise given to other NHS staff this year. Meanwhile, those on WAWY’s terms have been offered between 0% and 4%, depending on their pay band.\nThese people do an incredibly tough job and don’t want to be taking industrial action, but poor pay is causing a huge turnover of staff, which ultimately impacts a service user’s recovery.\nWAWY management need to meet with staff and UNISON reps to agree a fair pay offer for ALL staff, in recognition of the increasing cost of living as well as the vital work they do all year round. In the long run, this council-commissioned contract should also be in-sourced and undertaken by a public sector body, just like it is in neighbouring authorities.\nUntil that time, we will continue to stand with these invaluable workers who support vulnerable people in need all across our borough.\n- Cllr Draper & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_old-and-rusted-bins-at-worsley-hall_html/content_254.html": "Pleased to say that the very old and rusted litter bins in front of Worsley Hall shops have now been replaced!\nThe graffiti on one of these bins has been reported to Streetscene for removal, and the other nearby bins outside The Meadows Family Hub and Lawton’s Chippy are due to be replaced when stocks allow.\n- Cllr Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_12_useful-christmas-contact-numbers_html/content_206.html": "Here are some useful contact numbers if anyone needs emergency help, or advice, over the Christmas period.\nMany Council services will be closed, or running a reduced service, during this period but help is available in case of emergency.\nFor more information, please visit: https://www.wigan.gov.uk/.../Christmas-opening-times.aspx",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Community%20Groups/content_88.html": "St Mark's Café Hub Volunteers Recognised with \"Heart of the Community\" Award Brighter Borough Funding Community Groups Culture Newtown +\nPoolstock Church Throws Open Its Doors to Feed People on Christmas Day Brighter Borough Funding Community Groups Culture Poolstock +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_01/content_17.html": "Old and Rusted Litter Bin Replaced on Montrose Avenue Environment and Outdoors Litter Picking Worsley Hall +\nMore Annual Newsletters Delivered Across Worsley Hall and the Pier Quarter Announcements Wigan Pier Quarter Worsley Hall +\nVisiting Wigan and Leigh Wrestling Club's New Premises Community Groups Community Resilience and Safety Health Sports Clubs Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02_huge-potholes-on-valley-road-reported_html/content_149.html": "Huge Potholes on Valley Road: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps The huge potholes on Valley Road, Pemberton, have now been fully repaired. Thank you to the Highways Department for a job well done!- Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_barry-prior-recognised-as-h-art-of_html/content_60.html": "| Photo: Michelle Adamson - Wigan Post |\nOn Tuesday, we were honoured to recognise Barry Prior, who has been a stalwart of our local community for many years. Barry spends most of his spare time volunteering across our town, including at Sandalwood Assisted Living Scheme in Beech Hill, Fur Clemt, as well as The Brick.\nThe Mayor of Wigan, Cllr Kevin Anderson, presented his award at Marsh Green Art Group, which Barry found himself running at some point along the way! The group been going for some years and has only grown in that time, with around 20-25 members in attendance each week, including residents from Douglas ward.\nMany of the members here had no prior experience with art, but by attending the group, and slowly nurturing their skills, we now have many talented artists across our town.\nMore importantly, the art group offers a place for people to socialise, combatting loneliness and improving the mental health of members. Barry’s part in this – making sure the group continues to run – has been crucial.\nAround six years, ago with the help of members – and Barry’s organising – the group started to distribute food and drink hampers at Christmastime. These are for vulnerable and elderly residents all around the local area, including Marsh Green, Kitt Green, Pemberton, Norley Hall and Worsley Hall.\nWith Brighter Borough Funding from Douglas and Pemberton ward members, and the support of Julie Clarke, Wigan Council’s Community Capacity Officer for this area, around 200 of these hampers are now hand-delivered every year, helping to ensure that everyone has the best Christmas possible, regardless of their circumstances.\nAll of this is just a small snapshot of the voluntary work that Barry has taken part in and helped to organise. Legend is a word which is used very often to describe people nowadays, but in Barry's case it is absolutely true. He is a gentleman, a family man, a grafter and a real legend.\nAt the event, we also took the opportunity to recognise one of our constituents, Rita Culshaw, who was in attendance. Rita recently turned 90 and is one of Wigan Borough’s last surviving pit brow lasses! Over the years, she has been instrumental in raising awareness of our borough’s mining history.\nSo, to Barry and Rita, congratulations! To Barry, we say a huge thank you for the many years of voluntary service you have given to our local community. We applaud you for your dedication and look forward to what comes in the future!\n- Cllr Draper & Cllr Dawber\n| Photo: Michelle Adamson - Wigan Post |",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09_councillors-surgery-at-mount-zion_html/content_44.html": "Great to be back at Mount Zion for this morning’s surgery, joined by local police to offer advice and assistance to constituents. Thank you to Sergeant Aspinall and PC Lomas for taking the time to help out!\nAs a reminder, this surgery takes place on the last Thursday of the month, from 11am - 12pm.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_meeting-up-with-robin-park-runners_html/content_275.html": "Tonight, it was fantastic to catch up with the Robin Park Runners! This social group encourages people of all abilities and levels of fitness to get involved with running.\nThe club is fully affiliated to England Athletics. Following Brighter Borough Funding secured by the Douglas Ward Councillors, they were able to train up 10 run leaders!\nFor more information, please visit their page: Robin Park Runners Wigan.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02_clean-up-works-around-st-marks-avenue_html/content_182.html": "Skip to main content\nClean-Up Works Around St Mark's Avenue and Wilfred Street\nOn a recent round of the ward, I noticed an overflowing bin on Wilfred Street, and a street sign on St Mark’s Avenue that needed a good clean-up. These have both now been rectified. Thank you to the Waste as well as Highways Departments for carrying out these works.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_new-markings-on-southgate-improving_html/content_46.html": "Great to see the new road markings completed on Southgate last week, including at the traffic lights and the junction with Pottery Road.\nPrior to the new markings, local residents and businesses had mentioned that vehicles were mistakenly going onto Pottery Road at the wrong turning as it had two lanes.\nThis has now been replaced with one lane only, and new “No Entry” markings have been put down. New “Slow” markings have also been painted ahead of the traffic lights.\n- Cllr Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_07_wigan-man-thanks-robin-park-gym-staff_html/content_87.html": "Last week, it was lovely to visit Robin Park Leisure Centre as a local resident thanked quick-thinking staff at for saving his life after he suffered a heart attack at the gym.\nPaul Sutton, 59, had just finished a 5k run at the council-owned Be Well facility when he collapsed to the floor.\nHappily, he survived and, three months on, he returned to the gym to thank staff in person for saving his life.\nFull story available here: https://www.wigan.gov.uk/News/Articles/2024/July/Robin-Park-gym-staff-saving-life.aspx",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07_improvements-made-to-trencherfield-mill_html/content_94.html": "Great to visit Trencherfield Mill to see the improvements that have followed on from our recent pieces of casework!\nPennywort removed from the canal; fencing repaired; overgrown vegetation cut down and weeds removed!\nIf you’ve got any issues in your area, please drop us a message and we’ll try to get it sorted.\n- Cllr. Pat Draper & Cllr. Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_damaged-path-leading-to-red-pond_html/content_144.html": "Damaged Path Leading to the Red Pond: Reported It, Fixed It!\nGet link\nFacebook\nX\nPinterest\nEmail\nOther Apps\n⚠️ A constituent contacted us to report a large hole on the path from the Saddle Junction to the Red Pond. We reported this and it has now been filled in.\n✅ Thank you to the Council for addressing this so quickly!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_fly-tipping-on-scot-lane-reported-it_html/content_131.html": "On our rounds of the ward, we reported a well-known fly-tipping hot-spot next to the recycling banks on Scot Lane, Newtown.\nAn Enforcement Officer has attended on site and obtained positive lines of enquiry for Enforcement action to be taken.\nThe Officer has also made contact with the recycling banks' logistics teams to ask for increased collections to these banks and removal of waste from the area, which they have confirmed they will do.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_p_our-ward_html/content_155.html": "Our Ward Get link Facebook X Pinterest Email Other Apps Our ward covers Newtown, Worsley Hall, Wigan Pier Quarter, and parts of Pemberton and Poolstock. To see if you are one of our constituents, please see the map of our ward boundaries below.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_catching-up-with-robin-park-indoor_html/content_256.html": "It was great to visit Robin Park Indoor Bowling Club this afternoon to meet up with members and see their new purchase of a specialist vacuum cleaner for the bowling mats.\nWe are really pleased to have helped fund this with Brighter Borough Funding as well as Supporting Communities Funding secured by our great Community Capacity Officer, Julie Clarke.\nIt helps to improve people’s physical health through sports, and boosts mental health by giving people a place to socialise during the colder months, something we are always keen to support.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_12_bin-collections-over-christmas-period_html/content_235.html": "Skip to main content\nBin Collections Over the Christmas Period\nDon't forget: bin collections will change over the Christmas period!\nBin collections will be one day later than usual.\nThere will be no green bin collection between Tue 26 Dec and Fri 5 Jan.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_12_happy-new-year-to-residents-in-2024_html/content_165.html": "🎉 Here’s to a peaceful and prosperous New Year for all local residents, community groups, sports clubs and others in Douglas Ward! 🎉\n🙌 We’ve had a very busy 2023 and would like to thank everyone we have worked with this year. We'll be back in action soon; keep a look out for our Annual Newsletter, which we'll be delivering to households throughout January!\n- Cllr Draper, Cllr Callaghan & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2025_01_councillors-surgery-at-meadows-family_html/content_43.html": "This morning, we were back at The Meadows in Worsley Hall for our first surgery of 2025. The family hub recently purchased a defib which has now been installed, offering a lifeline should it be needed in an emergency situation.\nAs a reminder, our surgery at The Meadows Family Hub takes place on the first Friday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!\nTo see more information about how The Meadows can help you and your family, please visit: www.wigan.gov.uk/familyhubs",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07_councillors-surgery-at-mount-zion-july_html/content_258.html": "Skip to main content\nCouncillors' Surgery at Mount Zion - July 2023\nGreat to be back at Mount Zion for this morning’s surgery!\nAs a reminder, this takes place on the last Thursday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2025_01_st-marks-cafe-hub-volunteers-recognised_html/content_102.html": "Yesterday, we were honoured to recognise the dedicated volunteers from St Mark’s Hub Café, with a ceremony that took place at Wigan Town Hall.\nThe Mayor of Wigan Borough, Cllr Debbie Parkinson, presented the recipients with a certificate, glass “Heart of the Community” award and engraved silver salver on behalf of the Douglas Ward Councillors.\nSince April 2016 when the café was founded, each of the volunteers have contributed to creating a warm, welcoming space that brings together the local community in Newtown in a variety of ways.\nWith “Mini Hubbubz”, they open up the church to offer fun, play, stories and songs in sessions for youngsters and their parents/ guardians.\nEvery November, the café hosts a meal following on from the Douglas Ward Remembrance Service event held at the nearby Alexandra Park Bowling Green. This is attended by many local residents and schoolchildren from St Mark’s Primary School. In hosting this meal, the volunteers allow people to come together to honour all those we have lost in conflict, and ensure that they are remembered by passing on this commemoration to the next generation.\nAt Easter and Christmastime, again the volunteers host community meals that fill up the café and ensure that the festive spirit is spread throughout the local area.\nAnd finally, in the weekly café sessions, the volunteers serve delicious and affordable food during term times, offering a gathering place for people and helping to reduce loneliness and social isolation.\nIn all that they do, these wonderful volunteers meet people with a smile and treat them with a warmth that makes them feel at home. It is for these reasons that The Hub Café is such a special place and without them, this simply would not be possible. For your tireless work, we applaud you!\nSue, one of the café’s original volunteers, said: “A huge thank you to all the Douglas Ward Councillors for the Heart of the Community award which we had presented to us yesterday.\n“We were all absolutely thrilled to be awarded with the beautiful plaque and certificate, but we were also delighted and humbled to hear the lovely speech from The Mayor, as well as Cllr Draper saying such lovely words about our team.\n“You made us feel so very special and we had a day that none of us will ever forget and we want to thank you all from the bottom of our hearts. God bless you all and thank you for all the support you give us at St Mark’s Hub Café.”\nCllr Pat Draper said: “When I first met these lovely ladies in 2017 in St Mark's Church I was impressed. Since then, the services they provide have grown to providing a play group for young children to feeding the whole community on Wednesdays, which is a lifeline for many people of all ages.\n“In 2022, when I was diagnosed with breast cancer, these wonderful ladies were a lifeline for me personally. They supported me all through my treatment they hold a special place for me.\n“Without our volunteers, our communities could not function, so to all of the St Mark's Hub Café ladies, you deserve to be recognised with this award! For the work you do in the café and St Mark’s Church as a whole, I salute you.”",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_councillors-surgery-at-mount-zion_html/content_265.html": "Skip to main content\nCouncillors' Surgery at Mount Zion - October 2023\nGreat to be back at Mount Zion for this morning’s surgery!\nAs a reminder, this takes place on the last Thursday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_huge-litter-pick-completed-around_html/content_99.html": "Earlier today, we completed our litter pick in Newtown and collected an astonishing 21 BAGS of waste! We did all around the Saddle Junction and going down Frith Street to B&Q.\nA huge thank you to the members of Wigan Litter Pickers who joined us today: you were a tremendous help!\nIt’s safe to say the area is looking much tidier now. Let’s help it stay that way: either take waste home or take it to a bin!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_06_improving-road-safety-on-ellesmere-road_html/content_124.html": "The new double yellow lines have now been implemented on Ellesmere Rd’s junctions with Bulteel St and Claude St.\nFor some time, residents living in the area have found it extremely difficult to drive out of these streets and onto Ellesmere Rd, due to lack of visibility caused by cars parking on the corner of the junction.\nAfter reporting this to the Council’s Network Management department, they have taken action, improving road safety for local people.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_01_productive-branch-meeting-with-local_html/content_25.html": "Yesterday, we had a very productive meeting with local Labour members in Douglas Ward:\nReport from Cllr Callaghan, including recent work done in the ward.\nSpeech from Steve Shaw RMT Regional Organiser- North West, North Wales & Eire on current railway disputes, campaigns and the strong benefits of joining a trade union!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_11_our-ticket-offices-will-stay-open_html/content_66.html": "We fully welcome this week’s announcement from the government, completely withdrawing from its plan to close ticket offices across the country.\nThis is a resounding victory for the RMT’s campaign to “Save Our Ticket Offices” and a win for passengers, community groups and rail workers alike!\nA huge thanks locally goes to Steve Shaw RMT Regional Organiser-, and everyone who supported the campaign here in Wigan.\nWe were proud to stand alongside local rail workers, and will always stand up for a railway that is safe and accessible for passengers!\n- Cllr Draper, Cllr Callaghan & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_more-damaged-and-missing-street-signs_html/content_76.html": "Skip to main content\nMore Damaged and Missing Street Signs Replaced\nRecently, we’ve noticed a few street signs that were rusted, damaged or missing, and in need of reporting to the Council. Thank you to the Highways/ Network Management Team for promptly replacing these signs, helping to improve the appearance of our neighbourhoods.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Brighter%20Borough%20Funding/content_220.html": "St Mark's Café Hub Volunteers Recognised with \"Heart of the Community\" Award Brighter Borough Funding Community Groups Culture Newtown +\nPoolstock Church Throws Open Its Doors to Feed People on Christmas Day Brighter Borough Funding Community Groups Culture Poolstock +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_improvements-ongoing-at-alexandra-park_html/content_111.html": "💚 Great to see the improvements taking place at Alexandra Park’s Bowling Green. Local bowlers and members of Friends of Alexandra Park are working with a maintenance professional to improve the surface of the greens, which we have supported via Brighter Borough Funding.\n🚶 We also did a walk-around of Alexandra Park itself and noticed some litter, fly-tipping and a large fallen branch which we have reported to Wigan Council for action to be taken.\n🍂 Otherwise, it was lovely to see the colours of autumn creeping in around the area… 🍁",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09_attending-estate-inspection-of-worsley_html/content_56.html": "This morning, the rain didn’t stop us as we completed our estate inspection of Worsley Hall Central with Neighbourhood Tenant Officers James and Sarah.\nWe had the opportunity to speak to local tenants and residents, and picked up casework to improve the area. Please get in touch if you have any issues you’d like us to address.\nWe had the opportunity to speak to local tenants and residents, and picked up casework to improve the area. Please get in touch if you have any issues you’d like us to address.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_09_the-bee-network-has-arrived_html/content_191.html": "🐝 Today we said “yellow” to the #BeeNetwork!\n📍 For the first time in almost 40 years, our buses are back under local authority control. This project has been driven by GM Mayor Andy Burnham and Greater Manchester’s ten Labour councils.\n🚌 Reduced fares. Extended services. A modern fleet of zero-emission, accessible buses. A fully integrated app to buy tickets and show live bus times.\n🚌 If you haven’t used the buses in a while please jump on one when you can — we think you will see a big difference!\n📱 Download the Bee Network app for more information.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_p_useful-information_html/content_11.html": "On this page, you can find the following contact details:\n- Wigan Council departments;\n- Wigan Council emergencies;\n- Regional emergencies e.g. gas, water, electricity;\n- Healthcare emergencies/ out-of-hours;\n- General advice and support.\n| Team | Number/ Email |\n|---|---|\n| Council Tax/ Business Rates | 01942 489001 revenues@wigan.gov.uk businessrates@wigan.gov.uk |\n| Housing Benefit | 01942 489002 benefits@wigan.gov.uk |\n| Registrars & Bereavement Services | 01942 489003 wiganregisteroffice@wigan.gov.uk |\n| Environmental Services | 01942 489004 |\n| Housing - General | 01942 489005 |\n| Housing - Register for Housing Applications | 01942 486182 01942 486183 houreg@wigan.gov.uk |\n| Housing - Homelessness | 01942 487732 HST@wigan.gov.uk |\n| Housing - Tenancy Services | 01942 486353 myhome@wigan.gov.uk |\n| Housing - Rents Team | 01942 486865 myrent@wigan.gov.uk |\n| Automated Payment Line | 01942 489006 |\n| Blue Badges | 01942 489014 bluebadgeservices@wigan.gov.uk |\n| Welfare Support | 01942 705221 welfare.support@wigan.gov.uk |\n| Licensing | licensing@wigan.gov.uk |\n| Parking Services - Parking Permits | 01942 488280 parking@wigan.gov.uk |\nWigan Council Emergency Contact Details\n| Team | Number |\n|---|---|\n| Council Out-of-Hours Emergencies (for genuine emergencies concerning drainage, flooding, highways, street-lighting, building and electrical repairs) |\n01942 404040 |\n| Council Housing Emergency Repairs | 01942 489005 |\n| Adult Social Care | 01942 828777 |\n| Children's Social Care | 01942 828300 |\nRegional Emergency Contact Details\n| Team | Number |\n|---|---|\n| Fire, Police and Ambulance Emergencies | 999 |\n| Greater Manchester Police | 0161 872 5050 |\n| Gas Emergencies (National Grid) | 0800 111999 |\n| Electrical Emergencies (Electricity North West) | 0800 195 4141 |\n| Power cuts or damage to power lines/ substations | 105 |\n| Water Emergencies (United Utilities) | |\n| No water supply or discoloured water | 0345 672 3723 |\n| Problems with drains or sewers | 0845 602 0406 |\n| Pollution | 0800 015 1230 |\n| Leaks | 0800 330 033 |\nHealthcare Out-of-Hours Contact Details\n| Organisation | Number |\n|---|---|\n| NHS 111 (formerly NHS Direct) | 111 |\n| Wigan GP Alliance (out-of-hours appointments) | 01942 482848 |\n| Wigan Mental Health Crisis Line | 0800 051 3253 |\n| GM 24/7 Mental Health Crisis Line | 0800 953 0285 |\n| Urgent Dental Care Service | 0333 332 3800 |\nGeneral Advice and Support Contact Details\n| Organisation | Number |\n|---|---|\n| Citizens' Advice (CAB) | 0808 278 7801 |\n| Citizens' Advice (CAB) Wigan | 01942 709709 |\n| Age UK Wigan | 01942 615880 |\n| The Brick | 01942 236953 |\n| DIAS (Wigan Borough Domestic Violence Service) | 01942 311365 |\n| With You (Drug & Alcohol Support Service) | 01942 827979 |\n| Samaritans | 116 123 |",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2025_01_fly-tipping-and-litter-cleaned-up-at_html/content_64.html": "Over the Christmas & New Year period, constituents in and around Trencherfield Mill contacted me about issues with fly-tipped waste, litter and bins overflowing.\nYesterday, whilst on site, it was great to see Streetscene workers attending to this. A huge thank you to them as they have done a great job in removing the waste and tidying up the area. The graffiti on some litter bins has also been reported for action.\n- Cllr Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Environment%20and%20Outdoors/content_140.html": "Fly-tipping and Litter Cleaned Up at Trencherfield Mill Environment and Outdoors Fly-tipping and Litter Wigan Pier Quarter +\nJoining Pemberton Green Spaces to Plant Spring Bulbs on Enfield Street Community Groups Environment and Outdoors Pemberton +\nHighfield Gardens Bowling Green Benefits from New Tarmac Paving Community Groups Environment and Outdoors Pemberton Sports Clubs +\nAlexandra Park Tidied Up as Part of the Winter Maintenance Schedule Environment and Outdoors Newtown +\nFly-tipping and Overgrown Vegetation Removed in Newtown Environment and Outdoors Fly-tipping and Litter Newtown Reported It - Fixed It! +\nHaig Street Car Park Transformed by Streetscene Works! Environment and Outdoors Reported It - Fixed It! Roads and Traffic Wigan Pier Quarter +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09/content_217.html": "Posts\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\nPresenting Pemberton Old Wigan Brass Band with £4,000 to Compete in the Finals of the National Brass Band Championships\nPresenting Pemberton Old Wigan Brass Band with £4,000 to Compete in the Finals of the National Brass Band Championships\n- Get link\n- X\n- Other Apps",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09_our-town-waste-amnesty-week-arrives-in_html/content_221.html": "A slightly wet start to the day, but great to be at The Meadows Family Hub to kick off Douglas Ward’s Waste Amnesty Week as part of the Our Town programme.\nWe met up with Jonathan from Streetscene, David from Highways, and local Neighbourhood Manager Jo, to discuss the range of planned works taking place over the week ahead.\nDon’t forget - there are two more skip days taking place: at Worsley Hall shops on Wednesday and in Wigan Pier Quarter (Trencherfield Mill) on Friday, both from 9am - 2pm.\nIf you can’t make any of these times, please remember that you can also book 2 FREE bulky waste collections of up to five items in a 12 month period, through the Council. To do so, please visit https://www.wigan.gov.uk/BulkyCollections.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_attending-grand-opening-of-wigans-first_html/content_59.html": "Absolutely terrific to attend the grand opening of Wigan Borough’s first Family Hub at The Meadows in Worsley Hall.\nFamily Hubs are a new way of bringing together all the support a family may need. From pregnancy support, to housing advice, to children’s activities, these accessible and connected services will be available to all families!\nWhilst we were there, it was great to catch up with Maureen and Noreen from Daffodils Dreams.\nThank you to all the staff for putting on such a terrific day! For more information, please visit: https://www.wigan.gov.uk/Resident/Education/Family-Hubs.aspx",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09_catching-up-with-daffodils-dreams-to_html/content_186.html": "Last week, we had a great catch up with Maureen, Noreen and other staff and volunteers at Daffodils Dreams, hearing about the terrific work they do for children and adults across our borough all year round.\nSo far in their journey, they have helped over 6,500 children and 900 adults, ensuring that people can get the basic essentials they need, including clothing, bedding, toiletries and much more!\nDaffodils Dreams also has a Community Lounge open on Wednesdays and Fridays. Everyone is welcome down to socialise and have a brew and a biscuit! Please do try to support this brilliant charity where you can!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_12_councillors-surgery-at-meadows-family_html/content_34.html": "Great to be at The Meadows Family Hub in Worsley Hall for this morning’s surgery.\nAs a reminder, our surgery here takes place on the first Friday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!\nTo see more information about how The Meadows can help you and your family, please visit: www.wigan.gov.uk/familyhubs\nAs a reminder, our surgery here takes place on the first Friday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!\nTo see more information about how The Meadows can help you and your family, please visit: www.wigan.gov.uk/familyhubs",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_12_waste-amnesty-day-success-in-worsley_html/content_128.html": "Great to be out this morning seeing the success of Waste Amnesty Day in Worsley Hall.\nThank you the residents who came down to dispose of their excess household waste, helping to keep our area clean and tidy.\nThank you also to Stan, Jack and Hannah from Wigan Council for organising the skip, and staffing the waste collection today.\nIf you missed the skip this morning, you can still book a FREE Bulky Waste Collection from the Council, for up to five items, twice a year. See more info here: wigan.gov.uk/BulkyCollections",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_laithwaite-park-looking-terrific_html/content_130.html": "Laithwaite Park Looking Terrific! Get link Facebook X Pinterest Email Other Apps Laithwaite Park looking terrific on our rounds of the ward today, with new play equipment installed recently! Thanks to the Parks and Streetscene Team for your work.- Cllr. Pat Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_visiting-on-way-cafe-project-at_html/content_272.html": "Skip to main content\nVisiting \"On The Way\" Café Project at Sunshine House\nEarlier today, it was lovely to be invited to see the newly-opened On The Way Cafe based at Sunshine House. Liz and the rest of the team have done a terrific job of renovating the building. The café was very welcoming and the food and drink was great!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_07_attending-pre-opening-event-at-omniplex_html/content_80.html": "Tonight, we were very lucky to be invited to the pre-opening event at Omniplex Cinema as the local ward Councillors.\nThe cinema is looking absolutely amazing following Omniplex’s £3.5 million investment and refurbishment, with reclining leather seats in every screen (and sofa beds!). There has also been a complete overhaul of the lobby area, which now has vans serving hot food, beer and cocktails, as well as classic cinema snacks!\nA huge thank you to the General Manager, Anthony, for inviting us to tonight’s event. We would encourage everyone in the local area to come down and take advantage of our town’s brand new cinema!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08/content_8.html": "The Green Flag Continues to Fly High Over Alexandra Park! Community Groups Community Resilience and Safety Culture Environment and Outdoors Newtown NHS +\nTwo More Litter Picks Carried Out in Newtown Environment and Outdoors Fly-tipping and Litter Litter Picking Newtown +\nOverhanging Vegetation Cut Back Along Swan Meadow Road Environment and Outdoors Poolstock Reported It - Fixed It! +\nVery Productive Litter Pick in Newtown Environment and Outdoors Fly-tipping and Litter Litter Picking Newtown +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07_estate-walkabout-of-worsley-hall-south_html/content_160.html": "Yesterday morning, we were out on Worsley Hall for an estate inspection with Jo (Service Delivery Manager), Katrina (Neighbourhood Tenant Officer) and Martin (Estate Caretaker).\nGreat to interact with tenants and listen to their concerns. We will work together with tenants and Council Officers to improve the area.\nIf you have any concerns, please contact us.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_the-campaign-to-saveourticketoffices_html/content_93.html": "Great response this morning from the public with Steve Shaw, RMT Regional Organiser, supporting the campaign to #SaveOurTicketOffices. We handed out many leaflets.\nAt risk are almost all the country's 1,000 ticket offices - including Wigan North Western and Wallgate. This would cause 2,300 job losses, and lead to less safety and accessibility on our railways for passengers.\nAvanti West Coast: Save your Avanti West Coast ticket offices\nNorthern: Save your Northern ticket offices",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_pothole-on-bulteel-street-reported-it_html/content_4.html": "Pothole on Bulteel Street: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps ⚠️ After noticing a large pothole on Bulteel Street, Worsley Hall, whilst we were on our rounds of the ward, we reported it, and it has now been filled in.✅ Thank you to the Highways Team for responding so quickly!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_two-more-litter-picks-carried-out-in_html/content_118.html": "A slightly wet morning as we litter-picked around Newtown today!\nWe collected 2 bags of waste from the Douglas St car park in the middle of the Saddle Junction. Following our last litter pick here a fortnight ago, Streetscene have now cut back the vegetation around the car park, making it look much tidier!\n- Cllr Draper & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_estate-walkabout-of-worsley-hall-central_html/content_10.html": "🏡 Last week, it was terrific to go on an estate walkabout of Worsley Hall Central - the first of three taking place in the area - accompanied by Katrina, one of the Neighbourhood Tenant Officers.\n💚 We had an excellent walkabout and our observations scored “good,” with clean streets, no dog fouling, very little damage to properties. There were also many front gardens that are well looked after by residents.\n🧰 For those properties that are damaged, we are aware that they are undergoing refurbishment, and contractors are working as quickly as possible to complete the work.\n✅ Overall, it was a pleasant walk and following on from it, there will be additional weed-spraying around lampposts and pavement edges, undertaken by the Streetscene Team - thank you!\n💬 If there are any areas that require attention, please message us and let us know.\n- Cllr. Mary Callaghan",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_01_additional-300-annual-newsletters_html/content_30.html": "Skip to main content\nAdditional 300 Annual Newsletters Delivered Around Worsley Hall!\nGreat to be out around Worsley Hall again today, delivering 300 more of our Annual Newsletters! Today, we covered Laithwaite Road and the streets off, as well as Buchanan Road and the bungalows on Fraser Road and Davidson Walk.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Reported%20It%20-%20Fixed%20It%21/content_79.html": "Fly-tipping and Overgrown Vegetation Removed in Newtown Environment and Outdoors Fly-tipping and Litter Newtown Reported It - Fixed It! +\nHaig Street Car Park Transformed by Streetscene Works! Environment and Outdoors Reported It - Fixed It! Roads and Traffic Wigan Pier Quarter +\nMore Damaged and Missing Street Signs Replaced Newtown Norley Hall Reported It - Fixed It! Roads and Traffic Wigan Pier Quarter Worsley Hall +\nAlleyway Cleaned Up and \"No Dog Fouling\" Signs Implemented Environment and Outdoors Fly-tipping and Litter Pemberton Reported It - Fixed It! +\nOverhanging Vegetation Cut Back Along Swan Meadow Road Environment and Outdoors Poolstock Reported It - Fixed It! +\nOld and Rusted Bins at Worsley Hall Shops Replaced Environment and Outdoors Reported It - Fixed It! Worsley Hall +\nDangerous Missing Gate Replaced at Trencherfield Mill Community Resilience and Safety Environment and Outdoors Poolstock Reported It - Fixed It! +\nImprovements Around Norfolk Street in Newtown Fly-tipping and Litter Litter Picking Newtown Reported It - Fixed It! Roads and Traffic +\nAlleyway off Montrose Avenue Cleaned Up Environment and Outdoors Reported It - Fixed It! Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_are-you-eligible-for-pension-credit_html/content_169.html": "PLEASE SHARE WITH ELDERLY FAMILY AND FRIENDS: Wigan Council’s “Here for You” campaign is helping pensioners to see if they’re eligible for Pension Credit.\nCurrently, around 4,000 pensioners in Wigan Borough are missing out on Pension Credit, which the Council is working to change, because Pension Credit is worth around £3,900 a year and unlocks additional support including the Winter Fuel Payment, help with Council Tax, NHS dental care and a free TV licence for those over 75.\nWigan Council is hosting a number of events to help local people apply for this financial support, so why not come along or let your loved ones know they're happening? Upcoming events at Wigan Life Centre are:\n* 10 October 2024, 10am to 4pm\n* 17 October 2024, 10am to 4pm\n* 24 October 2024, 10am to 4pm.\nAlternatively, residents are able to drop in at Wigan Life Centre in the new “Here for You” room for advice and support, Monday to Friday between 10am and 4pm .\nFor more information, ring the Council’s Welfare Team on 01942 705221 or visit wigan.gov.uk/HereForYou.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_councillors-surgery-at-st-james-church_html/content_174.html": "⛪️ Lovely to be back at St James' Church for this morning’s surgery!\n⏰ As a reminder, our surgery here takes place on the second Saturday of the month, from 11am - 12pm.\n☕️ If you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Worsley%20Hall/content_86.html": "Taking Part in an Estate Inspection Around Laithwaite Road Community Resilience and Safety Environment and Outdoors Housing Worsley Hall +\nMore Damaged and Missing Street Signs Replaced Newtown Norley Hall Reported It - Fixed It! Roads and Traffic Wigan Pier Quarter Worsley Hall +\nRailings Re-Installed on Sherwood Drive, Improving Safety Community Resilience and Safety Roads and Traffic Worsley Hall +\nAttending the Estate Inspection of Worsley Hall Central Community Resilience and Safety Environment and Outdoors Fly-tipping and Litter Housing Worsley Hall +\nWorsley Hall Welcomes \"Our Town\" Waste Amnesty Week Announcements Environment and Outdoors Fly-tipping and Litter Litter Picking Worsley Hall +\n\"Our Town\" Waste Amnesty Week Arrives in Douglas Ward! Announcements Community Resilience and Safety Environment and Outdoors Fly-tipping and Litter Newtown Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_visiting-more-than-words-at-their-new_html/content_274.html": "Last week, it was lovely to catch up with Sue and Shelley from More Than Words, to see their new building in Ince which they are in the process of renovating and moving into.\nWhilst it was a bittersweet moment because they will be moving outside of our ward, we think this will make a fantastic new home for the organisation. We were amazed by the plans which will allow them to support more students through drama, music, dance, singing and creative activities.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_05_thank-you-cllr-matt-dawber-is-re-elected_html/content_129.html": "Cllr Matt Dawber Re-Elected! LAB: 1,379 (69.7%) GRN: 304 (15.4%) CON: 296 (14.9%) “To all the constituents in Douglas Ward who cast their vote for me, I want to say a HUGE thank you for placing your trust in me. “Your support is not something I take for granted, and I will continue to work hard every day to repay that trust.\n“When I was first elected last year, I promised that I would put the local community at the heart of my work, and that is what I intend to do over the next four years!”",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02_councillors-surgery-at-mount-zion_html/content_228.html": "Great to be back at Mount Zion for this morning’s surgery. Thank you to all the residents who came over for a chat!\nAs a reminder, this takes place on the last Thursday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_05_councillors-surgery-at-st-james-church_html/content_180.html": "Lovely to be back at St James' Church for our first surgery following the local elections! Thank you to all the local residents who came for a chat.\nAs a reminder, this surgery takes place on the second Saturday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!\nAs a reminder, this surgery takes place on the second Saturday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_p_imprint_html/content_12.html": "Imprint Get link Facebook X Pinterest Email Other Apps Published and promoted by Cllr M Dawber on behalf of Cllr M Callaghan and Cllr M Dawber, at 47 Rose Ave, WN6 8RE.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_11_join-us-for-st-james-christmas-fair_html/content_208.html": "Please join us next Saturday for St James’ Christmas Fair, taking place from 12 noon!\nRefreshments available from the Faith Café;\nSanta's Grotto;\nChocolate Tombola;\nBottle Stall;\nHamper Raffle and much more!\nRefreshments available from the Faith Café;\nSanta's Grotto;\nChocolate Tombola;\nBottle Stall;\nHamper Raffle and much more!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_waste-bins-replaced-on-tunstall-lane_html/content_238.html": "Skip to main content\nWaste Bins Replaced on Tunstall Lane and Billinge Road\nAfter many requests from residents, the litter bins that were taken away from Tunstall Lane and Billinge Road have now been replaced! Working with the Streetscene Team, a new waste bin will also be placed on Norfolk Street in the coming weeks, to combat litter issues in the area.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Planning%20Applications/content_40.html": "Planning Application Submitted for Vacant Hare and Hounds Pub Housing Pemberton Planning Applications +\nPlans Submitted for New Council Flats at Logwood Place Housing Newtown Planning Applications Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_presenting-rachel-heyden-with-heart-of_html/content_21.html": "This afternoon, it was our absolute pleasure to nominate Rachel Heyden for the \"Heart Of The Community\" Award for her work in setting up Wigan Litter Pickers and her work in the community.\nRachel, who lives in Douglas Ward, first started the litter-picking group during lockdown, after seeing that Wigan Council would provide free equipment for people to tidy up their local area. It gave her an idea to make it bigger and invite the whole community to join in.\nWigan Litter Pickers have done group picks; individual picks; organised children's awards and talks in schools; ordered free equipment; and Rachel has personally delivered equipment to lots of residents across all townships in the borough. She runs the group on her own.\nCllr. Pat Draper first became involved with the group during the Covid-19 pandemic, and after meeting up with Rachel, contacted the Council's Environmental Department to discuss ways in which they could work together. This relationship has grown with time, helping to combat litter in our town.\nThrough the group, Rachel supports three youngsters to obtain their Duke of Edinburgh Award. She also serves as a local school governor, championing SEND and sports premium for children.\nRachel believes that Wigan Litter Pickers belongs to the people of Wigan, who have made it what it is. She said: \"I love living here and want other people to love it too. We are so lucky to live here, and I will support anyone to do the right thing.\"",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_dont-forget-summer-hours-for-boroughs_html/content_68.html": "Don’t forget: from this Sunday 31 March (when the clocks go forward) the Council’s recycling centres will move to their summer opening hours.\nThey will be open 7 days a week, 8am - 7.45pm (excluding Christmas Day, Boxing Day and New Year's Day)\nFor more info, please visit: https://www.wigan.gov.uk/Resident/Bins-Recycling/Waste-and-Recycling-Centres.aspx",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_12_joining-pemberton-green-spaces-to-plant_html/content_133.html": "This afternoon, we had a fantastic time joining Ange, Chris, kids, and Kyle from Pemberton Green Spaces to plant spring bulbs in front of ProCare on Enfield Street.\nThese regular planting sessions form part of the group’s project “From Coal to Colour: Bringing biodiversity to Wigan's colliery streets,” which has been funded by the Greater Manchester Environment Fund.\nWith Enfield Street having a large industrial estate and terraced houses lacking front gardens, it means the area is dominated by brick, tarmac and litter. Through community volunteers, the project will add trees and plants, providing colour and food and shelter for wildlife – all things requested by our community. The project will also bring overgrown vegetation under control. Together, these help the space feel more cared for, inspiring pride in the community and benefitting some of the most deprived areas in the borough.\nTo find out more about this fantastic project and ways to get involved, please visit their Facebook page or email the group at pemgreenspaces@gmail.com",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_06_new-noticeboard-at-worsley-hall-shops_html/content_263.html": "Great to see the new noticeboard in place around Worsley Hall shops, replacing the old one which was damaged and vandalised!\nWe’ve now filled it with posters that may be helpful to local residents, including information on:\nCouncillors’ surgery dates;\nReporting off-road bikes;\nBee in the Loop: GMP’s online neighbourhood policing service;\nWigan Council’s Bulky Waste Collection scheme;\n“Here For You” resources to help with the ongoing cost-of-living crisis;\nThe 2024 Gardening Competition for Wigan Council tenants!\nWe will keep the noticeboard updated throughout the year, and if there’s anything you’d like us to include, please let us know!\nWe’ve now filled it with posters that may be helpful to local residents, including information on:\nCouncillors’ surgery dates;\nReporting off-road bikes;\nBee in the Loop: GMP’s online neighbourhood policing service;\nWigan Council’s Bulky Waste Collection scheme;\n“Here For You” resources to help with the ongoing cost-of-living crisis;\nThe 2024 Gardening Competition for Wigan Council tenants!\nWe will keep the noticeboard updated throughout the year, and if there’s anything you’d like us to include, please let us know!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Welfare%20and%20Pensions/content_61.html": "Are You Eligible for Pension Credit? Wigan Council's \"Here for You\" Programme Can Help! Announcements Welfare and Pensions +\nWigan Labour Group Continues to Support the WASPI Campaign! Local Election 2024 Welfare and Pensions +\nWigan Town Hall Lit Up in Support of International Women's Day and WASPI Campaign WASPI Welfare and Pensions +\nVisiting Montrose Hall Care Home in Worsley Hall Community Groups Health Trade Unions Welfare and Pensions Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_catching-up-with-volunteers-and_html/content_199.html": "🐣 Today, we visited The Hub Café at St Mark’s Church for Easter lunch.\n❤️ It was lovely to catch up with the terrific café volunteers and many local residents there, and the roast beef lunch was delicious!\n👏 A huge well done to the café team, who prepped, cooked and served over 40 lunches. We hope you have a well-earned rest until the café reopens on Wednesday 17th April. See you soon!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_04/content_39.html": "Skip to main content\nDouglas Labour Councillors\nSearch\nSearch This Blog\nHome\nContact Us\nAdvice Surgeries\nOur Ward\nUseful Information\nShowing posts from April, 2024\nView all\nPosts\nOne Last Push Speaking to Residents on the Eve of Polling Day!\nLocal Election 2024\nPemberton\n+\nBack Out on Billinge Road Listening to Residents' Views\nLocal Election 2024\nPemberton\n+\nListening to Residents on the Doorstep in Newtown\nLocal Election 2024\nNewtown\n+\nAttending the Cotton Works Launch at Eckersley Mill\nCulture\nHousing\nWigan Pier Quarter\n+\nSuper Saturday Spent Talking to Residents on Billinge Road\nLocal Election 2024\nPemberton\n+\nOut Again Speaking with Residents in Pemberton\nLocal Election 2024\nPemberton\n+\nMore posts",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_07_councillors-surgery-at-mount-zion_html/content_108.html": "Great to be back at Mount Zion for this morning’s surgery, helping plenty of local residents with issues they are facing!\nAs a reminder, this surgery takes place on the last Thursday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_12/content_24.html": "Poolstock Church Throws Open Its Doors to Feed People on Christmas Day Brighter Borough Funding Community Groups Culture Poolstock +\nImproving Road Safety on Busy Newtown Street Community Resilience and Safety Newtown Roads and Traffic +\nPublic Space Protection Order (PSPO) Consultation – Car Cruises Announcements Community Resilience and Safety Roads and Traffic +\nJoining Pemberton Green Spaces to Plant Spring Bulbs on Enfield Street Community Groups Environment and Outdoors Pemberton +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03/content_20.html": "Don't Forget: Summer Hours for the Borough's Recycling Centres Announcements Environment and Outdoors Fly-tipping and Litter +\nHuge Litter Pick Completed Around the Saddle Junction! Community Groups Environment and Outdoors Fly-tipping and Litter Litter Picking Newtown +\nSupporting Kids at Wigan & Leigh Wrestling Club to Travel to Estonia! Brighter Borough Funding Community Groups Sports Clubs Worsley Hall +\nAlleyway off Montrose Avenue Cleaned Up Environment and Outdoors Reported It - Fixed It! Worsley Hall +\nJon Lister Recognised for 20+ Years Voluntary Work in Grassroots Football Health Heart of the Community Awards Newtown Sports Clubs +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_waste-amnesty-programme-success_html/content_152.html": "Once again, it was great to be out this afternoon seeing the positive impact that the Council’s Waste Amnesty Programme has had during the week!\nA huge thank you to all the staff from Environmental Services and Street Scene for your hard work. It was lovely to speak to Dave and Kieron today, who were working flat out helping residents.\nDon’t forget: if you couldn’t make it to the waste collection this week, you can still book a FREE bulky waste collection at the following link: Bulky waste and larger household items (wigan.gov.uk).\n- Cllr. Pat Draper & Cllr. Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_05_attending-more-than-words-art_html/content_234.html": "This morning, we had a lovely time attending local group More than Words’ Art Exhibition, held at The Turnpike Gallery in Leigh.\nNamed “The Sunshine of our Lives,” the exhibition featured a glorious art piece and dance performance by the students, highlighting what brings them happiness.\nA huge well done to all the students for your amazing work, and congratulations to members of staff for organising such a great event!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_07_out-on-campaign-trail-to-re-elect-lisa_html/content_49.html": "Out on the Campaign Trail to Re-Elect Lisa Nandy Get link Facebook X Pinterest Email Other Apps Two days left until we can put an end to 14 years of Conservative chaos.Great to be out leafletting around Heather Grove on Sunday, then on Tunstall Lane and Sherwood Drive today!#VoteLabour on Thursday!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_fly-tipping-and-overgrown-vegetation_html/content_81.html": "The busy walkway between Anson Street and Newtown Working Men’s Club has now been cleaned up after we reported fly-tipping and overgrown vegetation to the Council. Nearby fly-tipping has also been removed.\nThank you to Environmental Enforcement and Streetscene for working together to improve our outdoor spaces.\nPlease don’t be tempted to fly-tip: the Council operates a FREE Bulky Waste Collection Scheme which can be used twice per year for up to 5 items each time. To find out more and book a collection, please visit: wigan.gov.uk/BulkyCollections",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_WASPI/content_136.html": "Wigan Town Hall Lit Up in Support of International Women's Day and WASPI Campaign WASPI Welfare and Pensions +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_NHS/content_6.html": "The Green Flag Continues to Fly High Over Alexandra Park! Community Groups Community Resilience and Safety Culture Environment and Outdoors Newtown NHS +\nAttending the Grand Opening of Wigan's First Family Hub at The Meadows Community Resilience and Safety Health Housing NHS Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_deposit-assistance-scheme-is-available_html/content_145.html": "Help is available from Wigan Council if you’re struggling with the cost of a deposit for a new private-rented home.\nWe also offer pre-tenancy support and guidance – checking that your new home is affordable, suitable and safe – and have an online claims process for landlords.\nTo find out further information and check if you are eligible visit:",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07_traffic-lights-on-warrington-road_html/content_162.html": "Skip to main content\nTraffic Lights on Warrington Road: Reported It, Fixed It!\nAfter noticing that the traffic lights on Warrington Road had been hit and were leaning into the road, Cllr. Draper reported it, and they have now been fixed. Thank you to TfGM for fixing them so quickly!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_05_potholes-on-tansley-square-reported-it_html/content_150.html": "Potholes on Tansley Square: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps ⚠️ After noticing potholes on Tansley Square, Pemberton whilst we were on our rounds of the ward, we reported them and they have now been filled in.✅ Thank you to the Highways Team for responding so quickly!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02_litter-in-kingwood-crescent-alleyway_html/content_216.html": "Litter in Kingwood Crescent Alleyway: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps On Kingwood Crescent in Worsley Hall, the alleyway was in great need of a clean-up because of litter and leaf-fall. I reported this to the Estate Caretaker, who has done a terrific job of tidying up the area!- Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07_visiting-st-marks-hub-cafe_html/content_121.html": "Had a fantastic visit yesterday to The Hub Café at St. Mark’s Church. As ever, the food and company was terrific! Picked up some casework, too.\nOpen every Wednesday during school term time, this was the last session until the café reopens on 13th September.\nI want to say a massive thank you to all those who volunteer at the café, including Christine, Sue, June and Ann.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09_alleyway-cleaned-up-and-no-dog-fouling_html/content_262.html": "Good to see that the “No Dog Fouling” signs and markings have now been put in place at the alleyway between Queen St and Billinge Rd!\nI also reported some remaining weeds along here and these have now been sprayed and treated.\nOverall, the alleyway is looking much better since it was originally reported to the Council. Thank you to Streetscene for carrying out these works.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_04_super-saturday-spent-talking-to_html/content_223.html": "We’ve had a super Saturday spent talking to constituents along Billinge Road and the streets off it!\nThis week, we have spoken to over 250 people on the doorsteps, and will be continuing as we approach polling day on Thursday.\nA huge thank you to everyone who is planning to vote Labour and re-elect Matt as local Councillor. Make your plan to vote at: iwillvote.org.uk",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_bee-network-buzz-continues-with-just_html/content_158.html": "It’s almost time to say yellow to the #BeeNetwork! In just one month, locally-controlled buses will take to the streets of Wigan for the first time in almost 40 years.\nFor passengers, this means travel will be great value, with capped fares and flexible tickets. Simpler. Accessible, with improved passenger information. More reliable. And more sustainable.\nTo find out more, visit: https://tfgm.com/the-bee-network",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_dont-forget-wigans-recycling-centres_html/content_106.html": "Don't forget: from this Sunday 27 October (when the clocks go back) our recycling centres move to their winter opening hours:\n9:00am - 5:45pm\nOpen 7 days a week, except Christmas Day, Boxing Day and New Year's Day\nFor more info, visit: https://www.wigan.gov.uk/Resident/Bins-Recycling/Waste-and-Recycling-Centres.aspx",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10/content_198.html": "Pothole on Bold Street: Reported It, Fixed It! Pemberton Potholes Reported It - Fixed It! Roads and Traffic +\nDon't Forget: Winter Opening Hours for Recycling Centres Announcements Environment and Outdoors Fly-tipping and Litter +\nHigh Sheriff of Greater Manchester Visits Pemberton Old Wigan Brass Band Community Groups Culture Pemberton +\nMeeting Up with Robin Park Runners Brighter Borough Funding Community Groups Health Sports Clubs Wigan Pier Quarter +\nAttending the Grand Opening of Wigan's First Family Hub at The Meadows Community Resilience and Safety Health Housing NHS Worsley Hall +\nWaste Bins Replaced on Tunstall Lane and Billinge Road Environment and Outdoors Fly-tipping and Litter Pemberton +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_councillors-surgery-at-meadows-family_html/content_36.html": "Great to be back at The Meadows in Worsley Hall speaking to residents at this morning’s surgery.\nAs a reminder, this surgery takes place on the first Friday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_haig-street-car-park-transformed-by_html/content_168.html": "The Council car park on Haig St, opposite Wigan Pier, is looking terrific after we asked Streetscene to carry out works! This followed on from us doing a litter-pick there, collecting 6 bags of waste.\nA massive thank you to Johnny and the rest of the Streetscene staff for cutting back the overgrown vegetation, cleaning up mud and silt, unblocking gulleys and tidying up the general area!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_dont-forget-winter-opening-hours-for_html/content_209.html": "Don't Forget: Winter Opening Hours for Recycling Centres Get link Facebook X Pinterest Email Other Apps Don't forget! Our Borough’s recycling centres have now moved to their winter opening hours. Open 7 days a week, from 9am to 5:45pm.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_06_faded-road-markings-renewed-in-pemberton_html/content_189.html": "Skip to main content\nFaded Road Markings Renewed in Pemberton\nVery happy to see the faded road markings have now been re-painted on Winton Ave and Ansdell Rd in Pemberton, following my report a few weeks ago. Thank you to the Highways/ Network Management Team for taking this on board and acting quickly.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09_presenting-pemberton-old-wigan-brass_html/content_271.html": "Presenting Pemberton Old Wigan Brass Band with £4,000 to Compete in the Finals of the National Brass Band Championships\nWhat a terrific evening spent last night at Pemberton Old Wigan DW Band listening to the Youth Band in concert! Stellar performances from every member of the band and great conducting by John Don-Duncan!\nWe are very happy to have been able to provide this much-needed funding for the band’s travel and hotel costs via Wigan Council Brighter Borough Funding coming from the three Douglas Ward Councillors and 48 Councillor colleagues across the Borough.\nAmazingly, Pemberton Old Wigan Band is one of just 20 bands that qualified to attend the finals out of 117 who entered the qualifying rounds throughout Great Britain. We wish you all the very best of luck and know that the whole of Wigan Borough will be behind you!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_05_fly-tipping-on-douglas-street-car-park_html/content_232.html": "⚠️ After reporting a shocking amount of fly-tipping on the Douglas Street car park in Newtown, we are pleased that it has now been removed. Huge thank you to Street Scene for doing such a good job!\n❌ Please do not be tempted to fly-tip: not only is it illegal, it costs the Council an estimated £4-million a year to deal with. This is money that could be invested in our schools, enhancing our local environment or caring for people in need.\n🚮 If you have waste that you need to dispose of, please use the Council's FREE bulky waste collection service. You can book a slot here: Bulky waste and larger household items (wigan.gov.uk)",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_theres-still-time-to_html/content_15.html": "This week, we have been out again supporting the RMT’s campaign to #SaveOurTicketOffices.\nFirst on Monday, attending the public meeting listening to RMT General Secretary Mick Lynch, as well as rail staff, speaking.\nThen on Wednesday, attending the campaign day at Wigan North Western, informing commuters about the risks of closing our ticket offices.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_11_plans-submitted-for-new-council-flats_html/content_159.html": "📥 This week, a planning application was received for the building of 74 new flats at Logwood Place, off Scot Lane, together with parking, landscaping and associated works, following demolition of the existing flats.\n🏘 These plans will comprise of 69 one-bedroom flats and 5 two-bedroom flats, representing an increase of 20 properties from the current site. All of these flats will be owned and operated by Wigan Council, for social rent.\n👀 You can view further details and submit comments relating to the application at the following link: https://planning.wigan.gov.uk/online-applications/applicationDetails.do?keyVal=S2D0Q2RR0C800&activeTab=summary",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02_last-of-annual-newsletters-delivered_html/content_293.html": "❤️ Another fantastic weekend spent delivering the last of our Annual Newsletters, around Worsley Hall, Norley Hall and the Pier Quarter!\n🏡 We have now delivered to almost every household in the ward, with deliveries in progress across the Trencherfield Mill site, thanks to local members Maggie and Andy.\n👏 A huge thank you to everyone who has helped over the last month, ensuring that all residents are up to date with our latest work.\n👀 We will be publishing the online edition tomorrow, so keep your eyes peeled!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09_supporting-wigan-bulldogs-arlfc-with_html/content_249.html": "Terrific to meet up with Craig, Leah, the coaches and the kids from Wigan Bulldogs ARLFC to see their Junior Teams from ages 4 - 11 training last night on Scot Lane Playing Fields!\nWe’re proud to have supported some of their new playing kits with £679 of Brighter Borough Funding allocated by Wigan Council.\nGrassroots clubs like these are a central part of our local communities and we will do everything we can to support the enthusiastic and passionate volunteers that run them!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_alleyway-off-montrose-avenue-cleaned-up_html/content_177.html": "In Worsley Hall, the walkway between Montrose Avenue and Gordon Close was in dire need of a clean-up due to lots of litter and broken glass.\nAfter reporting it to the Council, the area has been cleared up a total of three times. It is now much safer for people to walk through - dog walkers in particular!\nHuge thank you to the Estate Caretakers for their work on this.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02_road-closure-on-warrington-road-for_html/content_237.html": "🚗 Warrington Road, from Victoria Street to Alexandra Park, is to undergo resurfacing works carried out the by the Council.\n⛔️ From this Sunday, and for the following three Sundays, this part of the road will be closed between the hours of 7am and 7pm.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_07_lots-of-damaged-street-signs-replaced_html/content_51.html": "Skip to main content\nLots of Damaged Street Signs Replaced in Worsley Hall and Pemberton\nRecently, we’ve noticed quite a few street signs that were either vandalised, rusted, faded or otherwise damaged, and so we reported them to the Council. Thank you to the Highways/ Network Management Team for promptly replacing these signs, helping to improve the appearance of our neighbourhoods.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_free-festive-parking-returns_html/content_151.html": "Our extended festive parking offer has begun!\nWigan and Leigh council town centre car parks FREE all weekend AND every weekday after pm.\nMost roadside pay & display bays in Wigan town centre FREE all weekend AND every weekday after pm (don't worry Leigh, there isn't any charging on-street parking in town).\nCelebrate Local, Shop Local, #LoveLocal",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Norley%20Hall/content_219.html": "More Damaged and Missing Street Signs Replaced Newtown Norley Hall Reported It - Fixed It! Roads and Traffic Wigan Pier Quarter Worsley Hall +\nLast of Annual Newsletters Delivered Across Douglas Ward Announcements Norley Hall Wigan Pier Quarter Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_celebrating-world-mental-health-day_html/content_247.html": "Every year we celebrate World Mental Health Day on 10 October. The theme for 2023, set by the World Foundation of Mental Health, is ‘Mental health is a universal human right’.\nWorld Mental Health Day is about raising awareness of mental health and driving positive change for everyone’s mental health.\nIt’s also a chance to talk about mental health, how we need to look after it, and how important it is to get help if you are struggling.\nTalking is good for your mental health. And talking about mental health is important. But starting a conversation isn’t always easy. Whether you’d like to talk to someone about how you’re feeling, or check-in with someone you care about, here are some tips that can help.\nTalking about your mental health\n- Choose someone you trust to talk to - This might be a friend, family member or a colleague. Or you might be more comfortable talking to someone you don’t know, for example, through a support helpline. It can help to do a pros and cons list about talking to someone.\n- Think about the best place to talk - It’s important to choose a place where you feel comfortable enough to open-up. You might want to choose somewhere private where you’re less likely to be disturbed. You also might want to talk while you do an activity, like walking together.\n- Prepare yourself for their reaction - Hopefully, you will have a good experience when you open-up to someone. But there’s a chance that they may not react in the way you hope. This may be for different reasons, like they may be worried or not fully understand at first. If that’s the case, try to give them time to process what you’ve told them. It might help to give them information to read to help them understand. And don’t forget to be kind to yourself and practise self-care.\nTalking to someone about their mental health\n- Find a good space to talk without distractions - If you’re worried about someone, try to find a place where you know you can have a conversation without being distracted. Make sure to give them your full attention. It might help to switch off your phone.\n- Listen and ask questions - Listening can be one of the most valuable ways to be there for someone. Show them that you’re actively listening by facing them, making eye contact, and not interrupting. Questions can help you clarify what they mean and also show that you’re actively listening. But make sure the questions are relevant to what they’re saying, and not changing the subject.\n- Ask how you can help - Ask how you can help or make suggestions, rather than telling them what to do next. They might want support with making a GP appointment, help around the house, or just for you to keep things normal and chat about what’s going on in your life.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_05_listening-to-residents-on-doorstep-in_html/content_62.html": "With just three days until polling day, we were busy knocking on doors in Newtown this afternoon!\nThank you to everyone who took the time to chat with us and all those voting to re-elect Matt as local Councillor this Thursday.\nMake your plan to vote at: iwillvote.org.uk",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_06_stay-well-in-heat_html/content_115.html": "Temperatures are expected to reach highs of 25C this week.\nDrink plenty of fluids and avoid excess alcohol during the hot weather.\nRemember to check in on how vulnerable family, friends and neighbours are coping.\nRead the latest tips on keeping safe in warm weather https://ow.ly/JoGb50So5w9",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_high-sheriff-of-greater-manchester_html/content_248.html": "This morning, it was an honour to be invited to Pemberton Old Wigan DW Band to see the Youth Band practising.\nWe were joined by Mary-Liz Walker, who is the High Sheriff of Greater Manchester (representative of King Charles in the county).\nMary-Liz was very impressed by the Youth Band’s performance, as well as conductor John Don-Ducan for all he does in helping them.\nWe would like to say a huge thank you to George, Ben, Vicky and all the fantastic people who run this great organisation! The band can traced right back to the 1870s when pit collieries proliferated the area. It’s great to see the preservation of our local heritage in such good hands.\n- Cllr Draper & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_06_attending-ordination-of-alison-brown_html/content_176.html": "Thank you to Alison Brown and all the volunteers at St James Church for the invite to the beautiful Liverpool Cathedral yesterday to see Alison being ordained as a Deacon for Church Wigan. It was a lovely service.\nAlison has worked in the community for many years, setting up the local food bank, Tom's Pantry, St James’ Faith Café and running many initiatives such as the Christmas Dinner last year that helped many in the community.\n- Cllr Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_more-than-words-have-won-over-47000-in_html/content_70.html": "We are ABSOLUTELY THRILLED for all the staff and students at More Than Words. They have won over £47,000 to fund their ‘Danspiration’ project!\nWe cannot wait to see the positive impact this will have on our local communities. It is so heartwarming to see the non-stop dedication of Sue and everyone at More Than Words recognised at this level.\nA huge well done from us all!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_councillors-surgery-at-mount-zion_html/content_57.html": "Great to be back at Mount Zion for this morning’s surgery, helping plenty of local residents with issues they are facing.\nWe also handed out information about Wigan Council’s Here For You service, which can help people to maximise their income through welfare and benefits support. For more information, ring the Welfare Team on 01942 489015 or visit wigan.gov.uk/HereForYou.\nAs a reminder, this surgery takes place on the last Thursday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_01_more-annual-newsletters-delivered_html/content_137.html": "A sunny day spent delivering our Annual Newsletter to households in Worsley Hall and parts of the Pier Quarter!\nToday, we covered the Sherwood Drive area, around Montrose Avenue, as well as Eleanor Street and Queen Street.\nWe spotted a few areas with a build-up of litter on our way round, which we have reported to the Council for clean-up.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_12_councillors-surgery-at-st-james-church_html/content_26.html": "Lovely to be back at St James' Church for this morning’s surgery!\nHad a great chat with Margaret who has attended St James with St Thomas Church - Poolstock for 83 years since she was 5 years old what an amazing woman.\nAs a reminder, our surgery here takes place on the second Saturday of the month, from 11am - 12pm.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_back-out-on-billinge-road-listening-to_html/content_73.html": "Back Out on Billinge Road Listening to Residents' Views Get link Facebook X Pinterest Email Other Apps Two days until polling day and we have been out speaking to more residents on Billinge Road and the surrounding streets. Thank you to everyone is voting to re-elect Matt as local Councillor this Thursday. Make your plan to vote at: iwillvote.org.uk",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_12_new-defibrillator-installed-at_html/content_242.html": "Earlier this week, we visited Pemberton Old Wigan DW Band to see the newly-installed defibrillator that we have helped to fund.\nWe were very happy to provide 50% match funding through our Brighter Borough pot, with the remainder coming from the Department of Health and Social Care.\nStudies have shown that the use of an AED defibrillator can increase someone’s chances of survival by 7 TIMES, should they have a cardiac arrest.\n- Cllr Draper, Cllr Callaghan & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09_worsley-hall-welcomes-our-town-waste_html/content_212.html": "Another great Waste Amnesty Day at Worsley Hall Shops today!\nA huge thank you to everyone who dropped off waste, preventing fly-tipping in our area. Thanks also to Streetscene for their work in clearing the children’s play area at The Meadows Family Hub.\nDon’t forget - there is one more skip day taking place at Trencherfield Mill on Friday, from 9am - 2pm.\nIf you can’t make this, please remember that you can also book 2 FREE bulky waste collections of up to five items in a 12 month period, through the Council. To do so, please visit https://www.wigan.gov.uk/BulkyCollections.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_07_successful-litter-pick-around_html/content_77.html": "Skip to main content\nSuccessful Litter Pick Around Trencherfield Mill!\nQuite a successful litter pick around Trencherfield Mill! We picked up 5 bags of waste, which we have logged with the Council for removal! We have also reported various on-site issues to Wigan Council including used needles, fly-tipping, overgrown vegetation and uneven paving stones.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02_fly-tipping-at-saddle-junction-reported_html/content_195.html": "Over the last few months, Douglas Street car park, on the Saddle Junction, had again become a hotspot for litter and fly-tipping of household and trade waste.\nThis has now been completely cleared up! Huge thanks to Wigan Council’s Environmental Enforcement Team who have investigated and removed the offending waste.\nPlease do not be tempted to fly-tip. The Council’s FREE Bulky Waste Collection Scheme is available to ALL residents. For more information and to book a slot, please visit: https://wigan.gov.uk/BulkyCollections\nIf you see fly-tipping, please report it to the Council and help to keep our area clean and tidy: https://wigan.gov.uk/FlyTipping\n- Cllr Callaghan",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_councillors-sugery-at-mount-zion-august_html/content_230.html": "Councillors' Sugery at Mount Zion - August 2023 Get link Facebook X Pinterest Email Other Apps 🙏 Thank you to the residents who came to speak to us at this morning's surgery at Mount Zion!✅ We picked up several pieces of casework which we are now dealing with.- Cllr Callaghan & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_12_funding-christmas-food-hampers-for_html/content_229.html": "It was an absolute pleasure to help out at St Francis’ Church this morning, packing Christmas food hampers for local residents in need in the Douglas and Pemberton wards.\nA massive thank you to the brilliant Barry Prior, a local unsung hero who organises this mammoth task every year! Thanks also to Carol, Elaine, Peter and Derek for helping out this morning.\nWe have always supported these hampers, and will continue to do so through our Brighter Borough Funding, to make sure everyone has the best Christmas possible!\n- Cllr Draper, Cllr Callaghan & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_05_attending-grundy-charity-wrestling-match_html/content_225.html": "On Saturday, we had the absolute pleasure of attending the Grundy Charity Wrestling Match, in honour of Dave Grundy, who sadly passed away in April.\nIt was a very special night, which raised over £5,000 for the family, and truly showcased how sports can make such a positive impact on the lives of our children and young people.\nWe will always support organisations like Wigan and Leigh Wrestling Club that are active in our communities, providing a life-line for so many local people.\nOnce again, a huge thank you to Mike Julie and the rest of the Grundy family for inviting us to this terrific event!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_fly-tipping-on-eleanor-street-reported_html/content_194.html": "⚠️ After reporting fly-tipping in the back alleys of Eleanor Street, we are pleased that it has now been removed. Huge thank you to Street Scene for doing such a good job!\n❌ Please do not be tempted to fly-tip: not only is it illegal, it costs the Council an estimated £4-million a year to deal with. This is money that could be invested in our schools, enhancing our local environment or caring for people in need.\n🚮 If you have waste that you need to dispose of, please use the Council's FREE bulky waste collection service. You can book a slot here: https://www.wigan.gov.uk/Resident/Bins-Recycling/Bulky-collections.aspx",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_visiting-tmp-colleges-new-campus_html/content_126.html": "Earlier today, we were thrilled to visit TMP College’s new campus on Caroline Street to attend a session marking the end of their “Discover Creative Careers Week”.\nWe heard from representatives from UK Music, YouTube, Curious Minds and others, talking about opportunities for young people in the creative industries. We were also treated to some great performances by art rock collective “Dilletante” as well as TMP’s own students.\nWell done to all involved! It’s fantastic to see opportunities like these being made available to more young people in Wigan and we look forward to working together, so that the arts, music, film, TV and drama are accessible to all.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_p_advice-surgeries_html/content_157.html": "If you would like to talk to us face-to-face, please come along to one of our regular advice surgeries.\nCllr Mary Callaghan holds the following surgeries:\nSt. James’ with St. Thomas’ Church\nWhere: Church Street, Poolstock, Wigan WN3 5EZ.\nWhen: Last Tuesday of the month, from 9.30am - 10.30am.\nBramble House\nWhere: 8 Broom Road, Worsley Hall, Wigan WN5 9QE.\nWhen: 3rd Thursday of the month, from 10am - 11am.\nPlease note: occasionally, dates and times for our surgeries can change. Please contact us before attending, or view the latest updates on our Facebook page.\nThroughout the year, we also hold 'street surgeries' across the ward. If we are visiting your street, we will notify you by posting a flyer and putting it on our Facebook page.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_councillors-surgery-at-mount-zion-june_html/content_213.html": "Skip to main content\nCouncillors' Surgery at Mount Zion - June 2023\nGreat to be back at Mount Zion for this morning’s surgery!\nAs a reminder, this takes place on the last Thursday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!\n- Cllr. Mary Callaghan & Cllr. Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_04_recent-issues-reported-for-action-from_html/content_244.html": "Almost every day, we report issues to the Council for them to take action. Here’s some we have reported over the last couple of weeks:\nLitter and fly-tipping\nPotholes\nFaded road markings and blocked gullies\nUnsafe fencing\nOn Thursday 2nd May, re-elect Cllr Matt Dawber: working hard for residents in Douglas Ward all year round!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_overgrown-vegetation-on-southgate_html/content_287.html": "Skip to main content\nOvergrown Vegetation on Southgate: Reported It, Fixed It!\nOvergrown vegetation impeding drivers’ vision, and a battered road bollard underneath Adam Viaduct on Southgate, were reported and have now been rectified.\nThank you to the Network Management Team and the Streetscene Team for doing such a good job!\n- Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_mesmerising-evening-at-light-night-wigan_html/content_266.html": "Mesmerising evening spent at Light Night Wigan, which is taking place in Mesnes Park until Saturday!\nA huge well done to all the local artists involved, and to Wigan Council’s Culture, Arts and Heritage Team for organising this fantastic event every year. Thank you also to the many volunteers and security workers staffing the event.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Newtown/content_5.html": "St Mark's Café Hub Volunteers Recognised with \"Heart of the Community\" Award Brighter Borough Funding Community Groups Culture Newtown +\nImproving Road Safety on Busy Newtown Street Community Resilience and Safety Newtown Roads and Traffic +\nAlexandra Park Tidied Up as Part of the Winter Maintenance Schedule Environment and Outdoors Newtown +\nFly-tipping and Overgrown Vegetation Removed in Newtown Environment and Outdoors Fly-tipping and Litter Newtown Reported It - Fixed It! +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_dangerous-missing-gate-replaced-at_html/content_175.html": "Skip to main content\nDangerous Missing Gate Replaced at Trencherfield Mill\nAfter seeing a missing gate next to the canal at Trencherfield Mill, I reported it to the Council as a matter of priority.\nThank you to Streetscene, who immediately cordoned off the area and have now fitted a new gate, making the area safe again.\n- Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_discussing-community-safety-at-meadows_html/content_222.html": "This afternoon, we were at The Meadows on Worsley Hall. We met with GMP officers, Sgt Steve Aspinall and PC George Lomas, as well as Jo Edwards, Wigan Council Manager of SWAN.\nWe discussed how we can work together with our tenants and residents to help our community to thrive and feel safe. As ever, any issues please contact us.\n- Cllr Draper & Cllr Callaghan\nWe discussed how we can work together with our tenants and residents to help our community to thrive and feel safe. As ever, any issues please contact us.\n- Cllr Draper & Cllr Callaghan",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_09/content_171.html": "Taking Part in Macmillan Coffee Morning at More Than Words Community Groups Culture Wigan Pier Quarter +\nFaded Sign on York Street: Reported It, Fixed It! Reported It - Fixed It! Roads and Traffic Wigan Pier Quarter +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_taking-part-in-estate-inspection-around_html/content_134.html": "🏠 Great to take part in another estate inspection of Worsley Hall this morning. This time, we focussed on the areas around Laithwaite Road with local Neighbourhood Tenant Officer James.\n✅ We had some really useful conversations with local tenants and residents, and picked up casework to improve the area. Please get in touch if you have any issues you’d like us to address.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09_waste-amnesty-day-arrives-in-wigan-pier_html/content_276.html": "Great to be at Trencherfield Mill this morning for the final day of the “Our Town” programme in Douglas Ward! Another skip well used by residents, and the entrance to Trencherfield Mill Apartments looking much tidier thanks to Dan and Ben from Streetscene.\nIf you couldn’t make this week’s waste amnesties, you can still book 2 FREE Bulky Waste Collections of up to five items in a 12 month period, through the Council. To do so, please visit https://www.wigan.gov.uk/BulkyCollections. Or, you can visit the waste amnesties taking place in other wards; see Wigan Council’s Facebook page for further details.\nWe’d like to say a huge thank you to local Neighbourhood Manager Jo for organising this week’s activities, along with Johnny, Dan and Ben from Streetscene, David from Highways, Lisa and all the staff at The Meadows Family Hub, and our neighbourhood policing team. Here’s to the next “Our Town” week!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_04_improvements-around-norfolk-street-in_html/content_172.html": "Following more than a year of campaigning, I am pleased to see that the new litter bin has been installed at the junction of Norfolk Street/ Victoria Street.\nIn addition, the OneStop corner shop has agreed to carry out regular litter-picks and install their own bin outside the premises. All of this should help to tackle litter problems in the area.\n- Cllr Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_01_super-saturday-delivering-800-more_html/content_204.html": "Super Saturday as we continued around Worsley Hall delivering 800 more of our Annual Newsletters!\nToday, we covered Heather Grove, Poplar Avenue, Ridyard Street, Greenwood Avenue and many other roads off these.\nWe spotted some more areas with litter and fly-tipping on our way round, which we have now reported to the Council for clean-up.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_05_welcome-to-our-website_html/content_19.html": "Your local Labour Councillors for Newtown, Wigan Pier Quarter, Worsley Hall and parts of Pemberton & Poolstock.\nWelcome to our website: we are your local Labour Councillors for Douglas Ward!\nOur ward covers Newtown, Worsley Hall, the Pier Quarter, and parts of Pemberton and Poolstock.\nTo see if you are one of our constituents, please see the map of our ward boundaries.\nIf you need any help, please contact us using the details on our contact page. Alternatively, you can attend one of our advice surgeries.\nWe look forward to hearing from you soon!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_09_attending-opening-of-thomas-linacres_html/content_18.html": "Last Tuesday, I was honoured to speak at the opening of the new ultrasound suite at the Thomas Linacre Breast Clinic, alongside members of Boot Out Breast Cancer and our dedicated healthcare professionals.\nPLEASE attend your mammogram appointment: I had no lumps, no bumps, no symptoms. Last year, 12,000 women in our area didn’t attend their check up; by the time symptoms arise, some of these women may be beyond help. So, PLEASE attend your check-up!\nWigan’s new ultrasound suite was funded by over £100,000 of generous donations from Boot Out Breast Cancer and WWL’s Three Wishes Charity, with £44,000 being raised by the recent 'In Pink' campaign!\nThe suite will enable Breast Consultants to diagnose patients more effectively and efficiently and will make a positive impact on reducing the waiting list for patients waiting for an ultrasound examination.\nDr Amruta Talwalkar, Director of South Lancashire Breast Screening Unit and Consultant Radiologist said: \"We at The South Lancashire Breast Screening Service are very grateful and would like to express our heartfelt thanks to everyone who has so generously contributed to the 'InPink' campaign.\"",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07_councillors-surgery-at-meadows-july-2023_html/content_112.html": "Great to be back at The Meadows on Worsley Hall for this morning’s surgery. The centre is looking terrific following the recent renovation work!\nAs a reminder, this surgery takes place on the first Friday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!\n- Cllr. Mary Callaghan & Cllr. Matt Dawber\nAs a reminder, this surgery takes place on the first Friday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!\n- Cllr. Mary Callaghan & Cllr. Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_07_councillors-surgery-at-st-james-church_html/content_132.html": "Skip to main content\nCouncillors' Surgery at St James' Church - July 2024\nLovely to be back at St James' Church for this morning’s surgery! As a reminder, this surgery takes place on the second Saturday of the month, from 11am - 12pm. If you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_07_wigan-council-opens-gardening_html/content_193.html": "Reminder that there is still time to enter Wigan Council’s gardening competition for social housing tenants! Awards include:\nBest garden, front or rear;\nMost improved or transformed garden;\nBest eco garden;\nBest allotment/school or eligible sheltered housing scheme;\nBest street.\nClosing date for entries is Monday 22nd July. To apply, please visit www.wigan.gov.uk/gardeningcompetition\nFor more information, please contact the team on 01942 486645 or email tvegardeningcomp2024@wigan.gov.uk",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_12_improving-road-safety-on-busy-newtown_html/content_161.html": "Skip to main content\nImproving Road Safety on Busy Newtown Street\nFollowing on from many residents’ requests, it is great to see that 20mph road markings and street signs have now been completed on Norfolk Street. A big thank you to the Traffic and the Highways Team for implementing this, helping to improve road safety in this busy area.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_councillors-surgery-at-meadows-october_html/content_280.html": "Great to be back at The Meadows on Worsley Hall, speaking to residents at this morning’s surgery. Thank you to Lisa and the staff for being so accommodating as usual!\nAs a reminder, this surgery takes place on the first Friday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_09_recognising-decades-of-voluntary_html/content_192.html": "This morning, it was our absolute privilege to recognise three stalwart volunteers: John Broomhead, Joe Edgar and Kevin Johnson.\nThey have dedicated decades of their life to improving Alexandra Park and the surrounding areas, including the Community Garden and Bowling Green.\nAfter seeing a notice asking for volunteers, John signed up and on 23 September 2010, the Friends of Alexandra Park Group was created. He has been volunteering ever since, and says there is still so much to be done.\n𝗝𝗼𝗲 𝗘𝗱𝗴𝗮𝗿: for over 30 years, Joe has been active in our community. From the 1990s, with the St Mark’s Boys Brigade; leading Bible classes at Bramble House; and running a group to welcome asylum seekers.\nIt was through his work with the asylum seekers that around seven years ago he became a gardener. These lads, who were mainly Eritrean, were becoming depressed with nothing to do with their time. So Joe thought the garden would be a good outlet for them.\nThey were very enthusiastic at first and soon got stuck in. But unfortunately, after three weeks they all got their papers and immediately went to live in Manchester. So the garden became Joe and Kath's garden, and so it has remained since.\nJoe said: “It's hard work but we have had some success, twice doing well in the Wigan in Bloom awards. We have also have been able to supply Toms Pantry in Poolstock with lots of potatoes, 6 bags this summer.”\n𝗞𝗲𝘃𝗶𝗻 𝗝𝗼𝗵𝗻𝘀𝗼𝗻: following his retirement, Kevin first became involved in Alexandra Park Bowling Green in 1993.\nOver time, his responsibilities have grown from taking care of the painting at the Bowling Green, to maintaining the benches, the green itself, the bowling pavilion, and everything in between!\nRecently, Kevin treated the Wooden Soldier at the Bowling Green with preservative, ahead of Armistice Day in November. This is something he does every year, ensuring our community can come together to remember those we have lost in war.\nKevin has also served as Chairman of the Wigan Catholic Men’s Bowling Leauge, and enjoys going down to the Bowling Green every day without fail. To socialise with other members, and keep on top of general maintenance.\nRecently, he has also started to give bowling lessons every Monday, in cooperation with Wigan Council’s Active Living Team. Kevin has said that this helps to improves the physical well-being of those who take part, but is also a chance for people to come together and socialise, who would otherwise be “stuck inside looking at four walls.”\nAll in all, Kevin’s voluntary work over the last three decades has meant that we have a jewel in the crown of Newtown: a Bowling Green that is kept in immaculate condition all year round, for those in the community to use. Bringing people together, and improving their mental and physical well-being in the process.\nA huge thank you to all those who made today’s special occasion possible:\nThe Mayor, Councillor Kevin Anderson, for presenting the three gentleman with their awards.\nMatt Kelly, Streetscene Services Manager, and Mike Cheers, Streetscene Operations Manager, for joining us.\nRoss, from Standards of the Wiend, for the stunning trophies and silver salver.\nChristine from Gaskell's Munch Box for the delicious buffet!\nThe Hub Café at St. Mark’s Church for providing refreshments and accomodating us so well!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_alexandra-park-tidied-up-as-part-of_html/content_100.html": "Great to see that Alexandra Park’s car parking area has been tidied up as part of the winter maintenance schedule.\nAll the hedges have been cut back and lowered in height, improving visibility and safety for park visitors on these dark nights. In addition, a large fallen branch that we reported has now been removed from the edge of the car park.\nThank you as ever to Streetscene staff for carrying out these works: you’ve done a fantastic job!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_07/content_31.html": "Upcoming: Worsley Hall Community Fun Day! Community Groups Community Resilience and Safety Worsley Hall +\nSuccessful Litter Pick Around Trencherfield Mill! Environment and Outdoors Fly-tipping and Litter Litter Picking Poolstock +\nLots of Damaged Street Signs Replaced in Worsley Hall and Pemberton Pemberton Roads and Traffic Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2025_01_commemorating-holocaust-memorial-day_html/content_215.html": "Commemorating Holocaust Memorial Day Get link Facebook X Pinterest Email Other Apps Today has marked 80 years since the liberation of Auschwitz.We must never forget the six million Jews murdered in the Holocaust and all victims of the Nazis, as well as victims of other genocides across the globe.#HolocaustMemorialDay #HMD2025 #NeverForget",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_09_councillors-surgery-at-mount-zion_html/content_291.html": "Skip to main content\nCouncillors' Surgery at Mount Zion - September 2023\nGreat to be back at Mount Zion for this morning’s surgery! As a reminder, this takes place on the last Thursday of the month, from 11am - 12pm. If you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_04_supporting-rmts-campaign-against_html/content_103.html": "Out on the picket line at Wigan Wallgate this morning, supporting the RMT’s campaign against outsourcing and low-pay for local rail workers.\nTrain operator Northern is outsourcing staff to sub-contractors, meaning they are on lower pay than directly-employed staff, on zero hours contracts and with no trade union recognition.\nIt’s simple: staff doing the same job deserve the same pay, same terms and conditions and same union rights. Low pay - no way!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_councillors-surgery-at-st-james-church_html/content_35.html": "Great to be back at St James' Church for this morning’s surgery! Thank you to the residents who came over for a chat!\nAs a reminder, this surgery takes place on the second Saturday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Heart%20of%20the%20Community%20Awards/content_14.html": "Jon Lister Recognised for 20+ Years Voluntary Work in Grassroots Football Health Heart of the Community Awards Newtown Sports Clubs +\nBarry Prior Recognised as a H-Art of the Community! Community Groups Culture Heart of the Community Awards Pemberton +\nRecognising Decades of Voluntary Service Given to Alexandra Park Brighter Borough Funding Community Groups Environment and Outdoors Heart of the Community Awards Newtown +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_01_old-and-rusted-litter-bin-replaced-on_html/content_146.html": "Skip to main content\nOld and Rusted Litter Bin Replaced on Montrose Avenue\nAfter many months of chasing up the Council, I am pleased to say the old and rusted litter bin on Montrose Avenue/ Greenwood Avenue has now been replaced! The new bin looks much better and will help to keep the local area clean and tidy in the coming years.- Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07_backing-campaign-to-saveourticketoffices_html/content_196.html": "Backing the Campaign to #SaveOurTicketOffices Get link Facebook X Pinterest Email Other Apps Terrific to be out this morning with RMT members, as we fight against disastrous Government proposals to close EVERY ticket office in Wigan. Huge levels of support from members of the public who want to #SaveOurTicketOffices!- Cllr. Pat Draper & Cllr. Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_12_on-site-at-trencherfield-mill-to_html/content_267.html": "This morning, we had a productive meeting at Trencherfield Mill with residents, to address long-standing issues with the bins on premises, including problems with fly-tipping, contamination and vermin.\nThank you to Ian Chappell, Waste Collection Supervisor at Wigan Council, for arranging the meeting. Thanks also to the collection crews for coming down to speak with us, and for the hard work they do all year round.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Sports%20Clubs/content_104.html": "Highfield Gardens Bowling Green Benefits from New Tarmac Paving Community Groups Environment and Outdoors Pemberton Sports Clubs +\nCatching Up with Robin Park Indoor Bowling Club Brighter Borough Funding Community Groups Health Newtown Sports Clubs +\nImprovements Ongoing at Alexandra Park Bowling Green Brighter Borough Funding Community Groups Environment and Outdoors Newtown Sports Clubs +\nSupporting Wigan Bulldogs ARLFC with Funding for New Junior Kits Brighter Borough Funding Community Groups Sports Clubs +\nCatching Up with Friends of Alexandra Park and Seeing the New Defibrillator Installed Brighter Borough Funding Community Groups Community Resilience and Safety Environment and Outdoors Health Newtown Sports Clubs +\nSupporting Kids at Wigan & Leigh Wrestling Club to Travel to Estonia! Brighter Borough Funding Community Groups Sports Clubs Worsley Hall +\nJon Lister Recognised for 20+ Years Voluntary Work in Grassroots Football Health Heart of the Community Awards Newtown Sports Clubs +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_01_councillors-surgery-at-mount-zion_html/content_89.html": "Yesterday, it was great to be back at Mount Zion for our first surgery there of the new year!\nWe were joined by members of the Highfield Gardens Bowling Club to discuss their plans to improve the facilities in 2024 and ways in which we can help.\nAs a reminder, this surgery takes place on the last Thursday of the month, from 11am - 12pm.\n- Cllr Draper, Cllr Callaghan & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_12_public-space-protection-order-pspo_html/content_200.html": "Public Space Protection Order (PSPO) Consultation – Car Cruises\nWigan Council are currently considering as part of the Community Safety Partnership introducing a PSPO to assist in tackling the increasing issues being caused across the borough through car cruising and to support making the roads of Wigan Borough safer.\nThe consultation is now live on the Council website and will close on 31 January 2025.\nThe consultation can be accessed via the Council website using the following link:\nFor any questions regarding this consultation, please email pspoconsultation@wigan.gov.uk",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_councillors-surgery-at-st-james-church_html/content_163.html": "❤️ Great to be back at St. James' Church for this morning’s surgery! We had many conversations with local residents and even got to join in with the teddy bear picnic!\n👏 We also had some brilliant news from Alison Brown, who is training for ordination to be a Distinctive Deacon, with a calling in the community. Huge congratulations, Alison, we wish you the best of luck with your training! We know you will excel.\n⏰ As a reminder, this surgery takes place on the second Saturday of the month, from 11am - 12pm.\n☕️ If you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!\n- Cllr. Pat Draper & Cllr. Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02/content_23.html": "Huge Potholes on Valley Road: Reported It, Fixed It! Pemberton Potholes Reported It - Fixed It! Roads and Traffic +\nLitter in Kingwood Crescent Alleyway: Reported It, Fixed It! Environment and Outdoors Reported It - Fixed It! Worsley Hall +\nClean-Up Works Around St Mark's Avenue and Wilfred Street Environment and Outdoors Newtown Reported It - Fixed It! Roads and Traffic +\nClean-Up of Walkway in Newtown Environment and Outdoors Fly-tipping and Litter Newtown Reported It - Fixed It! +\nLarge Pothole on Sherwood Drive: Reported It, Fixed It! Potholes Reported It - Fixed It! Roads and Traffic Worsley Hall +\nFly-tipping at the Saddle Junction: Reported It, Fixed It! Environment and Outdoors Fly-tipping and Litter Newtown Reported It - Fixed It! +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_05_todays-day-vote-labour-vote-matt-dawber_html/content_109.html": "Today's the Day: Vote Labour, Vote Matt Dawber! Get link Facebook X Pinterest Email Other Apps Today’s the day! Polls are open until 10pm. Find your polling station, bring your photo ID and make your plan to vote at: iwillvote.org.uk Vote Labour TODAY - Thursday 2nd May!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_fourteen-more-bags-of-litter-collected_html/content_37.html": "🚮 Earlier this week, we carried out a huge litter pick along the railway tunnel going from Prescott Street to York Street.\n🌳 This followed on from Streetscene doing a fantastic job of cutting back a lot of overgrown vegetation as part of the recent “Our Town” Week in Douglas Ward.\n1️⃣4️⃣ Despite us collecting FOURTEEN big bags of waste, there is still more litter in the area, so we will return during the week to pick up the rest.\n💚 We have also requested that the remaining shrubbery is removed, a tree blocking a street light is cut back, and have asked if a waste bin can be installed in this location to prevent litter.\n#KeepItClean",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_councillors-surgery-at-mount-zion_html/content_83.html": "Great to be back at Mount Zion for this morning’s surgery! Thank you to all the residents who came over for a chat.\nAs a reminder, this surgery takes place on the last Thursday of the month, from 11am - 12pm, alongside the church’s coffee morning.\nThis Saturday, 31st August, the church is hosting a “Sausage Sizzle” afternoon from 2pm - 4pm! £3 admission; all are welcome!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_supporting-kids-at-wigan-leigh_html/content_38.html": "We had a great catch-up with Wigan and Leigh Wrestling Club tonight, as we presented them with a cheque for £1,500 from our Brighter Borough Funding, provided by Wigan Council.\nTomorrow, 10 kids from the club are travelling to Estonia, to compete in the Tallinn Open Youth Wrestling Tournament, supported in part by the Brighter Borough Funding.\nWe are wishing all the kids the best of luck in the competition and hope that everyone has a fantastic time!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_the-green-flag-continues-to-fly-high_html/content_52.html": "Fantastic to see the Green Flag flying high over Alexandra Park, as it wins the prestigious award again for 2024-25!\nHuge congratulations to our Council staff and dedicated volunteers from the Friends of Alexandra Park, especially John Broomhead, Joe Edgar and Kevin Johnson, who all do an amazing job! Thanks also to Greenspaces Officer, Jeff O’Brien, for organising today’s ceremony.\n- Cllr Draper & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_remembrance-light-up-alexandra-park_html/content_285.html": "𝗥𝗲𝗺𝗲𝗺𝗯𝗿𝗮𝗻𝗰𝗲 𝗟𝗶𝗴𝗵𝘁 𝗨𝗽: 𝗔𝗹𝗲𝘅𝗮𝗻𝗱𝗿𝗮 𝗣𝗮𝗿𝗸 𝗠𝗼𝗻𝘂𝗺𝗲𝗻𝘁\nAhead of Armistice Day, the Alexandra Park Monument will be illuminated next Tuesday, 7th November, from 7pm - 9pm.\nWe have funded this from our Brighter Borough pot; please come down next week to remember all those we have lost in war.\n- Cllr Draper, Cllr Callaghan & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07_damaged-railings-on-enfield-street_html/content_183.html": "Many constituents who live close to the Enfield Street/ Ormskirk Road junction have been concerned about the railings being repeatedly damaged through lorries turning left.\nAfter the railings were taken away, I arranged a meeting with the Traffic Department so that residents could voice their concerns about the safety of pedestrians on the pavement and those crossing the road.\nI am pleased to report that all the damaged railings have now been replaced. They are now set further back to hopefully prevent this from happening again.\nA big thank you to local resident, Jack Whatton, for taking part in the meeting. Thank you also to Traffic and Highways. It's a job well done!\n- Cllr. Pat Draper, getting the job done!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_05_alleyway-clean-up-in-between-queen_html/content_125.html": "Skip to main content\nAlleyway Clean-Up in Between Queen Street and Billinge Road\nGood to see the alleyway between Queen St and Billinge Rd has been now cleaned up! Residents originally contacted me saying it was full of dog fouling and overgrown weeds. I reported this to Streetscene, who have done a terrific job in cleaning it up. To help prevent this problem again, I have requested that new “No Dog Fouling” signs are put on lampposts as well as having markings on the pavement.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_05/content_54.html": "Posts\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\nYour local Labour Councillors for Newtown, Wigan Pier Quarter, Worsley Hall and parts of Pemberton & Poolstock.\nYour local Labour Councillors for Newtown, Wigan Pier Quarter, Worsley Hall and parts of Pemberton & Poolstock.\n- Get link\n- X\n- Other Apps",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Potholes/content_227.html": "Recent Issues Reported for Action from the Council! Fly-tipping and Litter Litter Picking Local Election 2024 Potholes Roads and Traffic +\nPothole on Clayton Street: Reported It, Fixed It! Potholes Reported It - Fixed It! Roads and Traffic Wigan Pier Quarter +\nPothole on Ridyard Street: Reported It, Fixed It! Potholes Reported It - Fixed It! Roads and Traffic Worsley Hall +\nHuge Potholes on Valley Road: Reported It, Fixed It! Pemberton Potholes Reported It - Fixed It! Roads and Traffic +\nLarge Pothole on Sherwood Drive: Reported It, Fixed It! Potholes Reported It - Fixed It! Roads and Traffic Worsley Hall +\nPothole on Bold Street: Reported It, Fixed It! Pemberton Potholes Reported It - Fixed It! Roads and Traffic +\nDamaged Path Leading to the Red Pond: Reported It, Fixed It! Newtown Potholes Reported It - Fixed It! +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_11_attending-grand-opening-of-fur-clemts_html/content_278.html": "💚 This morning, it was great to attend the grand opening of Fur Clemt’s Warm Hub, alongside colleagues and local businesses that have supported the initiative.\n❄️ The Hub is part of Wigan Council’s “warm, welcoming spaces” that operate across the Borough, now that temperatures have begun to drop.\n🫶 These spaces offer a place for people to visit to stay warm and see a friendly face, free of charge and without judgement.\n⏰ Fur Clemt’s Warm Hub will be open Monday - Thursday (8am-5pm) and Friday (8am-4pm). So, please pop down and share this post with anyone who may need it!\nℹ️ You can find further information about our local warm, welcoming spaces here: https://www.wigan.gov.uk/Council/The-Deal/Deal-Communities/Here-for-you/Warm-welcoming-spaces.aspx",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_pothole-on-clayton-street-reported-it_html/content_277.html": "Pothole on Clayton Street: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps Another deep pothole - this time on Clayton Street - has now been filled in after reporting it to the Council. Thank you to the Highways Department for acting so quickly!- Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_councillors-surgery-at-st-james-church_html/content_141.html": "This morning it was lovely to catch up with local residents and volunteers at our Councillors' Surgery at St James' Church, Poolstock.\nThe Faith Café is open every Saturday from 11am - 2pm, with our surgery taking place on the second Saturday of the month, from 11am - 12noon.\n- Cllr. Pat Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Culture/content_2.html": "St Mark's Café Hub Volunteers Recognised with \"Heart of the Community\" Award Brighter Borough Funding Community Groups Culture Newtown +\nPoolstock Church Throws Open Its Doors to Feed People on Christmas Day Brighter Borough Funding Community Groups Culture Poolstock +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Roads%20and%20Traffic/content_58.html": "Improving Road Safety on Busy Newtown Street Community Resilience and Safety Newtown Roads and Traffic +\nPublic Space Protection Order (PSPO) Consultation – Car Cruises Announcements Community Resilience and Safety Roads and Traffic +\nHaig Street Car Park Transformed by Streetscene Works! Environment and Outdoors Reported It - Fixed It! Roads and Traffic Wigan Pier Quarter +\nMore Damaged and Missing Street Signs Replaced Newtown Norley Hall Reported It - Fixed It! Roads and Traffic Wigan Pier Quarter Worsley Hall +\nRailings Re-Installed on Sherwood Drive, Improving Safety Community Resilience and Safety Roads and Traffic Worsley Hall +\nWorking Together with Council Officers, Police and Residents to Improve Alexandra Park Announcements Community Groups Community Resilience and Safety Environment and Outdoors Newtown Roads and Traffic +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_tarmac-on-kilshaw-street-reported-it_html/content_185.html": "Skip to main content\nTarmac on Kilshaw Street: Reported It, Fixed It!\nAfter weeks of chasing down the contractor to remove the tarmac from Killshaw Street, I am happy to to report that it has now been removed!\nI'm sure local constituents are happy this mess has now been taken away. Thank you to the Highways Team for their help.\n- Cllr. Pat Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_05_supporting-striking-rail-workers_html/content_53.html": "This morning, we were proud to stand alongside striking RMT rail workers outside Wigan Wallgate.\nThey are fighting against the Tory government’s proposals, which include a real-terms pay cut and a further erosion of workers’ terms and conditions.\nThere was great support from the public.\n- Cllr. Draper & Cllr. Callaghan\nThey are fighting against the Tory government’s proposals, which include a real-terms pay cut and a further erosion of workers’ terms and conditions.\nThere was great support from the public.\n- Cllr. Draper & Cllr. Callaghan",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02_street-and-road-signs-cleaned-up-in_html/content_187.html": "Skip to main content\nStreet and Road Signs Cleaned Up in Newtown\nThe road and street signs on Woolden Street, Newtown, were covered in algae, making them difficult to see. I reported this to the Highways Department, who have now given them a good clean-up!",
  "https_www_douglaslabourcllrs_co_uk_/http_www_douglaslabourcllrs_co_uk/content_65.html": "Your local Labour Councillors for Newtown, Wigan Pier Quarter, Worsley Hall and parts of Pemberton & Poolstock.\nYour local Labour Councillors for Newtown, Wigan Pier Quarter, Worsley Hall and parts of Pemberton & Poolstock.\n- Get link\n- X\n- Other Apps",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_re-elect-cllr-matt-dawber-on-thursday_html/content_156.html": "With my nomination papers now handed in to the Town Hall, I’m pleased to say that I am the Labour candidate for Douglas Ward in the upcoming Local Elections!\nFor a Councillor that puts our local community first, I hope that I can count on your support to be re-elected on Thursday 2nd May.\n- Cllr Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_defaced-street-sign-on-eleanor-street_html/content_110.html": "Defaced Street Sign on Eleanor Street: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps Defaced sign on Eleanor Street reported, and now replaced by the Network Management Team. Let's keep Douglas Ward looking its best!- Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07_visiting-new-flower-displays-at_html/content_233.html": "Out on our rounds of the ward today, we popped into Alexandra Park to look at the lovely new flower displays around The Memorial. A huge thank you to John and the other members of Friends of Alexandra Park for always making our park look exemplary! - Cllr. Pat Draper & Cllr. Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_drive-around-of-ward-and-collecting-our_html/content_96.html": "Productive day today as we did a drive-around of the ward, picking up casework for some damaged traffic lights, blocked gulleys, fly-tipping and potholes!\nWe then returned to Prescott Street where we collected our final five bags of litter. Over the last three weeks, we have collected a total of THIRTY bags of waste here and the area is looking much better for it!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_councillors-surgery-at-meadows-august_html/content_84.html": "❤️ Great to be back at The Meadows on Worsley Hall, speaking to residents at this morning’s surgery.\n⏰ As a reminder, this surgery takes place on the first Friday of the month, from 11am - 12pm.\n☕️ If you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!\n- Cllr. Pat Draper & Cllr. Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_very-productive-litter-pick-in-newtown_html/content_107.html": "Very productive litter pick this afternoon in Newtown, around the Douglas St car park at the Saddle Junction!\nWe collected 5 big bags of waste, as well as a carpet that had been fly-tipped! All of this has been logged with Wigan Council for removal.\nWe have also requested that the shrubbery around the car park is trimmed back, to make the area look as tidy as possible.\n- Cllr Draper & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_graffiti-removed-from-bin-at-highfield_html/content_97.html": "Skip to main content\nGraffiti Removed from Bin at Highfield Gardens\nPleased to see that the graffiti has now been removed from the litter bin at Highfield Gardens!\nHowever, whilst at the park, I saw that there has been further graffiti sprayed on the notice board and railings. I have reported this to Streetscene, who will arrange to remove it.\n- Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_04_speaking-to-residents-around-little_html/content_253.html": "Lovely afternoon spent talking to residents in Pemberton: including little Billinge Road, Barlborough Road, Queen Street and others.\nWe picked up some more casework, which we’ll be taking up with the Council shortly.\nWe really appreciate all the support we’ve had from constituents, many of whom are voting to re-elect Matt on Thursday 2nd May. Make your plan to vote at: iwillvote.org.uk",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_11/content_164.html": "Having a Ball at More Than Words' Annual Celebration Ball! Community Groups Culture Wigan Pier Quarter +\nAttending the Grand Opening of Fur Clemt's Warm Hub Community Groups Community Resilience and Safety Health Pemberton Worsley Hall +\nNew Alley Gate Installed on Ormskirk Road to Combat Anti-Social Behaviour Brighter Borough Funding Community Groups Community Resilience and Safety Fly-tipping and Litter Pemberton Reported It - Fixed It! +\nHard-To-See Street Sign on Hamilton Court: Reported It, Fixed It! Reported It - Fixed It! Roads and Traffic Worsley Hall +\nPlans Submitted for New Council Flats at Logwood Place Housing Newtown Planning Applications Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_04_another-productive-day-talking-to_html/content_218.html": "Another very productive day today! First, we attended one of our regular surgeries at Mount Zion Church and helped constituents with various casework issues.\nThen, we were back out around Valley Road and Marina Drive, talking to people on the doorstep, ahead of polling day next Thursday.\nWe are very grateful for all the support we have had from local residents - including the gnomes! On Thursday 2nd May, re-elect Councillor Matt Dawber!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Health/content_167.html": "Friends of Alexandra Park Win Highest \"In Bloom\" Award! Community Groups Environment and Outdoors Health Newtown +\nCatching Up with Robin Park Indoor Bowling Club Brighter Borough Funding Community Groups Health Newtown Sports Clubs +\nAttending the Festival of Hope on World Mental Health Day Community Resilience and Safety Health Wigan Pier Quarter +\nCatching Up with Daffodils Dreams to See Their Fantastic Work! Community Groups Health Wigan Pier Quarter +\nCatching Up with Friends of Alexandra Park and Seeing the New Defibrillator Installed Brighter Borough Funding Community Groups Community Resilience and Safety Environment and Outdoors Health Newtown Sports Clubs +\nNew Defib Installed at St James' Church Brighter Borough Funding Community Resilience and Safety Health Poolstock +\nJon Lister Recognised for 20+ Years Voluntary Work in Grassroots Football Health Heart of the Community Awards Newtown Sports Clubs +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06/content_3.html": "Posts\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_meeting-residents-to-discuss-traffic_html/content_71.html": "Great to meet residents of Norfolk Street this afternoon, with Traffic Management and Development Manager Danny Orrell, as well as Traffic Engineer Darren Findley.\nWe discussed the ongoing traffic and parking issues in the area, and are working together to introduce measures to alleviate these!\n- Cllr. Draper & Cllr. Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_11_councillors-surgery-at-mount-zion_html/content_286.html": "Great to be back at Mount Zion for this morning’s surgery! Thank you to all the residents who came over for a natter!\nToday, we were joined by our fantastic Community Capacity Officer, Julie Clarke, who was giving advice to residents on setting up community groups and obtaining funding.\nAs a reminder, this surgery takes place on the last Thursday of the month, from 11am - 12pm.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_04_wigan-labour-group-continues-to-support_html/content_205.html": "At last week’s full council meeting, Leader Cllr David Molyneux re-affirmed Wigan Council’s full support for the WASPI Campaign and their demand for fair and fast compensation.\nWigan Council’s WASPI Champion, our own Cllr Draper, has presented numerous motions since 2017, all of which have been passed unanimously and enjoyed cross-party support.\nWhilst the Ombudsman’s report makes it clear that 1950s women have faced injustice and that they are entitled to compensation, the fight is far from over. The Government must act urgently and bring forward an appropriate compensation scheme to Parliament!\nWe are not going away until fair and fast compensation is paid to the 3.7 million 1950s women affected by state pension inequality!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_councillors-surgery-at-mount-zion_html/content_138.html": "Lovely to be back at Mount Zion for this morning’s surgery. Thank you to all the residents who chatted with us; we will be taking up your casework issues with Wigan Council and Transport for Greater Manchester.\nAs a reminder, our surgery here takes place on the last Thursday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09_catching-up-with-friends-of-alexandra_html/content_261.html": "💚 Lovely to call down to Alexandra Park Bowling Green this morning to meet with bowlers, park volunteers and Council Officers to discuss improvements required for the greens going forwards.\n⚡️ Whilst we were there, we had chance to see the new defibrillator on site that we paid for via our Brighter Borough Funding provided by Wigan Council. The park and greens are very well used by residents, so this will be a lifeline available should it ever be needed in an emergency!\n👏 Thanks again to all those involved in today’s meeting: we will continue to work together with the park’s bowlers, volunteers, Council Officers and residents to make Alexandra Park the best it can be.\n- Cllr Draper & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_litter-pick-around-newtown-working-mens_html/content_101.html": "Quick litter-pick yesterday around Newtown Working Men’s Club and Anson Street, with 3 bags collected!\nUnfortunately, there was some fly-tipped furniture and household waste in the area, which I’ve reported to Wigan Council.\nPlease help to keep our area free from fly-tipping by using the Council’s FREE Bulky Waste Collection Scheme, which residents can use 2x per year, up to 5 items each time. For further info, visit: https://www.wigan.gov.uk/BulkyCollections.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_05_please-vote-for-danspiration_html/content_139.html": "Local group More Than Words has revealed that their dance project, called ‘𝘿𝙖𝙣𝙨𝙥𝙞𝙧𝙖𝙩𝙞𝙤𝙣’ has got through to the final stages of The People's Projects!\nMore Than Words is of 𝗼𝗻𝗹𝘆 𝗳𝗶𝘃𝗲 𝗴𝗿𝗼𝘂𝗽𝘀 in the Granada TV region to have got through to win a share of £250,000 of funding! And they are the 𝗼𝗻𝗹𝘆 𝗴𝗿𝗼𝘂𝗽 𝗶𝗻 𝗪𝗶𝗴𝗮𝗻 to get this far!\n‘𝘿𝙖𝙣𝙨𝙥𝙞𝙧𝙖𝙩𝙞𝙤𝙣’ is a student-led project, which will bring inclusive dance workshops to the local community. It will bring people of all ages and abilities together to enjoy dance and movement, make new friends and lead a more healthy and active lifestyle.\n𝙒𝙚 𝙣𝙤𝙬 𝙣𝙚𝙚𝙙 𝙥𝙚𝙤𝙥𝙡𝙚 𝙩𝙤 𝙜𝙚𝙩 𝙗𝙚𝙝𝙞𝙣𝙙 𝙩𝙝𝙞𝙨 𝙗𝙧𝙞𝙡𝙡𝙞𝙖𝙣𝙩 𝙡𝙤𝙘𝙖𝙡 𝙜𝙧𝙤𝙪𝙥, 𝙩𝙤 𝙨𝙝𝙤𝙬 𝙩𝙝𝙚𝙞𝙧 𝙨𝙪𝙥𝙥𝙤𝙧𝙩 𝙖𝙣𝙙 𝙫𝙤𝙩𝙚!\n𝙏𝙤 𝙗𝙚 𝙞𝙣 𝙬𝙞𝙩𝙝 𝙖 𝙘𝙝𝙖𝙣𝙘𝙚 𝙤𝙛 𝙬𝙞𝙣𝙣𝙞𝙣𝙜, 𝙬𝙚 𝙣𝙚𝙚𝙙 𝙮𝙤𝙪 𝙩𝙤 𝙨𝙪𝙥𝙥𝙤𝙧𝙩 𝙩𝙝𝙚𝙞𝙧 𝙥𝙧𝙤𝙟𝙚𝙘𝙩. Voting opens at 9am on Monday 15 May and closes at noon on Friday 26 May 2023.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_wigan-town-hall-lit-up-in-support-of_html/content_241.html": "Absolutely terrific to see Wigan and Leigh Town Halls lit up purple, in support of International Women's Day and the WASPI Campaign!\nSolidarity to all women, especially our 1950s born & WASPI women, who have been fighting for nine years to get justice.\nAs your Labour Councillors, and with Cllr Draper as Wigan Council’s WASPI Champion, we will always support the WASPI campaign and demand #FairAndFastCompensation for those who have lost out on thousands of pounds of State Pension that they should have received!\nThe fight goes on to achieve justice for our WASPI women and to call out stereotypes, challenge bias, end discrimination, and build an inclusive world for women everywhere!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_presenting-awards-to-students-at-more_html/content_269.html": "❤️💙 Last night, we had a wonderful time attending the More Than Words Graduation Awards Evening, and were honoured to present some of the students with their certificates!\n👏 A huge well done to you all on your achievements from the Open Awards, Arts Awards & Leadership Skills Foundation. Keep up the terrific work!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_councillors-surgery-at-mount-zion-march_html/content_33.html": "Great to be back at Mount Zion for this morning’s surgery. Thank you to all the residents who came over for a chat!\nAs a reminder, this takes place on the last Thursday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08_flowers-in-bloom-at-alexandra-park_html/content_123.html": "🌺 Lovely to pop into Alexandra Park yesterday and see all the flowers in bloom.\n💚 A huge thank you to John and the other members of Friends of Alexandra Park for always making our park look exemplary!\n🚮 Whilst there, we reported some litter that had accumulated. Let’s keep Alexandra Park looking its best: please use the bins provided and encourage children to do the same.\n- Cllr. Pat Draper & Cllr. Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_attending-festival-of-hope-on-world_html/content_75.html": "What a fantastic way to mark the conclusion of the Month of Hope and World Mental Health Day, by attending the Festival of Hope at Feast at the Mills!\nOrganised by suicide prevention organisation EPiC Hope, we saw some terrific Danspiration & More Than Words performances!\nWe also heard from EPiC Hope founder, Ellie Palma-Cass, who gave a very inspiring speech on the importance of hope for the people of our town.\nIf you need help or support with your mental health, find out what help is available at https://bit.ly/4gjd52O. If you need urgent help you can contact Samaritans 24/7 by phoning 116 123.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_05_help-us-to-combat-off-road-bike_html/content_224.html": "HELP US TO COMBAT ILLEGAL OFF-ROAD BIKE ACTIVITY IN OUR AREA\nPlease report it to Greater Manchester Police wherever you see it. Include as many details as possible, including dates, times, descriptions and locations.\nUsing this information, the police will formulate an action plan in co-operation with Wigan Council, to target known hot-spots.\nAlternatively, you can report it online via GMP’s website: https://www.gmp.police.uk/ro/report/asb/asb-v3/report-antisocial-behaviour",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_06_commemorating-42nd-anniversary-of_html/content_251.html": "Commemorating the 42nd Anniversary of the Falklands War\nGet link\nFacebook\nX\nPinterest\nEmail\nOther Apps\nToday marks the 42nd anniversary of the Falklands War ending.\nWe were humbled to attend the 2 minute silence held at Believe Square, in commemoration of all those who gave their lives in the conflict. Lest we forget.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_06_wigan-council-launches-its-gardening_html/content_255.html": "✨ We are pleased to let you know that Wigan Council has launched the Tenant Voice & Engagement Gardening Competition 2024!\n🌻 If there is one thing that brightens up our day, it’s a nice garden and if you like gardening why not enter the competition. Anyone with green fingers and a passion for gardening can apply, you just need to be a tenant of Wigan Council. There will be several categories including:\n🥇 Best garden, front or rear;\n👏 Most improved or transformed garden;\n🐝 Best eco garden;\n🌺 Best pots and baskets;\n🏡 Best allotment/school or eligible sheltered housing scheme;\n🏘️ Best street.\n💚 For details on how to enter, please visit www.wigan.gov.uk/gardeningcompetition\nℹ️ For more information, please contact the team on 01942 486645 or email TVAT@wigan.gov.uk.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_06_councillors-surgery-at-mount-zion_html/content_207.html": "Great to be back at Mount Zion for this morning’s surgery, helping plenty of local residents with issues they are facing!\nAs a reminder, this surgery takes place on the last Thursday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!\nAs a reminder, this surgery takes place on the last Thursday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_pothole-on-ridyard-street-reported-it_html/content_273.html": "Pothole on Ridyard Street: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps The large pothole on the roundabout at Worsley Hall shops has now been fully repaired. Thank you to the Highways Department for a job well done!- Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_presenting-awards-at-more-than-words_html/content_120.html": "Last night, we had an absolute ball at More Than Words’ Annual Celebration Ball!\nIt was heart-warming to see all the students receive their accolades, and we were honoured to present some of the awards. With More Than Words in the process of moving to their new home in Ince, it was great to be joined by Council Leader Cllr David Molyneux and Portfolio Holder for Communities Cllr Chris Ready.\nA huge well done to all the staff members for organising such a wonderful event and to the students for their hard work all year round!\nWe cannot put into words how proud we are to support this group. To the staff and students: keep up the good work; we cannot wait to see what comes next!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_09_councillors-surgery-at-st-james-church_html/content_270.html": "Lovely to be back at St James' Church for this morning’s surgery! Today is their heritage open day, so it was great to see plenty of familiar faces at the Faith Café and local residents coming down for tours of the church!\nAs a reminder, our surgery here normally takes place on the second Saturday of the month, from 11am - 12pm.\nIf you have any issues, please do come down for a brew and a chat, or contact us using the details on our page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02_planning-application-submitted-for_html/content_243.html": "| Source: Google Maps |\nA planning application has been submitted for the vacant Hare and Hounds Pub on Billinge Road. This is for a change of use from a public house to 8 residential apartments.\nThe application also includes the installation of dormer windows and alterations to the roof to create rooms in roof space, together with associated external alterations, following the removal of existing sheds, chimneys and external staircase and partial demolition of the extension to the rear.\nYou can view further details, and submit comments relating to the application until 2nd March, at the following link here: https://planning.wigan.gov.uk/online-applications/applicationDetails.do?activeTab=dates&keyVal=S3EGQ8RRHSP00",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Pemberton/content_178.html": "Posts\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\nPresenting Pemberton Old Wigan Brass Band with £4,000 to Compete in the Finals of the National Brass Band Championships\nPresenting Pemberton Old Wigan Brass Band with £4,000 to Compete in the Finals of the National Brass Band Championships\n- Get link\n- X\n- Other Apps",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Announcements/content_179.html": "Public Space Protection Order (PSPO) Consultation – Car Cruises Announcements Community Resilience and Safety Roads and Traffic +\nWhite Ribbon Day, Starting 16 Days of Action to End Domestic Abuse Announcements Community Resilience and Safety +\nDon't Forget: Wigan's Recycling Centres Return to Winter Hours Announcements Environment and Outdoors Fly-tipping and Litter +\nAre You Eligible for Pension Credit? Wigan Council's \"Here for You\" Programme Can Help! Announcements Welfare and Pensions +\nWaste Amnesty Day Arrives in Wigan Pier Quarter Announcements Environment and Outdoors Fly-tipping and Litter Wigan Pier Quarter +\nWorking Together with Council Officers, Police and Residents to Improve Alexandra Park Announcements Community Groups Community Resilience and Safety Environment and Outdoors Newtown Roads and Traffic +\nWorsley Hall Welcomes \"Our Town\" Waste Amnesty Week Announcements Environment and Outdoors Fly-tipping and Litter Litter Picking Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Fly-tipping%20and%20Litter/content_7.html": "Fly-tipping and Litter Cleaned Up at Trencherfield Mill Environment and Outdoors Fly-tipping and Litter Wigan Pier Quarter +\nFly-tipping and Overgrown Vegetation Removed in Newtown Environment and Outdoors Fly-tipping and Litter Newtown Reported It - Fixed It! +\nDon't Forget: Wigan's Recycling Centres Return to Winter Hours Announcements Environment and Outdoors Fly-tipping and Litter +\nDrive-Around of the Ward and Collecting Our Final Five Bags of Litter from Prescott Street Community Resilience and Safety Environment and Outdoors Fly-tipping and Litter Wigan Pier Quarter +\nAnother Eleven Bags of Litter Collected Around Prescott Street Environment and Outdoors Fly-tipping and Litter Litter Picking Wigan Pier Quarter +\nFourteen More Bags of Litter Collected Along Prescott Street and York Street Environment and Outdoors Fly-tipping and Litter Litter Picking Wigan Pier Quarter +\nLitter-Pick Around Newtown Working Men's Club and Anson Street Fly-tipping and Litter Litter Picking Newtown +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_12_highfield-gardens-bowling-green_html/content_105.html": "At the start of the week, we visited Highfield Gardens, following on from the council repairing tarmac paving all around the bowling green. Previously, areas were cracked, unlevel and damaged by tree roots growing through.\nThank you to the Streetscene and BeWell Teams for carrying out these repairs, helping to keep our precious sporting facilities in good working order.\nBowling greens like these are vital for older people’s physical and mental health. We are determined to work alongside our dedicated volunteers and the council to keep them in use for the community.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07_vandalised-sign-on-southgate-reported_html/content_170.html": "Vandalised Sign on Southgate: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps Vandalised sign on Southgate reported, and now cleaned up by the Network Management Team. Let's keep Douglas Ward looking its best!- Cllr. Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_06_missed-blue-bin-collections-in-poolstock_html/content_135.html": "MISSED BLUE BIN COLLECTIONS IN POOLSTOCK\nWe have been informed by the Waste Collection Team that due to operational issues, blue recycling bins have not been collected today in the streets highlighted below:\nTipping Street\nBewerley Close\nRoecliffe Close\nCarlton Street\nHardman Street\nThey have apologised for any inconvenience, and advise any residents to leave their bins out for collection as they plan to return tomorrow (Saturday 22 June).\nWe have been informed by the Waste Collection Team that due to operational issues, blue recycling bins have not been collected today in the streets highlighted below:\nTipping Street\nBewerley Close\nRoecliffe Close\nCarlton Street\nHardman Street\nThey have apologised for any inconvenience, and advise any residents to leave their bins out for collection as they plan to return tomorrow (Saturday 22 June).",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_12/content_85.html": "New Defibrillator Installed at Pemberton Brass Band Brighter Borough Funding Community Groups Health Pemberton +\nFunding Christmas Food Hampers for Residents in Need Brighter Borough Funding Community Groups Health +\nWaste Amnesty Day Success in Worsley Hall Environment and Outdoors Fly-tipping and Litter Worsley Hall +\nOn Site at Trencherfield Mill to Address Waste Issues Community Resilience and Safety Environment and Outdoors Fly-tipping and Litter Wigan Pier Quarter +\nBin Collections Over the Christmas Period Announcements Environment and Outdoors Fly-tipping and Litter +\nWarm, Welcoming Spaces in Our Local Area Announcements Community Groups Community Resilience and Safety Health Newtown Pemberton Poolstock Wigan Pier Quarter Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_08/content_13.html": "Posts\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps\n- Get link\n- X\n- Other Apps",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_01_visiting-wigan-and-leigh-wrestling_html/content_27.html": "Last night, we really enjoyed catching up with Julie, Mike, Leanne and all the team at Wigan and Leigh Wrestling Club!\nThey have recently moved to their new premises on the Pioneer Industrial Estate, off Ormskirk Road.\nWe have long been involved with this fantastic sporting group and it was an honour when we awarded Dave Grundy the “Heart of the Community” Award, just before he passed away last year. Dave has left an enormous legacy, which we saw at the club tonight, watching the Tough Tots and Kids Wrestling sessions!\nMike, who is a world champion himself, is running the club and gym on site, with his mum Julie and business partner Danny. Over the years, this club has produced world champions in wrestling, boxing, and cage fighting.\nIt is a brilliant facility for all ages and an asset to our community. Please check them out!\n- Cllr Draper, Cllr Callaghan & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2025_01/content_29.html": "St Mark's Café Hub Volunteers Recognised with \"Heart of the Community\" Award Brighter Borough Funding Community Groups Culture Newtown +\nFly-tipping and Litter Cleaned Up at Trencherfield Mill Environment and Outdoors Fly-tipping and Litter Wigan Pier Quarter +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_02_clean-up-of-walkway-in-newtown_html/content_201.html": "Clean-Up of Walkway in Newtown Get link Facebook X Pinterest Email Other Apps In Newtown, the walkway between Bakehouse Close and Winstanley Street was in dire need of a clean-up because of litter. Thank you to Streetscene, who acted quickly and did a great job of tidying up the area!- Cllr Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_01_attending-derek-green-memorial-concert_html/content_47.html": "Last night, we were honoured to attend the Derek Green Memorial Concert at Pemberton Old Wigan DW Band. It was a wonderful night where we had the chance to listen to Derek’s favourite music and hear wonderful stories and memories from his family and friends.\nIn 2022, we had the honour of awarding Derek the Heart of the Community Award in Wigan Town Hall. He absolutely loved it, and it was great to see Derek getting the recognition he deserved.\nDerek: you were a class act and your dedication to our community will never be forgotten.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_09_celebrating-wigan-casinos-50th_html/content_257.html": "Fifty years ago this weekend, Wigan Casino hosted the first of its legendary all-nighters, which made it the epicentre of the Northern Soul scene.\n50 years on, the soul stays strong! Two exhibitions celebrating Wigan Casino are now open in Wigan town centre.\nYou can find out more about our borough’s celebrations here. Keep the faith! https://www.visitwigan.com/\n50 years on, the soul stays strong! Two exhibitions celebrating Wigan Casino are now open in Wigan town centre.\nYou can find out more about our borough’s celebrations here. Keep the faith! https://www.visitwigan.com/",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_12_merry-christmas_html/content_203.html": "Merry Christmas! Get link Facebook X Pinterest Email Other Apps Wishing a very Merry Christmas to all our residents in Newtown, Pemberton, Poolstock, Wigan Pier Quarter and Worsley Hall Best wishes from Pat, Mary & Matt!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_10_backing-local-government-workers-on_html/content_226.html": "This week, we were proud to stand alongside local government workers fighting for fair pay and conditions.\nOur council workers are the backbone of our communities. From caring for our children and our elderly to keeping our streets clean and rubbish collected, they provide the vital services that we rely on everyday.\nBut 13 years of government funding cuts, pay cuts and financial mismanagement from the Tories, a global pandemic and a cost-of-living crisis has left morale in tatters and services at breaking point.\nYears of pay freezes and cuts imposed by the Tories has seen the value of local government workers’ wages fall by 25% since 2010.\nMany workers rely heavily on overtime just to make ends meet, and some need foodbanks to get by. This is a national disgrace. We say work should pay, and we will continue to back our residents until they get it!\nOur council workers are the backbone of our communities. From caring for our children and our elderly to keeping our streets clean and rubbish collected, they provide the vital services that we rely on everyday.\nBut 13 years of government funding cuts, pay cuts and financial mismanagement from the Tories, a global pandemic and a cost-of-living crisis has left morale in tatters and services at breaking point.\nYears of pay freezes and cuts imposed by the Tories has seen the value of local government workers’ wages fall by 25% since 2010.\nMany workers rely heavily on overtime just to make ends meet, and some need foodbanks to get by. This is a national disgrace. We say work should pay, and we will continue to back our residents until they get it!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Advice%20Surgeries/content_22.html": "Skip to main content\nDouglas Labour Councillors\nSearch\nSearch This Blog\nHome\nContact Us\nAdvice Surgeries\nOur Ward\nUseful Information\nShowing posts with the label\nAdvice Surgeries\nView all\nPosts\nCouncillors' Surgery at The Meadows Family Hub - January 2025\nAdvice Surgeries\nWorsley Hall\n+\nCouncillors' Surgery at St James' Church - December 2024\nAdvice Surgeries\nPoolstock\n+\nCouncillors' Surgery at The Meadows Family Hub - December 2024\nAdvice Surgeries\nWorsley Hall\n+\nCouncillors' Surgery at Mount Zion - November 2024\nAdvice Surgeries\nPemberton\n+\nCouncillors' Surgery at St James' Church - November 2024\nAdvice Surgeries\nPoolstock\n+\nCouncillors' Surgery at The Meadows Family Hub - November 2024\nAdvice Surgeries\nWorsley Hall\n+\nCouncillors' Surgery at Mount Zion - October 2024\nAdvice Surgeries\nPemberton\nWelfare and Pensions\n+\nCouncillors' Surgery at St James' Church - October 2024\nAdvice Surgeries\nPoolstock\n+\nCouncillors' Surgery at The Meadows Family Hub - October 2024\nAdvice Surgeries\nWorsley Hall\n+\nCouncillors' Surgery at Mount Zion - September 2024\nAdvice Surgeries\nPemberton\n+\nMore posts",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_p_contact-us_html/content_184.html": "As your local Councillors for Douglas Ward, we are here to help you with anything related to Wigan Council.\nOur ward covers Newtown, Wigan Pier Quarter, Worsley Hall and parts of Pemberton and Poolstock. To see if you are one of our constituents, please see the map of our ward boundaries.\nIf you need any help, please contact us using the details below. Alternatively, you can attend one of our advice surgeries.\nCllr Mary Callaghan\nEmail: Mary.Callaghan@wigan.gov.uk\nMobile: 07359 422485\nEmail: M.Dawber1@wigan.gov.uk\nMobile: 07423 451661",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_12_enjoying-christmas-dinner-at-st-marks_html/content_82.html": "Today, we visited The Hub Café at St Mark’s Church for Christmas lunch.\nIt was lovely to catch up with the terrific café volunteers and local residents, and the roast dinner was delicious!\nA huge well done to the café team, who prepped, cooked and served many customers. We hope you have a great Christmas and a well-earned rest until the café reopens in the New Year. See you soon!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_05_planned-road-closure-billinge-road_html/content_90.html": "Skip to main content\nPlanned Road Closure: Billinge Road\nPart of Billinge Road will be closed TODAY (Sunday 12th May) and next Sunday (19th May) from 08:00 to 18:00.\nThe closure is from its junction with Tunstall Lane to St Matthew’s Close, in order to carry out resurfacing works.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_06/content_114.html": "Wigan Council Launches Its Gardening Competition for Tenants! Announcements Environment and Outdoors Housing +\nImproving Road Safety on Ellesmere Road Community Resilience and Safety Pemberton Roads and Traffic Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_04_leafletting-around-norley-hall_html/content_283.html": "Great to be out this morning delivering election leaflets around the parts of Norley Hall in our ward!\nThis includes Thorburn Road, Devon Close, Wiltshire Place, Cornwall Place, School Way and part of Norley Hall Avenue.\nThank you to the residents who came over to chat with us! We have picked up some casework which we are now dealing with.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_08_terrific-tiem-attending-worsley-hall_html/content_250.html": "We had a terrific time at Worsley Hall Fun Day this afternoon! It was lovely to see so many members of the local community coming together to enjoy the day’s free sports activities, face painting, DJ, food and more!\nThere was also plenty of advice on hand from various Wigan Council teams, DIAS Domestic Violence Centre, Wigan Youth Zone and others.\n- Cllr Draper & Cllr Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_09_faded-sign-on-york-street-reported-it_html/content_288.html": "Faded Sign on York Street: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps ✅ Old and faded sign on York Street reported, and now replaced by the Network Management Team.💚 Let's keep Douglas Ward looking its best!- Cllr Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Trade%20Unions/content_45.html": "Visiting Montrose Hall Care Home in Worsley Hall Community Groups Health Trade Unions Welfare and Pensions Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_05_thank-you-for-your-support_html/content_240.html": "Thank You for your Support! Get link Facebook X Pinterest Email Other Apps To all the constituents in Douglas Ward who cast their vote for us, we want to say a HUGE thank you! We were elected with 82% of the vote!- Cllr. Draper, Cllr. Callaghan & Cllr. Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_05/content_50.html": "Help Us to Combat Off-Road Bike Activity in our Area! Announcements Community Resilience and Safety +\nNew Defib Installed at St James' Church Brighter Borough Funding Community Resilience and Safety Health Poolstock +\nAttending More Than Words' Art Exhibition at The Turnpike Gallery Community Groups Culture Wigan Pier Quarter +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_planting-project-to-commence-on-enfield_html/content_289.html": "Huge congratulations to Pemberton Green Spaces for securing funding from the Greater Manchester Environment Fund for their planting project on Enfield Street!\nThe Enfield Street project will be improving the greenery in front of Procare on Enfield Industrial Estate and the car park opposite. This will be a community project that will enhance the area for the benefit of people and pollinators.\nWhy not join them? The group will use their monthly events to plant and care for the area in stages. It's a great opportunity to meet like-minded people, get hands on with nature (good for the old mental health!) and have the joy of helping make our community greener and more beautiful. View more info on their page!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_waste-amnesty-week-begins_html/content_98.html": "It was fantastic to be out this morning seeing Wigan Council’s Waste Amnesty Programme in action on Douglas Ward!\nRemember, if you still need to get rid of waste, the team will return to Newtown Working Men's Club on Thursday from 10am - 2pm!\nDon’t forget: if you couldn’t make it to the waste collection this week, you can still book a FREE bulky waste collection at the following link: Bulky waste and larger household items (wigan.gov.uk).\nA huge thank you to all the staff from Environmental Services and Street Scene for your hard work. It was lovely to speak to you all!\n- Cllr. Pat Draper & Cllr. Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_01_visiting-highfield-gardens-crown-green_html/content_48.html": "This afternoon, we had a wonderful time meeting up with Highfield Gardens Crown Green Bowling Club, based off Enfield Street.\nJoined by our fantastic Community Capacity Officer, Julie Clarke, we discussed funding avenues for the club in the year ahead.\nWe also discussed ways in which the Council can help with maintenance issues and upkeep of the grounds, which we will be following up.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_supporting-junior-doctors-on-strike_html/content_28.html": "It was brilliant to be out this morning supporting the British Medical Association Junior Doctors picket line at Wigan Infirmary!\nSolidarity with local junior doctors and ALL junior doctors across the country who are fighting for full pay restoration now.\nJust as we supported striking NHS ancillary workers in 2018, we will always stand up for our NHS and its amazing staff.\nJunior doctors have experienced a cut of more than 25% to their salaries since 2008/09. We clapped for them during the Covid-19 pandemic; now let’s pay them properly!\n- Cllr. Pat Draper & Cllr. Matt Dawber",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_06_councillors-surgery-at-meadows-june-2023_html/content_173.html": "💬 Great to be back at The Meadows in Worsley Hall for this morning’s surgery!\n⏰ As a reminder, this takes place on the first Friday of the month, from 11am - 12pm. The centre is located at 110 Ridyard Street, WN5 9RQ.\n🤝 If you have any issues, please do come down or contact us using the details on our page!\n- Cllr. Pat Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_03_wishing-all-constituents-happy-easter_html/content_143.html": "Wishing All Constituents a Happy Easter! Get link Facebook X Pinterest Email Other Apps Sending joy and happiness to all our constituents who are celebrating this Easter Sunday. Happy Easter!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_councillors-surgery-at-meadows-family_html/content_181.html": "Great to be back at The Meadows Family Hub in Worsley Hall for this morning’s surgery.\nWe drew the raffle for last night’s Halloween Hamper. The winning ticket is so well done to the winner!\nAs a reminder, our surgery here takes place on the first Friday of the month, from 11am - 12pm.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07_fly-tipping-at-alexandra-park-reported_html/content_236.html": "Fly-tipping at Alexandra Park: Reported It, Fixed It! Get link Facebook X Pinterest Email Other Apps Last week, at Alexandra Park, we reported some fly-tipping which has now been removed. Thank you to the Streetscene Team! We’ve also asked for the bushes around the car park to be trimmed back.- Cllr. Matt Dawber & Cllr. Pat Draper",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk/content_1.html": "Your local Labour Councillors for Newtown, Wigan Pier Quarter, Worsley Hall and parts of Pemberton & Poolstock.\nYour local Labour Councillors for Newtown, Wigan Pier Quarter, Worsley Hall and parts of Pemberton & Poolstock.\n- Get link\n- X\n- Other Apps",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_07_upcoming-worsley-hall-community-fun-day_html/content_154.html": "𝗪𝗢𝗥𝗦𝗟𝗘𝗬 𝗛𝗔𝗟𝗟 𝗖𝗢𝗠𝗠𝗨𝗡𝗜𝗧𝗬 𝗙𝗨𝗡 𝗗𝗔𝗬\nJoin us for a fun-filled afternoon with sports activities, face painting, DJ, food, stalls and much more!\nFor more info, contact Wigan Council’s Tenant Voice and Engagement Team at TVAET@wigan.gov.uk or call 01942 486645!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11_white-ribbon-day-starting-16-days-of_html/content_116.html": "Today marks White Ribbon Day and the start of 16 days of action to end domestic abuse\nLove is not abuse - throughout this period and beyond, key information will be shared, raising awareness of domestic abuse and its many forms, as well as highlighting the borough-wide support available to those affected.\nIf you or someone you know is affected by domestic abuse, DIAS Domestic Violence Centre is here to help\nCall the helpline on: 01942 311365\nVisit the drop-in sessions:\nDias domestic violence centre - Rodney House, King Street, Wigan, WN1 1BT\nWell Women Centre - The Old Court House, 14 Walmesley Road, Leigh, WN7 1YE\nMonday, Tuesday, Thursday\n8am - 3pm\nTo find out more, visit: wigan.gov.uk/domesticabuse\nThe Council's website has a “leave website” button so you can safely leave the site\nLove is not abuse - throughout this period and beyond, key information will be shared, raising awareness of domestic abuse and its many forms, as well as highlighting the borough-wide support available to those affected.\nIf you or someone you know is affected by domestic abuse, DIAS Domestic Violence Centre is here to help\nCall the helpline on: 01942 311365\nVisit the drop-in sessions:\nDias domestic violence centre - Rodney House, King Street, Wigan, WN1 1BT\nWell Women Centre - The Old Court House, 14 Walmesley Road, Leigh, WN7 1YE\nMonday, Tuesday, Thursday\n8am - 3pm\nTo find out more, visit: wigan.gov.uk/domesticabuse\nThe Council's website has a “leave website” button so you can safely leave the site",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_10_another-eleven-bags-of-litter-collected_html/content_32.html": "🚮 Yesterday, we returned to the railway tunnel going from Prescott St to York St to do some more litter-picking.\n1️⃣1️⃣ We collected ANOTHER 11 bags of waste, along with some fly-tipped items, and have asked if the Council can clear up some more difficult to reach areas.\n💚 We have also requested that waste bins are installed in this location to prevent litter, and will continue to work to keep our ward clean and tidy!\n#KeepItClean",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Community%20Resilience%20and%20Safety/content_16.html": "Improving Road Safety on Busy Newtown Street Community Resilience and Safety Newtown Roads and Traffic +\nPublic Space Protection Order (PSPO) Consultation – Car Cruises Announcements Community Resilience and Safety Roads and Traffic +\nWhite Ribbon Day, Starting 16 Days of Action to End Domestic Abuse Announcements Community Resilience and Safety +\nDrive-Around of the Ward and Collecting Our Final Five Bags of Litter from Prescott Street Community Resilience and Safety Environment and Outdoors Fly-tipping and Litter Wigan Pier Quarter +\nTaking Part in an Estate Inspection Around Laithwaite Road Community Resilience and Safety Environment and Outdoors Housing Worsley Hall +\nAttending the Festival of Hope on World Mental Health Day Community Resilience and Safety Health Wigan Pier Quarter +\nRailings Re-Installed on Sherwood Drive, Improving Safety Community Resilience and Safety Roads and Traffic Worsley Hall +\nAttending the Estate Inspection of Worsley Hall Central Community Resilience and Safety Environment and Outdoors Fly-tipping and Litter Housing Worsley Hall +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_06_new-road-markings-at-poolstock_html/content_211.html": "Fantastic to see the freshly re-painted road markings at the roundabout on Swan Meadow Road / Waterside Drive in Poolstock!\nThe roundabout was originally implemented following me campaigning along with local residents to slow down vehicles and improve road safety, but recently the markings had worn away.\nA big thank you to Wigan Council’s Highways Team who have done a great job re-marking them.",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2023_07_out-again-supporting-rmts-campaign-to_html/content_202.html": "Skip to main content\nOut Again Supporting the RMT's Campaign to #SaveOurTicketOffices\nThis morning, as the Douglas Ward Councillors, we were proud to stand alongside our friends in the RMT as they continue their fight to #SaveOurTicketOffices from closure.\nAgain, there were huge levels of support from members of the public who want our railways to remain safe and accessible for all!",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_2024_11/content_119.html": "Presenting Awards at More Than Words' Annual Celebration Ball Community Groups Culture Wigan Pier Quarter +\nWhite Ribbon Day, Starting 16 Days of Action to End Domestic Abuse Announcements Community Resilience and Safety +",
  "https_www_douglaslabourcllrs_co_uk_/https_www_douglaslabourcllrs_co_uk_search_label_Local%20Election%202024/content_74.html": "Another Productive Day Talking to Residents around Pemberton Advice Surgeries Local Election 2024 Pemberton +\nWigan Labour Group Continues to Support the WASPI Campaign! Local Election 2024 Welfare and Pensions +"
}