{
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_green-party-manifesto-2024/content_12.html": "And here it is – our Green Party Manifesto launching today Wednesday 12th June 2024 at 12pm in anticipation of the UK General Election to be held on Thursday 4th July 2024.\nPlease:\n- Make sure you have registered to vote\n- Make sure you have Voter ID\n- Read our Green Party Manifesto – CLICK HERE -> https://greenparty.org.uk/about/our-manifesto/\n- Vote Green on Thursday July 4th 2024",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_give-peas-a-chance/content_7.html": "What colour are peas…!? Green of course..\nAnd we would like you to consider voting GREEN.\nOther parties are using tactical voting sites to influence your vote.\nAccording to the latest poll from ‘Best for Britain’ on 15th June 2024 Emma is a mere 9.7% behind the Conservative candidate, within touching distance of being a Green MP and we’ve gained 10% of local votes in the past 2 weeks..\nSUFFOLK IS GOING GREEN – let’s take this opportunity to show we mean business. With 8 excellent Green Candidates standing in the County led by Adrian Ramsay, the joint party leader standing in Waveney Valley, the chances are that there will be several Green MP’s in Suffolk. In Mid Suffolk we already have the only Green District Council in the northern hemisphere and several more councils are likely to turn Green at the next local election.\nThe Green Party have always had a big following but without Proportional Representation they have never been fairly represented in Parliament. This needs to change. With the very evident effects of climate change and the dire need for political reform the party has now grown sufficiently to win elections even under a First Past the Post system.\nSuffolk can lead the way.\nWhen Jo Churchill, the incumbent MP, decided to withdraw from being re-elected, the field was left WIDE open to elect a brand new MP. A fantastic opportunity, due to the extreme lack of confidence in the Conservative Party currently, to elect a non Conservative MP which is a potential moment in history, for this area has never had anything but a Conservative MP despite the majority of voters not voting Conservative.\nAs both the Tory and the Labour candidates were brought into the constituency at the very last moment, everyone is now under election spending limits. The limit for this constituency is about £9000.\nAlthough the Green spend will still be much less than that and as you may have noticed we are concentrating on a primarily digital campaign to make the best and most ecological use of our small budget.\nEveryone agrees that the Labour party will win this election with a sizeable majority. It will be important that someone holds them to account. The Bury St Edmunds and Stowmarket Constituency represents such a chance. Emma is standing for parliament in order to give a voice to the people of Suffolk and to stand up for nature, she will challenge Labour to the benefit of the people and places in her constituency.\nLet’s give Emma and the Green Party the chance to show how well they can represent you, your constituency and the nation on the 4th July 2024. #VoteGreen2024\nTo hear more about Emma’s views and Green Party policy, follow our blog.\nTo read the Green Party Manifesto for the UK General election follow this link\nTo donate to MidSuffolk Green Party or find out more about the candidates in our neighbouring Constituencies click here",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_green-party-launch-in-east-anglia/content_19.html": "This weekend the Green Party launched their General Election Campaign in East Anglia. Supporters gathered in Diss in Suffolk on Saturday led by Co-Party leader Adrian Ramsay, who is a candidate for the newly created Waveney Valley seat. He gave an inspiring speech some of which you can watch here via the ITV coverage below.\nMy constituency, the Bury St. Edmunds and Stowmarket Constituency is a new constituency created by a reassessment of the boundaries of the old Bury St. Edmunds Constituency in 2023. The old seat was held by a Conservative MP ever since its inception. This year, this General Election 2024, is a true opportunity for change, a moment where constituents could, for the first time in history, turn that blue seat GREEN by voting for myself, Emma Buckmaster and the Green Party on the 4th July 2024.\nThe full ITV article is available if you click here and a corresponding BBC article can be seen by clicking here.\nHOW CAN YOU HELP?\nREGISTER TO VOTE :- https://www.gov.uk/register-to-vote\nFUNDRAISE to fund leaflets for myself, Emma Buckmaster, for Bury St Edmunds and Stowmarket and Dr Dan Pratt to be MP for Central Suffolk and North Ipswich.\nDonate to support Dan and Emma’s campaigns: https://midsuffolk.greenparty.org.uk/donate/\nCONNECT You can connect with me on Facebook, Instagram and X (twitter)\nPlease do engage with our social media posts by liking, commenting and sharing to your networks",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_arts-culture-and-heritage-in-suffolk/content_18.html": "As a practicing artist I am really passionate about the value of art and culture in our society and I know the sector in this constituency very well.\nSuffolk is a culturally rich area and the arts enhance the lives of those of us who live here as well as playing an important part in the local economy. To give you an idea of the fiscal benefits, every £1 invested in the arts generates £7 in local business. For example if someone attends a Theatre Royal performance they will probably eat at a local restaurant, may stay in a hotel and visit other local attractions as well. The restaurants and hotels then attract other visitors and the town thrives. The Culture and Creative Industries generate £272m in the East Anglian region every year! This is the 4th highest of any sector and they create over 7,000 jobs – see more stats at the end of this article.\nThe cultural benefits are not limited to the wonderful performances and exhibitions provided by the sector. What happens behind the scenes in the form of outreach, is possibly more important. The Theatre Royal has run some amazing outreach schemes for local children. As a school governor at Great Barton CE Primary Academy I have seen the impact of the collaborative projects that the children have done with the Theatre Royal. I particularly noticed after covid that it really helped children who had lost confidence socially to take part in a theatre project and to actually perform on the stage in Bury St Edmunds. I don’t think that they will ever forget that!\nThe Government’s All-Party Parliamentary Report into Arts, Health & Wellbeing found that 83% of people who engaged with culture went on to enjoy greater well being and 77% of people who engaged with culture went on to enjoy more physical activity. Locally in Suffolk the culture sector supports 24,493 children and young people and 76,516 vulnerable people each year, through community engagement work. Arts and Culture are low cost and preventative – if citizens do not engage with arts and culture they are less likely to live active/healthy lifestyles and more likely to access NHS or other statutory care services – which are vastly more expensive.\nMy personal involvement in the sector is as a printmaker and ceramicist. I was a Trustee at Gainsborough’s House and Chair of the Printworkshop. I have personally taken part in outreach work and have seen the benefits. I was instrumental in organising the campaign to fight the Arts Funding Cuts proposed by the County Council. Whilst they agreed not to cut the funding they are still proposing a very damaging cut to core funding for the Theatre Royal and the Food Museum. I continue to oppose and fight these cuts.\nTogether with Owen Calvert Lyons of the Theatre Royal I organised a meeting between the Leaders of the Culture Sector in Suffolk and the eight Suffolk Green Party Parliamentary Candidates. It was very helpful, below I attach the briefing paper from which I have drawn for my statistics.\nGreen MPs will push for:\n- A £5bn investment to support community sports, arts and culture.\n- Keeping local sports facilities, museums, theatres, libraries and art galleries open and thriving.\n- An end to VAT on cultural activities, lowering the prices of everything from museum tickets to gigs in local pubs and making these more accessible.\nhttps://greenparty.org.uk/about/our-manifesto/arts-sports-and-culture-for-all/\nSocial Benefit\n- Collectively, our organisations support 24,493 children and young people and 76,516 vulnerable people each year, through our community engagement work.\n*New Anglia LEP Cultural Evidence report April 2021 Evidence Report\n- The Government’s All-Party Parliamentary Report into Arts, Health & Wellbeing found that:\n– 77% of people who engaged with culture went on to enjoy more physical activity\n– 83% of people who engaged with culture went on to enjoy greater well being\n- Arts and Culture are low cost and preventative – if citizens do not engage with arts and culture they are less likely to live active/healthy lifestyles and more likely to access NHS or other statutory care services – which are vastly more expensive.\nEconomic Impact\n- Culture is a major growth area. The Creative Industries contribute £115bn to the UK economy (2019)\n- The Culture and Creative Industries generate £272m in the East Anglian region every year! *New Anglia LEP Cultural Evidence report April 2021 Evidence Report\nFrom SCC’s 2022 Report:\nArts & Culture\nThe arts organisations that the Council invests in attract over £2.8 million of national\ninvestment from the Arts Council, over £400k from Trusts and Foundations, £300k from\nPhilanthropy and earn over £4.5 million. For every £1 that the Council invested in these\norganisations in 2019-20 attracted £11.78 from national public funding, charities and\nphilanthropists.\nThese organisations also deliver a significant social return, offering access to culture for all\ncorners of our communities – from the most vulnerable, to the most socially isolated, from\nthose with access problems and disabilities, to those with mental health issues, from outreach\nwork with children in our schools to workshops specifically for adults with dementia.\nIt is important to recognise that the cultural scene in Suffolk is not just the organisations the\nCouncil supports financially, these organisations work together and collaborate. The Norfolk\nand Suffolk Culture Board works to ensure that the sector is regionally efficient and effective.\nThey have recently, with support from Arts Council and LEP, commissioned an economic\nimpact study that shows that the cultural sector of Norfolk and Suffolk:\n- Delivers over 7,000 jobs\n- Has seen employment grow 24% in last 5 years (2019)\n- Generates £272 million in GVA per annum (the 4th highest of any sector)\n- Is made up of over 1,250 businesses\n- Is dominated by micro business with 95% having fewer than 10 employees. This is\nhigher than the national average.\n- Average full-time workers earn £26,700 – 16% more than the average for the rest of\nthe economy\n- Participation levels have grown from 2005/6 to 2018/19: in the Arts (+7%), Heritage\n(+11%) and Museums (+ 22%).",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_category_latest/content_6.html": "As a practicing artist I am really passionate about the value of art and culture in our society and I know the sector in this constituency very well. Suffolk is a culturally rich area and the arts enhance the lives of those of us who live here as well as playing an important part in the local economy. To give … Read More\nWhat is biodiversity loss!?\nThis is one of those phrases that is being tossed about in election speeches without much explanation. What does it really mean and who does it actually affect? Simply put it means that there are significantly less different types of insects, wild flowers and other species than there used to be. It is true that some species are thriving but … Read More\nThe Future of Farming\nYou may well ask me; what do you know about farming? The answer is that 41 years ago I married a farmer, so quite a lot. I certainly know what long hours they work. I am not brilliant on a tractor but I did do the farm accounts so I know that the hours worked do not relate to the … Read More\nThe Value of Nature\nYesterday’s inspiring Restore Nature Now march saw 350 environmental groups from across the UK come together to put pressure on UK politicians to take leadership on Nature, both locally and globally. More than 60,000 people turned up to show their support. It would be hard to find someone who doesn’t care about Nature in any form at all. The air … Read More\nBee the Change\n“Be the change you wish to see in the world” Gandhi is quoted as saying, so what is YOUR vision of the future? Do you want to remain stuck in the Conservative doldrum; with a continuously rising cost of living, unaffordable housing, the dental desert, school funding cuts, a split society where the rich become richer whilst the poor and … Read More\nGive Peas a Chance\nWhat colour are peas…!? Green of course.. And we would like you to consider voting GREEN. Other parties are using tactical voting sites to influence your vote. According to the latest poll from ‘Best for Britain’ on 15th June 2024 Emma is a mere 9.7% behind the Conservative candidate, within touching distance of being a Green MP and we’ve … Read More\nMeet Emma and discuss the issues important to you\nMeet Emma Buckmaster at the following upcoming events: Freedom Cafe – Wednesday 26th June 10am – 12pm Great Barton Free Church, Mill Rd, Great Barton, Bury Saint Edmunds IP31 2RU Old School Cafe – Tuesday 25th June 10 – 11am St Johns Centre, St John’s St, Bury Saint Edmunds IP33 1SJ Climate and Nature Hustings – Tuesday 25th June … Read More\nGreen Party Manifesto 2024\nAnd here it is – our Green Party Manifesto launching today Wednesday 12th June 2024 at 12pm in anticipation of the UK General Election to be held on Thursday 4th July 2024. Please: Make sure you have registered to vote Make sure you have Voter ID Read our Green Party Manifesto – CLICK HERE -> https://greenparty.org.uk/about/our-manifesto/ Vote Green on Thursday … Read More\nGreen Party launch in East Anglia – Can we make history?\nThis weekend the Green Party launched their General Election Campaign in East Anglia. Supporters gathered in Diss in Suffolk on Saturday led by Co-Party leader Adrian Ramsay, who is a candidate for the newly created Waveney Valley seat. He gave an inspiring speech some of which you can watch here via the ITV coverage below. My constituency, the Bury St. … Read More\nInterview With East Anglian Daily Times March 2024\nBy Becca Sproston@becca_sproston, Reporter An artist and grandmother, who only got into politics a few years ago, has been selected as the Green Party’s parliamentary candidate for Bury St Edmunds and Stowmarket. Emma Buckmaster will contest the newly-created seat at the next general election. After reading economics at university, Mrs Buckmaster trained as an analyst in London, before marrying her … Read More\n- Page 1 of 2\n- 1\n- 2",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_news/content_2.html": "As a practicing artist I am really passionate about the value of art and culture in our society and I know the sector in this constituency very well. Suffolk is a culturally rich area and the arts enhance the lives of those of us who live here as well as playing an important part in the local economy. To give … Read More\nWhat is biodiversity loss!?\nThis is one of those phrases that is being tossed about in election speeches without much explanation. What does it really mean and who does it actually affect? Simply put it means that there are significantly less different types of insects, wild flowers and other species than there used to be. It is true that some species are thriving but … Read More\nThe Future of Farming\nYou may well ask me; what do you know about farming? The answer is that 41 years ago I married a farmer, so quite a lot. I certainly know what long hours they work. I am not brilliant on a tractor but I did do the farm accounts so I know that the hours worked do not relate to the … Read More\nThe Value of Nature\nYesterday’s inspiring Restore Nature Now march saw 350 environmental groups from across the UK come together to put pressure on UK politicians to take leadership on Nature, both locally and globally. More than 60,000 people turned up to show their support. It would be hard to find someone who doesn’t care about Nature in any form at all. The air … Read More\nBee the Change\n“Be the change you wish to see in the world” Gandhi is quoted as saying, so what is YOUR vision of the future? Do you want to remain stuck in the Conservative doldrum; with a continuously rising cost of living, unaffordable housing, the dental desert, school funding cuts, a split society where the rich become richer whilst the poor and … Read More\nGive Peas a Chance\nWhat colour are peas…!? Green of course.. And we would like you to consider voting GREEN. Other parties are using tactical voting sites to influence your vote. According to the latest poll from ‘Best for Britain’ on 15th June 2024 Emma is a mere 9.7% behind the Conservative candidate, within touching distance of being a Green MP and we’ve … Read More\nMeet Emma and discuss the issues important to you\nMeet Emma Buckmaster at the following upcoming events: Freedom Cafe – Wednesday 26th June 10am – 12pm Great Barton Free Church, Mill Rd, Great Barton, Bury Saint Edmunds IP31 2RU Old School Cafe – Tuesday 25th June 10 – 11am St Johns Centre, St John’s St, Bury Saint Edmunds IP33 1SJ Climate and Nature Hustings – Tuesday 25th June … Read More\nGreen Party Manifesto 2024\nAnd here it is – our Green Party Manifesto launching today Wednesday 12th June 2024 at 12pm in anticipation of the UK General Election to be held on Thursday 4th July 2024. Please: Make sure you have registered to vote Make sure you have Voter ID Read our Green Party Manifesto – CLICK HERE -> https://greenparty.org.uk/about/our-manifesto/ Vote Green on Thursday … Read More\nGreen Party launch in East Anglia – Can we make history?\nThis weekend the Green Party launched their General Election Campaign in East Anglia. Supporters gathered in Diss in Suffolk on Saturday led by Co-Party leader Adrian Ramsay, who is a candidate for the newly created Waveney Valley seat. He gave an inspiring speech some of which you can watch here via the ITV coverage below. My constituency, the Bury St. … Read More\nInterview With East Anglian Daily Times March 2024\nBy Becca Sproston@becca_sproston, Reporter An artist and grandmother, who only got into politics a few years ago, has been selected as the Green Party’s parliamentary candidate for Bury St Edmunds and Stowmarket. Emma Buckmaster will contest the newly-created seat at the next general election. After reading economics at university, Mrs Buckmaster trained as an analyst in London, before marrying her … Read More\n- Page 1 of 2\n- 1\n- 2",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_bee-the-change/content_16.html": "“Be the change you wish to see in the world” Gandhi is quoted as saying, so what is YOUR vision of the future?\nDo you want to remain stuck in the Conservative doldrum; with a continuously rising cost of living, unaffordable housing, the dental desert, school funding cuts, a split society where the rich become richer whilst the poor and middle classes struggle, more pesticide usage, where there are constant cuts to the arts, plans to privatise the NHS, create more airports ( for the 15% who take 70% of all flights) with more pollution, where there is little to no regard for the environment, an incessant loss of biodiversity and damage to the biosphere – a place where nothing seems to be working and we are simply sinking further or ….\nCan you imagine a better, more sustainable, equitable future?\nOne where we invest into what matters most every day, where we live, what we eat, how we work, how we travel, our health, the environment we live in – our homes and the ecosystem which supports us, education & jobs, transport systems, arts and culture.\nWe have to have faith in our vision and ability to create the world we would like to see.\nOne of THE most important ways we can achieve the future we so desire is to BE that change – to look after ourselves and the area around us, to join together to create the future we want together starting with one small act with great impact – using your right to VOTE, to ELECT someone who will represent you, where you live and the world you want.\nBe the bees!\nWe have come to understand how important BEEs are to our lives, how they maintain the biodiversity we need to be able to thrive – they are our canaries in the mines and their declining numbers have sounded the alarm bell for the loss of biodiversity.\nOur young people find biodiversity loss hard to recognise because they have never seen the insects that used to cover our car windscreens and fly in the windows at night. We have lost 70% of our insects in the last 25 years and we can’t risk losing any more.\nVote for bees, vote for biodiversity and vote for the future of the Suffolk countryside. Vote Green. We get it.",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_restore-nature-protest-28-9-23/content_17.html": "I joined Chris Packham and 80 different NGO’s in Westminster to campaign for Nature.\nA pay rise for nature. Farmers need greater support to help nature and manage over 70% of UK land – we want to see double the current budget for nature-friendly farming.\nMake polluters pay. Big business contributes to nature’s decline and should contribute to nature’s recovery.\nA Public Nature Estate. Just 3% of the land and 8% of English waters are protected for nature. We want rapid action to expand and improve protected areas.\nA National Nature Service. A National Nature Service would create thousands of green jobs as well as a healthier society.\nA right to a healthy environment. Limited access to nature and pollution in the air and water affects everyone’s health. An Environmental Rights Bill would drive better decisions for nature and improve public health.",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_election-predictions-2024/content_11.html": "Emma Buckmaster\nNavigation\nHome\nNews\nSupport us\nHome\nNews\nSupport us\nNews\nHome\nNews\nElection Predictions 2024\nElection Predictions 2024\nCJ\n30th January 2024\nLatest updates\nReplant",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_letter-to-the-financial-times/content_8.html": "Unusual career changes – courtesy of that FT link\nFrom Emma Buckmaster, Green Party Prospective Parliamentary Candidate for Bury St Edmunds and Stowmarket, Suffolk, UK\nI found my first career through the Financial Times ,when I finished my Degree in Economics and went to work in the City. Later as an artist they ran a feature on my work in How to Spend It. Now as a Prospective Parliamentary Candidate I am once again indebted to the FT for its excellent journalism.",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_privacy/content_3.html": "Who we are\nThe website emmabuckmastergreenparty.org was created by Emma Jell and Chris Joseph on behalf of Emma Buckmaster c/o Bevants Farm, Combs, Stowmarket, Suffolk. For further information please email campaign [at] emmabuckmastergreenparty.org .\nComments\nIf visitors leave comments on the site we collect the data shown in the comments form, and also the visitor’s IP address and browser user agent string to help spam detection.\nAn anonymized string created from your email address (also called a hash) may be provided to the Gravatar service to see if you are using it. After approval of your comment, your profile picture is visible to the public in the context of your comment.\nCookies\nIf you leave a comment on our site you may opt-in to saving your name, email address and website in cookies. These are for your convenience so that you do not have to fill in your details again when you leave another comment. These cookies will last for one year.\nIf you visit our login page, we will set a temporary cookie to determine if your browser accepts cookies. This cookie contains no personal data and is discarded when you close your browser.\nWhen you log in, we will also set up several cookies to save your login information and your screen display choices. Login cookies last for two days, and screen options cookies last for a year. If you select “Remember Me”, your login will persist for two weeks. If you log out of your account, the login cookies will be removed.\nWe use cookies to provide anonymised tracking data to Google Analytics, which allows us to see how our website is being used and make improvements to the website in the future. This tracking data includes standard internet log information and details of visitor behaviour patterns.\nEmbedded content from other websites\nThis site may include embedded content (e.g. videos, podcasts, social media feeds etc.). Embedded content from other websites behaves in the exact same way as if the visitor has visited the other website.\nThese websites may collect data about you, use cookies, embed additional third-party tracking, and monitor your interaction with that embedded content, including tracking your interaction with the embedded content if you have an account and are logged in to that website.\nWho we share your data with\nWe do not share your data with anyone unless explicitly required to do so by a lawful request from legal authorities.\nHow long we retain your data\nIf you leave a comment, the comment and its metadata are retained indefinitely. This is so we can recognize and approve any follow-up comments automatically instead of holding them in a moderation queue.\nFor users that register on the website we also store the personal information that they provide in their user profile. All users can see, edit, or delete their personal information at any time (except they cannot change their username). Website administrators can also see and edit that information.\nWhat rights you have over your data\nIf you have an account on this site, or have left comments, you can request to receive a file of the personal data we hold about you, including any data you have provided to us. You can also request that we erase any personal data we hold about you. This does not include any data we are obliged to keep for administrative, legal, or security purposes.\nWhere your data is sent\nVisitor comments and a submitted mailing list email address may be checked through an automated spam detection service.\nMy mailing list\nIf you sign up to the mailing list you are agreeing to receive news from me by email. You can unsubscribe at any time using the link found in the footer of any mailing list email that you receive. The mailing list service is provided by MailChimp.",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_category_latest_page_2/content_21.html": "Fighting Arts Funding Cuts in Suffolk\nI have been fighting the arts funding cuts in the County. Suffolk County Council announced in January 2024 that they proposed to cut all funding to the arts sector by 100%. I know just how important the arts are to both the economy in the County and to our wellbeing. For every £ invested in the arts, £7 is returned. … Read More\nLetter to the Financial Times\nUnusual career changes – courtesy of that FT link From Emma Buckmaster, Green Party Prospective Parliamentary Candidate for Bury St Edmunds and Stowmarket, Suffolk, UK I found my first career through the Financial Times ,when I finished my Degree in Economics and went to work in the City. Later as an artist they ran a feature on my work in How to Spend … Read More\nSuffolk County Council Cuts Arts Funding\nTHE GUARDIAN – Thu 4 Jan 2024 “Arts organisations have called on Suffolk county council (SCC) to reconsider a proposed 100% cut to its culture budget. As part of its plans to make £64.7m in savings over two years, the council announced on Wednesday that it will stop core funding of £500,000 to art and museum sector organisations from April … Read More\nRestore Nature Protest. 28.9.23\nI joined Chris Packham and 80 different NGO’s in Westminster to campaign for Nature. A pay rise for nature. Farmers need greater support to help nature and manage over 70% of UK land – we want to see double the current budget for nature-friendly farming. Make polluters pay. Big business contributes to nature’s decline and should contribute to nature’s recovery. A Public … Read More\n- Page 2 of 2\n- 1\n- 2",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_meet-emma-and-discuss-the-issues-important-to-you/content_15.html": "Meet Emma Buckmaster at the following upcoming events:\nFreedom Cafe – Wednesday 26th June 10am – 12pm\nGreat Barton Free Church, Mill Rd, Great Barton, Bury Saint Edmunds IP31 2RU\nOld School Cafe – Tuesday 25th June 10 – 11am\nSt Johns Centre, St John’s St, Bury Saint Edmunds IP33 1SJ\nClimate and Nature Hustings – Tuesday 25th June 7-9pm\nThe Friends Meeting House, St John’s Street, Bury St Edmunds\nStowmarket market place Saturday 10-11\nAngel Hill Bury St Edmunds – Saturday 29 June 2-3pm\nCoffee caravan Rattlesden – Tuesday 2nd 10.30 – 11.30\nFeel free to contact us with suggestions of events you would like to invite Emma to attend or places she is welcome to visit and canvas. Email: emma.buckmaster@votegreen.uk",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_suffolk-county-council-cuts-arts-funding/content_22.html": "THE GUARDIAN – Thu 4 Jan 2024\n“Arts organisations have called on Suffolk county council (SCC) to reconsider a proposed 100% cut to its culture budget. As part of its plans to make £64.7m in savings over two years, the council announced on Wednesday that it will stop core funding of £500,000 to art and museum sector organisations from April 2025. A shared statement from local organisations affected by the decision said the cut would make an “extremely modest difference” to the council’s overall finances but have a “huge impact” on communities across the county. Emma Buckmaster, Green party prospective parliamentary candidate for Bury St Edmunds and Stowmarket, said it was “a shocking proposal… that will do lasting damage to the arts in Suffolk”. Full details of the council’s financial plans – which include a 4.99% increase in council tax – will be presented to its scrutiny committee on 11 January.”\nChris Wiegand, Stage editor\nRead the full article in The Guardian",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_future-of-farming/content_20.html": "You may well ask me; what do you know about farming? The answer is that 41 years ago I married a farmer, so quite a lot. I certainly know what long hours they work. I am not brilliant on a tractor but I did do the farm accounts so I know that the hours worked do not relate to the return on investment.\nFor many years our farmers have relied on subsidies. After leaving the EU the government set about redesigning the agricultural subsidy system CAP (Common Agricultural Policy).\nThey declared that from now on ‘Public money would be for Public good’ and that the way forward would be called ELMS Environmental Land Management Scheme which would be phased in over 5 years with subsidies being reduced each year. But the new scheme has been complex and the payments were ridiculously small. We looked at it and decided that the income we would get was not worth the time that it would take me to do the paperwork and the restrictions that it would place on us.\nThe government finally offered us a viable payment this year. Like most farmers we use a land agent to check our figures and advise us. We had our annual meeting and agreed the plan for the next year. Two days later the government changed the policy yet again and reduced the land that you could claim payments on dramatically. Nightmare.\nThis year has been particularly hard for farmers. The incessant rain has made crop establishment difficult. Low prices and Brexit complications have hit farmers badly and some have lost 70% of their income with little prospect of immediate improvement. The situation is untenable. Small family farms are gradually disappearing as young people turn their backs on agriculture. Certainly the future of farming is under threat along with the future of farmers.\nIt almost feels that we are asking farmers to do the impossible. We want them to provide the best food for us from the optimum soil and biodiversity, maintain our quintessential countryside, using no chemicals but we are not prepared to help them make that transition from a more intensive chemical based agricultural approach to more sustainable methods which are healthier for soil, plants, bees, birds and us.\nIt’s no wonder that the situation has caused riots and blockades across Europe and causes enormous strain on mental health. Worryingly, every week, three people in the UK farming and agricultural industry die by suicide and the suicide rate for male farm workers is three times the male national average.\nWhen the consumer talks about farming the point that everyone comes back to is that we need to grow our own food in this country. Of course, it is true that it is better if we grow good food here. We should be able to achieve that and look after the environment as well. Biodiversity and soil health are critical when growing any crop.\nBy supporting farmers to work sustainably, we could turn around the desperate loss of biodiversity that we are seeing here. We can do this without losing our reputation as the ‘bread basket of England’. The Farming and Wildlife Advisory Group FWAG are already encouraging and advising farmers but without sufficient financial support but it is a step too far for many small farming businesses without the necessary financial support to implement changes.\nThe Green Party manifesto tries to pull together the connection between what we eat and farming and biodiversity to encourage farmers to be stewards of our rich agricultural lands so that they can produce healthy food for us to consume.\nListen to Ellie Chowns on the Farming programme on 28th June to hear how we plan to support agriculture and the environment.",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_what-is-biodiversity-loss/content_14.html": "This is one of those phrases that is being tossed about in election speeches without much explanation. What does it really mean and who does it actually affect?\nSimply put it means that there are significantly less different types of insects, wild flowers and other species than there used to be.\nIt is true that some species are thriving but overall the statistics are dramatic. The timeline or ‘baseline’ can be varied but the trajectory is still downward.\nWhy have I never noticed? I have to admit that I managed to go through much of my life without noticing the change myself. It was only during covid when I did an online course on wildflower identification for a series of paintings and began to join local plant survey groups that I realised what was happening. It was learning about this change and the implications for society that pushed me to become a more active member of the Green Party and ultimately to stand for Parliament.\nSuffolk is a rural county. Surely it doesn’t apply here?\nSadly Suffolk is one of the most badly affected areas in the country.\nBiodiversity loss is caused by many different things including climate change, housing developments and general pollution and these are all relevant here. However, Suffolk is also a very successful arable farming area, often referred to as the bread basket of England. As part of a farming family I know this sector well. These farmers are dedicated to producing food and they work on tight margins. Some years are more profitable than others and there is very little certainly in farming.\nHistorically the use of pesticides has been key to maintaining the very high yields that these farmers produce. Many of them are now becoming aware that this may have to change and they are looking at reducing in particular the use of insecticides. They are also being encouraged not to farm marginal land that requires more inputs for less gain and instead leave this land for nature to rejuvenate. The Green Party recognises that farmers will need increased financial support to change the way that they farm and to still produce food. It is important that this money is targeted so that it benefits the public and our environment.\nThere seem to be plenty of annoying insects!\nInsects don’t get very good press. They sting and bite us and get in our food. Do we really want more of them?\nIt does seem as if the particularly annoying insects are in plentiful supply. But some people might remember how dirty our windscreens used to get when we drove a car in the summer with all the insects splattered on the windscreen and how you could never leave the windows open and the lights on at night because you would summon an unwelcome invasion of creatures. For those of you who remember that, the evidence of change is there. Younger people have never seen that and so find the change harder to recognize.\nWhy do we need insects?\nInsects are a vital part of the food chain which ultimately supports human life.\nInsects play a critical role as pollinators. 1/3rd of our food requires pollinators in order to grow, for example, most fruit and vegetables.\nMany birds and other species are insectivorous and so their survival depends on eating insects.\nWithout insects, life on earth would collapse, millions of species would go extinct, and we would be surrounded by the carcases of dead animals.\nThe UK’s flying insect population has declined by as much as 60% in the last 20 years, a new study has revealed – > https://cdn.buglife.org.uk/2022/05/Bugs-Matter-2021-National-Report.pdf\nInvertebrates are critical to ecosystem functions and services. They pollinate most of the world’s crops, provide natural pest control services, and decompose organic matter and recycle nutrients into the soil. Without them we could not grow onions, cabbages, broccoli, chillies, most tomatoes, coffee, cocoa, most fruits, sunflowers, and rapeseed, and demand for synthetic fibres would surge because bees pollinate cotton and flax. Invertebrates underpin food chains, providing food for larger animals including birds, bats, reptiles, amphibians, fish and terrestrial mammals. Almost all birds eat insects, and many of those that eat seeds and other food as adults must feed insects to their young – it is thought to take 200,000 insects to raise a single swallow chick (Chapman et al., 2013). Without insects, life on earth would collapse, millions of species would go extinct, and we would be surrounded by the carcases of dead animals.\nThe Green Party is the only party to support action on Biodiversity – we want to protect and restore nature, Elected Greens will campaign to:\nIntroduce a new Rights of Nature Act, giving rights to nature itself.\nEnd the scandal of sewage pouring into our rivers and seas by taking the water companies back into public ownership.\nExtend people’s access to green space and waterways close to where they live with a new English Right to Roam Act.\nSet aside 30% of our land and seas by 2030 in which nature will receive the highest priority and protection.\nGreen MPs will also press for:\nAn immediate end to the emergency authorisation of bee-killing pesticides.\nA new Clean Air (Human Rights) Act, giving everyone the right to breathe clean air.",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_interview-with-east-anglian-daily-times-march-2024/content_9.html": "By Becca Sproston@becca_sproston, Reporter\nAn artist and grandmother, who only got into politics a few years ago, has been selected as the Green Party’s parliamentary candidate for Bury St Edmunds and Stowmarket. Emma Buckmaster will contest the newly-created seat at the next general election.\nAfter reading economics at university, Mrs Buckmaster trained as an analyst in London, before marrying her farmer husband and moving to Suffolk more than 40 years ago. It was through her artwork, which focuses on nature and has been displayed around the world, that Mrs Buckmaster became involved in the Green Party, with her growing concern about environmental issues facing the planet. She said: “People aren’t taking environmental issues seriously enough. I understand that it’s a difficult thing for people to grasp or even think about because it’s frightening, scientific, and complicated. And I don’t claim to understand all of it, but from what I do understand and what I see around me, I know we have to do something. It’s really for the next generation.”\nMrs Buckmaster vowed to work with farmers to enable positive environmental action. She said: “It is possible to bring change but you can only do that if you support farmers through it. You can’t expect them to work for nothing and you can’t expect people to pay too much for their food. And it’s not necessarily an easy political path and I’m afraid other parties are just ignoring the reality.”\nThe grandmother’s selection comes after the Greens took control of the Mid Suffolk district in last year’s local elections. She said: “I really think people have lost faith in politicians. “I hope that as someone who comes into politics without a career agenda, I can encourage people to vote. That’s the only way we can enact change. We are lucky in this country because we still have a democratic system and we still have the power to change things. “I think politicians have got to be more transparent, more genuine. In fact, we need less party politics. I don’t like seeing it in the councils, when a party has a huge majority and doesn’t listen to the opposition. “Again, this is part of the Green Party ethos – we must work together with other people and I think that’s really important.”\nMrs Buckmaster will likely face Conservative Jo Churchill, who currently holds the Bury St Edmunds seat, at the next general election.\n12th March 2024\nRead the full article in The East Anglian Daily Times Online",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_fighting-arts-funding-cuts-in-suffolk/content_10.html": "I have been fighting the arts funding cuts in the County.\nSuffolk County Council announced in January 2024 that they proposed to cut all funding to the arts sector by 100%. I know just how important the arts are to both the economy in the County and to our wellbeing. For every £ invested in the arts, £7 is returned. The nine arts organisations that the Council supports, spend the money that they recieve on outreach projects in the County. These benefit everyone but especially our children and those who could not normally take part. I know as a school governor just how much the children in my school benefitted from the work that they did with the Theatre Royal in Bury St Edmunds.\nI joined forces with Equity (the trade union for the perfoming arts) to oppose the plans. We produced a petition which was signed by almost 4000 people and organised a peaceful demonstration outside the Council meeting. I then addressed the Council Budget meeting in person.\nWE WON! The Council agreed with us and has reinstated the funding. Unfortunately they have decided to change the way that they allocated the funds and so we are still hoping for further dialogue on this.",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_the-value-of-nature/content_4.html": "Yesterday’s inspiring Restore Nature Now march saw 350 environmental groups from across the UK come together to put pressure on UK politicians to take leadership on Nature, both locally and globally. More than 60,000 people turned up to show their support.\nIt would be hard to find someone who doesn’t care about Nature in any form at all. The air we breathe, the food we eat, the paths we walk, the water we drink and bathe in, the beaches we enjoy, the mountains we climb – the ability to heat our homes and travel from A to B, everything is fundamentally provided by Nature.\nBut Nature, in all its potential abundance, is simply ignored by economists, there is a blind spot which perhaps they don’t wish to see. Can we afford for this to continue?\nCurrent economic theory came about because of societies’ need to account for resources, plan for the future, and exchange and allocate goods. It is therefore quite ironic that under traditional economics the very resources we rely on most heavily – those provided by the natural world – do not hold any economic value. To put it simply, economic thought has always taken for granted the supply of all things natural. Air, water, the existence of soil, plant growth, light and sunshine – these all hold a value of £0.00p.\nA vivid explanation of this can be seen in the devastation of the rainforests in South America where millions of acres – 1.4 billion trees – are destroyed every year for momentary gain. But how much did it actually cost to create those rainforests? How do we value the benefits they gave us? How can we measure the cost of replacing those millions of acres of trees, and how long will it take?\nThe total scale of destruction in the Amazon is huge. 13.2% of the original Amazon forest biome has been lost due to deforestation and other causes. This equates to more than 85 million hectares.\nWe know that the Amazon forest provides a significant role to the world in absorbing CO2; we know it is one of the areas with the most biodiversity in the world, home to thousands of species of animals, plants, insects and birds, not to mention the 40 million people who live within its shelter; but still we continue to destroy this amazing natural resource.\nNatural resources or natural capital, e.g. forests and oceans, are not taken into account when calculating the wealth of a nation, as they are assigned no inherent financial value. Our economic system is rigged towards valuing destruction; using free resources to generate wealth, rather than protecting the very resources from which we draw our wealth. Whether or not an ocean or a river is polluted or a thriving ecosystem counts for nothing economically. Of course this is completely illogical.\nPutting a value on Nature is not a new concept – it is one that has been slowly gaining ground over the past few decades as we have come to realise the impact of ignoring the pollution we create, the balance of ecosystems and our neglect in protecting vital resources. We have treated Nature as though it is free and limitless without considering what happens when it’s no longer there. In fact we have mismanaged our most precious assets, our fundamental capital upon which all other goods and services depend. We know we can do better.\nLaws to protect Nature have not been strong or wide ranging enough to be efficient at protecting Nature. Unfortunately there are too many forces who wish to exploit Nature – the free resource – for their own benefit, and our local and global lawmakers have not been able to fully stop this. There have been calls to include Ecocide (destruction of the natural environment by deliberate or negligent human action) as a 5th international crime against peace. 14 countries across the world have introduced Ecocide laws, but without international enforceability, given the global nature of the businesses responsible for destructive actions, it is not enough.\nA transformation of how we value Nature could be a key ally in promoting the protection of Nature. By giving Nature an economic value we can ensure its value becomes a part of every political and economic policy. Its value as a capital asset will provide protection of those assets and attract investment to maintain and grow the capital.\nWe also need to better reflect the value Nature contributes to our individual, social and cultural wellbeing in key political and economic decisions. We know green spaces make us happier and healthier, yet 10 million people in England live in areas with very limited access to green space, and at least 500 schools in the UK have less than 1,000m2 of outdoor space and nearly 30 have no outside space at all.\nChris Packham, who proposed the Restore Nature Now march, made his point very clearly that right now, as we choose who to vote for as our next political representatives, we have a huge opportunity to change the dynamic in Westminster, and across the world. The UK has always been a global thought leader, so how we chose to vote now can create REAL impact, real hope, real change.\nPeople are fed up with the lack of action from politicians to protect and improve nature, or to act on climate change. Restore Nature Now pointed to the following critical situations in the UK:\n- Pollution to air, water and soil\n- 1 in 6 British species are at risk of extinction\n- Lack of support to UK farmers who manage 70% of UK land\n- 3% of English land and 8% of waters are properly protected for nature and wildlife\n- Lack of fair and effective action on Climate Change\nAmongst other solutions Restore Nature Now are also calling for an Environmental Rights Bill which would drive better decisions for nature, improve public health and access to nature.\nI fully endorse the Restore Nature Now campaign and the Environmental Rights bill. Furthermore I strongly believe we can better use the current legal and economic systems we already have in place as a two pronged approach to solving our current local and global environmental crises. I would welcome international measures on Ecocide and a valuing of Nature which represents its true cost and value to us all. I feel this could fundamentally shift the political and economic powers into being able to implement real change.\nA Green Vote is a powerful step in the best direction to enable lawmakers and economists to restore and maintain our Natural World.\nWill you Vote Green on 4th July to show your support for the value of Nature to everyone? The Green Party are the only ones proposing an equivalent act of law.",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_news_page_2/content_5.html": "Fighting Arts Funding Cuts in Suffolk\nI have been fighting the arts funding cuts in the County. Suffolk County Council announced in January 2024 that they proposed to cut all funding to the arts sector by 100%. I know just how important the arts are to both the economy in the County and to our wellbeing. For every £ invested in the arts, £7 is returned. … Read More\nLetter to the Financial Times\nUnusual career changes – courtesy of that FT link From Emma Buckmaster, Green Party Prospective Parliamentary Candidate for Bury St Edmunds and Stowmarket, Suffolk, UK I found my first career through the Financial Times ,when I finished my Degree in Economics and went to work in the City. Later as an artist they ran a feature on my work in How to Spend … Read More\nSuffolk County Council Cuts Arts Funding\nTHE GUARDIAN – Thu 4 Jan 2024 “Arts organisations have called on Suffolk county council (SCC) to reconsider a proposed 100% cut to its culture budget. As part of its plans to make £64.7m in savings over two years, the council announced on Wednesday that it will stop core funding of £500,000 to art and museum sector organisations from April … Read More\nRestore Nature Protest. 28.9.23\nI joined Chris Packham and 80 different NGO’s in Westminster to campaign for Nature. A pay rise for nature. Farmers need greater support to help nature and manage over 70% of UK land – we want to see double the current budget for nature-friendly farming. Make polluters pay. Big business contributes to nature’s decline and should contribute to nature’s recovery. A Public … Read More\n- Page 2 of 2\n- 1\n- 2",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org_podcasts/content_13.html": "Emma Buckmaster will be standing as the Green Party Parliamentary Candidate for the new constituency of Bury St Edmunds and Stowmarket, continuing the work done by Helen Geake over the past three General Elections.\n- Emma has lived in Suffolk for over forty years. She initially trained and worked as an economist, but more recently has established a reputation as an environmental artist.\n- Emma understands the needs of rural communities. She has worked with small businesses and farmers and knows how important their contribution is to a thriving economy.\n- Food and farming are at the core of Emma’s campaign. She is very aware of challenges facing the farming sector as well as the environmentalists concerns about biodiversity loss and climate change.\nShe is also clear that housing and transport policies must focus on the needs of local people. Our new Green-led council in Mid Suffolk is leading the way in offering fair, green solutions that make life better for all – and she wants to bring these ideas to Parliament too.\n- Emma is keen to meet and talk to people in the constituency about what is important to them. As a local school governor, she is closely involved with educational issues, and she is especially keen to hear the views of the younger voters in the area.\nGet email updates from Emma\nThe information you provide here will not be shared or used for any other purpose. You may opt out of these updates at anytime by using the link provided on every email.\nPlease see my privacy policy for how I treat your data and additional information.",
  "https_emmabuckmastergreenparty_org_/https_emmabuckmastergreenparty_org/content_1.html": "Emma Buckmaster will be standing as the Green Party Parliamentary Candidate for the new constituency of Bury St Edmunds and Stowmarket, continuing the work done by Helen Geake over the past three General Elections.\n- Emma has lived in Suffolk for over forty years. She initially trained and worked as an economist, but more recently has established a reputation as an environmental artist.\n- Emma understands the needs of rural communities. She has worked with small businesses and farmers and knows how important their contribution is to a thriving economy.\n- Food and farming are at the core of Emma’s campaign. She is very aware of challenges facing the farming sector as well as the environmentalists concerns about biodiversity loss and climate change.\nShe is also clear that housing and transport policies must focus on the needs of local people. Our new Green-led council in Mid Suffolk is leading the way in offering fair, green solutions that make life better for all – and she wants to bring these ideas to Parliament too.\n- Emma is keen to meet and talk to people in the constituency about what is important to them. As a local school governor, she is closely involved with educational issues, and she is especially keen to hear the views of the younger voters in the area.\nGet email updates from Emma\nThe information you provide here will not be shared or used for any other purpose. You may opt out of these updates at anytime by using the link provided on every email.\nPlease see my privacy policy for how I treat your data and additional information."
}