{
  "https_www_clivegrunshaw_com_/https_www_clivegrunshaw_com_experience/content_4.html": "Clive’s Experience\nI am a working class person who has seen the devastation that the loss of the traditional Lancashire industries can have on communities. How some of our towns have not been able to adapt to the post-industrial world and how our young people are not given the hope and opportunity that we once were.\nThis doesn’t apply everywhere, we have some wonderful business leaders, and it is great to see how some businesses have been successful and how our Universities have progressed but these are the exception. Sadly we have seen a breakdown in the close knit working class communities that we were once known for. Our children need to move further away to find work and the family connections weaken. Those left behind are often the elderly and isolated or the young and angry.\nI may be expressing in terms of caricatures but in policing that is what you are mostly faced with, the extremes of society. Where everything is fine there is no need to be involved. It is where it isn’t that you can make a difference.\nAs an elected community representative for over 27 years I have dealt with these issues. The past thirteen years however we have seen the steady decline of services, through the Tory imposed cuts, and the impact this has had. It’s important to add that I don’t believe that the Tories cut the services because of a need to balance the books but rather because they don’t use public services like the rest of us and consequently they don’t value them. Their aim is to force us into paying privately. They see public services as a way of making money rather than a means of supporting people in need. As an example just look what they are doing the the NHS!\nIn policing we have witnessed the impact the cuts across the whole of the public sector In the words of Tom Winsor, the then Chief Inspector of Policing “the police have become the service of first resort, not last resort” as they have picked up more and more social care, mental health and non-crime demand because other services have been withdrawn.\nWe have also seen the decimation of youth services leading to more anti-social behaviour, and record numbers of young people being placed into the care of local authorities as family support services diminish.\nAs a County Councillor I had responsibility for dealing with some of these issues but I was also a member of Lancashire Police Authority for several years before becoming PCC. I understood the symbiotic relationship between the local authorities and the police. Most importantly how this can be developed if we are not only to deal with tackling the aftermath of criminality but on its prevention.\nAs Lancashire’s Police & Crime Commissioner my job was to deliver the best possible services for the people of Lancashire, services to the most vulnerable in society, victims of abuse, of antisocial behaviour, of hate crime, and to ensure that they get justice. We delivered this, and we were recognised as one of the best performing and most efficient in the country, despite the devastating cuts to the police budget imposed on Lancashire by the Conservative government.\nWe were recognised as outstanding for efficiency and use of resources by government inspectors. It was important that every penny we spent we spent on keeping the people of Lancashire safe. This accolade has already been lost by the Tory PCC who prefers to put police officers behind desks rather than on the streets.\nI fought incessantly for a fair deal for Lancashire. To get our Bobbies back that the Tories kept taking from us. I had victories against the change in the funding formula that would have slashed our budget by a further £25m per year and in lobbying the government for reimbursement for the costs of policing the fracking operation at Preston New Road, that saw a return of approx £10m into Lancashire Police’s coffers.\nFor the Association of Police and Crime Commissioner’s I was the national lead for Fraud & Cyber Crime and sat on committees with Government Ministers. It was partly through my negotiations that we saw the national Cyber Crime Centre being placed in Lancashire.\nThe bottom line is that it’s important to have vision and values for what you want to achieve but it is experience that ensures that it is delivered. My vision and values are about demanding high standards, standards of police officer behaviour and standards of service. Ensuring the money is spent well is a part of it but also ensuring effective governance and accountability.\nThe past thirteen years, through Tory imposed austerity on northern police forces and local authorities, have been a struggle. The past three years, with a Tory PCC we have lost direction. With the prospect of the return of a Labour Government to work with, with sensible policies that recognise the importance of rebuilding neighbourhood policing and our connection with the public once again, the future for Lancashire’s policing is once again on the up.",
  "https_www_clivegrunshaw_com_/https_www_clivegrunshaw_com/content_1.html": "Clive Grunshaw\nFor Lancashire Police and Crime Commissioner\nMy Priorities For Lancashire\nDomestic Abuse – tackling violence against women and girls; To retain refuges for a safe haven for victims. Fund perpetrator services to get the support to prevent further abuse. To improve victim services and support and build trust from the victims in the police to come forward and report. This is a challenge as at present the conviction rate for reported rape is pitiful and unacceptable at 2%. I will push for national vetting of all police officers.\nVisibility – getting our police officers back onto the streets and rebuilding our neighbourhood policing. The Tory PCC has slashed the number of PCSOs and he has put many police officers behind desks rather than on the streets. Despite what he says the service has been significantly degraded. I would never have allowed this to happen and I am committed to rebuilding the public’s trust and confidence in the police.\nPrevention – improve early intervention and work with a range of partners to redirect young people away from offending behaviour. There is a strong correlation between deprivation and crime, mental health issues, domestic abuse, antisocial behaviour and nearly all the ills of society.\nValue for money – to respect public funding of policing and to ensure that every penny spent is used to deliver the best possible service. To strive once again to regain Lancashire’s rating for being Outstanding for efficiency and use of resources. This also means ensuring that police officers return to the streets doing police work rather than sitting behind desks doing work that could be done better and cheaper by police staff.\nCustomer experience – improve how residents are dealt with by the police. My aim is to achieve the highest standards in both service delivery and police officer behaviour. For Lancashire to be once again a byword for excellence in policing rather than a fallen or failing police force as some people see it now.\nLet’s Get Lancashire’s Policing Back!\nLancashire Police and Crime Commissioner from 2012 – 2021",
  "https_www_clivegrunshaw_com_/https_www_clivegrunshaw_com_priorities/content_2.html": "Priorities\nDomestic abuse – tackling violence against women and girls; to retain refuges for a safe haven for victims, to fund perpetrator services to get the support to prevent further abuse, to improve victim services and support, to build trust from the victims in the police to come forward and report – which is a challenge as at present the conviction rate for reported rape is a pitiful and unacceptable 2%; and to push for national vetting of all police officers.\nThis was the area of service that I campaigned on more than any other. Defending women’s refuges from closure and being the conduit for making Lancashire a White Ribbon County – standing up against men’s violence against women’s and girls. But much more is needed.\nVisibility – getting our police officers back onto the streets and rebuilding our neighbourhood policing. The Tory PCC has slashed the number of PCSOs and he has put many police officers behind desks rather than on the streets. Despite what he says the service has been significantly degraded. I would never have allowed this to happen and I am committed to rebuilding the publics trust and confidence in the police.\nThe simple fact is, we need more Bobbies on the beat rather than behind desks. We need a fair share of funding from government, which we have never had under the Conservatives. We need to push officers to tackle all instances of antisocial behaviour and shoplifting at the outset rather than allowing it to go on with impunity as it is now. For example, according to the Coop, in the past year, Lancashire Police only responded to 20% of ongoing incidents of reported shoplifting and in only 2% of cases did it lead to a conviction. These are the known cases, not including the ones that go undetected completely. What kind of message is this sending to criminals? Simply not acceptable!\nPrevention – improve early intervention and to work with a range of partners to redirect young people away from offending behaviour. There is a strong correlation between deprivation and crime, mental health issues, domestic abuse, antisocial behaviour and nearly all the ills of society. If, through a multi-agency approach, we can work with families and young people at an earlier stage to give them some support, hope and opportunity we could turn people’s lives around, prevent young people becoming involved in the criminal justice system, prevent many future crimes being committed and it would be a far better use of resources.\nValue for money – to respect public funding of policing and to ensure that every penny spent is used to deliver the best possible service. To strive once again to regain Lancashire’s rating for being Outstanding for efficiency and use of resources. This also means ensuring that police officers get back out onto the streets doing police work rather than sat behind desks doing work that could be done better and cheaper by police staff.\nPart of the job of PCC should also be about getting a fair deal from government. Lancashire has been treated appallingly by the Conservatives over the past 13 years. Rishi Sunak boasts about taking funding away from more deprived areas in the north, such as Lancashire, and distributing to areas in the South, such as Royal Tunbridge Wells. We still have fewer police officers than when the Tories came to power in 2010. We have seen a drastic cut in PCSOs and police staff by the Tory PCC, and we have seen the burden for trying to close the gap being shifted onto the hard pressed council tax payers of Lancashire. This has got to stop!\nI am committed to fighting the Tory government for a better deal for Lancashire but, better still, working with an incoming Labour government to bring in some sensible policies and fair funding once again.\nCustomer experience – improve how residents are dealt with by the police. My aim is to achieve the highest standards in both service delivery and police officer behaviour. For Lancashire to be once again a byword for excellence in policing rather than a fallen or failing police force as some people see it now.\nTo achieve this I aim to create a golden thread of service delivery, from prevention i.e. visibility, becoming embedded in communities, stopping crime and ASB occurring, working with partners to bring hope and opportunity to deprived communities.\nThen ensuring the police are responsive, answering calls and emails timely and effectively, visiting scenes of crime quicker and also providing feedback so the victims actually know what is going on.\nTechnology has improved significantly and should be used to build and maintain the publics relationship with the police. I was part of the evolution of its use in Lancashire and see massive potential for how we can improve in the future.\nLet’s Get Lancashire’s Policing Back!",
  "https_www_clivegrunshaw_com_/https_www_clivegrunshaw_com_about-clive-grunshaw/content_3.html": "About Clive Grunshaw\nExperience\nClive oversaw a police force that was rated as outstanding for efficiency and use of resources. A police force that was a byword for excellent policing and with a proud reputation. It has taken just two years for a Tory PCC to trash that reputation, for morale to fall and for police officers to be sat behind desks rather than tackling criminals. It’s time to bring back Clive Grunshaw.\nPriorities\nI am committed to fighting the Tory government for a better deal for Lancashire but, better still, working with an incoming Labour government to bring in some sensible policies and fair funding once again. I have a range of priorities from tackling anti-social behaviour to erradiction violence against women and girls. My number one priority from day one will be to get more bobbies back on the beat.\nLancashire Police and Crime Commissioner from 2012 – 2021\nBring Back\nClive Grunshaw!\nI am born and bred in Fleetwood, a town I am very proud of, and where I have lived all my life. Both my parents came from East Lancashire, my father’s side from Blackburn and Darwen and my mother’s from Oldham. I am conscious of my Lancashire heritage and I am passionate to ensure that our future is as great as our past.\nI left school aged 16 to work as an apprentice winch builder, back in the days when Fleetwood had a fishing industry. As the industry died I spent several years as a milkman before taking up adult education, going to Lancaster University and gaining both a BA (Hons) degree and Masters Degree in Politics and Trade Union Studies respectively.\nSince then I have worked in various roles in the Labour Movement, as a trade union tutor, as a Parliamentary Assistant and as a Wyre borough councillor and Cabinet Member on Lancashire County Council. Latterly taking up the role of Police & Crime Commissioner for Lancashire between 2012 and 2021.\nI have been a trade unionist since aged 16 and I have been a Labour Party member nearly 40 years. Fighting for equality of opportunity and against social, economic and environmental injustice is what I have been trying to achieve all my life.\nLet’s Get Lancashire Police Back\nOn the County Council I served as the Cabinet Member for Children and Young People; having responsibility for some emotive services such as supporting children with disabilities and children in the care of the local authority. In the past, as a family, we offered respite care and short term fostering for children with disabilities, so I had experience of how difficult this could be.\nMy passion is still about changing the world for the better. Making it a kinder and safer place to be. My belief is that there is such a thing as society and that we all have our part to play in supporting each other. There is no more important service than the police for making this happen.\nOutside of politics I enjoy travelling as much as I can; walking in the hills of the Yorkshire Dales or the Lake District, and sport, watching rather than playing these days."
}