{
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_talk-on-climate-change-at-iglobal-s-diwali-fest/content_36.html": "Talk on Climate Change at iGlobal's 'Diwali Fest'\n- Hersh Thaker\n- Nov 15, 2020\n- 1 min read\nAs part of the iGlobal virtual Diwali celebrations i was invited to join a panel of guests to discuss the impacts of the current climate emergency and what responsibilities individuals need to and can take.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_a-false-sense-of-hope-on-climate-change/content_25.html": "Creativity in Crisis Publication: A false sense of hope on the climate crises?\n- Hersh Thaker\n- May 20, 2020\n- 4 min read\nIs it realistic to expect the sustainability agenda to be prioritised in the post- COVID recovery? (This article was published in \"Creativity in Crisis - Micro Stories From The Macro Pandemic\". All proceeds from this publication was donated to the National Emergencies Trust). You can purchase the full book here.\nIt’s 6pm on the evening after the 23rd March UK lockdown, and I’m cycling down a country lane just off a busy A46 dual carriageway in Leicester. The roads are empty and at points on my ride, it feels like I’m the only person on them. Usually, the roads are buzzing with rush hour traffic, so it was a nice change. I did feel an uncomfortable sense of peace — uncomfortable because I know this is only short-term and soon these roads will be awash with vehicles again. With feel-good stories circulating on social media and media outlets on how the lockdown has been good for the climate, there is a similar risk of being lured into a false pretence on how the current crises will impact climate change. In reality, like the inevitable return of the rush hour traffic we potentially face an even bigger challenge with the climate crises post COVID.\nThe short-term outlook is indeed very positive. With almost a third of the global population in lockdown, current analysis suggests we will see a 5.5% reduction in global C02 emissions in 2020, in comparison to 2019. This would represent the largest annual fall compared to any previous wars or economic crises[1]. During the peak of the China lockdown, CO2 emissions fell by 25%[2]; in major European cities, we’ve seen falls between 30-60%[3] in Nitrogen Oxide (NO2) and Particulate Matter, both largely created by vehicle fuel emissions, and lead to respiratory and cardiovascular disease. Closer to home, we’ve also seen 30-50% falls in NO2 levels in London, Birmingham, Bristol, and Cardiff[4]. Although these data points are reassuring, they are merely anomalies in an otherwise grim reality on our collective failure to get a grip of the climate crises.\nThe world has not been on track to meet the Paris Agreement target to keep average global temperatures “well below 2 degrees”[5] and to pursue efforts to limit the rise to 1.5 degrees. Depressingly, the current predicted 5.5% fall in 2020 (if maintained) still does not bring us down to the 1.5-degree limit. Global emissions would need to fall by some 7.6%[6] every year this decade in order to limit warming to less than 1.5 degrees above pre-industrial temperatures; this is the reality of the challenge we face. The question now, is that given the magnitude of the current crisis and the long shadow it will cast, can the world really afford to prioritise the sustainability agenda at this time? I’m sceptical.\nTaking air pollution as a use case, there have been notable instances of easing the standards. Trump has already announced the reduction of fuel efficiency standards for new cars[7], which is expected to worsen air pollution and greenhouse gas emissions. China has also announced that it would temporarily suspend some environmental standards for small businesses to accelerate their economic recovery[8]. As well as this, in UK cities, several of the clean air zones roll-out plans have already been postponed. As temporary as some of the measures may be, they serve as an indication that economic recovery will not be compromised for environmental protection.\nIn a world potentially facing low oil prices for the foreseeable future, and falling car sales, we could see electric vehicle (EV) production being pushed back and de-prioritised by car manufacturers in order to survive and ease the pressures of cash flow; this would be a further dent in the reduction of air pollution. With Ford expecting to report Q1 2020 loses of $2billion[1], there is already a sense amongst investors that companies like Tesla will gain a competition advantage for EV’s, in the backdrop of immense disruption faced by their traditional competition[2]. Whilst this might be good for Tesla, it certainly isn’t good for tackling the climate crisis. I believe that, left to its own devices’ companies, will not prioritise a sustainability agenda when there is real or perceived risk to its bottom line.\nThere has been a move away from government regulations since the 1980’s, with the view that markets know best, and can organise more efficiently than governments can. Whilst it’s true that the market dynamics are vital, COVID-19 has shown that they are no substitute for the government’s role in organising society against a crisis and maintaining everyone’s best interests. The quote by Churchill, “Never waste a good crisis,” has never felt so apt. Whilst we’ve all had to rethink how we fundamentally live our lives, there is also an opportunity to intervene and steer people’s behaviour into low carbon consumption to maintain lasting reductions in carbon emissions. I’d like to see even more regulation and control, as well as the tightening of environmental standards in a statement from the government of the central role that it must continue to play in our lives as we work past the COVID crisis, but continue to live with the climate crisis.\nCOVID-19 was not a “black swan” event in that experts had warned of the dangers of a global pandemic and of how unprepared we were. Similarly, the climate crisis that we are already seeing play out, with extreme weather patterns and catastrophes like the recent bushfires, are not “black swan” events either — they are becoming more frequent and predictable. Climate change may not threaten our short-term survival, but it does indeed threaten our long-term existence. Unless there is intervention and action at the scale we are living through now, we risk sleep-walking past the point of no return on climate change.\n[1] https://www.carbonbrief.org/analysis-coronavirus-set-to-cause-largest-ever-annual-fall-in-co2-emissions [2] https://www.carbonbrief.org/analysis-coronavirus-has-temporarily-reduced-chinas-co2-emissions-by-a-quarter [3] https://www.eea.europa.eu/highlights/air-pollution-goes-down-as [4] https://ncas.ac.uk/en/18-news/3057-air-pollution-falling-across-uk-cities-latest-data-shows [5] https://unfccc.int/process-and-meetings/the-paris-agreement/the-paris-agreement\n[6] https://wedocs.unep.org/bitstream/handle/20.500.11822/30797/EGR2019.pdf?sequence=1&isAllowed=y [7] https://www.hrw.org/news/2020/04/02/us-car-emissions-rollback-endangers-peoples-health [8] https://www.reuters.com/article/us-health-coronavirus-china-environment/china-to-modify-environmental-supervision-of-firms-to-boost-post-coronavirus-recovery-idUSKBN20X0AG\n[9]https://www.cnbc.com/2020/04/17/ford-warns-of-2-billion-loss-in-first-quarter-due-to-coronavirus.html",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_speech-at-empower-a-generation-event/content_27.html": "Speech at \"Empower a generation\" event.\n- Hersh Thaker\n- Nov 7, 2012\n- 5 min read\nIn my role as a member of Youth Parliament for Leicester i was invited by Operation Black Vote and Unison to speak to a group of students at the Wyggeston and Queen Elizabeth College in Leicester on political participation and share my experiences of it.\nYou can read the full transcript below.\n\"I would like to start by saying how fantastic it is that OBV and Unison have put together this event and bought the line-up of speakers that we’re going to hear from today. Just to introduce myself, I was a student at QE as of last year, I’m currently on a Gap Year and was until recently a member of Leicester Youth Council and U.K Youth Parliament. I have three quick points to make to share some of my motivation to get involved in politics and speak about the Youth Council Itself.\n1. To start with, I’d like to share an analogy with you. It’s an analogy for our education system. I’d like you to think of our education system as a sandwich factory; let’s call it the education factory.\nHow does it work? Well …\n1. We enter the conveyor belt at primary school, each with our own characteristics and undeveloped moral but are essentially a blank canvass.\n2- We move along the belt onto secondary school, essentially being filled with the same ingredients, that being the National curriculum.\n3- Then onto college and university, we pick our subjects so we’re given different branding but aren’t too different.\n4. Once we come off the belt, everything we have known or seen will have been shown or given to us by the factory, hence unless we’ve gone out and sought it everything we’ve seen and done is similar\nThis was explained to me as a 15 year and it massively changed the way I began think, act and make decisions. And it inevitably led to my interest in politics and decision to run for youth council and youth parliament.\nWhat’s my point?\nWell, once we’re cast off the production line along with 500,000 other graduates all fighting to find our place in the world, we need to stop and think. How much of the world will we have actually seen? How much different will our life experiences have really been? What will we have done that really differentiates us? And what will we have done that has made any difference to the world? It’s a daunting thought.\nThese were all questions which empowered me to want to create the experiences and opportunities that have not simply been shown or fed to me by the factory, BUT ones that I have gone out and made for myself. And what better way to do so than being involved in politics, where creating change is at the centre of what we do.\n2. Coming to my second point, I’d like to shine some light onto what the youth council actually does and my experience of it, in particular.\nWe have 40 youth councillors that represent 8neighbourhoods of Leicester. Within which there is an executive body and there are two members of youth parliament and two deputy members. All members are democratically elected in. At the last election 7500 votes were cast in total from schools and clubs across Leicester. Our structure closely resembles the structure of the council\nBut the question is, are we effective? Well yes we are. The structure is there and it’s up to us to use them and for other young people to come to us as tell us what needs to be done.\nAn example of this is the study space campaign I’ve recently completed, which I hope some of you have made full use of, where working with the head of library services in Leicester we created a total of hundred extra study spaces across the city at virtually no cost to the council. Now this was an issue I used to complain about as a student, but have been empowered to proactively do something about it.\nAlso, on a national level, as a Member of UK Youth parliament, I had the privilege of debating in the House of Commons chamber last November and we collectively agreed that the cost of public transport is the issue most affecting young people across the country. And we are still in the process of lobbying the relevant sec. of state on this. So you see, there is real opportunity to make change, even if it’s just small.\n3. On my third and final point, I want to bring it back to the title of today’s event. This idea of ‘Empowering a new generation’ and particularly how the Youth council has empowered my generation and will continue to do so in the future?\nQuite simply, it has completely opened up Leicester’s political institutions to its young people to an extent that we hold similar powers to actual councillors. Just think how empowering it is to know that a 13 year old has the potential to similar political powers to a middle aged councillor!\nHow so;\n- We’re given a full flavour of political campaigning through running your own one\n- We have access to cities decision makers such as Sir Peter, who himself has been a massive champion of ours and has supported ever since he was an MP\n- We run meetings in the council’s chamber\n- We have seats in most of the council’s decision making and scrutiny panels.\n- We have our own office in the town hall with full use of facilities of the town hall.\n- Regular meetings with council executives\n- We even have our own council badges!\nNow I don’t mean to brag about one particular institution, when there are many other fantastic ones working to empower young people in different ways. But what it does demonstrates is just how much value is put on the us and it now must be up to us, as young people, to go and make things happen for ourselves.\nWhat the YPC offers essentially is a structure in which we can flourish and serve each other. It isn’t about being spoon fed, it’s about using your initiative and creating your own opportunities and campaigns. Surely these are the ideal conditions needed to empower creative young minds. It reminds me of something Bear Grylls recently tweet, (Not originally his quote) - “Do not go where the path may lead, go instead where there is no path and leave a trail”. And this is exactly what we’re doing and giving the space for young people to do in Leicester.\nJust to conclude, obviously the YPC isn’t the only organisation out there and I’m not here to sell it. It’s just an example how young people are being empowered here in Leicester. But as I said at the start, the motivation to want to do something special should come from within ourselves and these organisations should only be channels for us to do good.. Steve Jobs said something relevant to this in a speech at Stanford University which particularly stuck with me and I’ll end on this. He said, “For the past 33 years, I have looked in the mirror every morning and asked myself: 'If today were the last day of my life, would I want to do what I am about to do today?' And whenever the answer has been 'No' for too many days in a row, I know I need to change something.”\nFor me, the privilege of being a Youth Politician has given me the opportunity to serve this higher purpose myself… by doing things like this, and I’m really grateful for it.\nSo thank you very much.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_blog/content_2.html": "Derailing Dysfunction: Can a Labour Government Revive Britain’s Railways?\nBritish Railways need reform, and only Labour seems ready to address it.\nBritish Railways need reform, and only Labour seems ready to address it.\nThis article was originally published with Leicester Gazette. Earlier this year, I had the privilege of standing as a Labour Party...\nThis article was originally written for and published by iGlobal as part of my regular column. Earlier this month, Keir Starmer...\nA review of Kate Raworth’s book, Doughnut Economics: Seven Ways to Think like a 21st Century Economist. This article was originally...\nI was selected to participate in the Youth Interfaith Leaders Fellowship on Climate Change, a collaboration between Duke University and...\nThis article was originally written for and published on my Medium channel. There’s hope for all cuties. Amsterdam wasn’t always the...\nThis article was originally written for and published by iGlobal as part of my regular column. According to the latest ONS census data,...\nThe conservatives haven't gotten much right in 12 years, but they have given us a British Indian Prime Minister.\nIntroduction The American Ecologist Garrett Hardin describes the problem of unencumbered population growth as a \"Tragedy of the Commons\"....\nThe last few weeks have served as a stark reminder about the fragility of our energy supply chain. A 250% rise in wholesale gas prices...\nThis blog was originally published in my regular column for iGlobal News. Investing in the transition to a lower energy system is...\nI was invited to share my thoughts on WhatsApp's updated privacy policy and what it means for UK consumers.\nTo say the vaccine roll out is in full flow would be a slight overstatement but with over 700,000 people now vaccinated in the UK at the...\nThis response was sent to the Leicester City Council's planning office in response to their call for views on future planning policy....\nAs part of the iGlobal virtual Diwali celebrations i was invited to join a panel of guests to discuss the impacts of the current climate...\nI was delighted to join Gopal Patel on a virtual panel with students from the National Hindu Students Forum UK to discuss environmental...\n(This article was published in \"Creativity in Crisis - Micro Stories From The Macro Pandemic\".\nFocus on motorway charging is welcome but is the Electric Highway network hindering progress? The government has set out its vision...\nThe UK went a record 1 week without using coal to generate the UK’s electricity, a feat not achieved since the start of the industrial...\nAs we loom closer to the inevitability of a Peoples Vote and prepare to mobilise for the campaign, click here how your constituency and...",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_how-amsterdam-became-a-cycling-nirvana/content_4.html": "How Amsterdam became a cycling Nirvana\n- Hersh Thaker\n- Jan 25, 2023\n- 3 min read\nThis article was originally written for and published on my Medium channel.\nThere’s hope for all cuties. Amsterdam wasn’t always the cycling capital of the world. It took civic unrest and political will.\nCycling is a way of life in Amsterdam, with cyclists everywhere on the city’s streets. Coming to Amsterdam, you will notice this immediately upon stepping out of the central station, where the first road crossing you encounter is not for cars but for bikes. Before moving here, I had thought cycling was a mere novelty, but upon experiencing the city, it became clear that cycling is deeply ingrained in Dutch culture. It is a common and effortless mode of transportation, just as natural as eating, sleeping, or breathing.\nHowever, it wasn’t always this way. In the post-war era of the 1950s and 1960s, cycling was under threat due to the growing number of vehicles on the roads. As cars became cheaper and more fashionable, the use of bikes decreased by 6% every year. It was on track to be virtually eliminated as driving became more fashionable, affordable and in favour of urban planners and policymakers in the city. Canals were filled in, and streets were modified to accommodate the increased traffic and cater to the vehicle boom.\nBut, by the 1970s, the tide began to shift in Amsterdam, and the city began to invest in cycling infrastructure. This was triggered by the high death rates caused by traffic accidents in the Netherlands, with 400 of the 3300 deaths in 1971 being children. Campaigns were launched, and the government responded by making roads safer for cyclists. By the 1980s, Amsterdam had transformed into the cycling haven it is today. Urban planners shifted their focus from destroying neighbourhoods to making space for cars to building cycling lanes on virtually every road. No new roads were planned without considering how to accommodate cyclists.\nCreating a safe culture\nThe focus on making cycling safe didn’t just mean painting white lanes to separate the traffic; it meant physically separating the cycle lanes from the roads through bollards, trees, and curbs. A 13-year study on 12 cities found that physically separating cycling lanes reduced fatalities by 44%. To make cycling second nature, Amsterdam built a network of more than 750 kilometres of interconnected cycle lanes, ensuring that all parts of the city can be accessed by bike. The city also provided amenities such as bike parking and bike rental stations to make cycling even more accessible. This includes bike parking in front of shops, bars, cafes, train stations and other public transportation hubs, so people can easily continue their journey by bike.\nIn addition to physically separating the cycle paths, which makes cycling so safe in Amsterdam, the speed limits on cars that share the roads with bikes also play a significant role in the relaxed cycling culture. Dutch design manuals stipulate that wherever cars are permitted to travel faster than 30 km/h (19 mph), they must be kept separate from bikes, as described above. This allows slow-moving cars on side roads and tight streets to safely share the road with cyclists, making it safer and more comfortable for both groups.\nThere are also strict traffic regulations that prioritize the safety of cyclists. For example, cars are not allowed to park in bike lanes and must give way to cyclists at intersections. This helps create a safer cyclist environment and encourages more people to cycle.\nOne of the things you will notice when cycling in Amsterdam and across the Netherlands is that it is an upright, everyday activity, not an endurance sport. Chris Bruntlett, the author of Modacity, describes cycling in the Netherlands as “walking with wheels.” The focus is not on speed but on enjoying the journey socially and conveniently without needing special shoes, helmets, or clothing. This approach helps to maintain an inclusive cycling culture.\nWhat’s next?\nToday, Amsterdam is rightfully considered a cycling paradise, with its residents cycling 2 million kilometres daily. City planners across the Netherlands have incorporated cycling into the development of new roads, and no credible political party would consider reducing investment in cycling. As the market and use of e-bikes grows, the Dutch authorities have increased their focus on connecting city corridors to allow intercity cycling through long connected roads, which can now be easily done on the increasingly popular e-bikes without breaking a sweat.\nAmsterdam’s transformation into a cycling haven was not a coincidence but a deliberate effort by the government and urban planners to make cycling safe and accessible for all. Other cities can learn from Amsterdam’s example and replicate its success by investing in cycling infrastructure, physically separating cycling lanes, providing amenities and strict traffic regulations, and promoting cycling education and awareness campaigns. With the right planning and commitment, it is possible to create other Amsterdams where cycling is not just a mode of transportation but a way of life.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_celebrate-our-first-british-indian-and-hindu-prime-minister/content_9.html": "Rishi Sunak is a testament to the success of the British Indian story.\n- Hersh Thaker\n- Oct 25, 2022\n- 3 min read\nUpdated: Oct 25, 2022\nAfter the defeat of the Liberal candidate Dadabhai Naoroji in 1886 for the parliamentary seat of Holborn, Lord Salisbury, the leader of the Conservative Party, proclaimed his doubt whether the English would “elect a black man.” Naoriji’s election in 1892 to become the first Indian MP disproved Lord Salisbury’s assertion.\nOver a hundred years later, David Cameron stood beside Narendra Modi in front of 60,000 British Indians at Wembley and boasted that his party now had the highest number of British Indian MPs in history. He also predicted it wouldn’t be long until the country had its first British Indian Prime Minister. Seven years later, one of those MPs from 2015, Rishi Sunak, a British Indian and Hindu, has taken on the most important job in British politics, and it’s something we should celebrate.\nAs a Labour party member, I would have wished it would be my party that had this record. A party committed to equality but has so far failed to elect a female or ethnic minority as a leader or to any great offices of state is disappointing. As a British Indian, however, today I am proud of what he’s achieved because it represents an achievement of a generation of Indians like my parents who made this possible.\nRepresentation matters, and seeing Rishi Sunak in the top job will spur a new generation of young leaders in this country to take an interest in politics and thus enrich our democracy and representation. He has utterly broken the glass ceiling, and this can only be a good thing.\nHe has undoubtedly inherited a poisoned chalice. He has no mandate, and the tories are deeply divided and unpopular. His membership base would probably not have voted him in, and he will likely lead the conservatives to an electoral defeat in two years. It is also true that he eventually got the top job on a technicality, and his wealth and privileged upbringing played a significant role. That doesn’t matter today because it is a day my parents would never have expected when they came to this country.\nToday and for weeks and months to come, millions of Indians worldwide and here in Britain will be talking about this over the dinner table with pride. It will feel not so much like Rishi Sunak’s achievement but the achievement of every person of colour that moved to this country. Those who migrated here made it their home, fought racism, built community organisations and support networks and allowed their children to stand on their shoulders and flourish. They will feel this is their story, and rightly so.\nThe UK is one of the most successful multiracial democracies in the world. There is representation in every corner of British society, business, media, entertainment, education and politics. Of course, many ceilings still exist to break, and many forms of inequality continue to stifle the opportunity to progress. We’re a country that others have historically looked up to, and under this Conservative government have lost our way and eroded our soft power because of Brexit, scandal & economic mismanagement. This moment goes beyond and gives us a chance to show the world this great country is all about.\nWe are not at the mountain top yet, far from it, but this is a summit many believed would never come, so let us celebrate it.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_electric-vehicles-now/content_23.html": "Electric Vehicles Now\n- Hersh Thaker\n- Dec 28, 2018\n- 4 min read\nThe transition to electric vehicle ownership should not be assumed. A progressive government must do more, argues Hersh Thaker - This articles was first published on www.progressonline.org.uk\nThe United Kingdom’s transport network is now the largest contributor to our greenhouse gases according to a report by the Department for Business, Energy and Industrial Strategy (BIES). With the glittering headlines of new electric vehicle (EV) model announcements and ambitious new government targets, you can be forgiven for believing we are further ahead of the curve than we really are.\nThe reality is that air pollution levels in cities like London are at hazardous levels, greenhouse gasses from our transport network are unsustainably high and as of 2017 EV’s only accounted for around two per cent of the new car market in the UK. The case to accelerate the transition to a lower carbon transport system is clear, but it should not be assumed. If the government is serious about meeting its target of every new car and van sold by 2040 being an ultra-low emission vehicle (ULEV), then it needs to do more.\nChanging the game\nA McKinsey 2016 EV consumer survey showed that not having enough access to charging points is one of the biggest barriers for consumers think of switching to EVs. With improvements to the technology bringing down cost and increasing the range of the vehicles, charging infrastructure will inevitably become the biggest barrier to entry for consumers.\nYou could argue that combined home, work and some strategically placed long-distance charging locations could cover an owner’s entire energy demand. This might be true of today’s early adopter drivers who are more willing to compromise, and it might be true for drivers who use an EV as a second car only for commuting or errands. However, this scenario does not work when considering the scale of ownership we should be aspiring for.\nAs EV ownership becomes mainstream, charging will likely shift toward public options and away from the home over time, as middle and lower income households without home charging options own EV’s. Additionally, the millennial generation opting to lease, hire or use car clubs, yet again builds the case for charging at public facilities and away from the home.\nThe case for more rapid public charging infrastructure is clear. Progressives must push for government action to create an environment that encourages operators to enter the market and makes it easier for drivers to access the current network. There are many tools at the government’s disposal. Each could be an article topic of its own and therefore I will focus on just one. I believe that mandating interoperability is a low hanging fruit which would almost immediately make driving an EV in the UK easier and bring us in line with our European peers.\nIt’s the single subscription, stupid\nInteroperability is the ability for various systems to work together. For EVs, this means giving the driver the ability to use any charging infrastructure wherever it is located and whoever it is operated by, as is the case in most mainland European countries today.\nIn the UK, drivers are required to sign up with each individual charge post operator in order to access their network. With contactless payment still an extremely rare luxury and cash payment a distant dream, there is little option but for drivers but to conform. This means a return journey from London to Manchester could require signing up to three different schemes just to be able to charge on the way. This is like asking regular car drivers to sign up to be a member of a fuel programme with Shell, Esso, BP and Tesco, and to use custom payment cards in order to fill up petrol at their stations. Bizarre – who would put themselves through all that extra stress?\nInteroperability would mean a driver requires only a single subscription and a single method of payment in order to access all charge posts. This has to be the first step if we want to make large scale EV ownership to make sense in the UK. Elon Musk put it extremely succinctly that “you have to match the convenience of the gasoline car in order for people to buy an electric car”. Interoperability goes a long way to achieving this goal.\nMaking the market fair\nFree market purists could argue that if the demand from the consumer is strong enough, eventually something will give and the operators will open up their network, just as they have done across the rest of Europe. I’m not so sure.\nThe market in the UK is dominated by a few big players that are vehemently protecting their network in order to grow their own customer base. Take for example, BP Charge master who have network scale and exclusive contracts to install infrastructure in many UK cities. Or take Ecotricity, who have a monopoly over motorway sites. These operators have little incentive to open up their network since they risk losing the relationship with a customer who could use their network without ever signing up with them. Thus, with very little incentive for some of the established players the only losers here are the drivers, smaller operators and new entrants.\nThe first steps toward interoperability have been made by the current government. The Autonomous and Electric Vehicle Act 2018 granted a series of powers around improving access and availability of charging infrastructure. One of the most important of those powers was to “oblige charge point network operators to allow interoperability between networks”. If the government is serious about this they have to be bold and enforce this power through secondary legislation.\nThis is a complicated area and there is no one size fits all solution to speeding up the transition to a cleaner transport system. There is a responsibility on the consumer to make the right choices, a role for the car manufacturers to produce the right vehicles and a responsibility for operators to build the right infrastructure.\nHowever, considering all the factors at play here, the government has to step in and make sure this technology is truly available for everyone.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_electric-vehicle-terminology-explained/content_8.html": "Electric Vehicle Terminology Explained\n- Hersh Thaker\n- Jun 6, 2018\n- 3 min read\nWith people increasingly considering switching to an Electric Vehicle, the initial research can be rather daunting. I've put together this handy list of terms that you might come across:\nPHEV: Plug in Hybrid Electric Vehicle The car has an internal combustion engine and an electric motor. The difference between a PHEV and a standard Hybrid is that the battery which powers the electric motor needs to be charged using an external electrical outlet.\nBEV: Battery Electric Vehicle The car runs entirely on an electric motor which is powered by a battery. The battery needs to be charged using an external electrical outlet. BEV’s have zero tailpipe emissions since there is no combustion engine.\nICE: Internal Combustion Engine The car runs with a combustion engine which requires fuel .\nULEV: Ultra Low Emission Vehicle This terminology is used in the UK and refers to any motor vehicle emitting extremely low levels of emissions. This is currently defined as a vehicle that emits <75g of CO2 per KW drive\nNEDC: New European Driving Cycle This was the old measure of reporting the range of a vehicle. the measure was based on theoretical driving and therefore did not reflect real world range data. (E.g. Old version of the Nissan Leaf had a NEDC range potential of 150KW but in reality the range was closer to 80KW)\nWLTP: Worldwide Harmonised Light Vehicle Test Procedure This new measure of reporting comes into play in 2017 and reports vehicle range based on real world driving which better reflects on the road performance. (E.g. The old version of the Nissan Leaf would have had a WLTP range closer to the 80KW)\nCCS: Combined Charging System This is the rapid DC charging standard which exists across Europe and USA. (E.g. BMW in Europe uses CCS)\nCHAdeMO This is the Japanese rapid DC charging standard (E.g. Nissan uses CHAdeMO)\nType 2 This is the AC charging standard which is capable of fast and rapid (upto 43KW) charging\nEVSE: Electric Vehicle Supply Equipment Collective term referring to the collection of equipment installed to deliver energy from the grid to an EV. Includes plugs, sockets, conductors and power outlets\nOCPP: Open Charge Point Protocol This is a protocol which enables communications between any recharging equipment and any wider system including a central management system. OCPP also makes it easier to create a large-scale, visible network that uses a range of different charging stations since there is a requirement for only one operating system. (E.g. New Motion Network has a range of different charge posts that are all connected through OCPP)\nISO 15118 This is a standard for Vehicle to grid communication. This protocol allows for bi-directional charging and discharging of EV’s. Inductive charging, seamless payment (Plug and start charge) are examples of functionality that is enabled by ISO 15118.\nSingle vs 3 Phase Power Both of these are electricity supplies, it’s the amount of power that is different. A single-phase supply is smaller than a three-phase supply meaning you cannot use as much power. A typical house will need a single-phase supply whilst a larger house, flats or commercial building will need a three-phase supply. Single phase power supply will not allow for charging rate beyond 7.5KW. So although a New Motion home charger is enabled for 22KW charging, your house would require a three phase power supply.\nRegenerative Braking This is a process which occurs when the drive is not applying power to drive the motor and hence the car is running from kinetic energy and momentum. Hence, the electric motor is turning using kinetic energy which generates electricity. This (AC)electricity flows back through the inverter, converted to DC current and charges the battery.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_derailing-dysfunction-can-a-labour-government-revive-britain-s-railways/content_14.html": "Derailing Dysfunction: Can a Labour Government Revive Britain’s Railways?\n- Hersh Thaker\n- Jan 15, 2024\n- 5 min read\nBritain's railway system is in dire straits. The recent Christmas chaos at Euston and cancellations across the country, coupled with a 5% fare hike in 2024, was another kick in the teeth for British travellers who are already paying the highest fairs in Europe for a railway system that is no longer fit for purpose.\nA recent journey to the London O2 from Leicester with my mum would have cost us £75 each for an open return. That’s just under 40p a mile. To save money, we chose instead to drive three hours over what could have been a 90-minute train journey. I’ve travelled by train my entire life, but it wasn’t until I lived in the Netherlands that the abnormality of our railways hit home. Dutch trains ran on time and frequently; I could cycle in and out of stations, tap in and out with my travel card, and prices were fair and predictable. Driving never felt like a better option.\nThe litany of issues plaguing British rail travel, from broken facilities to delayed services, have become daily experiences for British travellers and have contributed to the normalisation of subpar services. What we have is not normal; our infrastructure ranks 29th globally[i] – below India and just above Kazakhstan. We should be outraged at the managed decline of our trains.\nRailways aren't just about transportation; they are crucial for achieving net-zero goals and promoting social mobility. Millions in our country lack access to private transport, making quality and accessible rail travel critical for enabling people to access more opportunities beyond the limits of their communities.\nIn the UK, one in five households do not have access to a car, which rises to two out of three low-income households[ii]. 1.5 million people are estimated to be in “transport poverty”, defined as people living in low-income areas more than one mile from the nearest bus/railway station[iii]. Ethnic minorities, women, young people not in education, employment, or training (NEETs), older people and students are most at risk of transport poverty[iv]\nQuality and accessibility railways can unlock social mobility by allowing those without the means of alternative private transport to access social, leisure and job opportunities that might otherwise become unavailable or inaccessible. It directly impacts improving social outcomes for the poorest in society.\nRailways also matter for meeting our net-zero targets. If we don’t get a grip, we’ll be stuck with a car-led transport system that endangers those goals. At a time when we need to protect our planet’s health and revive local economics, we need the railways to pull their weight. There is a risk that the managed decline will make way instead for heavily polluting road-building programmes, which under this current government seems to be the preferred approach[v].\nPrivatisation and the system of franchising set up by the Tories have a lot to answer for when trying to understand how we arrived here. A fragmented system has meant nobody is in control, and the lack of accountability has led to a dearth of long-term investments and escalating costs. The franchising model, dividing responsibilities among private entities, has only fuelled inconsistency and confusion for passengers.\nThe privatisation model, introduced by John Major, split British Rail into three parts. Private Train Operating Companies (TOCs) would bid to run franchises of specific routes. Railtrack, a new private company, would take responsibility for railway infrastructure (cables, tracks), and rolling stock (the trains themselves) would be leased out to specific TOCs per franchise agreements by private rolling stop companies.\nRailtrack failed almost immediately. The tragic Hatfield train crash in 2000, caused by damaged tracks, exposed Railtrack’s negligence. Soon after, networking was re-nationalised and bought under the control of National Rail, which continues to operate the infrastructure today. The model also meant that TOCs operated on short-term contracts and were responsible for operating services but had little incentive to make any long-term investments into infrastructure beyond the term of their contracts, which typically lasted seven years.\nThe franchising model was destined for failure as private operators lacked genuine control over a fragmented and geographically intricate railway network. This resulted in a lack of standardised passenger experiences and pricing. Fares vary widely, from 15p to 62p per mile, and the quality of the passenger experience was entirely dependent on the specific company operating the line in a given region.\nThe model was eventually dropped in 2020 when the pandemic struck, and passenger levels fell off a cliff, which meant the government had to step in to cover the losses and ensure the TOCs could continue to operate profitably. It also highlighted that true free markets will never be fully at play when it comes to public services because companies can operate without financial risk, knowing the government will always have to step in when things go awry.\nThe franchising model has now been replaced by a concession-based model, where the government pays private companies a management fee to run the service. However, fares, timetables, and risks sit with the government, and the private operators continue to hold no commercial risk. The plan was for a new arms-length body in Great British Railways to oversee the network's contracts and running to move towards a more unified system. What would have been a move in a positive direction, with no legislation planned or in place, now seems to have been kicked into the long grass.\nWith Labour on track to win the next general election, hope is on the horizon. The party has committed to re-nationalisation and recently announced a review of rail infrastructure delivery led by former Siemens UK boss and Vice-Chair of the Northern Powerhouse Partnership, Jürgen Maier.[vi]\nNationalisation isn’t a panacea, but in the case of Britain’s railways, it’s a sensible move. Centralised control of a complex, fragmented, and broken public service is badly needed.\nUsing the railways needs to be simple, flexible, and convenient, and the TFL network offers a model of the simplicity we could offer passengers. Predictable pricing, cheaper single-leg tickets that don’t cost the same as return leg journeys, pay-as-you entry and exit at stations.\nThis can only be achieved where there is the promise of long-term investment. The era of privatised railways heeded little long-term investment because of a lack of certainty and control. A long-term railway infrastructure plan would create the conditions for a simpler, predictable, and affordable system that benefits passengers and workers.\nIdeological debates should not overshadow the practical advantages of nationalisation. With the evident failure of privatisation over the past 24 years, embracing nationalisation is necessary, and our railways are already effectively nationalised in all but name. Foreign-state-owned companies wield significant influence, and whenever private operators have failed, the British state has stepped in to take control.\nTranspennine Express, South Eastern, LNER, Northern Rail, Transport for Wales, Scot Rail, and Caledonian Express were all nationalised due to the failure of private operators. National Rail was set up to run the network to take over from the failed Railtrack, and those TOCs that remain privately operated are foreign state-owned companies of Netherlands, Germany, France, Italy, Hong Kong and Japan. It’s quite astonishing that nationalised state operators from all over the world, but not the British state, have been allowed to run our railways.\nRailways might not be the issue that decides the next election, but it represents another clear dividing line between Labour and the Conservatives. On the one hand, Labour is committing to bringing ownership of railways into public hands, so we no longer subsidise the cost of rail fares of our European neighbours, whilst the Tories remain silent on a problem that has worsened under their watch.\nSerious reform is overdue, and only one party seems ready to address it.\n[ii] https://www.ons.gov.uk/peoplepopulationandcommunity/personalandhouseholdfinances/expenditure/datasets/percentageofhouseholdswithcarsbyincomegrouptenureandhouseholdcompositionuktablea47\n[iii] Sustrans, “Locked Out: Transport Poverty in England”, 2012\n[iv] https://www.oxfordeconomics.com/wp-content/uploads/2022/11/The-Economic-Environmental-and-Social-Opportunities-that-Rail-Brings-to-the-UK.pdf?utm_source=Recent-release&utm_medium=Website&utm_campaign=The%20Economic,%20Environmental,%20and%20Social%20Opportunities%20that%20Rail%20Brings%20to%20the%20UK",
  "https_www_hershthaker_com_/https_www_hershthaker_com_blog_categories_environment/content_30.html": "Derailing Dysfunction: Can a Labour Government Revive Britain’s Railways?\nBritish Railways need reform, and only Labour seems ready to address it.\nBritish Railways need reform, and only Labour seems ready to address it.\nA review of Kate Raworth’s book, Doughnut Economics: Seven Ways to Think like a 21st Century Economist. This article was originally...\nI was selected to participate in the Youth Interfaith Leaders Fellowship on Climate Change, a collaboration between Duke University and...\nIntroduction The American Ecologist Garrett Hardin describes the problem of unencumbered population growth as a \"Tragedy of the Commons\"....\nThe last few weeks have served as a stark reminder about the fragility of our energy supply chain. A 250% rise in wholesale gas prices...\nThis blog was originally published in my regular column for iGlobal News. Investing in the transition to a lower energy system is...\nThis response was sent to the Leicester City Council's planning office in response to their call for views on future planning policy....\nAs part of the iGlobal virtual Diwali celebrations i was invited to join a panel of guests to discuss the impacts of the current climate...\nI was delighted to join Gopal Patel on a virtual panel with students from the National Hindu Students Forum UK to discuss environmental...\n(This article was published in \"Creativity in Crisis - Micro Stories From The Macro Pandemic\".\nFocus on motorway charging is welcome but is the Electric Highway network hindering progress? The government has set out its vision...\nThe UK went a record 1 week without using coal to generate the UK’s electricity, a feat not achieved since the start of the industrial...\nThe transition to electric vehicle ownership should not be assumed. A progressive government must do more, argues Hersh Thaker - This...\nShell held their first internal product conference in November 2018 where we bought together all consumer facing product teams in the...\nThere is widespread belief in the industry that the tipping point for mass EV adoption and therefore scale up the production of EV’s will...\nWith people increasingly considering switching to an Electric Vehicle, the initial research can be rather daunting. I've put together...",
  "https_www_hershthaker_com_/https_www_hershthaker_com_blog_categories_community/content_19.html": "Hersh ThakerJul 19, 20234 min readThe Labour Party's Relationship with India: A Critical Path for the Next DecadeThis article was originally written for and published by iGlobal as part of my regular column. Earlier this month, Keir Starmer...\nHersh ThakerFeb 8, 20235 min readA fresh new way to look at economic development and growth: The Doughnut.A review of Kate Raworth’s book, Doughnut Economics: Seven Ways to Think like a 21st Century Economist. This article was originally...\nHersh ThakerFeb 1, 20235 min readReflections on the Interfaith Leaders Fellowship on Climate change at Duke University.I was selected to participate in the Youth Interfaith Leaders Fellowship on Climate Change, a collaboration between Duke University and...\nHersh ThakerDec 6, 20223 min readLeicester: A Role Model City for Diversity and IntegrationThis article was originally written for and published by iGlobal as part of my regular column. According to the latest ONS census data,...",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_give-optimism-a-chance-individual-electoral-registration/content_31.html": "Give Optimism a Chance: Individual Electoral Registration.\n- Hersh Thaker\n- Jan 24, 2012\n- 3 min read\nThe introduction of Individual Electoral Registration (IER) is the biggest change to the way we do elections since the Universal Franchise. Done right, it will get more of us engaged – a massive challenge in an era of deep disillusionment with politics and politicians. Done wrong, it will cause a collapse in participation and wreak havoc with the government’s claims to restore ‘power to the people’.\nI acknowledge the anxiety towards IER, particularly because of its potential to disenfranchise voters. However these arguments are based on certain proposals from the current White Paper. Since then; The Electoral Commission, The Political and Constitutional Reform Committee, backbench MP’s & Peers, countless civil society organisations, local councils and NGO’s have raised their concerns around the opt-out, 2014 Household Canvass and it’s affect on the Boundary Review. The likelihood is that the coalition will struggle to ignore the consensual recommendations put forward to ensure that the register is both complete and accurate.\nSo on the basis that the opt–out clause is dropped and a full household canvass is maintained in 2014, surely the implementation of IER is no longer a contentious issue. Beyond the technical jargon that comes with constitutional reform, it essentially comes down to knowing that my dad used to register me, but now I have to do it. After all, it’s me who’s voting, whose names is on the register, whose credit ratings will be helped and who will get called up to jury duty, not my dad. It puts the responsibility of my civic duty directly into my hands. That’s not so bad is it?\nApart from attacking the claim that IER will make the register more complete, critics have pointed out that it doesn’t actually tackle the issue of electoral fraud. Sure - it’s not full proof on security, however the requirement of having to now provide identification does make it more secure than the status quo. IER is also a progressive measure. The desire to modernise and ‘move with the times’ is popular with us progressives so, again providing it’s done correctly, individual registration caters for our ever increasing mobile and individualistic society. Not only this but there is a greater number of people living in bedsits and shared accommodation on top of student accommodations, all for which traditional registration methods just do not work. It is only sensible that our democracy evolves with our society.\nThe changes will also bring new opportunities to rejuvenate young people’s interest in politics and go some way in giving them a sense of responsibility towards society. The simple process of filling in your own registration form can create an awareness of the civic duty that it brings. Yes, again critics have been skeptical of this argument and will note that they would rather have the more reliable parents ensure their kids register, but that is in no sense a progressive attitude and besides, if it’s to be compulsory anyway why not let young people take ownership? This also adds purpose to, frankly lackluster, citizenship education in schools. Registering, voting and other social obligations are no longer airy topics that students cannot relate to in their classrooms. It becomes a real duty that only they will be held responsible for.\nI accept there the tone of optimism in my argument, which is based on the (calculated) assumption that certain recommendations will be passed. For now however, we must wait for the bill to come before parliament and revisit the arguments then.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_reflections-on-the-interfaith-leaders-fellowship-on-climate-change-at-duke-university/content_15.html": "Reflections on the Interfaith Leaders Fellowship on Climate change at Duke University.\n- Hersh Thaker\n- Feb 1, 2023\n- 5 min read\nUpdated: Feb 2, 2023\nI was selected to participate in the Youth Interfaith Leaders Fellowship on Climate Change, a collaboration between Duke University and Faith for Our Planet. I joined 30 other young people from across the world looking to or already contributing to the energy transition through their communities. This piece is my opportunity to reflect and share learnings from the week.\nAs a technophile, I have primarily approached the energy transition by considering ways to make technological solutions affordable, accessible, and user-friendly. Business and technology hold the key to accelerating the energy transition. If we make technology solutions cheap, accessible and easy, people will naturally adopt and utilise them. However, this \"build it and they will come\" attitude is not enough. The more I’ve been reading into systems thinking, the more I’ve realised that we must also realign systems to drive increased political support, investment, and talent towards climate mitigation and adaptation efforts. This belief encouraged me to apply for the fellowship in the first place.\nThe question I went into the week at Duke was, how significant of a role can faith and faith communities actually play in climate change?\nThe language of climate change\nThe job of leaders in the energy transition is not to talk about climate change. Instead, we should think of ourselves as holders of stories and be able to empower people to tell their own stories to the broader community. Talking science will not bring people on the journey with us; we need to find the right language of the community to get them on board. Dr Normal Wirzba kicked us off with this message from the Duke Divinity School and set the tone for the week.\nHe gave the example that in a politically divided country like the US, where religion is also significant, talking about climate change with farmers living in the mid-west may be futile since it’s such a politically loaded term rejected by the Republican party in recent years. Instead, a conversation about the weather or soil quality is how to connect with people. Dr Ellen Davies, the renowned theology professor who specialises in translating the bible into relatable preaching with a particular focus on ecological crises, further emphasised this when she spoke to us about finding the correct language for our communities and congregations.\nGive Climate Change a face.\nThere is a human cost to climate change that millions of people are facing across mainly developing countries. As people's homes become uninhabitable, we will see the rise of climate-related migration. The World Bank estimates that 216 million people could migrate by 2050. Without migration, one-third of the global population will live in Sahara-like conditions affecting their physical health, agricultural productivity and vulnerability to crop diseases. In the UK and elsewhere, refugees and migrants are often dehumanised, making them easier to be ignored. I reflected that climate leaders should also take responsibility for giving a voice to those displaced by climate change, especially considering they do not currently receive the same legal protections as refugees under international law.\nWe were also reminded that climate change is intertwined with and will accelerate other humanitarian issues, such as poverty, violence and poor governance. It’s a reinforcing feedback loop. Dr Sarah Berneo presented her research on climate-driven migration in Central America, showing extraordinary migration from Honduras and Guatemala (two case study countries), particularly after climate events. For example, after the 2018 floods in Honduras, there was an influx of migration towards the USA. She presented Central America as a case study where the combination of violence, poverty, and climate change has resulted in rural-to-international migration from the global south to the north.\nDr Berneo's findings showed a shift in migration patterns in countries facing high levels of poverty and violence. Historically, migrations were typically from rural to urban or single individuals leaving their families behind to find work. However, after the 2018 floods in Honduras, Dr Berneo observed entire family units directly migrating from rural areas and being apprehended attempting to migrate to North America. The change in migration patterns indicates a greater sense of hopelessness and the belief that their country holds no future for them and their families, with existing societal issues combined with climate-driven events significantly triggering these migrations.\nWhereas the case of central America points to a need to improve the migration options available to climate refugees, Bangladesh presents opportunities for also investing in climate adaptation measures.\nThe situation in Bangladesh highlights the pressing need for investment in climate resilience. Rising sea levels and flash flooding are causing rural-to-urban migration as more people flock to Dhaka, which has become a mega-city. However, the growth of the city's population is outpacing its infrastructure development, leading to overcrowded and inadequate housing and increased urbanisation in areas vulnerable to hazards like landslides.\nA significant increase in climate financing for adaptation measures is required to protect such vulnerable communities and prevent forced onwards international migration. Despite the need, the current funding of 80 billion dollars in 2019 is far from the estimated 300 billion needed for adaptation efforts.\nFaith in action\nDuring the fellowship, we learned about the external challenges the world is facing and explored how best to respond to them. At the same time, I was struck by how faith is already being harnessed for positive change. I want to highlight two specific examples that particularly stood out to me.\nDr Rajwant Singh, global President of the EcoSikhs, inspired us by sharing his organisation's work. They have mobilised the Sikh community to act on climate change, and they’re on a mission to plant a million trees through a system they’ve developed for growing forests. They’ve produced 510 forests and planted over 280,000 trees across India, the UK and the USA in just three years.\nEcosikhs have mobilised an army of volunteers and paid staff members focused on planting and maintaining forests and supporting those with available land to grow. They’re self-sufficient and run off private sponsorship and donations without government support. We were all impressed by their incredible job of mobilising a community by connecting their climate change mission to their faith traditions.\nWater and faith.\nWater is symbolic in all faith traditions, with most rituals involving water use. Yet some of the holiest rivers in the world are the most polluted; take the river Jordan or the river Ganges.\nDr David Katz from the Nicholas School of environment shared his experience working on the “Save the Jordan” project. Dr Katz noted that mobilising the faith leaders were crucial to the project, and no amount of science or data would have been able to bring the leaders to the table. Belief systems and spirituality moved people and got them to respond to the crises facing the river Jordan.\nSimilarly, trees are significant in Buddhism since It was under trees and in caves where the Buddha found enlightenment. Monks in Thailand, dubbed ‘ecology monks’, have been ordaining trees by wrapping orange robes around the trunks to protect them from incursion. Once ordained, they become spiritually significant and are less likely to be destroyed for economic purposes. It’s a clear example where the moral authority of religion is more powerful than science or data.\nConclusion\nComing back to the question I started the week with, it becomes embarrassingly clear just how powerful a role faith communities and leaders have in the energy transition. It’s just as much of a battle of hearts and minds as it is of science and technology. The conversations, musings, lectures and readings over the week have reaffirmed my commitment to engage further within the context of my local community. I’m grateful to Duke University and Faith for Our Planet for the opportunity to be immersed in the environment and spend a week with an incredible group of people.\nWatch this space.",
  "https_www_hershthaker_com_/https_www_hershthaker_com/content_1.html": "I use this platform to share my thoughts on clean energy, technology, politics, and social impact.\nI am always open to meaningful conversations, so don't hesitate to connect with me on my social media channels or through email.\nThank you for visiting!",
  "https_www_hershthaker_com_/https_www_hershthaker_com_blog_categories_personal/content_16.html": "Hersh ThakerFeb 1, 20235 min readReflections on the Interfaith Leaders Fellowship on Climate change at Duke University.I was selected to participate in the Youth Interfaith Leaders Fellowship on Climate Change, a collaboration between Duke University and...\nHersh ThakerJan 16, 20211 min readSpeaking about WhatsApp’s new data privacy policy on BBC Radio LeicesterI was invited to share my thoughts on WhatsApp's updated privacy policy and what it means for UK consumers.\nHersh ThakerJan 1, 20211 min readSupporting the vaccine roll outTo say the vaccine roll out is in full flow would be a slight overstatement but with over 700,000 people now vaccinated in the UK at the...\nHersh ThakerNov 15, 20201 min readTalk on Climate Change at iGlobal's 'Diwali Fest'As part of the iGlobal virtual Diwali celebrations i was invited to join a panel of guests to discuss the impacts of the current climate...\nHersh ThakerJun 24, 20201 min readTalk on environmental leadership with NHSF UKI was delighted to join Gopal Patel on a virtual panel with students from the National Hindu Students Forum UK to discuss environmental...\nHersh ThakerOct 1, 20181 min readPresentation at Shell ProductConShell held their first internal product conference in November 2018 where we bought together all consumer facing product teams in the...\nHersh ThakerJun 3, 20171 min readLeicester SOUP raises £500 for the 'I Love me' project. Congratulations to Lydia Unsudimi who's 'I love me' project won the community vote and took home all of the money raised at the door. The...\nHersh ThakerNov 7, 20125 min readSpeech at \"Empower a generation\" event.In my role as a member of Youth Parliament for Leicester i was invited by Operation Black Vote and Unison to speak to a group of students...",
  "https_www_hershthaker_com_/https_www_hershthaker_com_contact/content_32.html": "Home\nBlog\nContact\nMore\nIf you'd like to get in touch with me please fill out the form below and i'll get back to you right away.\nThanks for submitting!",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_talk-on-environmental-leadership-with-nhsf-uk/content_34.html": "Talk on environmental leadership with NHSF UK\n- Hersh Thaker\n- Jun 24, 2020\n- 1 min read\nUpdated: Nov 15, 2020\nI was delighted to join Gopal Patel on a virtual panel with students from the National Hindu Students Forum UK to discuss environmental leadership and the role students can play in the the energy transition.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_what-are-solid-state-batteries-and-why-could-they-be-so-important-to-the-future-of-electric-vehicles/content_18.html": "What are Solid State Batteries and why could they be so important to the future of Electric Vehicles\n- Hersh Thaker\n- Aug 6, 2018\n- 3 min read\nThere is widespread belief in the industry that the tipping point for mass EV adoption and therefore scale up the production of EV’s will come at the point the price of a battery cell hits $100 /kWh. We have already seen the price come down from $1000 /kWh to somewhere around $200 /kWh in 2018. However to see real scale, electric vehicles need to become more affordable which is why that $100 mark is so important. Are solid state batteries the answer to help get us to the magic number?\n3 key things to know about the battery:\nEnergy Density This refers to the capacity of a battery. A Nissan 22 /kWh battery means it can store 22 /kWh of power. The higher the energy density, the longer the battery stays charged = longer range\nPower Density This refers to the how fast a battery can charger and discharger power. The higher the power density = the faster the car will charge. The limit on power density is the reason why you cannot charge a Nissan Leaf any faster on a 100kw chargers vs 50kw chargers\nBattery Composition The battery is made up of a collection of modules. Each module is made up of a collection of cells. Therefore the more cells that you can fit into a module and the more modules that you can fit into a battery, the higher then storage capacity of the battery and therefore the more range you can travel!\nWhat are the key problems with Batteries today?\nRapid charging causes battery degradation. Although there are calls to increase rapid charging infrastructure, constantly rapid charging will degrade the battery. This is a problem today since any degradation on low energy density batteries make a big impact on the range. For future batteries with higher capacity (40kWh +), this may not be such a big issue.\nExtreme temperatures (cold or hot) will increase the degradation of the battery. Therefore the quality of the battery over a period of time will be influenced by the location of the EV. (E.g. an EV battery in the Sub-Saharan Africa will degrade much more than an EV battery in the UK).\nBatteries today are highly dependant on Cobalt. Batteries use 3 main raw materials: Nickel, Magnesium & Cobalt. Cobalt is the biggest problem since it is rare and expensive. Future developments will need to reduce the dependency on Cobalt to bring down price.\nBatteries need to become cheaper, pack more density, become safer and reduce dependency on Cobalt. The cost of a today is approximately $250 /kWh, the aim is get to $100 /kWh.\nHowever it is believed the current lithium-ion battery technology has reached it’s potential in terms technological efficiency and therefore economic efficiency.\nWhat is a Solid State Battery?\nSolid-state batteries replace the liquid or polymer electrolyte found in current lithium-ion batteries with a solid material, therefore requiring less space.This means solid state batteries can pack more density and aren’t as bulky. The solid state battery still works in the same way a lithium-ion would work but the change in materials bring many benefits.\nCurrent lithium-ion battery technology has reached it’s potential in terms technological efficiency and therefore economic efficiency.\nBenefit of a Solid State Battery?\nIncreased density means they carry more power, which means longer range vehicles. They can pack up to twice as much energy as lithium ion batteries.\nSolid state electrolytes are less reactive than liquid/gel electrolytes found in lithium -ion and therefore they are less prone to degradation and will last longer.\nSolid state batteries are much safer for the same reason as above.\nWhether we can get to the $100 barrier using Lithium - ion battery technology or not is to be seen. However, the breakthrough of solid state batteries to go beyond R&D and into production will be a real tipping point for mass market production and take up of electric vehicles.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_does-climate-change-require-a-shift-in-our-paradigm-or-can-we-rely-on-technical-solutions/content_3.html": "Does climate change require a shift in our paradigm, or can we rely on technical solutions?\n- Hersh Thaker\n- Nov 1, 2021\n- 16 min read\nUpdated: Jul 30, 2022\nIntroduction\nThe American Ecologist Garrett Hardin describes the problem of unencumbered population growth as a \"Tragedy of the Commons\". His basic premise is that the earth and its resources are finite and cannot accommodate exponential growth in the human population. To describe the tragedy at play in the commons, he uses the analogy of an open and common pasture where herdsmen raise their herd of cattle. Since the herdsmen reap the proceeds from selling his cattle, as a rational being, it is in his interest to continue adding cattle to his herd. All herdsmen share the negative consequence of overgrazing, made worse with each additional cattle. Hence, the cross-benefit analysis of adding cattle is always positive in the common pasture. The problem is that all rational herdsmen individually conclude that the only sensible action for them to pursue is to continue to grow their herd in a shared and limited common. Herein lies the tragedy. There is a conflict between individual and collective rationality, and ultimately \"Ruin is the destination towards which all men run… freedom in a common brings ruin to all\"[1].\nThis piece uses the tragedy of the commons as the framework to view the challenge of the net-zero transition. I will assess whether transitioning to a net-zero world requires us, as rational beings, to change our values or whether it is enough to rely on technical solutions alone. The transition to net-zero describes moving from a world where we collectively generate more greenhouses than we eliminate to one where we are at equilibrium. For ease of phrasing, I will refer to this simply as \"net-zero\" from this point onwards. I will also borrow Hardin's definition[2] [RS1] of a technical solution grounded in the natural sciences and extend it to include any formal government legislation instruments that create a legally binding obligation, such as paying taxes. When referring to 'solutions ', I am referring to solutions that will transition us to a net-zero world whilst keeping global temperatures under 1.5 degrees[3]. That is the unequivocal ceiling that the international scientific community has set. The 1.5-degree target is important in our definition because, although burning all the oil we have until we run out might eventually transition us to a net-zero world and force us to look for alternative and cleaner sources, it would not serve as a solution to stabilising our climate.\nI argue that technical solutions alone cannot solve the climate crisis. It requires a collective paradigm shift. I start by assessing the standard technical solutions we have today, focusing mainly on governance instruments but also technology. Instruments of governance include domestic law, international trade agreements, embargos, and voluntary international agreements facilitated by the United Nations. I will show that this techno-optimistic approach is too theoretical and not supported by how the world operates in practice. Hence, although they play a critical part, they cannot be relied upon without changing our paradigm. I will then argue why a shift in our moral paradigm is essential for the technical solutions to be effective and to overcome the tragedy of the commons. I draw upon systems thinking to help frame the conclusion.\nGovernance as a technical solution\nThe main tool nation-states have at their disposal is to implement laws to govern within their recognised jurisdiction; let's call this domestic law. At a local and national level, domestic law, on the face of it, seems perfectly equipped to mitigate externalities within its boundaries.\nThe Climate Change Act, introduced by the Labour Government in 2008, is an excellent example of an effective technical solution. It represented the first global legally binding climate change mitigation target set by any country and set out compulsory climate change reduction targets. It committed the UK government to reduce greenhouse gas (GHG) emissions by 80% by 2050 compared to 1990 levels. This agreement was amended in 2019 to further commit the UK to net-zero by 2050, making it the first country to make such a commitment.\nThe policy gave direction and impetus to UK lawmakers. In recent years we have seen a cost on plastic bags, subsidies to purchase electric vehicles and build commercial wind farms and grants to insulate homes better. The outcomes have been largely positive here in the UK. Total GHG emissions in 2019 are estimated to be 43.8% lower than in 1990[4], and Carbon Dioxide emissions are down 40% over the same period. Despite the success experienced in the UK, I believe this policy instrument falls short of being a solution as defined earlier.\nBritain should feel proud of the progress that we have made. However, it cannot be seen as a success if our collective emissions increase. In the commons, this would be the equivalent of one man reducing the rate at which he adds cattle to his herd each year but finds his neighbour is increasing his by an ever-greater pace. The resources of the commons are still depleting.\nBritain reduced its GHG emissions by over 40% between 1990 and 2019. Over the same period in the USA, GHG rose by 2% and carbon dioxide emissions by 3%[5]. Carbon dioxide emissions in India and China grew by over 300%, South Korea by over 150%, Brazil by 120%, Mexico by over 70%, Australia by 50% and Canada by 40%[6]. The data shows that despite the UK 'successfully' deploying domestic policy to reduce its emissions, the aggregated outcome during the period took us further away from our goal.\nIt is worth touching upon why emissions have risen so dramatically in developing countries. Developed countries have shifted much of their heavy, carbon-intensive manufacturing industries to the developing world, resulting in Carbon Leakage. Carbon Leakage refers to the situation where businesses transfer production from a country with strict climate policies to one where they are more lenient. We have seen this shift from the EU to developing countries, notably China. For example, as British manufacturing capabilities fell by half between 1990 and 2020[7], emissions from manufacturing also fell by 40%. Over the same period[8], our imports from markets like China have grown significantly. This shifting of emissions from one domestic market to another shows that domestic policy instruments cannot be relied on as a technical solution for the commons, although valuable in our toolkit.\nDomestic policy as a solution works well where geographical boundaries within which the problem you are trying to solve are well defined. For example, legalising gay marriage, giving women the vote, or introducing mandatory vaccines are all examples of policy instruments being used to (essentially) solve a problem. To make something illegal or legal enables you to control the outcome within your jurisdiction. However, it does not work for climate change issues because no matter the benevolence of one country's climate policies, they are largely irrelevant without collective action. Although the UK had implemented the climate change act, a technical solution, to reduce its emissions, the world was still producing more CO2 than it ever had. Herein lies the problem with domestic policy as a technical solution. The climate impact is on the commons, and no matter how effective a domestic policy instrument might seem, it does not work as a solution in isolation.\nTechnology alone as a technical solution\nWe will need to improve and scale existing technologies and invent new solutions. Technologies included making existing solutions more efficient and cheaper, such as Electric Vehicles (EVs), new and safer ways of producing cleaner energy, such as nuclear, or finding ways to sequester carbon via carbon capture technologies. I will not focus on the merits and challenges of deploying such solutions. (For those looking for an introduction on the topic, I would recommend Bill Gates's book \"How to avoid a climate disaster\"). Instead, I believe that technology alone cannot serve as the primary solution to climate change.\nDeveloping and deploying new technology is expensive, requires shifts in how economies are organised and requires mass upskilling of the workforce. Technology and private enterprise, where the market is still nascent, as it is in the clean technology space, needs government support and domestic policy initiatives. For example, in the UK, the government has announced a ban on the sale of new internal combustion engine vehicles from the year 2030. They have also been subsiding the cost of new electric cars, home charge points, and public charging infrastructure. It is difficult to see how EVs would have picked up any serious momentum without such interventions. However, since we have just shown that domestic policy alone cannot be sufficient and technology without policy support cannot be relied on, we need to look further.\nTo show that technical solutions, in the form of governance instruments, are an effective solutions, we need to mandate action in a coordinated manner that involves all countries and people.\nInternational Governance\nI have demonstrated that domestic law as a technical solution is effective, to a point, but falls over when other countries do not coordinate similar responses. Since the climate does not recognise boundaries, who is the common authority at this level?\nAccountability on the global political stage has never been easy to achieve because of the fundamental premise that nation-states are sovereign. In a democracy, leaders are accountable to voters; in a theocracy, leaders believe they are accountable only to God and leaders from authoritarian states feel accountable only to their own set of values.\nNation-states are not legally bound by any common authority and would see any restrictions on resource utilisation or extraction as a threat to their sovereignty. The United Nations (UN), set up to maintain peace after the second world war, today plays the coordinator role. Despite being the closest thing we have to one, the UN is not a global authority. Previously executive director of the UN's environmental programme, Achim Steiner described the UN as an \"honest broker\"[9]. He explains its role to realise trust between nations \"based on mutual self-interest and a sense that all are acting for a common cause\"[10].\nThe UN supports climate action through the UN Framework Convention on Climate Change (UNFCCC) and is the primary forum for agreeing on multilateral policies between nation-states to stabilise GHG emissions globally. The conference has a nearly universal membership of 197 countries, making it the only international body all countries are signed up to and engaged. The convention supports several international bodies and processes working towards international policymaking on climate change. Most notably, it supports the Conference of Parties (COP), the supreme decision-making body of the convention and represents all 197 parties. At the annual COP conference, countries will negotiate, agree on targets, and track progress.\nHere are the key milestones that the COP have agreed upon over the years:\nYear | Name | Importance |\n1997 | Kyoto Protocol | Kyoto was the first legally binding agreement that required developed countries to reduce emissions by an average of 5% by 2012 on 1990 levels. It also establishes a system to monitor countries' progress. |\n2012 | Doha Amendment | Doha extended Kyoto to the second phase 2013 - 2020 and sets a goal to reduce GHG emissions by 18% on 1990 levels for participating countries. Developed countries agree to support developing countries to adapt and mitigate the impacts of climate change. |\n2015 | Paris Agreement | Paris was the first global agreement that required both developed and developing countries to set emission reduction targets. Clear mission to keep global temperature rise below 2°C and pursue efforts to keep it below 1.5°C. |\n2021 | Glasgow Climate Pact | Glasgow called for countries to reduce coal use and fossil fuel subsidies for the first time and urged governments to submit more ambitious emissions-reduction targets by the end of 2022. Smaller groups make side deals on deforestation, methane emissions, coal, and more. |\nThe UN and COP have been integral in providing a framework and a forum through which countries can influence, debate, and cooperate and have led to notable agreements and milestones, as highlighted above. It is the closest thing we have to a global government. However, I believe it also falls short because it isn't one and so cannot be referred to as an instrument of governance that will provide a solution. It simply does not have the mandate or authority.\nWe can assess the shortcomings of the UN by assessing the notable agreements I just referred to. Heralded as the first legally binding agreement, the Kyoto Protocol was limited only to developed nations. The USA never formally ratified the treaty, and Canada later pulled out entirely. Even the countries that remained within the agreement only collectively met the commitment by chance. The fall of the Soviet Union decimated their manufacturing industry which caused an inevitable drop in emissions. The Doha amendment, which extended Kyoto to a second phase and bought it up to 2020, only had commitments from European member countries and Australia. USA, Russia, Canada, Japan and other developing countries did not make any commitments and instead made voluntary pledges for climate action[11]. Voluntary pledges are not reliable.\nParis 2015 was important because it was the first time both developed and developing countries made commitments. They committed to setting Nationally Determined Commitments (NDC's), which are each country's emission reductions targets by 2020 and submitting updates every five years after that. The commitment to NDC's explains why so many countries and companies have set net-zero reduction targets over the last couple of years. However, frailties of such international 'commitments' were laid bare by Donald Trump when he pulled the USA from the agreement in 2017. There was nothing the UN or any country could do about it. The USA did re-join in 2020 after Biden became president. Still, a major emitter was willing and able to walk away from this agreement, which is why the UN framework is not a reliable solution.\nMost recently, at COP 26, the Glasgow pact introduced the first global commitment to reduce coal usage, amongst other agreements such as stopping deforestation. However, analysts note that even if all countries follow up on their obligations for 2030 and beyond, we will still miss the target of 1.5°C. Some assessments go further to say the pledges would not even achieve the weaker target of keeping temperatures below 2.0°C[12].\nMy intention is not to downplay the importance of the UNFCCC. The climate conferences and agreements are critical if we want to stay within 1.5 degrees, stabilise the climate and protect communities that will inevitably be affected by the impacts we're already seeing. Each agreement has been a building block that has led to more action. However, the UNFCCC falls short of being a technical solution like domestic policy. There is no mandate to enforce action, and it is too easy for countries, often constrained by their own political pressures to dither and renege on their commitments. We have enough empirical evidence of this since the conception of the UNFCCC in 1992. We cannot rely on these international agreements alone as a solution to keep us under 1.5 degrees. We need to recognise that the effectiveness of the UN is constrained because it sits within the context of a broader system at play.\nSystems Thinking as a framework\nSystems thinking is a helpful framework for assessing the effectiveness of a solution. It allows us to look at the shortcomings of technical solutions to a complex problem like climate change by holistically considering the relationships with different systems parts.\nGovernments only have a finite number of policies to implement in their time in power. They benefit from an inflow of support when they do something popular and suffer from an outflow of that support when they do something unpopular. The partisan nature of politics means that there is always an inflow and outflow of support for governments at any given time.\nThe flow rate of this support will determine the stock of policies the government can implement. The longer they maintain a substantial inflow of political support and the slower the outflow of support, the longer they will stay in power and the more policies they will have the opportunity to implement.\nThe rate at which they gain and lose support will be determined by what system thinkers call feedback loops. Feedback loops are the critical driving force here. J.W Forrester once said, \"Everything we do as individuals, as an industry, or as a society is done in the context of an information-feedback system\". In the governance model, the information feedback system is the political will and support of the people. Even non-democratic countries count on political will and feedback flows; it would have a lesser impact on the stock because they can hold onto power for much longer.\nIn figure 2, stock represents the finite stock of technical solutions. These technological solutions represent all government's political, technical and economic apparatus at its disposal. Such as the climate change act, new subsidies for wind farms or carbon taxes. The more significant the discrepancy between public expectation and government implementation, the slower the inflow of support and the faster the outflow rate. Losing support faster than you gain will deplete the stock of policies those in power can implement. Therefore, it is in the interest of those in power to reduce that discrepancy by delivering popular and public interest initiatives.\nLet’s look back at global climate agreements made by countries at COP. Suppose setting and delivering on international commitments increase the discrepancy between the expected and delivered political agenda. In that case, it will reduce the inflow and increase the flow of outflow support. Therefore, governments will not prioritise it. This system of governance explains why successive governments have reneged on agreed commitments over the years, as Trump did, with the Paris agreement. He was doing what he believed would maximise his stock.\nThere has been a system failure in using technical solutions alone to solve the climate emergency. Many competing policy issues and crises are higher on the priority list and will increase the government's stock much faster. Climate-focused action needs to compete against these other initiatives. Until the lack of climate action reduces support inflow and increases outflow, frameworks like the UNFCCC will fall short. We need a way to strengthen the system by strengthening the feedback loop.\nShifting paradigms to strengthen the feedback loop\nThe tragedy of the commons arises because of weak, delayed, and often missing feedback loops. In the commons, we miss or receive weak feedback loops when we act rationally but against the interest of nature. For example, we still choose to drive rather than take public transport if it is more convenient, we consume more than we need for survival, we don't always clean up after ourselves or refuse to give up using single-use plastics. But we suffer no consequence for our selfish behaviour. Instead of behaving in the responsible interest of the community, it is usually easier to enjoy rewards of convenience and profitability.\nAs a result of the missing feedback on our behaviour, our expectations of what we expect from our leaders or what we are willing to tolerate become skewed. For simplicity, in Figure 3, I have labelled public expectations as \"public opinion\". Public opinion in the system will determine the public's expectations and, therefore, determine the discrepancy between what we expect and what is happening. For example, most of us would not tolerate dramatic increases in fuel prices or costs of goods imported from China. Rationally this makes sense since my fuel use is not having any adverse impact on my life today, and neither is me wanting cheap toys for my children. However, spending more on these goods would have an immediate and painful feedback loop.\nPublic Opinion\nScience-based technology solutions to climate change are critical. Technology solutions such as renewable energy generation, electrification of heat and transport or the development of non-hydrocarbon-based bio-plastics are real solutions for the energy transition. However, as we have established, they are not sufficient in themselves. Similarly, domestic policy and international frameworks such as the UNFCCC are levers our leaders must pull on. Again, however, we have established that they are not sufficient in themselves. For technical solutions to be effective, they require a change in our attitude, behaviours and preferences.\nHerein in the trap of the tragedy of the commons and why using technical solutions without shifting our paradigm will not allow us to combat the climate emergency with the vigour needed. We are missing the feedback loop to incentivise us.\nEducation and exhortation are ways we can achieve this. Indeed, many cultures have managed common resources in this way. For example, despite being relatively well off, my family in India has grown up valuing and preserving every drop of water because of restrictions on clean water supply. These cultures have lived closer to nature or, like my family, have had to live with scarcity; therefore, they have a faster feedback loop than the growing urbanised population of today. Hardin also saw the education and exhortation method as valuable but with limited use because it is open to being abused by those who refuse to respect the traditions and choose to be ignorant.\nWe need an extension of our current moral compass or what the America Philosopher, Thomas Kuhn, referred to as a 'paradigm shift' to shift our current systems feedback loops and ensure our leaders prioritise the technical solutions we need. By shifting our paradigms, we move society collectively along with us. It seems like a big ask, but as the systems thinker, Donella Meadows concludes, \"there's nothing physical or expensive or even slow in the process of paradigm change. In a single individual, it can happen in a millisecond\"[13]. Admittedly, making such paradigm shifts across whole societies is much more difficult. Collectively we are far more resistant to change. But it can be done and is already happening. Issues such as slavery or female disenfranchisement, which society accepted as the norm only a couple of generations ago, would be unthinkable today.\nTherefore, we must continue to call out the failings of the old ways of thinking and to keep speaking about the issue loudly. We ensure that when we vote, we put people into places of power with this paradigm, and we teach it to our children so that it becomes all they know for the next generation. This change is already happening and will continue to happen as long as we are deliberate. It is important to remember our collective paradigm will shift slowly. It is not a revolution, and we will only see the success of our actions when we have the luxury of looking back at the world and the life we used to live. For example, our children will find it hard to comprehend that we used to burn fuel extracted from the ground to power our cars.\nThis paradigm shift will allow us to build systems of what Hardin labelled \"mutual coercion mutually agreed upon\"[14]. We ultimately need to get a place where we are happy to enforce the restriction on our ability and freedom to abuse the commons. Thinking back to Figure 3 above, to have restrictions imposed upon us could risk the flow of support for leaders. Therefore, to avoid the system's trap, any form of coercion needs to be an expectation of the public.\nThere are everyday measures of mutual coercion agreement that we hardly think about because they are grounded in a shared idea amongst the people living in the community. For example, taxation, traffic lights, parking restrictions, and building permits are all cases of having our freedom restricted. We accept them because they follow the shared idea in our minds that make up the collective paradigm of our society. They are our deepest beliefs about how we believe the world should work.\nConclusion\nEffective to a point, technical solutions alone are too easy to change or not deploy because of political or economic pressure and thus cannot be relied upon alone. We need to recognise that we have a collective responsibility to shift our paradigm as a society because of our system of governance. Global cooperation is possible in protecting our commons only when prioritising the wellbeing of our climate becomes an unstated assumption rather than a partisan issue.\nRalph Waldo Emerson best sums up the idea when he says, \"Every nation and every man instantly surround themselves with a material apparatus which exactly corresponds to their moral state or their state of thought. Observe how every truth and every error, each thought of some man's mind, clothes itself with societies, houses, cities, language, ceremonies, and newspapers. Observe the ideas of the present-day—orthodoxy, scepticism, missions, popular education, temperance, anti-masonry, anti-slavery; see how each of these abstractions has embodied itself in an imposing apparatus in the community; and how timber, brick, lime and stone have flown into convenient shape, obedient to the master-idea reigning in the minds of many persons\"[15].\nFinally, as Krishna tells Arjun in the Bhagavad Gita that \"considering the wellbeing of the world, you must take action\". In the same way, we must also continue to act, and talk, and only then will we achieve the shift in the paradigm of the world needed to protect our natural world.\nNotes\n[1] Hardin, Garrett, The Tragedy of the Commons, in, Science, New Series, Vol. 162, No. 3859 (American Association for the Advancement of Science: 1968)\n[2] Hardin, Garrett, The Tragedy of the Commons, in, Science, New Series, Vol. 162, No. 3859 (American Association for the Advancement of Science: 1968)\n[3] IPCC, Impacts of 1.5°C of Global Warming on Natural and Human Systems, 2018 [https://www.ipcc.ch/sr15/chapter/chapter-3/]\n[4] Department for Business Energy & Industrial Strategy, 2019 UK Greenhouse Gas Emissions, Final Figures, (Accessed November 2021)\n[https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/957887/2019_Final_greenhouse_gas_emissions_statistical_release.pdf]\n[5] EPA, Climate Change Indicators: U.S. Greenhouse Gas Emissions, 2021 (Accessed December 2021)\n[https://www.epa.gov/climate-indicators/climate-change-indicators-us-greenhouse-gas-emissions]\n[6] Tiseo, Ian, Change in carbon dioxide emissions in selected countries from 1990 to 2019, 2021 (Accessed December 2021)\n[https://www.statista.com/statistics/270500/percentage-change-in-co2-emissions-in-selected-countries/]\n[7] Macrotrends, U.K. Manufacturing Output 1990-2022 (Accessed December 2021)\n[https://www.macrotrends.net/countries/GBR/united-kingdom/manufacturing-output]\n[8] Tiseo, Ian, Carbon dioxide (CO2) emissions from the manufacturing industry in the United Kingdom (UK) from 1990 to 2019, 2021 (Accessed December 2021)\n[https://www.statista.com/statistics/486100/co2-emission-from-manufacturing-uk/]\n[9] Steiner, Achim, The UN role in climate change action: taking the lead towards a responsible future (Accessed December 2021)\n[https://www.un.org/en/chronicle/article/un-role-climate-change-action-taking-lead-towards-global-response]\n[10] Steiner, Achim, The UN role in climate change action: taking the lead towards a responsible future (Accessed December 2021)\n[https://www.un.org/en/chronicle/article/un-role-climate-change-action-taking-lead-towards-global-response]\n[11] European Parliament, Doha Amendment to the Kyoto Protocol, 2015 (Accessed December 2021)\n[https://www.europarl.europa.eu/EPRS/EPRS-AaG-559475-Doha-Agreement-Kyoto-Protocol-FINAL.pdf]\n[12] Edie, Glasgow Climate Pact: The 7 key talking points from the new global deal at COP26, 2021 (Accessed November 2021)\n[https://www.edie.net/news/9/Glasgow-Climate-Pact--The-7-key-talking-points-from-the-new-global-deal-at-COP26/]\n[13] Meadows, Donella, Thinking in systems book, P.163 (Chelsea Green Publishing: 2008)\n[14] Hardin, Garrett, The Tragedy of the Commons, in, Science, New Series, Vol. 162, No. 3859 (American Association for the Advancement of Science: 1968)\n[15] Emerson, Ralph Waldo, The complete works of Ralph Waldo Emerson: Miscellanies. Vol. 11, Page 167 (University of Michigan Library: 2006)\n[RS1]Reference this.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_6-reasons-why-brexit-is-a-bonkers-idea/content_28.html": "6 reasons why Brexit is a bonkers idea\n- Hersh Thaker\n- Jun 17, 2016\n- 4 min read\nUpdated: Dec 28, 2018\nBefore I start let me be clear. Yes there are problems with the EU but that isn’t a reason to leave it. Don't bury your head in the sand and let people tell you that it is impossible to reform the EU and instead pretend that we can live in a perfect world outside of it. There are a lot of things in life, which don’t work as well as you want it to, but you know there is value in it and so you work at it and make it better. You don’t stick two fingers at it and walk away. The EU is too important to walk away from and if you don’t want to read what I have to say on it, that’s cool, instead spend 5 minutes to watch this short video by the Financial Times.\nLet me argue in 6 simple points why for me its makes no logical sense to vote leave.\n1. Economy: Almost every respected national and global institution has come out to say Brexit will have a negative impact on the British Economy. Here is where I see the starkest hypocrisy of many Brexit supporters. I know many people that I’ve spoken to and also observed across Facebook, who voted Conservative at the last election because they wanted ‘Economic Certainty’ and didn’t trust Labour with the economy. However the same people now seem to be willing to risk economic uncertainty against the advice of the Bank of England and the majority of big businesses on a gamble. This is embarrassingly hypocritical.\n2. Immigration: To suggest we have zero control of our borders within the EU is untrue. The UK is the only Western European nation that did not join the passport free Schengen travel zone, which even other Non-EU member states such as Norway and Switzerland have joined! The UK are also able to refuse benefits to unemployed EU migrants. So it isn’t strictly true that we have no control.Also, despite all of the scaremongering, only 24% of net migration since 1990 has actually been down to EU Immigration according to the Office for National Statistics. The majority of immigration today is still From India, then China, then Pakistan and fourthly Poland. So those of you calling for a stop to Polish Immigration, logically you must be in favour of culling Indian, Chinese and Pakistani immigration too. If this is seriously your position then you are irrational and probably a hypocrite. Ian Duncan Smith, Former Work and Pensions secretary who created much of hype the around immigration and its impact on benefits was forced to admit that he lied and misled the public. The reality is that a EU migrant is LESS likely to claim benefits that British people.\n3. There is no post Brexit Utopia: Norway Case Study: The Leave campaign often use Norway as the shining beacon of post Brexit Utopia. Whilst yes it’s true that Norway do enjoy access to EU markets through the EEA (European Economic Area), any sensible person will also understand that you can’t have something for nothing. To be part of the trade bloc, Norway still implements EU law, they still have EU immigration, they still have to retain EU’s product standards, financial regulations, and employment regulation and still contribute towards the EU budget. However they have zero influence over any of the policy decisions. This week the Norwegian Prime Minister and ex-EU advisor has advised Britain not to leave the EU warning us that if we leave we will still have to pay into Brussels but in return will no longer have any influence in decision making. So don’t be ridiculous to think we can leave the EU and still have a sweet deal on our terms at no cost. It isn't possible.\n4. EU Regulation: Suddenly we seem fixated on ‘EU controlling UK Laws’. Which isn’t strictly true. Yes an unelected Europe commission does propose legislation. But it is fully accountable to the elected European parliament. Of course there are flaws with this structure, just as there are with the British democratic system. But it’s obviously better to be inside to reform it rather than outside and still be affected. EU legislation has been a blessing across many areas in the UK. Here are some of the workplace laws which have been ‘cast down upon us’ which you probably didn’t know came from Brussels:Minimum paid annual leave (now 28 days a year including bank holidays)Additional rights for agency and temporary workers and for part-time workersCurrent pregnancy and maternity leave rightsParental leaveWorking time (which includes a maximum of a 48-hour week unless you agree otherwise, and minimum rest breaks each day)Equal payAnti-discrimination rules on race, sex, disability, age and sexual orientationData protection rights\n5. Identity & Scotland: If we vote to leave we will lose Scotland. The SNP will have a mandate to trigger another referendum. What are we then left with? A Northern Irish, Welsh and English Government led by Boris Johnson. Think about it! Brexit campaigners suggest we wont just remain ‘Little Englanders’ if we vote to leave. The reality is that we will and it will be to our detriment. What we must realise is that many of the global powers of the world are not liberal democracies. Many of them don’t buy into the ideals of our culture and so is important that we remain a close European community to challenge global threats we face as well as seizing the opportunities.\n6. Credibility: I will leave you with this, yes you should make your own decision. But sometimes it’s good to see who’s on your side. Look at the two lists below. Whose opinion do you trust more? Don't gamble on our future on a ludicrous and illogical pursuit of a 'perfect' world outside of the EU. The reality is that we're stronger, safer and richer as part of a European Community.\nExtra Reading:\nCBI Factsheet: http://news.cbi.org.uk/reports/our-global-future/factsheets/factsheet-2-benefits-of-eu-membership-outweigh-costs/Article by LSE Professer of public policy : http://blogs.lse.ac.uk/brexitvote/2016/05/27/dear-friends-this-is-why-i-will-vote-remain-in-the-referendum/FT Video on the economic risks of Brexit -http://video.ft.com/4854069744001/Martin-Wolf-on-Brexit-fears/World [",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_speaking-about-whatsapp-s-new-data-privacy-policy-on-bbc-radio-leicester/content_33.html": "Speaking about WhatsApp’s new data privacy policy on BBC Radio LeicesterHersh ThakerJan 16, 20211 min readI was invited to share my thoughts on WhatsApp's updated privacy policy and what it means for UK consumers.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_leicester-s-divisive-election-calls-for-fresh-leadership/content_17.html": "Leicester's divisive election calls for fresh leadership\n- Hersh Thaker\n- Sep 5, 2023\n- 5 min read\nThis article was originally published with Leicester Gazette.\nEarlier this year, I had the privilege of standing as a Labour Party candidate for the city council elections in the Belgrave Ward, an area I grew up in and know intimately. As I reflect on this experience as a first-time candidate in one of the most divisive elections the city has ever seen, I share my reflections and look forward to what lies ahead.\nI joined the Labour Party 14 years ago, inspired by Patricia Hewitt, for whom I worked as an intern at her constituency office during her time as the MP for Leicester West. Seeing the impact of the day-to-day casework her office dealt with to help people triggered my political aspirations, leading me to become a youth councillor and, later, a representative of the youth parliament for Leicester.\nI've studied politics as part of my degree and have campaigned for local Council, Parliamentary and Mayoral candidates whilst lending my voice to local and national campaigns.\nArmed with that political experience, I hit the streets to launch my campaign. However, the reality of deeply rooted local concerns among voters quickly became clear. It would be tough for me or the party to deliver the political messages on which we wanted to focus the election.\nA campaign dominated by local issues.\nI wanted to talk to voters about key issues I knew were important in Belgrave. The need to channel investments into road and pavement resurfacing on the Golden Mile, safeguarding the cherished Diwali celebrations that have long placed Leicester on the global map, bolstering patrols in anti-social hotspots, expanding our tree cover, enhancing cycling infrastructure to render our streets more appealing and increasing community healthcare facilities. Unfortunately, the narrative slipped away from us right from the outset.\nThree events ultimately dominated the discourse and meant that Labour Party candidates in Leicester East, which I felt were the strongest the party had fielded in many years, started on the back foot.\nFirstly, an opposition motion calling to remove the mayor system garnered support from a handful of incumbent Labour councillors. Secondly, the deselection of 19 sitting councillors by the National Executive Committee (NEC) of the Labour Party stirred considerable controversy. Lastly, the backdrop of the disturbances that unfolded in Evington and Belgrave the previous September cast a long shadow over the campaign.\nI was aware of and felt the underlying anxiety and anger about the political vacuum that emerged after the troubles broke out in parts of Leicester East. I was also very aware of the reputational damage amongst the British Indian community caused by the previous Labour leadership. Examples included passing of the motion on Kashmir in 2019, calling for a UN-led intervention and various interventions by the ex-Labour and current independent MP for Leicester East, Claudia Webb which were at odds with the views of her constituents.\nWhat I, nor the party, had quite appreciated was just how strongly many in the community and from outside wanted to send a message to the Labour Party not to take a historically strong bloc of British Indian and predominantly Hindu voters for granted. Leicester would become the backdrop to deliver that message to the national party. Many of the communities in Leicester East and particular in Belgrave live as a close-knit community where information circulates swiftly. Regrettably, our campaign faced an onslaught of misinformation that spread quickly and efficiently, taking advantage of people's genuine concerns.\nThis issue loomed large, and without effective political leadership capable of rekindling unity, this topic perpetually threatens to dominate political discussions in Leicester East.\nRebalancing power in the city\nOn a night when Labour gained over 500 new councillors across the country, the Conservatives lost over 1,000. Leicester bucked the national trend with the Conservatives picking up 17 seats, the Green Party picking up three, and the Liberal Democrats winning two. Labour was left with 36 out of 54 seats, down from the 53 seats won at the previous election but crucially kept overall control of the council.\nIn the broader context of democracy, it's essential to ensure a robust opposition to maintain a balanced distribution of power, especially in a mayoral system.\nPolitics is the ultimate leveller. Ultimately, no one owes you their vote or support, and it's on you to earn it. The beauty of democracy lies in this truth; a reset was ultimately healthy for democracy and the city's future.\nThe result was a demonstration of the disappointment with the Labour-run city's political representatives, including the city mayor, previous councillors, and MPs. Understandable after the dominance of the same personalities for a long time. Hence, although a personally and politically tricky result in the end, I took solace that it would serve as a wake-up call.\nA wake up call for leaders in the city, for the national party but also for community groups, the police and other civic organisations to step up and do more to keep out the divisive forces that took advantage of genuine fears and concerns for their benefit.\nWhat next?\nThe opposition parties (including the so-called \"Independents\") focused on a negative campaign attacking the city mayor and the Labour Party, neglecting to present a compelling case for change. Such a campaign can be and was adequate, but it's not sustainable nor does it inspire confidence. Hence it would be a little premature to predict a longer term decline of the Labour vote.\nThe national party keenly observed the events in Leicester and has acknowledged the urgency of regaining the trust of the British Indian community and mending the wounds of past leadership. However, localised leadership is equally essential.\nRebuilding trust within the city and fostering healing necessitate unity and a fresh wave of political leadership. A genuine opportunity for transformation has presented itself—an opportunity for a new generation of political leaders to step forward with a constructive agenda for change.\nAs the attention turns towards a general election the imperative will now be for the party to select a Leicester East candidate who understands the community dynamics and brings a sense of dignity and stability back to the seat.\nLeicester East requires an MP attuned to the diversity of Leicester's population, capable of advocating locally and nationally for vital investments and economic regeneration. Examples include directing investments to the golden mile—the jewel of our city—ensuring better access to community healthcare facilities, improving cycling infrastructure for seamless city centre connectivity, preserving and celebrating our rich cultural diversity, and attracting industries. For example, considering India already contributes significantly to UK investment, there's no reason why Leicester shouldn't thrive as a hub for Indian businesses to establish themselves here, given the strong cultural ties that already exist.\nParting thoughts.\nIt was naturally disappointing not to win the seat, but I left the campaign not bitter or resentful but instead filled with optimism. I'm proud that the community engaged so passionately in the political process. Voters in Leicester East raised their voices and expressed their frustrations; it's now incumbent upon political parties to respond effectively.\nI am confident that the Labour Party can rebuild in Leicester East and across the city. To do this it must must forward with new leadership and the inclusion of a new generation of independent minded and forward-thinking candidates that are free from the legacy of the past.\nLeicester is a special city and it deserves the political leadership that reflects this.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_we-need-to-prepare-for-the-worst-impacts-of-climate-change/content_6.html": "We need to prepare for the worst impacts of climate change.\n- Hersh Thaker\n- Aug 15, 2021\n- 3 min read\nUpdated: Oct 1, 2021\nThis blog was originally published in my regular column for iGlobal News.\nInvesting in the transition to a lower energy system is critical to prevent further warming and the implications that come with it. However, we must also tackle the consequences of the impacts of climate change that are already here.\n“Climate change is intensifying the water cycle. This brings more intense rainfall and associated flooding, as well as more intense drought in many regions”. These were the words published in last week's major report by the Intergovernmental Panel on Climate Change (IPCC). Like much of the content published in the paper this wasn’t anything we didn’t already know but still serves as a timely and pressing reality check.\nLast month, Germany and parts of neighbouring Belgium were battered with some of the worst floods the country has ever seen which left over 180 people dead. Flood forecaster, Professor Hannah Cloke, who was involved in setting up the Flood warning system currently used in parts of Europe, described the horror of the rising death toll in Germany. European Flood Awareness System (EFAS) had predicted the floods and the severity of them but unfortunately, the messaging did not make its way down to all local communities to give them a chance to evacuate or prepare in time. Similarly, we’ve seen unprecedented flooding in parts of Maharashtra in India, Zhengzhou in China, and most recently in the Black Sea region of Turkey. These are examples of only the last 2 months and like in the case of the EFAS in Germany we can point to proactive measures that could have been taken in all cases to prevent the worst impacts.\nOur new normal.\nExtreme weather events are not something we’re regularly faced with, in Europe, which probably explains why we tend to accept them as an irregular phenomenon and move on. After all, we will never protect ourselves from every extreme weather event. However, there is a danger at firstly becoming desensitised to the increased occurrences of these events and secondly treating these weather events in isolation and passing them off as an ‘anomaly’. You need to zoom out to realise these are not isolated cases of extreme localised weather patterns, but they are a pattern of events that are triggered by our climate becoming warmer. \"We will see even more intense and more frequent heatwaves… And we will also see an increase in heavy rainfall events on a global scale” according to Dr. Friederike Otto, one of the authors of the IPCC report. The bottom line is that our earth is getting warmer and that is the common thread amongst all these events.\nClimate scientists have been warning us about this for years but what's become increasingly clear is we’re now at a point where for several of the consequences there is simply no going back. We need to expand our dialogue, policy, and investments to account for preparing our communities to be resilient as well as continuing to focus on avoiding the worst effects of climate change by expediting the energy transition.\nTackling the problems already here.\nThe choice for policymakers should be clear. We need to protect our communities and prevent things from getting worse. Historically, decarbonisation policies alone have been difficult for parties to win votes on and so doubling down to include a focus on building resilience to protect people from the consequences of climate change that are already here could be a challenge.\nI remain optimistic and the tide of public opinion is certainly shifting with the environment increasingly becoming one of the key policy issues in European politics. Resilience to the consequences of global warming needs renewed focus whilst the need to expedite the transition to a cleaner energy system has never been so urgent.\nThe challenge ahead of us seems to be getting bigger and bigger but it’s one that is still just about within our grasp.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_presentation-at-shell-productcon/content_10.html": "Presentation at Shell ProductCon\n- Hersh Thaker\n- Oct 1, 2018\n- 1 min read\nShell held their first internal product conference in November 2018 where we bought together all consumer facing product teams in the organisation. The conference bought together product leaders from over 30 product teams across the organisation for a day of collaboration, knowledge sharing and learning.\nI was pleased to have had the opportunity to talk about the journey we've been on building the Shell Recharge App and wider B2C mobility services.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_where-is-the-new-centre-ground-how-does-labour-win-it/content_37.html": "Where is the new centre ground & how does Labour win it?\n- Hersh Thaker\n- Jan 11, 2012\n- 2 min read\nThe centre-ground lies with economic growth, immigration & welfare. Unfortunately they are the very same areas that people feel we are not able to deliver on.\nLabour has lost touch with the centre ground that it fought so hard for in 1997. Somewhere along the line we stopped evolving along with the mood and situation of the nation and hence find ourselves in this situation today;\n1) “Labour cannot be trusted with the economy”\n2) “Labour cannot control immigration”\n3) “Labour gives benefits to those who cannot be bothered to work”\nWithout overcoming these sentiments and presenting clear policies which address the issues, we cannot expect to win another election.\nGrowth\nNew Labour, under Blair, had set out to achieve limitless growth with little regulation. He made no apologies for being happy to keep his hands off business’, particularly to prove New Labour really had broken away from its past, but this came at an obvious cost. However, looking forward we must continue to emphasise on ‘responsible’ capitalism and approach the economy with our hearts as well as heads. The crises and its aftermath has affected voters in such a way that bringing about prosperity is no longer enough, people want confidence and some ability to ensure that it will last. Hence, there is the potential for greater use of the cooperative model for industry in this new centre ground.\nImmigration\nLabour quite frankly had been too slow to act upon the growing immigration problem whilst in government. People are feeling insecure within their own country as there seems to be nothing encouraging immigrants to integrate into the mainstream. Above that, ordinary hard working families were often witnessing immigrant families living a better quality of life through the welfare system than they could possibly imagine for themselves. Labour must make immigration work. This means encouraging the intake of only skilled workers and at a sensible rate, we must ensure they can adapt to the national culture and identity rather than flooding immigrants into ghettos, en masse. Tighter checks and controls seems the obvious first step. Nothing less than radical policies which challenge the status quo will be acceptable, as failure to act will only draw momentum to the far right.\nWelfare\nThe welfare system is the cornerstone of Labour’s identity and achievements. It is why criticism towards it is directed at us and why we should be the party responsible for reforming it. Immigration, ‘the benefit culture’, unemployment has all put strain on the contract of the welfare system. As a result, the already squeezed middle is being squeezed even more to pick up the bill for the ever increasing recipients of benefits. Labour must recapture the middle class votes, but won’t, until they can reassure that their taxes are being efficiently distributed. The benefit culture must be replaced by the ‘get up and get to work’ culture along with stronger constraints on the ability for immigrants to claim benefits. Of course, job creation is pivotal to make this work and so we must make it clear that our deficit reduction strategy will allow greater investment in job’s and enterprise.\nWork must once again pay and welfare should only be a safety net, if Labour can promise this then we are a third of the way there.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_blog_categories_technology/content_7.html": "Hersh ThakerJan 16, 20211 min readSpeaking about WhatsApp’s new data privacy policy on BBC Radio LeicesterI was invited to share my thoughts on WhatsApp's updated privacy policy and what it means for UK consumers.\nHersh ThakerDec 28, 20184 min readElectric Vehicles Now The transition to electric vehicle ownership should not be assumed. A progressive government must do more, argues Hersh Thaker - This...\nHersh ThakerOct 1, 20181 min readPresentation at Shell ProductConShell held their first internal product conference in November 2018 where we bought together all consumer facing product teams in the...\nHersh ThakerAug 6, 20183 min readWhat are Solid State Batteries and why could they be so important to the future of Electric VehiclesThere is widespread belief in the industry that the tipping point for mass EV adoption and therefore scale up the production of EV’s will...\nHersh ThakerJun 6, 20183 min readElectric Vehicle Terminology ExplainedWith people increasingly considering switching to an Electric Vehicle, the initial research can be rather daunting. I've put together...",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_response-to-electric-vehicle-rapid-charging-policy-paper/content_26.html": "Response to Electric Vehicle Rapid Charging Policy Paper\n- Hersh Thaker\n- May 16, 2020\n- 3 min read\nFocus on motorway charging is welcome but is the Electric Highway network hindering progress?\nThe government has set out its vision paper[1] on what it wants to see from a national rapid charging network with a particular focus on motorway locations. This vision paper is part of the government consultation to bring forward the end of diesel and petrol cars from 2040 to 2035 or even earlier[2].\nAmbitions include:\n· “By 2023, we aim to have at least 6 high powered, open access chargepoints (150 - 350 kilowatt capable) at motorway service areas in England, with some larger sites having as many as 10-12. We are confident this will be more than enough to meet demand from electric vehicles by this date. These high powered chargepoints are able to charge up to 3 times faster than most of the charge points currently in place, and can deliver around 120-145 miles of range in just 15 minutes for a typical electric vehicle.\n· By 2030, we expect the network to be extensive and ready for more people to benefit from the switch to electric cars. We are planning for there to be around 2,500 high powered chargepoints across England’s motorways and major A roads.\n· By 2035 we expect around 6,000 high powered chargepoints across England’s motorways and major A roads.”\nThe vision is ambitious and shows consistency in intent with the latest spring budget where they already introduced a £500 million rapid charger fund[3] to be made available over the next 5 years. Part of this budget would be made available to help businesses fund the expensive but important grid upgrades to cater for high power charge points. However, despite the best intent and vision, what seems to be lacking is a clear plan of action on how the government intends to meet its vision for motorway rapid charging.\nCharging at motorway services today is dominated by the “Electric Highway” network, which has monopolised UK service locations with a footprint of around 300 chargers. The Electric Highway network is operated by Ecotricity and was very much a pioneer of rapid charging when it started in 2011. Although the early network was set up in partnership with Nissan to largely cater for the Nissan Leaf[4], they deserve a lot of credit for the early risks they took to give people confidence to purchase an EV. The first mover advantage meant Ecotricity secured long term contracts with service station operators Moto, Welcome Break and Road Chef which become a barrier to entry for competitors. Herein lies the problem if the government wants to meet its 2023 vision highlighted above.\nMotorway refuelling is generally an emergency sale, where people only ‘fill up’ if they really need it. Hence, the infrastructure simply has to work. The problem today is that the Electric Highway network is outdated, underinvested in and therefore a real blocker to progress of motorway charging in the UK. You don’t have to scroll down very far on any EV forum on Facebook to understand the deep frustration drivers have with the network. Frustration might be tolerated by current early adopters but as we move up the adoption curve and EV sales continue to boom[5], we cannot afford to allow our motorway infrastructure to be left so neglected.\nToday, drivers have an increasingly diverse range of electric vehicle models to choose from. Most of them are using the CCS charging standard and can cater for charging speeds over 50kw. On all counts it leaves the electric highway network lagging behind rapid charging competitors in terms of reliability, charging speeds and availability of connectors. Therefore, although I applaud this vision paper for its ambition along with the consultation process underway to bring forward the diesel and petrol ban forward to 2035 or earlier, something must give on our motorway services if we have any chance of meeting this target. In my view, Ecotricity need to either invest in the technology and infrastructure to cater for the needs of motorway rapid charging or they must be forced to make way for competitors that can.\n[1] https://www.gov.uk/government/publications/government-vision-for-the-rapid-chargepoint-network-in-england/government-vision-for-the-rapid-chargepoint-network-in-england\n[2] https://www.gov.uk/government/consultations/consulting-on-ending-the-sale-of-new-petrol-diesel-and-hybrid-cars-and-vans",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_the-labour-party-s-relationship-with-india-a-critical-path-for-the-next-decade/content_35.html": "The Labour Party's Relationship with India: A Critical Path for the Next Decade\n- Hersh Thaker\n- Jul 19, 2023\n- 4 min read\nThis article was originally written for and published by iGlobal as part of my regular column.\nEarlier this month, Keir Starmer inaugurated the 5th annual UK-India week and described wanting an \"open-handed, respectful, forward-looking, and aspirational\" relationship with India. This positive and sensible tone demonstrated a commitment to reset Labour's relationship with the country, following strains that emerged under the previous leadership. It was an important movement because the UK's relationship with India will be paramount in the coming decade.\nAs Britain tries to find a new identity on the world stage after Brexit, the relationship with a new confident, emboldened, aspirational India must be a priority. The lack of a coherent vision for our place in the world offered by this government makes it ever more important for the Labour Party to provide it instead.\nEconomic Development\nIndia has become the de facto leader of the global south, a reputation it has looked to entrench in the year of its G20 presidency. Whether it's energy security, food security, migration or debt, the issues facing the global south are the central geo-political challenges of our day. Therefore, a government wanting to demonstrate the moral leadership that Britain should be showing will need to work with India to address them.\nEven for our self-interest, India, the world's most populous country with a rapidly growing middle class, presents an enticing market for post-Brexit Britain. It is the second-largest contributor of foreign direct investment (FDI) into the UK and has a deep cultural link to Britain through its history and the British Indian diaspora.\nIt is an economic and geo-political relationship a future Labour government must nurture.\nThe UK-India Free Trade Agreement (FTA) could provide another such opportunity. Negotiations commenced last week for the UK-India Free Trade Agreement (FTA), currently in its 11th round of talks.\nA deal before next year's Indian elections looks increasingly unlikely to be signed. There are still several hurdles to clear on the FTA before finalising an agreement. Migration will be one of those challenges.\nIndia is seeking easier access for its workers to the UK market, whilst the Tories are prisoners to their anti-immigration narrative. The denial of reality the government is currently suffering from means although we have a shortage of skilled workers of the like India could offer, it could still be challenging for Sunak to rally support within his party for a deal that allows more foreign workers in. It will also be difficult to envision India signing an agreement without such provisions.\nLabour may need to pick up the pieces of this FTA and could hit the ground running if the Tories fail to get it over the line before a general election. The FTA makes shaping the narrative towards India and building bridges from now become ever more crucial.\nClimate Change\nThe next decade is pivotal in the global transition towards a cleaner energy system. Where the Tories show little vision or interest, the Labour Party has prioritised climate change on the policy agenda. Collaboration with India is essential in this area. Prime Minister Modi recognised the next decade's importance and called for global action at the leader's summit in 2021. He set ambitious decarbonisation and biodiversity targets for India to transition millions out of poverty while building a cleaner energy system.\nHence, a strong relationship with India gives a Labour government that is serious on climate change an opportunity to demonstrate leadership. Working together on green infrastructure, biodiversity, mobilising finance for clean energy and technologies, and collaborating on global decision making on climate action are areas of potential partnerships.\nA Government in Waiting\nUnder Keir Starmer's leadership, the Labour Party has turned a page on many issues. One is recognising the strategic importance of the relationship with India and showing a desire to build those bridges.\nThere have been several examples of this recognition in recent months. Keir Starmer's speech at the UK-India forum, Navendu Mishra, has re-established the Labour Convention of Indian Organisations (LCIO) to engage with the British Indian Diaspora. Only recently has LCIO partnered with the UK-India Business Council to host a briefing on the FTA. Here, Nick Symonds reiterated Labour's commitment to ensuring a deal is in place. Yvette Cooper also met with the High Commissioner of India, Vikram Doraiswami, and Keir Starmer spoke at the first-ever celebration of Indian independence held in Parliament.\nManoj Ladwa, the founder of the UK-India Forum, rightly emphasised the need to prioritise the relationship with India and to prevent it from being \"held hostage to the vagaries of domestic politics\". By adopting the open, respectful, forward-looking, and aspirational approach that Starmer outlined, Labour can indeed look forward to strengthening the bond between the two nations. The economic potential of India, coupled with collaborative efforts on climate change, underscores the significance of this relationship.\nWith effective leadership and continued dialogue and engagement with India and its diaspora, Labour can secure a brighter future together. The relationship brings an additional electoral benefit of appealing to those voters who seek a dynamic and prosperous partnership with India.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_the-uk-went-a-week-without-using-coal-last-weekend-and-here-s-why-it-matters/content_29.html": "The UK went a week without using coal last week and here's why it matters.\n- Hersh Thaker\n- May 9, 2019\n- 3 min read\nUpdated: Jul 12, 2020\nThe UK went a record 1 week without using coal to generate the UK’s electricity, a feat not achieved since the start of the industrial revolution. It’s a remarkable milestone and we should use it as an opportunity to highlight the positive strides the UK is making in terms of de-carbonizing electricity generation and improving energy efficiency.\nReflecting on the recent extinction rebellion protests which did an important job in drawing attention back to the issue of climate change and the general negative tone whenever climate change is discussed, you can be forgiven for thinking we’ve made no progress in all the years that we’ve been discussing the issue. That is, of course, not the case and so it’s only right that we also celebrate and recognise achievements on the road towards de-carbonizing the UK’s power generation. There's three key things, linked to this weeks achievement which are worth mentioning and highlights the improvements we've made as a country but also the important job we still have to do.\nOur energy mix is less reliant on fossil fuels than you might think.\nThe most reassuring thing to take from this milestone is that it is not entirely a surprise and the National Grid believe we can expect it to become a far more regular occurrence. Coal now accounts for only 10% of Britain's power output and this year has already seen over 1000 hours of coal free generation. As more renewable energy resources enter the energy mix, supplemented by natural gas, this trend will only continue. The National Grid spokesperson agreed with the sentiment saying, “more people have installed solar, more coal is coming off and there’s more wind in the system”. It seems at this rate that we are well on track to surpass the 1800 hours of coal free generation achieved during the whole of 2018. Even at the time of writing this article (9th May) there is currently no electricity being generated by coal entering the grid. You can see supply and demand of power in the UK in real time here.\nWe are generating and demanding less energy.\nThis is important because it's something we can all take credit for. It is not fully understood why Britain has seen a drop in energy usage whilst our EU counterparts have seen a steady increase. However, decisions to better insulate our homes, our choice to use LED light bulbs and more energy efficient white goods have all been contributing factors. What's even more impressive is that UK has managed to reduce its energy consumption whilst in a period of economic growth. As a post-industrial economy, this shows real maturity.\nAccording to the research by Carbon brief, UK electricity generation has levelled off since 2000 and has fallen by 16% between 2006 and 2018. This is particularly impressive considering that the UK's population has grown by 10% over the same period of time.\nThere's still a long way to go.\nElectricity demand, generation and consequently greenhouse gas emissions have all fallen over the last 2-3 decades according to data published by the Department for Business, Energy and Industrial Strategy (BEIS). In 2018, UK greenhouse gas emissions had fallen by 43.% compared to 1990 and by 2.5% since 2017. The report states \"This is mainly as a result of changes in the fuel mix used for electricity generation, away from coal and towards renewables\". So where's the problem you could argue?\nIn 2018 transport accounted for a third (33 per cent) of all carbon dioxide emissions and the majority of these emissions came from road transport. As we work towards de-carbonising the rest of our energy mix, with road transportation being the key focus, we all need to continue to take responsibility. Here, once again our consumer choices to buy electric and hybrid vehicles, to use car sharing schemes, to use public transport will all have an accumulative impact to remove carbon emissions from the atmosphere. Just as it did when we decided to switch to LED lightbulbs or the pay a little bit more upfront to buy the most energy efficient refrigerator.\nThe electrification of our road transport network is incredibly important if the UK is to meet its climate change commitments, which at the moment we are not on track to do. The energy mix is becoming far more interconnected than it ever has been before, partly driven by electrification. Therefore, as energy demand starts to increase with the rise of electric vehicles we will need to generate more energy but the challenge will be to do this sustainably. This is why last weeks milestone is so important on our road to zero carbon energy generation but also reminds us why there is still much more for us all to do.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_blog_categories_politics/content_24.html": "Derailing Dysfunction: Can a Labour Government Revive Britain’s Railways?\nBritish Railways need reform, and only Labour seems ready to address it.\nBritish Railways need reform, and only Labour seems ready to address it.\nThis article was originally published with Leicester Gazette. Earlier this year, I had the privilege of standing as a Labour Party...\nThis article was originally written for and published by iGlobal as part of my regular column. Earlier this month, Keir Starmer...\nA review of Kate Raworth’s book, Doughnut Economics: Seven Ways to Think like a 21st Century Economist. This article was originally...\nThis article was originally written for and published by iGlobal as part of my regular column. According to the latest ONS census data,...\nThe conservatives haven't gotten much right in 12 years, but they have given us a British Indian Prime Minister.\nIntroduction The American Ecologist Garrett Hardin describes the problem of unencumbered population growth as a \"Tragedy of the Commons\"....\nThis blog was originally published in my regular column for iGlobal News. Investing in the transition to a lower energy system is...\nI was invited to share my thoughts on WhatsApp's updated privacy policy and what it means for UK consumers.\nThis response was sent to the Leicester City Council's planning office in response to their call for views on future planning policy....\n(This article was published in \"Creativity in Crisis - Micro Stories From The Macro Pandemic\".\nFocus on motorway charging is welcome but is the Electric Highway network hindering progress? The government has set out its vision...\nAs we loom closer to the inevitability of a Peoples Vote and prepare to mobilise for the campaign, click here how your constituency and...\nThe transition to electric vehicle ownership should not be assumed. A progressive government must do more, argues Hersh Thaker - This...\nBefore I start let me be clear. Yes there are problems with the EU but that isn’t a reason to leave it. Don't bury your head in the sand...\nIn my role as a member of Youth Parliament for Leicester i was invited by Operation Black Vote and Unison to speak to a group of students...\nThe introduction of Individual Electoral Registration (IER) is the biggest change to the way we do elections since the Universal...\nThe centre-ground lies with economic growth, immigration & welfare. Unfortunately they are the very same areas that people feel we are...",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_supporting-the-vaccine-roll-out/content_21.html": "Supporting the vaccine roll out\n- Hersh Thaker\n- Jan 1, 2021\n- 1 min read\nTo say the vaccine roll out is in full flow would be a slight overstatement but with over 700,000 people now vaccinated in the UK at the time of writing it’s encouraging that we’ve at least made a start.\nI spent the last 2 days volunteering alongside with the wonderful NHS nurses and doctors at Leicester Racecourse - 1 of 5 vaccine roll out centres set up in Leicester.\nIt was great to see an army of other volunteers on hand helping to man car parks, marshal people through the “checkpoints” and generally taking care of other tasks which allowed the medical staff to focus on administering the vaccine.\nI’m looking forward to continuing to support the roll out at the various sites across the city in the coming weeks and months.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_leicester-a-role-model-city-for-diversity-and-integration/content_13.html": "Leicester: A Role Model City for Diversity and Integration\n- Hersh Thaker\n- Dec 6, 2022\n- 3 min read\nThis article was originally written for and published by iGlobal as part of my regular column.\nAccording to the latest ONS census data, Leicester is one of the first cities in the UK to be majority non-white. It joins 14 other local authorities that recorded more than half of their residents identifying with an ethnic group other than white. Leicester is the largest majority-minority, with 59.1% of the people of Leicester now from ethnic minority groups.\nLeicester has long been a model city and a beacon for multiracial harmony and diversity. The latest census data should be celebrated as a milestone, and there are lessons that other cities can learn from its story. The city stands tall and is unique not only in the UK but in the world as a case study of how different cultures have assimilated, integrated, and thrived. Although recent disturbances have marked Leicester's record, we can take lessons from history and repair differences through the impartiality, openness and dialogue that helped build this city.\nThough the migration story of Leicester did not begin with the arrival of Ugandan Indians in the 1970s, it was certainly the catalyst that transformed Leicester into a remarkable story of multiracial harmony. Leicester became the first non-white city has long been predicted and is a fitting tribute to a city that has long been a model multi-racial city. Leicester, in the 1970s, was a hotbed for National Front activities and one of the most racist cities in the country.\nLeicester’s success story is multi-faceted and is credited to the attitude of Ugandan Gujarati Asians that settled and the city's proactive efforts to enable them. Leicester City council set up Britain's first race relations committee at the time, which ensured the needs and sensitivities of the new and diverse communities were considered in every aspect of policymaking. Significant investment was also afforded the faith groups to set up community organisations and businesses without fear or restraint. There are lessons that local political leaders across the UK can still draw from such proactive and positive engagements. What also helped was that the political leaders were supported by community and faith leaders who were extremely able and willing to integrate.\nThe Gujaratis that settled in Leicester, unlike many communities that settled in places like Oldham, which had disturbing race-related riots in 2001, were largely educated professionals, entrepreneurs and businessmen. They had been successful in their ventures before being expelled, so although they did not arrive in the city with their pockets stuffed with cash, they knew how to get things done. They bought their own modest houses, set up thousands of businesses in the city, got involved with local politics and built community organisations. They got their heads down, blended in, and actively tried to get on with people whilst proudly preserving and celebrating their identity.\nFor example, Leicester’s annual Diwali celebrations regularly draw tens of thousands to the city and have become the biggest Diwali celebrations outside of India. Such is the two-way respect in the city; as the Diwali celebrations pass, the lights on Belgrave road are replaced with Christmas decorations. The British Indian community that makes up the majority of residents along Belgrave road will also put up their Christmas trees without feeling any conflict but proudly take the opportunity to gather as families, try different foods and share gifts.\nLeicester’s unique record in community cohesion was noted several times in the groundbreaking Cantle Report, commissioned to investigate community cohesion after the disturbances in Oldham and Burnley in 2001. He particularly noted the pride those in Leicester felt about their community. He also highlighted the teaching of all faiths and cultures in schools, the celebration of religious and cultural events on the streets and the proactive approach to diversity amongst political and faith leaders who would meet to discuss issues affecting the city. His report noted that “openness and honesty meant that rumours and misunderstandings were less likely to gain credence and ferment resentment or jealousy”.\nLeicester's recent achievement is significant because the city accurately reflects modern Britain. The fact that Leicester is one of the first majority-minority cities in the UK should be celebrated, not just by those who live here but by everyone who cares about diversity and integration. As we live through a time of pessimism, conflict and rising xenophobia, there is much the world can learn from the city’s story and aspire to make local communities across Britain as inclusive as Leicester has shown us it is possible to be.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_success-the-community-raises-500-for-local-community-project/content_20.html": "Leicester SOUP raises £500 for the 'I Love me' project.\n- Hersh Thaker\n- Jun 3, 2017\n- 1 min read\nUpdated: Jul 12, 2020\nCongratulations to Lydia Unsudimi who's 'I love me' project won the community vote and took home all of the money raised at the door. The first ever soup held in Leicester was a resounding success and it was so exciting to see the mix of people in the room which represented the diversity of Leicester.\nPlease enjoy the teaser below of the full event.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_how-did-your-constituency-vote-in-the-2016-referendum/content_22.html": "How did your constituency vote in the 2016 referendum?\n- Hersh Thaker\n- Jan 12, 2019\n- 1 min read\nAs we loom closer to the inevitability of a Peoples Vote and prepare to mobilise for the campaign, click here how your constituency and neighbouring constituencies voted in the last referendum and mobilise your efforts accordingly.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_response-to-leicester-city-draft-local-plan-2020-2036/content_5.html": "Response to Leicester City Draft Local Plan 2020 - 2036\n- Hersh Thaker\n- Dec 5, 2020\n- 6 min read\nUpdated: Dec 6, 2020\nThis response was sent to the Leicester City Council's planning office in response to their call for views on future planning policy.\nDear Officers,\nPlease find my response to the draft local plan below.\nI appreciate this plan is not strictly dedicated to outlining how the city will respond to the climate emergency, however, I am sure officers would agree with the importance of looking at any future planning policies from the lens of climate change. The time frame of this plan (2020 - 2036) is particularly important because it is being set in the context of existing national climate commitments which this plan requires to demonstrate its contribution towards.\nI have highlighted some (and certainly not all) of the key commitments here to show where we will be once the time period of the draft plan comes to an end in 2036:\nThe sale of new petrol and diesel vehicles in the UK will already have been banned 6 years ago (in 2030)\nWe will be 14 years away from the legally binding commitment of the UK being a net zero country by 2050.\nWe will be 24 years away from our aspiration of having 12% woodland coverage in England by 2060.\nWe will be 6 years away from our target to eliminate avoidable plastic waste by 2042 and 14 years away from the target of zero available waste by 2050.\nWith that context in mind and also considering there is a real possibility that these targets are reviewed and become even more aggressive, please find my response to the draft plan below. I have tried to be specific and target key policy areas in the plan which I believe require more thinking and substance.\nPolicy CCFR01: Sustainable design and construction for new developments:\nResponse: I support the intent of the policy, with the requirement for property developers to demonstrate how they will minimise energy demand, reduce waste and reduce carbon emissions. There are also good suggestions for the hierarchy of measures that should be considered. However, this policy is missing any specific targets and mandatory requirements for the developers and there is a lack of clarity on what will be enforced. For example, will developments be stopped if they have not minimised energy demand or have not been designed to allow future opportunities for on-site solar generation? Also, what exactly constitutes as \"minimising energy demand\"? Is this going to be left to the developers to determine? I believe this policy needs to provide clarity on the standards that developers are expected to follow on sustainable design and what would be the implications if these standards are not met.\nPolicy CCFR02. Delivering renewable and low carbon energy projects\nResponse: Although it is encouraging to see the support for new low carbon and renewable projects being explicitly mentioned in the plan, it is unclear how such projects will be actively encouraged. In its current form, this policy only seems to provide criteria for what the council will consider before approving new projects, but with no additional provisions to actively encourage such projects.\nI would like the city council to be more ambitious and set out more proactive plans to encourage innovation into renewable and low carbon projects rather than following a passive policy which is doing the bare minimum. For example, could the council allocate greenfield or brownfield land specifically for solar and wind generation or even make council owned buildings available for solar generation? Not only would something like this allow the city to use more power from distributed generation but it could also provide a further source of revenue to the taxpayer.\nPolicy T01: Sustainable Transport Network & Policy & T03: Accessibility and Development\nResponse: When it comes to cycling, I appreciate there is already a Cycle City Action Plan in place and this draft city plan does explicitly commit to “develop an infrastructure network of high quality, continuous cycle tracks along main road routes”. I am also glad that the draft plan recognises that cycling links in and around the city remain “unattractive/weak”.\nHowever, we need to see more details and specific policies on how cycling tracks will be extended and made safer in order to attract more people onto their bikes. Once again, I would like to see more ambition from the council to set our city centre up to be on par with other progressive cycling cities like Lancaster, Exeter, Oxford and Cambridge. For example, reallocating road and pedestrian space for cycling and other forms of light mobility within the city centre. The cycle lane on Newark Street is a good example of such safe and dedicated space being allocated to cyclists.\nPolicy T08: Supporting Low Emissions Vehicles\nResponse: This is a particularly disappointing policy and I believe a real missed opportunity if not revisited. I am aware that there is currently a climate emergency consultation underway which is perhaps why the ambitions are understated in this policy, but I will highlight key concerns nevertheless.\nThe plan recognises the emergence of smart transport with driverless cars, shared mobility services and the emergence of smart electric charging. However, this recognition is then met by an underwhelming commitment to only install charging points “in at least 5% of all parking spaces” and states that only 25% of parking spaces will be future proofed to install future charge points through “additional ducting and cabling”. Considering the council currently provides 12,000 public parking spaces in the city centre, 5% represents a 600 charging points by 2036. This is simply not good enough. By 2036 the UK will already have banned the sale of new petrol and diesel cars for 6 years. The government’s own ‘Electric Vehicle and Infrastructure’ briefing paper predicts we will have 36 million electric vehicles on our roads by 2036.\nThis policy needs to do more to support and encourage the take up of low emission vehicles and the council could even replicate approaches that have worked in other cities. These include:\nCommitting to electrifying the city councils’ fleet of vehicles and implementing smart charging points at those relevant depots.\nULEV only driving lanes to give priority to clean modes of private transport.\nPublishing the number of charging points the council aspires to install in the city. The current commitment of 5% is not transparent enough. For example, Nottingham has committed to installing 400 new charge points in 2019/2020 alone.\nI have also highlighted two other areas which range across a few different policy areas which I wanted to call out.\nTree planting.\nResponse: There are insufficient provisions in this plan to protect our existing stock of trees and there is lack of ambition to plant more.\nPolicy DQP04: Landscape Design mentioned that new developments should retain landscape features such as trees in new developments but does not mandate it.\nPolicy HE01: The Historical Environment only provides a mandate to protect trees within conservation areas.\nPolicy NE04. Ancient woodland and Veteran Trees is the most concerning to me. The policy stipulates that the loss of ancient woodland and trees will only be permitted where benefits to the public outweighs the loss of habitat or where a suitable compensation strategy is in place with the council. This language seems to leave this policy open to interpretation since it does not explicitly protect our ancient woodlands from any damaging scenarios. How does one define a \"public benefit that outweighs the harm or loss to the habitat\" and what is a \"suitable compensation strategy\"? Does this mean a new private nursing home would be allowed to be built on an ancient woodland because there is public benefit? Or if a developer is willing to pay enough \"compensation\" in the form of an allocation of affordable housing in a new luxury house development - would this be permitted? This policy needs to be more explicit.\nOverall, the three key policies across the draft plan which mention trees and woodlands only go as far as attempting to protect our current stock. I could not see any provisions being made to expand woodlands or allocating land specifically for tree planting. It is therefore not clear to me how this draft plan contributes to the UK government target of 12% woodland coverage in England by 2060?\nDeveloping on Greenfield land.\nResponse: The draft plan outlines that greenfield land will be made available for development and in particular for the development of new housing. With a housing shortage in this country, I do understand the need for this. However, the plan should also recognise that building on greenfield sites encourages urban sprawls into our countryside which also increases carbon emissions with people needing to drive into the city from further away. My concern is that there is no mention of any special requirements on developers that are building on this land. Since greenfield space is allocated by the council, this provides a unique opportunity to ensure the highest environmental planning and standards are in place. For example, I would like to see mandatory requirements in place to mitigate the environmental impact through measures such as:\nMandatory installation of electric vehicle charging points.\nAll developments to meet the highest standards for energy efficiency.\nSolar generation on individual properties.\nIn conclusion, although there are several positive provisions in place in this draft plan and a clear intent to ensure that future development is sustainable, there are several policy areas where the council must go further. There is a lack of ambition and clearly defined safeguards in place to ensure that future development in the city is indeed contributing significantly enough to the reductions of Leicester’s carbon footprint and helping us move towards some of the UK government climate targets that I listed at the beginning of this letter.\nThank you for the opportunity to provide this input into the draft plan.\nHersh Thaker",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_a-fresh-new-way-to-look-at-economic-development-and-growth-the-doughnut/content_12.html": "A fresh new way to look at economic development and growth: The Doughnut.\n- Hersh Thaker\n- Feb 8, 2023\n- 5 min read\nA review of Kate Raworth’s book, Doughnut Economics: Seven Ways to Think like a 21st Century Economist. This article was originally written for and published on my Medium channel.\nIt was almost ten years ago that I first came across the idea that growth is not an economic metric for which we should aspire. We don't have the luxury of \"sustainable development\", according to the late James Lovelock in his compelling book, The Revenge of Gaia. Instead, Lovelock called for a \"sustainable retreat\". He argued it was already too late to make incremental reductions to carbon emissions, so switching to electric vehicles and more renewable energy sources or CCS energy would not be sufficient to reverse the damage. Instead, we need to plan how we will change how we live and produce food and energy to survive—for example, preparing for mass migrations into cities of Europe as countries like Bangladesh become uninhabitable. It was a stark message from Lovelock, and it stuck with me.\nI went on to study Economics as part of my A-levels and an undergraduate degree, yet the idea of a sustainable retreat never came up. Not a single module, not even environmental economics, entertained the idea that considering the world's fundamental challenges, exponential GDP growth may not be the right measure for global economies. Hence, although I was receptive to Lovelock's view, the idealist in me hadn't shared his more apocalyptic view of the future, yet, I also had yet to have the chance to further reflect on the idea of sustainability, growth and development. That was until I came across Doughnut Economics: Seven Ways to Think like a 21st Century Economist, written by the Oxford Economist, Kate Raworth.\nDoughnut Economics is a visual economic framework that brings together the constraints of planetary boundaries and meets the requirements for human flourishment. The space between those boundaries represents the space that global economies should be heading towards as their target. Raworth sets out a framework with steps on how we can get there.\nI won't spoil you with the details, but the seven principles she lays out in her framework are:\nPut people and planet at the centre: Raworth argues that the economy should serve the needs of both people and the planet rather than prioritising economic growth at the expense of social and environmental well-being. She argues we should drop GDP growth as the target and aim for the doughnut instead.\nRecognise interdependence: Raworth highlights the interdependence of economic, social, and environmental systems and argues for an integrated approach to economic development.\nRespect limits: Raworth argues that the economy must operate within the limits of the planet's resources and ecological systems and not exceed the boundaries that would cause irreversible harm.\nFoster distributive justice: Raworth emphasises the importance of distributive justice and argues that the economy should provide a decent standard of living for all without leaving anyone behind.\nEnsure intergenerational equity: Raworth argues that the economy should provide opportunities and resources for future generations rather than consuming them.\nEncourage diverse forms of well-being: Raworth argues that well-being should be measured and valued in diverse forms, including non-monetary forms of wealth such as health, happiness, and community.\nFoster holistic development: Raworth argues for an integrated approach to economic development that considers the interdependence of economic, social, and environmental systems and aims to achieve sustainable and equitable outcomes.\nThe book challenges the traditional wisdom of economic models, which assume humans are rational economic consumers. That we are not emotional when making decisions, we always have the full facts in front of us, and we always make decisions in our rational economic interest. In reality, we are complex, emotional beings interested in community, relationships, belonging and non-monetary fulfilment, not only looking to maximise our utility. Here, the Doughnut provides a framework for thinking about economic development whilst also considering how we prioritise social and environmental fulfilment. For example, Raworth argues we need to drop the idea of a rational economic man since that isn't who we are, and the more we talk about him, the more we behave self-interestedly. Instead, we need to nurture our humanity and recognise that we are social and adaptable beings.\nThe most substantial idea that I took away was her argument that GDP is not the be-all and end-all. Raworth criticises the use of GDP as the full measure of economic progress since it doesn't consider inequalities and environmental sustainability. For example, I was surprised to learn that the famous income inequality curve was based on the scantest of evidence and has been perpetuated over decades by multiple neoliberal economists. The curve is taught to all economics students, and it suggests that as nations get wealthier, inequality will inevitably grow until they begin to reduce that gap. We've already seen empirical evidence from history challenge this myth, but Rawworth provides further evidence to show the initial theory was put forward with very little evidence.\nThe idea of unlimited economic growth also goes unchallenged. We expect our economies to grow constantly, and any deviation from year-on-year growth signals trouble. Raworth rejects the notion of infinite growth. She argues that our limited resources make this undesirable and unrealistic. Instead, the economy must operate within the limits of the planet's resources and ecological systems. As such, a systems approach to economics is required instead of a tunnel focus on efficiency and GDP growth. She argues that economics needs to recognise the interdependence of economic, social and environmental systems. Thus economic development should be considered more holistically about how it impacts people and our planet's well-being.\nRaworth emphasises the importance of distributive justice and challenges the traditional economic thinking of efficiency over equity and instead argues that the role of an economy should be to provide a good standard of living for everyone. It reminded me of the Rawslian concept of the \"veil of ignorance\", which argued that we should design our society in such a way that we'd be happy to be placed at the bottom end of it. According to the Doughnut, fulfilment and equity should be indicators from which we assess the strengths of an economy. How happy we are, how healthy we are and how strong of a community we live in are valuable\nOverall, Raworth's approach challenges the conventional wisdom of traditional economic models and offers a new vision for economic development that prioritises social and environmental well-being. Her holistic approach to economics is better suited for understanding inequality and climate change challenges. It gives hope because, beyond just an economic theory, she provides practical suggestions to policymakers, communities and businesses for addressing the challenges and has subsequently set up an entire community of like-minded changemakers through the Doughnut Economics Actions Lab (DEAL).\nThe best ideas seem obvious when you read them, and the Doughnut provides such a framework. It needs to be taught to every economics student because it renders existing economic orthodoxy utterly unfit for purpose for problems of the 21st century. Whereas reading the revenge of Gaia 10 years ago left me feeling worried and confused, Raworth's work has left me feeling assured and hopeful that there is a framework we could all adopt, which is why I encourage you to read it too.\nFor those who prefer to avoid reading, there's a helpful series of animations representing the seven Doughnut principles. You can find it here.",
  "https_www_hershthaker_com_/https_www_hershthaker_com_post_it-s-all-bad-news-in-energy-right-now-but-let-s-take-a-glimpse-into-the-future/content_11.html": "It’s all bad news in energy right now but let's take a glimpse into the future.\n- Hersh Thaker\n- Oct 1, 2021\n- 3 min read\nUpdated: Oct 1, 2021\nThe last few weeks have served as a stark reminder about the fragility of our energy supply chain. A 250% rise in wholesale gas prices since the beginning of the year has seen 32 energy companies collapse (at the time of writing) and many others orderly exit the market. In the same month, the UK has been suffering from a fuel shortage caused by lorry driver shortages and subsequent panic buying.\nThey might seem to be unrelated issues on the face of it but both ultimately result in energy security issues. Natural gas makes up over 40% of the UK’s energy mix and over half of that gas is imported, whilst 90% of cars on the road still run on a combustion energy requiring fuel. So, whether it is the energy companies purchasing gas on the wholesale markets or the drivers filling up their cars at petrol stations, both are subject to interferences that have an impact on our ability to do business or live our lives. In short, the current model of generation, distribution and consumption of energy is highly centralised and therefore at the mercy of geopolitical forces which leaves us in situations like we’ve been seeing in recent weeks.\nThe transition to a cleaner and more self-sufficient energy system is a disrupter to this status quo and recent events should only serve to expedite the pace at which we move along this journey. In a world where there is a higher penetration of renewable generation, storage and electric vehicles on the road, the system becomes far more de-centralised and gives countries and individuals more control.\nNow you might be wondering, what a world where you have ‘more control’ actually looks like? Let's take a preview.\nIt’s October and the year is 2050. It has been a particularly hot summer (again) and winter is closing in. The days are getting shorter and you’re no longer able to rely primarily on your rooftop solar, as you did over the summer months, to meet your home energy demand. Fortunately, this week has been particularly windy and given that wind now accounts for around 50% of the UK’s energy mix, cheap domestic energy is abundant. It’s the early afternoon, you’re at work when you receive a mobile alert from your energy supplier. They’re letting you know that electricity will be free for a period of 3 hours tomorrow afternoon in a bid to help them remove excess supply from the grid caused by too much wind energy. You oblige and schedule your home battery to recharge during this time window whilst also scheduling the washing machine to run, after all it’s free electricity! That evening, you arrive home, plug your car into your home charger and set it to start charging at 9pm when electricity prices are cheaper again because of low demand. You then proceed to enjoy the rest of the evening ‘off-grid’ by discharging your home battery to avoid taking electricity from the grid whilst demand is high and hence expensive.\nThis snapshot might appear as a utopian fantasy but I can assure you it’s not. Some early adopters are already reaping the benefits of this energy transition and the control that it affords them. Scaling up renewable energy generation and storage will not only increase our energy security but will empower consumers like you and me from being mere spectators and consumers of energy to active participants in the new system. From generation, distribution and consumption, the energy transition is also about the decentralisation of our energy system and we’re all going to be active participants.\nSo whilst you’re sitting in the queue waiting for fuel this week, take solace in knowing that we will be the last generation to live like this. In fact, we might just be looking back at such moments in a not so distant future with nostalgia (or relief"
}