{
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-respond-to-interim-ehrc-guidance/content_10.html": "Co-leaders Carla Denyer MP and Adrian Ramsay MP said:\n“This guidance issued by the Equality and Human Rights Commission (EHRC) is ill-considered and impractical, and leaves many unanswered questions about how services will be provided in a way that meets trans people’s needs (1).\n“As it stands the guidance is likely to cause both distress to the trans community and further confusion to employers, businesses and service providers who are trying to understand what the Supreme Court ruling means for them.\n“In particular, this guidance could put trans people at risk of discrimination in the workplace, and is overly prescriptive in a way that seems to fly in the face of the tolerance that we value in this country.\n“For example, it doesn’t seem right that a lesbian organisation or space that wants to include trans women should be prevented from doing so.\n“It’s crucial that a wide diversity of women, trans and not, as well as the wider trans and non-binary community are listened to as this work is done on the detail of how services are provided in a way that meets everyone’s needs and protects everyone’s dignity.\n“This guidance should be withdrawn until the EHRC can produce something more thought-through which takes into account the voices of all those affected.”\n(1) An interim update on the practical implications of the UK Supreme Court judgment | EHRC\nThe post Greens respond to interim EHRC guidance appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_labours-recent-leaflet-boasting-about-deporting-more-people-than-the-tories-is-sickening/content_5.html": "Responding to Labour’s recent leaflet about how they’ve delivered “the four biggest deportation flights in UK history” Green Party Co-Leader, Carla Denyer said,\n“Labour’s recent leaflet boasting about deporting more people than the Tories is sickening.\n“Labour are failing to provide safe and legal routes into the UK while seemingly revelling in turning people’s lives upside down.\n“Any claim the Labour Party may have once had to be a party of compassion or principle has well and truly gone.”\nThe post “Labour’s recent leaflet boasting about deporting more people than the Tories is sickening” appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_green-mps-write-to-labour-colleagues-to-urge-benefit-cuts-opposition/content_40.html": "Every Labour MP has been sent a letter by Green MPs ahead of an announcement next week urging them to rebel against plans to slash around £6billion from the welfare bill\nDear Colleagues,\nAhead of the upcoming Spring Statement and Green Paper on welfare, I am writing to urge you to oppose strongly and vote against any proposed cuts to welfare benefits, which are rumoured to be as deep as £6 billion.\nAlong with my Green colleagues, I am gravely concerned about the catastrophic impact any such cuts would have on millions of disabled people.\nIt is not news to you that those in receipt of health-related benefits already face inordinate hardships, with 50 per cent of people claiming Universal Credit who have limited capability for work unable to heat their homes, pay their bills or have low food security.[1]\nScope told us recently that proceeding with cuts rumoured to be set out in the forthcoming Green Paper on welfare reform, will push an added 700,000 disabled households into poverty.[2]\nI am certain that your inbox, like mine, is filled with emails from constituents telling you how terrified and anxious they feel about how to make ends meet should their support payments be ripped away. There is no moral case for making these cuts.\nThe years of damaging austerity inflicted upon public services and welfare provision by the previous Conservative Government has already brought our communities to breaking point.\nThe United Nations Committee on Economic, Social and Cultural Rights has called on the UK Government to take “corrective measures” to address the immense negative impact of welfare cuts introduced by successive Conservative Governments since 2010.[3] But even George Osborne, at the height of austerity, ruled out freezing inflation-linked rises to PIP payments; a change the current Secretary of State for Work and Pensions is rumoured to be introducing.\nI know you didn’t campaign for this, and that you stood up at the election for a welfare system based on dignity and respect.\nLike me, I expect you feel alarmed at the rhetoric coming from the Government that is instead scapegoating disabled people. Pushing people who are in need into deeper poverty will do nothing to address the root issues that lead to welfare claims, namely housing insecurity, poor quality jobs, huge wage inequality and a soaring mental health crisis.\n[1] https://www.jrf.org.uk/news/factsheet-health-related-benefit-cuts\n[2] https://www.scope.org.uk/campaigns/open-letter-to-the-chancellor-the-cost-of-cuts-to-disability-benefits\n[3]https://tbinternet.ohchr.org/_layouts/15/treatybodyexternal/Download.aspx?symbolno=E%2FC.12%2FGBR%2FCO%2F7&Lang=en\nThe post Green MPs write to Labour colleagues to urge benefit cuts opposition appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-on-course-for-record-breaking-night-as-early-results-come-in/content_16.html": "Responding to early results from the night’s local and regional elections, Green Co-Leader and Bristol Central MP Carla Denyer said:\n“It has been a good night for us in the West of England where we saw a race that was wide open.”\n“The West of England result builds on Greens being elected to lead Bristol City Council, voters electing me as their first Green MP in the city, and major breakthroughs in local elections around the region in recent years.\n“I’m pleased how well Greens did in this mayor contest. This result offers a great platform for more Green electoral success in the coming years – including at Westminster.”\n“In Lambeth and Norwich early results suggest we are gaining councillors and are on course for yet another record-breaking night where we will increase the number of Green councillors serving their communities.\n“Five-party politics in England is the new norm, it’s here to stay, and Greens are only just getting started.”\nThe post Greens on course for “record-breaking” night as early results come in appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_labours-approach-to-middle-east-conflict-failing-as-civilian-death-toll-mounts/content_27.html": "Green Party Co-Leader, Carla Denyer said, “The reports over the weekend that no food has entered Northern Gaza since the 1st of October, of Israel’s attack on al-Aqsa Hospital, of chemical weapons being used to attack UNIFIL peacekeepers, of mass civilian casualties in Gaza’s Jabalia Refugee Camp and of increased rocket fire into Israel from Hezbollah are extremely disturbing. The huge numbers of civilian deaths and the prospect of widespread starvation in Northern Gaza are intolerable.\nThe Labour government must recognise that violence in the Middle East is escalating rapidly and that their current approach is failing. The Government needs to consider far more direct measures to incentivise a ceasefire including an end to arms sales, the introduction of divestments, boycotts and sanctions, prosecutions for all those who have committed war crimes and a plan for a viable Palestinian state.”\nThe post Labour’s approach to Middle East conflict “failing” as civilian death toll mounts appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_green-party-to-appeal-to-disillusioned-voters-as-they-head-for-record-breaking-local-election-results/content_4.html": "The Green Party of England and Wales will today (Tuesday 8th April) launch their local elections campaign for what they predict will be a “record-breaking” year for them. The launch will take place in Warwickshire, one of the places where Greens are expecting to make gains leaving them with a record number of local councillors.\nGreen Party co-leader, Adrian Ramsay, is expected to say:\n“We know that politics in this country isn’t providing people with what they need – that disillusionment is high and morale is low. But up and down the country Greens are making a difference. We are smashing through records getting more and more hard-working councillors elected.\n“We are taking votes from the old tired parties to offer something different – the positive change so desperately needed.\n“Meanwhile, Reform is trying to make gains on the back of a weak and lacklustre political old guard. It’s a party that uses the politics of fear to divide our communities. And whose policies are explicitly designed to only benefit a small number of the very richest people. Importantly for these local elections, Reform has no track record of delivering at any level of government.”\nThe Green Party has been breaking records in recent years and has increased their councillors nearly fivefold over the last five elections to over 800 in 170 councils. Greens lead 14 councils, including Bristol, Warwick and Mid Suffolk and, in total, are part of running over 40. In the general election in 2024, almost two million people voted Green, electing four new MPs to Parliament.\nSpeaking alongside Ramsay, Green Party co-leader Carla Denyer is expected to say:\n“The over 800 Green councillors across England and Wales between them already represent millions of people in this country. They are working hard every day to make a difference for their communities, working all year round on practical solutions, not just turning up on the doorstep when it’s election time.\n“Here in Warwick where we lead the council, we have invested millions into making council housing warmer and cheaper to run. In Mid Suffolk, another Green run council, in one year we have prevented hundreds of people from becoming homeless.\n“Green councillors are embedded in their communities, listen to the needs and concerns of their residents – their neighbours! – and take action to improve their quality of life every day. Offering hope, not division; community not chaos.”\nThe post Green Party to appeal to disillusioned voters as they head for “record breaking” local election results appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_blog/content_37.html": "Latest News\nSave bees and money by growing wild flowers by persuading Wakefield District Council to plant wildflowers on unused verges.\nTell Wakefield Council to stop with the green-wash about being considerate to wildlife by mowing down their environment. We want them to follow the lead of places like Rotherham...\nGreens respond to Runcorn and Helsby by-election\nGreen Party co-leader Adrian Ramsay MP said: “This Labour government and Prime Minister Keir Starmer need to do nothing short of a complete reset. “Tonight’s results, not just in...\nGreens on course for “record-breaking” night as early results come in\nResponding to early results from the night’s local and regional elections, Green Co-Leader and Bristol Central MP Carla Denyer said: “It has been a good night for us in the West...\nGreens anticipate another record-breaking year in local elections as polls close\nAs polls close in the council and mayoral elections taking place across England, the Green Party has said it is confident of “record-breaking” results. The Party is hoping to...\nGovernment must distance itself from Blair’s latest ‘dodgy dossier’ say Greens\nCommenting on Tony Blair’s call for a major rethink of net zero policies which comes as the Climate Change Committee warns the UK is critically unprepared for the escalating...\nGreens respond to interim EHRC guidance\nCo-leaders Carla Denyer MP and Adrian Ramsay MP said: “This guidance issued by the Equality and Human Rights Commission (EHRC) is ill-considered and impractical, and leaves many...\nGreens challenge “con artist” Farage to climate TV debate\nResponding to Nigel Farage’s comments on Radio 4’s Today Programme where he refused to accept that carbon emissions are leading to climate change, Green Party Co-Leader, Adrian...\nGreens to back nationalisation of British Steel as parliament recalled\nReacting to news that parliament is to be recalled on Saturday 12th April to discuss the future of British Steel, Green MP Ellie Chowns said: “The Green party will be backing...\nGreens back nationalisation of steel to safeguard industry and support green transition\nResponding to news that the government is considering nationalising British Steel, the Green Party has thrown its support behind public ownership. Co-leader Adrian Ramsay said:...\nGreens call on PM to “take tax cuts for billionaires” off the negotiating table\nResponding to reports that the Prime Minister is considering tax cuts for Musk, Bezos and other tech billionaires as part of his negotiations with President Trump, Green Party...\nGreen Party to appeal to disillusioned voters as they head for “record breaking” local election results\nThe Green Party of England and Wales will today (Tuesday 8th April) launch their local elections campaign for what they predict will be a “record-breaking” year for them. The...\nTrump’s tariffs: We must “oppose Trump’s divide-and-rule tactics” say Greens\nResponding to US President Donald Trump’s sweeping set of tariffs, Green Party Co-Leader, Carla Denyer MP, said, “We need to work together to oppose Trump’s divide-and-rule...\n“A legacy offering real hope for Scotland” – Carla Denyer reflects on Patrick Harvie’s tenure as longest serving political leader in the UK\nResponding to the news that Patrick Harvie is stepping down as Co-Leader of the Scottish Green Party, Carla Denyer MP, Co-Leader of the Green Party of England and Wales, said,...\nGreens condemn latest brutal displacement of Palestinians\nResponding to Israel defence minister Israel Katz’s statement that the country aimed to seize large areas of the Palestinian territory and incorporate them into “security zones”,...\n“Labour’s recent leaflet boasting about deporting more people than the Tories is sickening”\nResponding to Labour’s recent leaflet about how they’ve delivered “the four biggest deportation flights in UK history” Green Party Co-Leader, Carla Denyer said, “Labour’s recent...\nGreens react to ‘Awful April’ price hikes\nReacting to large price hikes that kick in today at the start of what has been dubbed ‘awful April’, co-leader of the Green party, Carla Denyer, said: “Energy bills up to nearly...\nGreens offer democratic alternative to dead end of Reform\nResponding to Reform’s local elections campaign event, Green Party co-leader Adrian Ramsay MP said: “We know people are struggling after 14 years of Conservative austerity, now...\nSpring statement targeting ill and disabled is “morally repugnant”\nResponding to the Chancellor’s Spring Statement, the Co-Leader of The Green Party, Adrian Ramsay MP, said, “The Chancellor had a choice today. To rebalance our economy by asking...\nGreens urge government to ‘rebalance the economy’ ahead of Spring Statement\nGreen MPs outside the Treasury, from left: Siân Berry MP, Adrian Ramsay MP, Carla Denyer MP, Ellie Chowns MP. Photo: David Mirzoeff/The Green Party Green MPs pose with scales...\nA “gargantuan waste of money”\nResponding to the news that the government has given the go ahead to the largest tunnel in the UK under the Thames, Sian Berry MP said, “The Lower Thames Crossing is a gargantuan...\nSolar panel initiative should be just a first step\nGreen Party MP and co-leader Adrian Ramsay welcomed government plans to fund the installation of 400 solar power projects for schools and hospitals, (1) and called for Ministers...\nGreen Party announces new CEO in “pivotal year for Green politics”\nThe Green Party of England and Wales has today announced the appointment of Harriet Lamb as the party’s new CEO. Harriet joins from the global environmental action NGO ‘WRAP’...\nGreens repeat call for UK to suspend all arms exports to Israel\nReacting to the resumption of attacks by Israeli forces on Gaza, Ellie Chowns, MP for North Herefordshire and Green Party Foreign Affairs spokesperson, said: “As Israel returns...\nSiân Berry’s message to Labour: stop scapegoating and stigmatising those in need\nReacting to the statement from Liz Kendal’s to parliament today on proposed cuts to welfare benefits [1], Siân Berry MP said: “I’ve heard nothing today that reassures me the...\nGreen MPs write to Labour colleagues to urge benefit cuts opposition\nEvery Labour MP has been sent a letter by Green MPs ahead of an announcement next week urging them to rebel against plans to slash around £6billion from the welfare bill Dear...",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk/content_3.html": "Fighting for a fairer, greener future for Wakefield\nFAIRER\nGREENER\nCOMMUNITIES\nWe want faster, more ambitious change to a fairer society, making more sustainable use of earth’s resources and reducing and repairing the damage done to our environment. The major parties in Wakefield are not responding to the climate emergency with the seriousness it deserves, nor are they planning for a fair and just transition to sustainable ways of living for the future. Elected Green Party politicians make a real difference to the pace and fairness of change.\nWe’re ready to do politics differently. See our manifesto",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_trumps-tariffs-we-must-oppose-trumps-divide-and-rule-tactics-say-greens/content_17.html": "Responding to US President Donald Trump’s sweeping set of tariffs, Green Party Co-Leader, Carla Denyer MP, said,\n“We need to work together to oppose Trump’s divide-and-rule tactics. In the first instance, that means standing with partners like the EU and Canada who share our commitment to trade agreements rather than trade coercion. It’s a fantasy to believe that our long-term economic prosperity can be left in the hands of whether or not we are in Trump’s favour on any one given day. As such, we must prioritise securing a Customs Union agreement with the EU so that we regain the strength of being part of a larger bloc.”\nThe post Trump’s tariffs: We must “oppose Trump’s divide-and-rule tactics” say Greens appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_caroline-lucas-responds-to-suggestion-labour-set-to-shelve-natural-history-gcse/content_26.html": "Former Green Party MP, Caroline Lucas, has given her reaction to suggestions that plans for a Natural History GCSE have been shelved because it is “seen as a Conservative party initiative.” Caroline was one of the key drivers of the GCSE in the last parliament. She said:\n“I very much hope that Labour will look at this again, and appreciate both the popularity of the proposed Natural History GCSE, and the urgency of its introduction. The GCSE enjoys huge support, including from WWF and the Wildlife Trusts through to the Natural History Museum, the Association of School and College Leaders, 17 universities and thousands of young people themselves.\n“It was a privilege to work with author and former BBC producer Mary Colwell, who has spearheaded the campaign, to persuade the last Government to agree to it. The curriculum has been prepared over several years by the OCR exam board, and it’s close to being ready to roll out. Stalling at this point would be a disaster, doing a massive disservice to students who desperately want to learn more about the natural world; failing to equip them with the skills of the naturalist which have increasingly been lost, and making it harder for all of us to restore and protect nature.\n“Over the last half century, the world has lost 60% of the mass of mammals, birds, fish and reptiles – our education system urgently needs to rise to the challenge of reversing this shocking scale of loss.”\nThe post Caroline Lucas responds to suggestion Labour set to shelve Natural History GCSE appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_land-use-strategy-must-deliver-nature-restoration-and-secure-our-food/content_32.html": "Adrian Ramsay, Co-Leader of The Green Party of England and Wales, MP for Waveney Valley, welcomes the start of the consultation process for the Land Use Framework.\n“Food security and nature restoration are essential for our very survival. They must not be seen as in competition – the government must step up its efforts on both.\n“We have one of the most nature depleted countries on Earth, yet we need our soils, pollinators and wider environment to be in a healthy state in order to secure our food supply – and farmers are crying out for adequate funding for nature friendly farming and natural flood management.\n“Climate breakdown is already threatening our ability to produce food, with droughts and flooding at different times of the year making life very hard for farmers.\n“This Land Use Framework represents a once-in-a-generation opportunity to address these critical issues and ensure our communities are more self-sufficient and resilient in our food supply. For this plan to work and deliver for communities, the Government must work to diversify what food we produce, which will strengthen our food security.”\n“A new framework could – and should – support farmers to produce seasonal foods for local markets and tackle the power of the supermarkets who don’t give farmers a fair deal.”\n“This happens throughout this country, with businesses like Hodmedods in Suffolk growing beans and pulses or Glebe Farm in Cambridgeshire producing homegrown oats. These examples show that we can diversify food production reducing our reliance on imports, ensuring food security for future generations.”\nThe post Land Use Strategy must deliver nature restoration and secure our food appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_standing-in-solidarity-with-ukraine/content_15.html": "On the weekend of the third anniversary of Russia’s war on Ukraine, Green Party co-leaders Carla Denyer and Adrian Ramsay said:\n“Across the world, people will be standing in solidarity with Ukraine, facing the third anniversary of Russia’s invasion.\n“Yes, Russia started the war and Yes, Ukraine is a democracy with an elected President. That we have to restate these simple facts is shocking but necessary because US President Donald Trump has chosen to buy into and amplify the lies and disinformation of the Russian state.\n“Russian President Vladimir Putin is a dangerous tyrant. It is deeply worrying that President Trump is now joining him in spreading lies, attacking democracy, sowing division and chaos, and undermining the rule of law.\n“We want this war to end, and we want peace talks.\n“Our unwavering position is that the voice of Ukraine must be front and centre of the peace talks that must take place. It is for the people of Ukraine to decide their future. Not Putin, not Trump.\n“The UK government could and should be doing much more to tighten sanctions on Russia. Sales of Russian fossil fuels are paying for the missiles and drones used to attack Ukrainian civilians.\n“The UK government must close all the loopholes enabling the Kremlin to refill its war chest.\n“Ukrainians who came to the UK to seek safety and still cannot return to their war-torn homes must be given ongoing protection and proper support.\n“The UK must keep supporting Ukraine to defend itself, and Prime Minister Keir Starmer must make it crystal clear when he meets President Trump that we will do so.\n“The end goal is a just and lasting peace based on the sovereignty, independence and territorial integrity of Ukraine. That can still be achieved.”\nThe post Standing in solidarity with Ukraine appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_sian-berrys-message-to-labour-stop-scapegoating-and-stigmatising-those-in-need/content_6.html": "Reacting to the statement from Liz Kendal’s to parliament today on proposed cuts to welfare benefits [1], Siân Berry MP said:\n“I’ve heard nothing today that reassures me the Government will stop scapegoating and stigmatising those in need, while impoverishing them to the tune of £5 billion. Young and disabled people should have the support and backing of the Government but instead they have been badly let down this month with the active trailing of terrifying plans.\n“It’s clear that these plans were plotted without the input of those whose lives will be most impacted. Disabled people must be listened to before any changes are made, and I hope that Labour backbenchers will join me in being their fiercest defenders and fight off the worst of these plans.\n“The Chancellor must listen as well, to growing calls from Green MPs, the public and even many millionaires for a wealth tax. How can she stoop as low as any Conservative Chancellor and take money away from disabled people rather than get a grip on the obscene wealth being hoarded in this country? This morally indefensible choice will have devastating consequences, and the Government should be ready to answer for it.”\nNotes\nThe post Siân Berry’s message to Labour: stop scapegoating and stigmatising those in need appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_our-people/content_38.html": "Officers of the Wakefield Green Party\nCo-ordinator: Kate Dodd – info@wakefieldgreenparty.org.uk\nTreasurer: Ashton Howick\nNominations Officer: Ruth Love\nSocial Media Officer: Dan Russell\nMedia Officer: Lyn Morton\nMembership Secretary: Ollie Watkins\nCo-ordinator: Kate Dodd – info@wakefieldgreenparty.org.uk\nTreasurer: Ashton Howick\nNominations Officer: Ruth Love\nSocial Media Officer: Dan Russell\nMedia Officer: Lyn Morton\nMembership Secretary: Ollie Watkins",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_blog_page_2/content_13.html": "Latest News\nGreen MPs write to Labour colleagues to urge benefit cuts opposition\nEvery Labour MP has been sent a letter by Green MPs ahead of an announcement next week urging them to rebel against plans to slash around £6billion from the welfare bill Dear...\nGreen leaders urge Labour backbenchers to vote down benefit cuts\nGreen co-leaders Adrian Ramsay MP and Carla Denyer MP appeal to Labour backbenchers to think again on supporting looming benefits cuts: “Experts at Scope suggest that 700,000...\n‘Zane’s Law’ needed to tackle toxic sites\nGreen MP Sian Berry urged the government to bring forward Zane’s Law to protect people from contaminated land after new research showed that out of 13,093 potentially toxic sites...\nGreens call for water companies to be taken into public hands as Environment secretary visits polluted Windemere\nGreen Party Co-Leader Adrian Ramsay MP has poured cold water on today’s visit by Environment Secretary Steve Reed to Lake Windemere and the announcement that United Utilities...\n“Now is the time to make clear we, as a country, stand with Zelensky in working for a lasting just peace.”\nResponding to the “bullying” and “shameful” behaviour of President Trump towards President Zelensky, Green Party MP, Ellie Chowns, said: “What we witnessed today was bullying...\nGatwick expansion unwanted, say Greens\nResponding to the Transport Secretary’s decision to pursue a positive decision for Gatwick Airport to bring its northern terminal into constant use, (1) Siân Berry Green MP for...\n“There should be zero tolerance of coercion, violence, or sexual abuse.”\nIn response to the review out today concluding that degrading, violent and misogynistic pornography should be banned, Green Party Baroness, Jenny Jones said: “Online pornography...\nGreens press government to act on Grenfell oversight\nResponding to the government’s announcement that it will accept all the recommendations from the Grenfell Tower Inquiry (1), Green MP Carla Denyer urged the government to accept...\nGreen Party demands ambitious action in wake of Climate Change Committee report\nAs the Climate Change Committee publishes its 7th carbon budget [1], the co-leader of the Green Party, Adrian Ramsay MP, has demanded the Government ensure ambitious climate...\nGreen parliamentarians write to Defence Secretary over defence spending principles\nGreen MPs and peers call for defence spending decisions to be based on “core principles” Ellie Chowns MP calls foreign aid cut announcement “cruel and unncecessary” Green letter...\nStanding in solidarity with Ukraine\nOn the weekend of the third anniversary of Russia’s war on Ukraine, Green Party co-leaders Carla Denyer and Adrian Ramsay said: “Across the world, people will be standing in...\nDiscarding old friends for new autocrats\nGreen Party response to JD Vance speech (1) Green MP, and party parliamentary spokesperson on foreign affairs, Ellie Chowns said: “US Vice President JD Vance’s use of the Munich...\nLabour are “plumbing new depths” with filmed immigration raids\nResponding to the news that Labour are now publishing videos of police immigration raids, Green Party Co-Leader, Carla Denyer MP, said: “This Labour government are plumbing new...\nGreens call for Drax subsidies to be shifted to home insulation scheme\nGreen MP and party co-leader Adrian Ramsay has urged the government to divert planned new subsidies for the privately owned wood-burning Drax power station to a national home...\nGreens warn of burning world and call for faster government-backed transition\nResponding to new data from the Copernicus Climate Change Service (1) showing that the global temperature was the highest on record for a January, Green Party co-leader Carla...\nThis announcement is straight out of an authoritarian playbook.\nGreen Party Co-Leader Adrian Ramsay MP has responded to the news that local elections in a number of parts of England this May will cancelled saying: “It’s hard to think of...\nThe forced movement of a people from their homeland is ethnic cleansing say Greens\nResponding to President Trump’s remarks overnight, Green Party MP, Ellie Chowns, said, “The forced movement of a people from their homeland is ethnic cleansing. These comments...\nStrong bonds with European neighbours is the only tonic to toxic Trump\nIn response to Starmer joining the EU 27 this evening, Greens are urging him to put European unity at the top of his agenda to provide a united front against the toxic impact of...\nWe must scrap Ofsted say Greens\nResponding to the news that Ofsted is considering a new approach to inspecting education providers and introducing ‘report cards’ for schools, Green Party Education Spokesperson,...\nLand Use Strategy must deliver nature restoration and secure our food\nAdrian Ramsay, Co-Leader of The Green Party of England and Wales, MP for Waveney Valley, welcomes the start of the consultation process for the Land Use Framework. “Food security...\nBrexit anniversary sparks call for much closer relationship with EU\nOn the fifth anniversary of the UK’s exit from the European Union, Green MP Ellie Chowns said: “These five years have seen the economic, social and political costs of leaving...\nGreens welcome Rosebank and jackdaw court ruling\nGreen Party co-leader Carla Denyer MP has welcomed a Scottish court ruling that government approval of the giant new Rosebank and Jackdaw developments was unlawful because it did...\n“The idea that we have to choose between economic prosperity and safeguarding our children’s future is absolute nonsense”\nResponding to Rachel Reeves’ speech on economic growth, Green Party Co-Leader, Adrian Ramsay MP, said “The idea that we have to choose between economic prosperity and...\n“expanding Heathrow in the face of a climate emergency is the definition of irresponsible.” say Greens\nResponding to the news that Rachel Reeves is backing the expansion of Heathrow Airport, Green Party MP, Sian Berry MP said, “The Chancellor talked about the ‘costs of...",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_there-is-a-green-elephant-in-the-room-with-governments-ai-plans/content_35.html": "| Responding to the news that Government plans for AI to be “mainlined into the veins” of the nation, Green Party Co-Leader, Adrian Ramsay MP, said,\n“The potential for AI is huge and Greens welcome the potential it holds, especially in research and innovation. He continued, “In addition, there is a green elephant in the room with neither government nor business truly addressing the environmental impacts of AI. One estimate said AI-related infrastructure may soon consume six times more water than Denmark, a country of 6 million people. And a request made through ChatGPT consumes 10 times the electricity of a Google Search. Yet the action plan does not address these crucial questions of environmental sustainability, let alone the debate about the relative gains from AI versus these obvious harms.” |\nThe post There is a green elephant in the room with government’s AI plans appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_manifesto/content_28.html": "Our plan for change\nWe want faster, more ambitious change to a fairer society, making more sustainable use of earth’s resources and reducing and repairing the damage done to our environment. The major parties in Wakefield are not responding to the climate emergency with the seriousness it deserves, nor are they planning for a fair and just transition to sustainable ways of living for the future. Elected Green Party politicians make a real difference to the pace and fairness of change.\nBetter Quality of Life for All\n- Warmer, more affordable homes; making more use of non-carbon energy sources.\n- Support for reducing the cost of living by providing more reducing, repairing and recycling.\n- Better support for struggling families, and families in crisis.\n- Free WiFi\nFairer, more equal Society\n- Stronger support for cohesive communities, celebrating equality and diversity.\n- Improved social care and mental health provision.\n- More Council support and funding for voluntary sector and food banks\nStronger, Connected Communities\n- More investment in local and village facilities and transport services.\n- More investment in bus, cycle, and electric vehicle transport.\n- Better integrated, and more regular public transport.\n- Safer routes for cycling and walking\nGreener economy\n- More flexible working, and WFH where possible.\n- Active promotion of living wage through Council contracts and procurement.\n- Promoting and investing in lifelong learning for green skills for transition to low/no carbon energy sources.\n- Support for Small Medium Enterprise’s (SMEs) undertaking green energy and digital transition work\nSustainable future\n- Plan for zero-carbon distribution infrastructure and protect employment.\n- Demand new builds and conversions are no-carbon to avoid costly retrofitting.\n- Promote jobs in digital, creative, and green technology.\n- Actively support businesses to transition to carbon neutral.\nGreener city & district\n- Council support for cheaper, and noncarbon energy for all.\n- No new road building unless all greener alternatives have been exhausted and ensure adequate replacement schemes to capture carbon.\n- Provide more play areas, allotments, improved green spaces.\n- Improve and clean up waste disposal, recycling, and water and air quality.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_why-wont-labour-even-consider-putting-water-companies-back-into-public-hands-ask-greens/content_30.html": "Responding to the news (BBC) that a new independent commission will soon launch the largest review of the water industry since privatisation in the 1980s, Green Party Co-Leader, Carla Denyer said,\n“Water is a basic human need. It should be in public hands run for people, not profit. I don’t know why Labour won’t even consider this.”\nThe post Why won’t Labour even consider putting water companies back into public hands ask Greens appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_save-bees-and-money-by-growing-wild-flowers-by-persuading-wakefield-district-council-to-plant-wildflowers-on-unused-verges/content_39.html": "Tell Wakefield Council to stop with the green-wash about being considerate to wildlife by mowing down their environment. We want them to follow the lead of places like Rotherham and grow meadow flowers on our verges.\nSign our petition to Wakefield Council at https://actionnetwork.org/petitions/save-bees-and-money-by-growing-wild-flowers-by-persuading-wakefield-district-council-to-plant-wildflowers-on-unused-verges",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_discarding-old-friends-for-new-autocrats/content_18.html": "Green Party response to JD Vance speech (1)\nGreen MP, and party parliamentary spokesperson on foreign affairs, Ellie Chowns said: “US Vice President JD Vance’s use of the Munich Security Conference to lambast allies rather than focus on the real chaos makers in the world is sadly predictable but no less bizarre and dangerous for that.\n“President Trump’s administration seems determined to usher in a new world where old friends are discarded and new friends made of dangerous autocrats. The UK should have no part of that and should work with others to protect international frameworks and institutions that support co-operation and the rule of law.”\n(1) https://www.politico.eu/article/us-vice-president-jd-vance-attack-europe-migration-free-speech/\nThe post Discarding old friends for new autocrats appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-call-for-drax-subsidies-to-be-shifted-to-home-insulation-scheme/content_29.html": "Green MP and party co-leader Adrian Ramsay has urged the government to divert planned new subsidies for the privately owned wood-burning Drax power station to a national home insulation scheme.\nAdrian Ramsay said:\n“Drax is a green energy scam, burning trees – some imported from ancient forests from as far away as Canada – subsidised by the taxpayer.\n“The billions of pounds worth of subsidies run out in 2027, but the government is expected to try to renew them next week, turning taxpayer money into profits for a private company, instead of using the money to fuel a green energy revolution.\n“Drax has benefitted from over £6 billion in subsidies since 2012 and neither taxpayers nor the environment can afford a penny more.\n“The money should be used to help fund a national scheme of home insulation that would cut people’s energy bills and help to reduce energy use.\n“Green MPs and Peers will be pressing the government to end this subsidy scandal and invest people’s money where it will make a real difference to them.”\nThe post Greens call for Drax subsidies to be shifted to home insulation scheme appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_brexit-anniversary-sparks-call-for-much-closer-relationship-with-eu/content_21.html": "On the fifth anniversary of the UK’s exit from the European Union, Green MP Ellie Chowns said:\n“These five years have seen the economic, social and political costs of leaving the European Union become ever clearer.\n“Far from ‘taking back control’, we have all lost out.\n“Young people have been deprived of the chance to easily study and work in the European Union, while small businesses have found it increasingly difficult to export, and the UK is increasingly isolated on the international stage.\n“No wonder, the proportion of the public believing Brexit to have been the right decision is at its lowest since 2020. (1)\n“The Green Party is very clear that people and planet would benefit from much closer relationships between our country and the European Union.\n“We will continue to press the Labour government to be braver and bolder in overcoming the negative impacts of Brexit.\n“Full membership of the EU remains the best option for the UK, and we are in favour of pursuing a policy to re-join as soon as the political will is present.\n“Of course, that means building the widespread public support we need before a decision to rejoin is made.\n“There are win-win first steps that the government should be taking today. For instance, working with the EU on a youth mobility scheme that opens up the European Union to our youngsters.\n“We should be working with the EU to tackle the twin crises of climate breakdown and biodiversity loss in the face of US President Donald Trump’s disastrous decision to pull the US out of the Paris climate agreement.\n“We should also rejoin the Customs Union to begin to overcome the obstacles that small businesses have faced in trading with our closest partners since Brexit.\n“While joining the Single Market would provide benefits in terms of free movement of people, goods, services and capital, membership of the Single Market without membership of the EU would not be an ideal long-term solution because the UK would not be a full partner in decision making processes.\n“We’ve learned from the divisiveness of Brexit that binary choices push people apart rather than bring people together.\n“So, we are proposing the use of citizens’ assemblies to support the wider public to make well-informed decisions about complicated political issues such as our future membership of the EU.”\nMark Ormiston, a sixth generation managing director of Ormiston Wire that manufactures a high quality products used in suspending lights, art installations, yacht rigging and surgical procedures, said Brexit is making it ever harder to get its components into final products manufactured abroad.\nMark Ormiston “We supply components not a final product so if the end product moves offshore, we have to try and supply that export market. With Brexit small exporters are being devastated and we must work very hard to persuade companies to use our quality and expertise.”\nNOTES TO EDITORS\n(1) https://yougov.co.uk/politics/articles/51484-how-do-britons-feel-about-brexit-five-years-on\nThe post Brexit anniversary sparks call for much closer relationship with EU appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_government-must-distance-itself-from-blairs-latest-dodgy-dossier-say-greens/content_8.html": "Commenting on Tony Blair’s call for a major rethink of net zero policies which comes as the Climate Change Committee warns the UK is critically unprepared for the escalating threats of the climate crisis, co-leader of the Green Party, Carla Denyer, said:\n“Tony Blair has decided to mimic Nigel Farage on net zero and sounds like he is speaking on behalf of petro-states like Saudi Arabia and Kazakhstan for whom he has lobbied for more years than he was prime minister.\n“It is vital that the government distance itself from this latest dodgy dossier from Blair and turn its attention instead to what the Climate Change Committee is saying today. Their report could not be clearer: we are woefully unprepared for the impacts of climate breakdown as a country. Tomorrow is likely to be the hottest local election day on record – a potent reminder that we need a comprehensive plan to prepare for increasingly extreme weather events.\n“Tony Blair and Nigel Farage apparently need reminding that a huge 89% of the world’s people want stronger action to fight the climate crisis, not a reset or watering down of ambition. And the CBI points to the fact that the UK’s net zero sector expanded 10 per cent last year, three times faster than the rest of the economy.\n“The future is green; Labour must not allow yesterday’s man to drag us back into the dark ages. The government must press ahead with the drive towards clean energy and the green economy and all the advantages that will bring in creating good quality jobs, cutting energy bills and creating a healthier society.”\nThe post Government must distance itself from Blair’s latest ‘dodgy dossier’ say Greens appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_a-legacy-offering-real-hope-for-scotland-carla-denyer-reflects-on-patrick-harvies-tenure-as-longest-serving-political-leader-in-the-uk/content_43.html": "Responding to the news that Patrick Harvie is stepping down as Co-Leader of the Scottish Green Party, Carla Denyer MP, Co-Leader of the Green Party of England and Wales, said,\n“Patrick’s legacy goes well beyond being the longest-serving political leader in the UK, or even being the leader who took Greens into government for the first time in the UK. His legacy will be marked every time a young person gets on public transport free of charge; with every renter who is able to keep a roof over their heads because of protections that Patrick secured; and with every kilowatt of clean renewable power that Scotland produces because of Green policies. These are real achievements to be proud of. A legacy offering real hope for Scotland.”\nThe post “A legacy offering real hope for Scotland” – Carla Denyer reflects on Patrick Harvie’s tenure as longest serving political leader in the UK appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_contact-wakefield-green-party/content_11.html": "Contact Email: info@wakefieldgreenparty.org.uk FollowFollowFollow Name *Email Address *Phone NumberMessage Send Message",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_green-party-announces-new-ceo-in-pivotal-year-for-green-politics/content_33.html": "The Green Party of England and Wales has today announced the appointment of Harriet Lamb as the party’s new CEO. Harriet joins from the global environmental action NGO ‘WRAP’ where she currently serves as their CEO.\nThe announcement comes just weeks before “pivotal” local elections where the party hopes to build on its record-breaking number of councillors and maintain momentum after last year’s record-breaking result in the General Election.\nFrom June, as CEO, Harriet will head up the party’s staff team and its day-to-day operations.\nWelcoming Harriet to the role, Green Party Co-Leader, Adrian Ramsay MP, said,\n“I am delighted to welcome Harriet to the Green Party. She brings a wealth of experience leading and scaling up organisations centred on bringing about environmental and social justice. She evidently has the experience and passion to play a central role in growing our party and our impact towards our core mission.\nHe continued, “The Green Party is on a roll. In the last few years we have quadrupled our number of councillors, entering administration on over 40 councils, and last year we saw a record General Election vote. With two party politics having broken down and people looking for alternatives, the Green Party’s positive vision for a fair, liveable future is needed more than ever. I look forward to working closely with Harriet in driving the party’s growth and impact to the next level.”\nCommenting, Harriet Lamb said,\n“I am super excited to be joining the Green Party and I am really looking forward to helping deliver the Party’s ambitious plans. I have spent my life working for charities driving social and environmental change – to end low pay, support refugees, nurturing peace in conflict-ridden countries, create the circular economy and most notably building the Fairtrade movement in the UK and globally – all values and issues dear to the Green Party and its agenda for positive change.”\nThe post Green Party announces new CEO in “pivotal year for Green politics” appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_spring-statement-targeting-ill-and-disabled-is-morally-repugnant/content_9.html": "Responding to the Chancellor’s Spring Statement, the Co-Leader of The Green Party, Adrian Ramsay MP, said, “The Chancellor had a choice today. To rebalance our economy by asking the very wealthiest to contribute more, or to remove vital support from ill and disabled people. That she chose to take from the most vulnerable to balance her books is a damning reflection of how out of touch this government is. It is morally repugnant.”\nHe continued, “And it’s not just ill and disabled people who will suffer as the Chancellor doubles down on cuts to frontline services. This will weaken our communities and leave us all poorer. Labour once claimed that they were for the many, not the few – it’s clear now that this is no longer the case.”\nThe post Spring statement targeting ill and disabled is “morally repugnant” appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_get-involved/content_19.html": "Be part of the change\nWe meet monthly except in August and December. Most of our meetings are currently held on line as this makes it easier for members who have family commitments and transport challenges. It also enables us to include outside speakers on from anywhere in the UK without them having to travel. We have outside speakers on policy and campaigning topics at most online meetings.\nAt least twice a year we meet in person and at least twice a year we get together for just a social get together. On top of this members meet up regularly during election time and over campaigns.\nIf you want to join us for part of a meeting or a social event without joining the Party please get in touch. We are a lively, committed and friendly group of activists including teenagers and pensioners and everything in between.\nOur Area\nWakefield Green Party covers the Parliamentary constituencies of Wakefield, Pontefract & Castleford and Hemsworth, plus Wrenthorpe, Outwood and Stanley which are part of the Morley and Outwood constituency. As well as the local council wards of:-\n- 1 Ackworth, North Elmsall and Upton\n- 2 Airedale and Ferry Fryston\n- 3 Altofts and Whitwood\n- 4 Castleford Central and Glasshoughton\n- 5 Crofton, Ryhill and Walton\n- 6 Featherstone\n- 7 Hemsworth\n- 8 Horbury and South Ossett\n- 9 Knottingley\n- 10 Normanton\n- 11 Ossett\n- 12 Pontefract North\n- 13 Pontefract South\n- 14 South Elmsall and South Kirkby\n- 15 Stanley and Outwood East\n- 16 Wakefield East\n- 17 Wakefield North\n- 18 Wakefield Rural\n- 19 Wakefield South\n- 20 Wakefield West\n- 21 Wrenthorpe and Outwood West\nWe campaign on local, national and international issues and stand candidates in local and general elections.\nJoin the Green Party\nWe welcome all members and however you feel you can contribute, from supporting our online presence, campaigning or standing in an election.\nVolunteer\nEven if you don’t want to make the commitment of joining us, we always welcome supporters and volunteers. Volunteers can help with our campaigning work. Could you help deliver leaflets to your street, or go out with our campaign team and speak to local residents about their concerns?\nDo you have fundraising experience or web design, press, research and administrative skills? Whatever your level of experience and however much or little time you can give, we would love to hear from you.\nContact Kate Dodd by email for more information about ways you can get involved.\nLocal Elections\nIn 2023, we will stand a candidate in every ward. You can help us to achieve this.\nWe need lots of enthusiastic, committed and hard-working candidates. We are particularly keen to ensure diversity amongst our candidates.\nCandidates must be paid-up members of the Green Party and support its main aims and policies.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton/content_1.html": "We’re ready to do politics differently. See our manifesto\nStanding for Change in Castleford Central & Glasshoughton\nWhat one thing do you think Wakefield District Council has to change it’s approach towards?\nRecognising that green words need green actions. By supporting a green positive agenda, the WMDC could attract investment, create jobs, and help save the planet.\nWhat difference do you think a Green Party Councillor could make in Castleford Central & Glasshoughton?\nA Green Party councillor would offer differing views and perspectives from those of Labour and the Conservatives. Wakefield Council seems trapped in a perpetual cycle of doing the same things and hoping for different outcomes. New opinions and a broad church of political views would foster new ideas and new ways of doing things to help the people of Castleford Central & Glasshoughton ward.\nWhat five words (or phrases) best describe you as a prospective councillor?\nMotivated to built a better future.\nHow would a Green approach help ordinary people to better manage the cost of living?\nThe UK has some of the least green housing in the developed world. Homes are rarely well-insulated and are inevitably heated by fossil fuels. A green approach to housing upgrades will make homes warmer and cheaper to run. Similarly, a switch away from fossil fuels to renewables is proven to lower energy costs and make household bills cheaper. Lastly, a strong push to take public control of privatised resources such as utilities and public transport will mean that private companies are not able to make massive profits that put shareholders before consumers.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-call-on-pm-to-take-tax-cuts-for-billionaires-off-the-negotiating-table/content_7.html": "Responding to reports that the Prime Minister is considering tax cuts for Musk, Bezos and other tech billionaires as part of his negotiations with President Trump, Green Party Co-Leader, Adrian Ramsay MP said,\n“I’m calling on the Prime Minister to take this morally reprehensible suggestion off the negotiating table. The very idea that he would cut tax obligations for some of the biggest companies in the world, controlled by some of the very richest people in the world, in an effort to appease President Trump is an insult to each and every person struggling to get by at the moment. The Prime Minister has made much of “the hard choices” he has had to make: cutting winter fuel allowance to our elderly, removing benefits from disabled people, capping child benefits, and taking huge chunks out of the international aid budget. These decisions, which are awful in isolation, are morally deplorable in the context of offering tax cuts to the likes of X, Amazon and other big tech companies.\nHe continued, “The crisis in our public finances is partly caused by corporations free riding on public services but avoiding paying their taxes. This is how the US tech billionaires have accumulated such excessive fortunes. The Digital Services Tax is a first step towards fair taxation of digital companies that dominate the global economy.”\nThe post Greens call on PM to “take tax cuts for billionaires” off the negotiating table appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-press-government-to-act-on-grenfell-oversight/content_14.html": "Responding to the government’s announcement that it will accept all the recommendations from the Grenfell Tower Inquiry (1), Green MP Carla Denyer urged the government to accept her Private Members’ Bill on preventing future deaths.\nCarla’s Bill calls for the creation of a National Oversight Mechanism which would have responsibility for ensuring that recommendations made following inquests and inquiries are followed. Currently, there is no body which has this responsibility.\nReacting to the government’s statement, Carla Denyer MP said:\n“The deaths of 72 people in the Grenfell tower fire was an unimaginable tragedy, but worse, it was an avoidable tragedy. We owe it to those who lost their lives to make sure nothing like this happens again.\n“I welcome the Government’s commitment to taking forward all of the report’s recommendations, a vital first step towards justice.\n“The Grenfell Inquiry recognised a failure of the state to properly follow up on the recommendations made by inquests and inquiries – meaning that too often, changes needed to prevent people from harm are simply not made. Time and time again, bereaved families go through the trauma of reliving the circumstances of a loved one’s death at an inquest only for the lessons from that death to be forgotten.\n“We urgently need an organisation responsible for making sure that recommendations from inquests and inquiries are actually followed, rather than being forgotten. I have put forward a Bill to create a National Oversight Mechanism for state-related deaths, which would do just that. It would be an independent body, able to scrutinise government action so bereaved families don’t have to be the ones fighting for change.\n“The National Oversight Mechanism proposal has the support of over 70 organisations, including Grenfell United, Amnesty, the Mayor of London, and the Institute for Government. It recently featured as a recommendation in the Health Services Safety Investigations Body’s report on deaths of mental health patients. It’s clear that this is badly needed, and I hope the government will support my Bill.”\nThe post Greens press government to act on Grenfell oversight appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-challenge-con-artist-farage-to-climate-tv-debate/content_12.html": "Responding to Nigel Farage’s comments on Radio 4’s Today Programme where he refused to accept that carbon emissions are leading to climate change, Green Party Co-Leader, Adrian Ramsay MP, hit back saying:\n“Nigel Farage is a performer, a con artist. He will say or do anything. He will happily dance to a populist tune regardless of its impact. Let’s not forget he’s bankrolled by fossil fuel interests, climate deniers, and major polluters—taking in £2.3 million since the 2019 election.\nThis morning’s performance suggested he hasn’t got the slightest grasp of even the most basic climate science. But I think it’s worse than that. He understands all too well human-made climate change, but he is willing to pretend he doesn’t and stand in the way of climate action for his party’s populist agenda.\nIf he really does believe what he says, let’s see if his ridiculous rhetoric stands up to actual scrutiny – let’s see if he is prepared to take part in an hour-long TV debate about climate change and the challenge of reaching net zero?”\nThe post Greens challenge “con artist” Farage to climate TV debate appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-call-on-starmer-to-lead-international-action-at-cop29/content_36.html": "Green Party co-leader Carla Denyer MP urged world leaders to attend COP29 next week to underline its critical importance:\n“COP29 has set itself the goal of “deep, rapid and sustained emission reductions now to keep temperatures under control and stay below 1.5˚C, while leaving no one behind’.\n“But it won’t achieve that without the international leadership needed from Heads of State, Presidents and Prime Ministers.\n“I welcome the fact that Sir Keir Starmer will attend. The UK has the opportunity and responsibility as the first industrial nation on Earth to provide the leadership for a just transition.\n“We need the Prime Minister to show leadership on the world stage, by ensuring COP29 commits to:\n- Urgently transition away from fossil fuels\n- Provide the equitable and just finance promised for adaptation and mitigation, and to fund the loss and damage many are already experiencing as a result of climate impacts\n“Unfinanced is unprepared and we are both.\n“Of course, these are incredibly difficult times internationally, with the European Union stalling on its actions and President-elect Trump, a climate crisis denier, once again stalking the world stage.\n“But that is why it is so important that the UK steps forward to remind the world what is at stake if co-ordinated international action does not take place now.\n“New scientific evidence shows global average temperatures are on track this year to end up more than 1.5C above pre-industrial levels, making 2024 the first calendar year to breach this crucial target. (1)l\n“We need international leadership now more than ever to tackle the climate crisis. We are getting leadership from the scientists, but too many of the world’s political leaders are ducking their responsibility.”\nAmong national leaders not attending the UN conference in Baku, Azerbaijan from 11- 22 November are those from the US, China, France, Brazil, South Africa, Japan and Australia, and EU Commission President Ursula von der Leyen.\nNOTES TO EDITORS\n(1) https://www.bbc.co.uk/news/articles/c1dpnxnvv2go\nThe post Greens call on Starmer to lead international action at COP29 appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_blog_page_3/content_24.html": "Latest News\n“expanding Heathrow in the face of a climate emergency is the definition of irresponsible.” say Greens\nResponding to the news that Rachel Reeves is backing the expansion of Heathrow Airport, Green Party MP, Sian Berry MP said, “The Chancellor talked about the ‘costs of...\nGreens respond to possible airport expansions\nResponding to the news that Rachel Reeves is expected to give the go-ahead to a series of airport expansions across the UK, Green Party MP for Brighton Pavilion, Sian Berry,...\nInauguration response: Trump will put us all in danger unless we unite\nResponding to President Trump’s inauguration speech, Green Party Co-Leader, Adrian Ramsay said: “Trump’s inauguration speech showed us that the peace many take for granted, and...\nStatement ahead of President Trump’s inauguration: “a dangerous turn toward right-wing populism”\nGreen Party Co-Leaders, Adrian Ramsay and Carla Denyer released a joint statement ahead of President Trump’s inauguration saying: “We must stand up for peace and democracy in...\nGreen Party welcomes Gaza ceasefire and calls for root causes of the conflict to be addressed\nEllie Chowns, MP for North Herefordshire and Green Party Foreign Affairs spokesperson, said: “I welcome the news of a ceasefire agreement between the Israeli government and...\nGreens react to increased threats of war and climate change\nResponding to the World Economic Forum’s Global Risks Report, Green Party co-leader and MP for Waveney Valley, Adrian Ramsay said: “War and climate change are rightly recognised...\nGReens respond to Badenoch’s “Shocking” comments\nResponding to the comments made by the Leader of The Conservative Party, Kemi Badenoch on GBNews, Green Party Co-Leader, Carla Denyer MP said, “These comments are shockingly...\nThere is a green elephant in the room with government’s AI plans\nResponding to the news that Government plans for AI to be “mainlined into the veins” of the nation, Green Party Co-Leader, Adrian Ramsay MP, said, “The potential for AI is huge...\nGreens call for council elections to be held as planned\nReacting to news that 11 councils have asked the government to postpone elections this year, Green Party co-leader Adrian Ramsay MP said: “People must be allowed to vote at the...\nGreens urge faster transition away from fossil fuels\nResponding to new data from the Copernicus Climate Change Service showing that the average temperature in 2024 was 1.6C above preindustrial levels, Green Party co-leader Carla...\nGreen Party reaction to Keir Starmer’s NHS plan\nReacting to Keir Starmer’s plans for the NHS in which he confirmed there will be greater use of the private sector to help reduce hospital waiting lists in England, co-leader of...\nGreen Peers respond to House of Lords appointments\nGreen Peers Jenny Jones and Natalie Bennett respond to news that new Peers have been appointed to the House of Lords: “We are the two Green Party peers who have campaigned for...\nGreens respond to Ofwat price rise green light\nResponding to Ofwat’s announcement of planned water bill rises over the next five years, co-leader of the Green Party, Adrian Ramsay, said: “England has one of the only fully...\nGreen reaction to government’s financial settlement for councils\nReacting to the government’s financial settlement for local government announced today, Green Party co leader Adrian Ramsay MP said: “The funding settlement is barely enough to...\nGreen Party reaction to government and regulators ‘breaking law’ over sewage spills\nReacting to news that government and regulators have broken the law by being too lenient on water companies that spill sewage, and on the day Thames Water seeks a £3bn bailout,...\nGreen Party reaction to launch of Devolution White Paper\nReacting to the government’s White Paper on the reorganisation of local government, Green Party MP Ellie Chowns said: “There is much to be welcomed in this White Paper including...\nGreens say local government reorganisation “steals power away from local people”\nResponding to measures contained within the government’s White Paper on English Devolution, which the government will announce today, Green Party co-leader Adrian Ramsay MP...\nNew planning framework “panders” to profit driven private housing developers say Greens\nResponding to the “planning overhaul” announced today by government, Green Party Co-Leader, Adrian Ramsay, said: “This new planning framework from Government fails to tackle the...\nThe Government cannot build its way out of the prison crisis, say Greens\nResponding to the Justice Secretary, Shabana Mahmood’s announcement that prisons may run out of space despite government plans to open 14,000 more prison places, Green Party MP...\n“We remain clear, cutting services always was and still is, a political choice” say Greens\nResponding to the news that Rachel Reeves is asking Ministers to identify efficiency savings worth 5% of their current budgets, Green Party Co-Leader, Adrian Ramsay said: “Labour...\nStarmer’s milestones not a route to real change say Greens\nResponding to today’s “milestones” speech by the Prime Minister, Green Party Co-Leader, Adrian Ramsay, said, “These milestones aren’t a clear route to real change. Today’s...\nIs the Prime Minister brave enough to allow common-sense prison reforms ask Greens\nResponding to this morning’s NAO report on the crisis in Britain’s prisons, Green Party MP Siân Berry said, “The National Audit Office has revealed in stark terms the futility of...\nCaroline Lucas responds to suggestion Labour set to shelve Natural History GCSE\nFormer Green Party MP, Caroline Lucas, has given her reaction to suggestions that plans for a Natural History GCSE have been shelved because it is “seen as a Conservative party...\nGreen Party response to “unrealistic” housing targets\nResponding to news that local councils have told the government that its plan to build 1.5m new homes in England over the next five years is “unrealistic”, Green MP Ellie Chowns...",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-back-nationalisation-of-steel-to-safeguard-industry-and-support-green-transition/content_34.html": "Responding to news that the government is considering nationalising British Steel, the Green Party has thrown its support behind public ownership. Co-leader Adrian Ramsay said:\n“We cannot afford to let our steel industry in Scunthorpe go into smelt down. With Chinese owner Jingyehas prepared to walk away and the steel industry facing Trump’s outlandish 25% tariff, nationalisation looks like the only sure way to secure this strategically important sector so vital to national security and British jobs. The fact the government is considering this long-held policy of the Green Party is welcome.\n“Nationalisation of the steel industry could also prove to be a key driver of a green industrial revolution. From wind turbines to trains, steel will be needed for the transition to a green economy.\n“We must not leave the future of steel communities to the whims of multinational companies or unhinged American presidents. These communities deserve better and green steel in public ownership is the way to ensure these communities not only survive but thrive into the future.”\nThe post Greens back nationalisation of steel to safeguard industry and support green transition appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_solar-panel-initiative-should-be-just-a-first-step/content_22.html": "Green Party MP and co-leader Adrian Ramsay welcomed government plans to fund the installation of 400 solar power projects for schools and hospitals, (1) and called for Ministers to be more ambitious.\n“This is an important first step in recognising the enormous energy resource offered by all the unused roof space on schools and hospitals that will also help them to cut energy costs. Now need the government to get out of the slow lane.\n“We need the government to scale up this initiative. For instance, there are 24,000 schools in England alone, many of which could become energy generators with solar panels on their roofs. And the government should be extending the initiative to factories and warehouses.\n“Better still, the government should be insisting that all new buildings include solar panels in their design.”\nNOTES TO EDITORS\nThe post Solar panel initiative should be just a first step appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_blog_page_4/content_25.html": "Latest News\nGreens respond to parliamentary vote on assisted dying Bill\nGreen MP Sian Berry said: “Today’s decisive vote in Parliament represents how the public feels about this highly sensitive issue. “The debate was full of caring and compassion...\nGreen Party responds to conclusion of COP29\nReacting to the conclusion of COP29, Green Party co-leader Adrian Ramsay MP said: “This COP has tested the patience of everyone who wants to see the devastating climate crisis...\nGreen response to latest Ofgem price cap\nReacting to the latest Ofgem price cap announcement, Green Party co-leader Adrian Ramsay MP said: “This is miserable news for those already struggling to make ends meet in the...\nWarm homes announcement “left too many householders out in the cold” say Greens\nResponding to the Department for Energy Security and Net Zero’s announcement that up to 300,000 homes will benefit from upgrades next year, Green Party Co-Leader Adrian Ramsay...\nArrest warrants makes selling of arms to Israel “utterly indefensible” say Greens\nCarla Denyer, co-leader of the Green Party said: “The ICC arrest warrants for Benjamin Netanyahu, Yoav Gallant and Mohammed Deif makes clear that to continue selling arms to...\nGreens welcome £1bn in funding for buses but challenge scrapping £2 fare cap and call for bus priority measures\nResponding to £1bn in funding which the government says will deliver a London-style bus service across England [1], co-leader of the Green Party, Carla Denyer MP, said: “It is...\nFarmers are feeling abandoned, but taxing wealth is right, say Greens\nReacting to planned protests this week by farmers over changes to Inheritance tax [1], Green Party Food, Agriculture & Rural Welfare spokesperson, Emily O’Brien, said: ...\nGreens back call for COP reform\nReacting to calls for the COP process to be reformed (1), Green Party co-leader Carla Denyer MP said: “This is a timely call for reform of an international forum that has...\nGreen MPs write to David Lammy to clarify Government position on risk of genocide in Gaza\nThe four Green MPs yesterday wrote to the Foreign Secretary to clarify the Government’s position on the risk of genocide in Gaza. Ellie Chowns said: “The UK has an obligation to...\nGreen Party responds to Reeves’ mega pension plans\nResponding to briefings on Chancellor Rachel Reeves’ Mansion House speech on pension funds reform, Green Party Co-Leader Adrian Ramsay MP said: “Chancellor Rachel Reeves needs...\nGreen reaction to government’s 81% emissions reduction target\nReacting to Keir Starmer’s public address at COP29 where he announced a new climate target for the UK to reduce the country’s emissions by 81% by 2035 against 1990 levels, Green...\nGreens call on Starmer to lead international action at COP29\nGreen Party co-leader Carla Denyer MP urged world leaders to attend COP29 next week to underline its critical importance: “COP29 has set itself the goal of “deep, rapid and...\nUS Elections: Trump is a “climate change denier, a proud racist and misogynist”\nResponding to the US elections, Green Party Co-Leader, Carla Denyer, said, “A dangerous bigot, bully, and liar is once again set to become the leader of the most powerful country...\nGreens urge Rachel Reeves to deliver real change\nGreens call on chancellor to: Raise taxes on the very wealthiest to help fund a better future for everyone Avoid more austerity by another name Ahead of today’s Budget,...\nGreen Council leaders call for funding boost in Budget\nAhead of the Labour government’s first Budget on Wednesday, Green Party Council leaders are warning of the urgent need for proper funding for local councils and services, after...\nWhy won’t Labour even consider putting water companies back into public hands ask Greens\nResponding to the news (BBC) that a new independent commission will soon launch the largest review of the water industry since privatisation in the 1980s, Green Party Co-Leader,...\nLabour must “ramp up investment in better rail connections across the North of England” say Greens\nResponding to the news that Labour is planning to build HS2 from London to Crewe (LBC), Green Party Transport Spokesperson, Matt Edwards, said, “A high-speed rail line connecting...\nGreens say “no more incineration” of waste\nResponding to the news that putting household rubbish in giant incinerators to make electricity is now the dirtiest way the UK generates power (BBC), Green Party Peer Baroness...\nGreens warn that when government “cuts red tape” this too often means harming environmental standards and workers’ rights\nGreen Party MP for North Herefordshire, Ellie Chowns said: “Starmer’s pledge to investors that he will “cut red tape” is a tired cliché that, in practice, too often means harming...\nLabour’s approach to Middle East conflict “failing” as civilian death toll mounts\nGreen Party Co-Leader, Carla Denyer said, “The reports over the weekend that no food has entered Northern Gaza since the 1st of October, of Israel’s attack on al-Aqsa Hospital,...\n100 days of increasing solitude for Starmer\nCommenting on Labour’s first 100 days in office, Green Party Co-Leader Carla Denyer MP said: “The collapse in Starmer’s popularity since taking office has been remarkable. It...\nGreens welcome Renters’ Rights Bill but say it must go further on rent controls and ending ‘plague’ of cold, damp, mouldy homes\nCo-leader of the Green Party and MP for Bristol Central, Carla Denyer, will welcome the Renters’ Rights Bill in parliament later today, but will say it must go further in...\n“The claim that wealth taxes would lead to large numbers of people leaving the UK isn’t credible” say Greens\nCarla Denyer, co-leader of the Green Party said: “The claim that wealth taxes would lead to large numbers of people leaving the UK isn’t credible. This didn’t happen when changes...\nGreen Party reaction to fossil fuel lobbying for carbon capture and storage\nCommenting on reports that the £22bn in subsidies awarded to carbon capture and storage projects followed a sharp increase in lobbying by the fossil fuel industry, co-leader of...",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_blog/content_2.html": "Latest News\nSave bees and money by growing wild flowers by persuading Wakefield District Council to plant wildflowers on unused verges.\nTell Wakefield Council to stop with the green-wash about being considerate to wildlife by mowing down their environment. We want them to follow the lead of places like Rotherham...\nGreens respond to Runcorn and Helsby by-election\nGreen Party co-leader Adrian Ramsay MP said: “This Labour government and Prime Minister Keir Starmer need to do nothing short of a complete reset. “Tonight’s results, not just in...\nGreens on course for “record-breaking” night as early results come in\nResponding to early results from the night’s local and regional elections, Green Co-Leader and Bristol Central MP Carla Denyer said: “It has been a good night for us in the West...\nGreens anticipate another record-breaking year in local elections as polls close\nAs polls close in the council and mayoral elections taking place across England, the Green Party has said it is confident of “record-breaking” results. The Party is hoping to...\nGovernment must distance itself from Blair’s latest ‘dodgy dossier’ say Greens\nCommenting on Tony Blair’s call for a major rethink of net zero policies which comes as the Climate Change Committee warns the UK is critically unprepared for the escalating...\nGreens respond to interim EHRC guidance\nCo-leaders Carla Denyer MP and Adrian Ramsay MP said: “This guidance issued by the Equality and Human Rights Commission (EHRC) is ill-considered and impractical, and leaves many...\nGreens challenge “con artist” Farage to climate TV debate\nResponding to Nigel Farage’s comments on Radio 4’s Today Programme where he refused to accept that carbon emissions are leading to climate change, Green Party Co-Leader, Adrian...\nGreens to back nationalisation of British Steel as parliament recalled\nReacting to news that parliament is to be recalled on Saturday 12th April to discuss the future of British Steel, Green MP Ellie Chowns said: “The Green party will be backing...\nGreens back nationalisation of steel to safeguard industry and support green transition\nResponding to news that the government is considering nationalising British Steel, the Green Party has thrown its support behind public ownership. Co-leader Adrian Ramsay said:...\nGreens call on PM to “take tax cuts for billionaires” off the negotiating table\nResponding to reports that the Prime Minister is considering tax cuts for Musk, Bezos and other tech billionaires as part of his negotiations with President Trump, Green Party...\nGreen Party to appeal to disillusioned voters as they head for “record breaking” local election results\nThe Green Party of England and Wales will today (Tuesday 8th April) launch their local elections campaign for what they predict will be a “record-breaking” year for them. The...\nTrump’s tariffs: We must “oppose Trump’s divide-and-rule tactics” say Greens\nResponding to US President Donald Trump’s sweeping set of tariffs, Green Party Co-Leader, Carla Denyer MP, said, “We need to work together to oppose Trump’s divide-and-rule...\n“A legacy offering real hope for Scotland” – Carla Denyer reflects on Patrick Harvie’s tenure as longest serving political leader in the UK\nResponding to the news that Patrick Harvie is stepping down as Co-Leader of the Scottish Green Party, Carla Denyer MP, Co-Leader of the Green Party of England and Wales, said,...\nGreens condemn latest brutal displacement of Palestinians\nResponding to Israel defence minister Israel Katz’s statement that the country aimed to seize large areas of the Palestinian territory and incorporate them into “security zones”,...\n“Labour’s recent leaflet boasting about deporting more people than the Tories is sickening”\nResponding to Labour’s recent leaflet about how they’ve delivered “the four biggest deportation flights in UK history” Green Party Co-Leader, Carla Denyer said, “Labour’s recent...\nGreens react to ‘Awful April’ price hikes\nReacting to large price hikes that kick in today at the start of what has been dubbed ‘awful April’, co-leader of the Green party, Carla Denyer, said: “Energy bills up to nearly...\nGreens offer democratic alternative to dead end of Reform\nResponding to Reform’s local elections campaign event, Green Party co-leader Adrian Ramsay MP said: “We know people are struggling after 14 years of Conservative austerity, now...\nSpring statement targeting ill and disabled is “morally repugnant”\nResponding to the Chancellor’s Spring Statement, the Co-Leader of The Green Party, Adrian Ramsay MP, said, “The Chancellor had a choice today. To rebalance our economy by asking...\nGreens urge government to ‘rebalance the economy’ ahead of Spring Statement\nGreen MPs outside the Treasury, from left: Siân Berry MP, Adrian Ramsay MP, Carla Denyer MP, Ellie Chowns MP. Photo: David Mirzoeff/The Green Party Green MPs pose with scales...\nA “gargantuan waste of money”\nResponding to the news that the government has given the go ahead to the largest tunnel in the UK under the Thames, Sian Berry MP said, “The Lower Thames Crossing is a gargantuan...\nSolar panel initiative should be just a first step\nGreen Party MP and co-leader Adrian Ramsay welcomed government plans to fund the installation of 400 solar power projects for schools and hospitals, (1) and called for Ministers...\nGreen Party announces new CEO in “pivotal year for Green politics”\nThe Green Party of England and Wales has today announced the appointment of Harriet Lamb as the party’s new CEO. Harriet joins from the global environmental action NGO ‘WRAP’...\nGreens repeat call for UK to suspend all arms exports to Israel\nReacting to the resumption of attacks by Israeli forces on Gaza, Ellie Chowns, MP for North Herefordshire and Green Party Foreign Affairs spokesperson, said: “As Israel returns...\nSiân Berry’s message to Labour: stop scapegoating and stigmatising those in need\nReacting to the statement from Liz Kendal’s to parliament today on proposed cuts to welfare benefits [1], Siân Berry MP said: “I’ve heard nothing today that reassures me the...\nGreen MPs write to Labour colleagues to urge benefit cuts opposition\nEvery Labour MP has been sent a letter by Green MPs ahead of an announcement next week urging them to rebel against plans to slash around £6billion from the welfare bill Dear...",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-react-to-awful-april-price-hikes/content_20.html": "Reacting to large price hikes that kick in today at the start of what has been dubbed ‘awful April’, co-leader of the Green party, Carla Denyer, said:\n“Energy bills up to nearly £2000 a year. Water bills up by 31% in some areas. Basic food prices keep rising – the list goes on. People aren’t fooling around when they say today is the start of “Awful April”. Especially awful for single parents who we know will be hit hardest by these price hikes.\n“These spiralling costs come on the back of axing winter fuel payments for pensioners, refusing to remove the two-child benefit cap and cutting benefits for the sick and disabled.\n“These are political choices. Rather than making the poorest and most vulnerable in society bear the brunt of the cost of living crisis, Labour could have chosen instead to tax a tiny percentage of the wealth of multi-millionaires and billionaires. They’ve made a choice, to take money off the old, ill and disabled.\n“Labour have again and again made the wrong choices, which has left many of the poorest households at breaking point.”\nThe post Greens react to ‘Awful April’ price hikes appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-condemn-latest-brutal-displacement-of-palestinians/content_42.html": "Responding to Israel defence minister Israel Katz’s statement that the country aimed to seize large areas of the Palestinian territory and incorporate them into “security zones”, (1) Ellie Chowns, MP for North Herefordshire and Green Party Foreign Affairs spokesperson, said:\n“The Green Party condemns in the strongest possible terms the Israeli government’s brutal decision to expand its military operations in Gaza. Seizing large areas of territory and forcibly displacing countless Gazans to create so-called “security zones” would be a further violation of international law against a population already devastated by 18 months of conflict.\n“This is not security; it is domination and erasure. It would constitute ethnic cleansing and further collective punishment on a mass scale, and it would only deepen the unimaginable suffering already endured by the people of Gaza.\n“More than 50,000 Palestinians have been killed since October 2023, and the humanitarian crisis could not be more dire. Israeli forces have maintained a total blockade of aid since early March, cutting off food, water, and medical supplies while bombs continue to fall. Last month, Israeli forces killed yet more medics, first responders, and a UN staff member, forcing the UN to reduce its operations.\n“The UK government cannot remain silent while genocide is carried out in plain sight. We cannot be complicit in this horror by continuing to arm and support the Israeli government. There is no justification—legal, moral, or political—for aiding a state that systematically targets civilians, destroys homes and hospitals, and plans to occupy yet more Palestinian land.\n“The Green Party has consistently called for the release of the hostages, an immediate ceasefire, a complete halt to arms sales to Israel, and recognition of the State of Palestine. We also urgently push for humanitarian corridors to be opened so that aid can reach those who are starving and injured. We owe it to the Palestinian people, to international justice, and to our own humanity to demand an end to this bloodshed and to take a stand against genocide.\n“Our thoughts are with the civilians of Gaza, whose courage and resilience in the face of such horror move us to keep fighting for justice, peace, and accountability. We will not look away.”\n(1) Deadly strikes in Gaza as Israel says it will seize ‘large areas’ – BBC News\nThe post Greens condemn latest brutal displacement of Palestinians appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-to-back-nationalisation-of-british-steel-as-parliament-recalled/content_23.html": "Reacting to news that parliament is to be recalled on Saturday 12th April to discuss the future of British Steel, Green MP Ellie Chowns said:\n“The Green party will be backing nationalisation of British Steel – which is now clearly the only sure way to secure this strategically important sector so vital to national security and British jobs. Public ownership of key sectors such as water and transport has always been Green party policy, and where it is in the public interest to have public ownership of a key strategic industry, which appears to be the case with Scunthorpe Steelworks, Greens are in full support.\n“Taking British Steel into public ownership provides the opportunity to help drive the green industrial revolution, supporting Scunthorpe Steelworks to make the transition from blast furnaces to electric arcs, which are cheaper and far better for the environment to run. Supporting decarbonisation of steel will further enable the UK to produce the green steel necessary to transition to a green economy, such as wind turbines and trains.\n“We must not leave the future of steel communities to the whims of multinational companies or unhinged American presidents. These communities deserve better and green steel in public ownership is the way to ensure these communities not only survive but thrive into the future.”\nThe post Greens to back nationalisation of British Steel as parliament recalled appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-repeat-call-for-uk-to-suspend-all-arms-exports-to-israel/content_31.html": "Reacting to the resumption of attacks by Israeli forces on Gaza, Ellie Chowns, MP for North Herefordshire and Green Party Foreign Affairs spokesperson, said:\n“As Israel returns to its bombardment of Gaza, hundreds more lives have been lost. Families, children, entire communities – gone in an instant. This is horrific. Each of these lives mattered. Each of these deaths was preventable.\n“The UK cannot remain complicit while bombs rain down on civilians. The government must act now: we must use all diplomatic means necessary to secure an immediate ceasefire and suspend all arms exports to the Israeli military including components of the F-35 Joint Strike Fighter, which evidence suggests have been used in ways that violate international law and exacerbate the humanitarian crisis. There can be no justification for continuing to supply arms while international law is being violated and humanitarian catastrophe unfolds.\n“The people of Gaza are not only facing bombardment – they are also being starved. The blockade is preventing essential food, water, and medical aid from reaching those in desperate need. The UK government must demand the full and immediate flow of humanitarian aid into Gaza and apply real diplomatic pressure to make that happen.\n“We also repeat our call for the release of the hostages still held in Gaza. The families of those hostages deserve to see their loved ones return home.\n“For too long, the UK has failed to take the necessary steps towards justice and peace. We must formally recognise the State of Palestine – a vital step towards a future based on equality, dignity, and the rule of law.\n“The cycle of violence will not end without justice. There must be accountability for war crimes, an end to the occupation, and a real commitment to peace. The UK government must make a stronger stand now, before more lives are lost.”\nThe post Greens repeat call for UK to suspend all arms exports to Israel appeared first on Green Party.",
  "https_wakefieldgreenparty_org_uk_stephen-brennan-green-party-candidate-for-castleford-central-glasshoughton_/https_wakefieldgreenparty_org_uk_greens-urge-government-to-rebalance-the-economy-ahead-of-spring-statement/content_41.html": "- Green MPs pose with scales showing government’s ‘skewed priorities’ as government slashes disability benefits while refusing to tax wealth\n- They say a tax on assets over £10 million could raise nearly 5 times as much as Rachel Reeves’s cuts to disability benefits\n- Greens urge Reeves to abandon the planned cuts and ‘rebalance’ the economy in favour of ordinary people\nAhead of the Spring Statement the Green Party is urging the government to ‘rebalance the economy’, by reversing the planned cuts to welfare spending and instead taxing the wealth of multi-millionaires and billionaires.\nThe party’s MPs say it is deeply unfair that those already struggling to get by will be pushed further into hardship because the government is unwilling to tax wealth fairly – and that while we are still feeling the effects of the Conservatives’ ‘failed austerity experiment’ more cuts will only damage the economy further while leaving us unprotected from the climate crisis.\nThe day before Rachel Reeves is due to unveil her response to the OBR’s economic outlook and set out her government’s response, Green MPs posed with a set of scales representing the stark difference in the money the government plans to save with its welfare cuts and the amount that could be raised by taxing extreme wealth.\nThey say if the government took the advice of the Patriotic Millionaires and levied a 2% tax on assets above £10 million, this could raise £24 billion a year – almost five times the amount Reeves plans to save by slashing welfare for disabled people.\nSpeaking ahead of the spring statement, Adrian Ramsay, Green Party Co-Leader, said:\n“It’s not fair that this government is unwilling to introduce a modest tax on the extremely wealthy while removing vital support from a million disabled people.\n“Fifteen years of austerity have driven our economy to the edge—forcing ordinary people to bear the burden while multi-millionaires, billionaires, and big corporations amass extreme wealth. Meanwhile our economy is not prepared to protect us from the climate crisis.\n“Labour’s plans will only deepen this inequality and push our economy further off-kilter. From removing the winter fuel payment from millions of pensioners to plans for more public service cuts, this government’s priorities are completely skewed.\n“Instead of doubling down on the Conservative failed austerity experiment and pushing more people into hardship, it’s time to rebalance our economy for good.\n“At the Spring Statement, Rachel Reeves can do just this. By taxing wealth fairly, she could invest in what this country desperately needs: giving communities the support they need, rebuilding our NHS, and taking action for a safe climate so we all have a future to look forward to.”\nThe post Greens urge government to ‘rebalance the economy’ ahead of Spring Statement appeared first on Green Party."
}