{
  "https_louisejones4ned_co_uk_/https_louisejones4ned_co_uk/content_1.html": "I'm an Army veteran who is building a better future for our community.\nWith your help, I will fight for your future.\nI'm an Army veteran who is building a better future for our community.\nI'm an Army veteran who is building a better future for our community.\nI'm an Army veteran who is building a better future for our community.\nI have always believed in the importance of public service, that contributing to the greater good uplifts both ourselves and our communities. It’s what motivated me to join the Army: the chance to do something for my country.\nBut incredibly, even as I deployed to Afghanistan, I saw the military being hollowed out around me under the Conservatives' disastrous austerity policies.\nIt's the same story all around us with our other public services. When I'm speaking to voters on the doorsteps in North East Derbyshire, they're telling me that they can't get an NHS dentist appointment. That they can't rely on their local bus. And that they're worried about this week's food shop.\nWell this isn't the country I want. I know it's not what you want. That's why I'm standing for Labour because I know that we can be better, and get our future back.\nI want to represent the people of North East Derbyshire because your fight is my fight. I know when I'm speaking to voters in the constituency that the constituency deserves better. In a country like ours, we can have stable public services, strong communities, and an economy that gives everyone a fair future. Instead we've been given one crisis after another by the Conservatives.\nThat's why a Labour Government in 2024 is so important. We know that we need to work hard in your community to show that we are serious about making a change. That politics can make things better and isn't just a place for talking and talking.\nMy promise to you is simple: I'll work hard, campaign smart and always put the people of North East Derbyshire first.\nI regularly am asked to comment on Defence affairs for a variety of media outlets in both print and on air. Here are just a few examples, with the one above being an evening debate on the shocking state of our Armed Forces.\nConducted after the War in Ukraine had just begun, this debate focused on what this meant for the future.\nI am most often asked to comment on the operational situation in Ukraine.\nFrom serving in the military I know the sheer damage that has been done to the stability of our vital public services. I'll campaign hard for the reforms needed to deliver an NHS and social care system that puts patients first, not profit. An education system that closes attainment gaps and doesn't widen them. And an MoD that doesn't waste billions on failed procurement contracts and leaves our soldiers accessing foodbanks.\nI know from working in a tech start-up that the future of this country depends on us revitalising our home industries and delivering tech innovation. Central to this is adult education. I've saw first-hand how going to university in her thirties changed my mum's life, and changed the children's lives she went on to teach. We need a revolution in how we understand our working lives so that we have the high-skilled jobs we need in our communities.\nWe're in one of the most centralised countries in the world, meaning that important decisions for our towns and villages aren't made by the people that live there. And it shows on the high street throughout our country. I believe that it's time more power was given to councils to choose the policies they need to grow our villages and towns. We also need to invest in real connectivity, whether ensuring everyone has access to adequate internet, or simply making sure that we have regular buses that run on time, and are available when you need to travel. Strong communities underpin opportunity.\nI grew up in a small village in Leicestershire, in a family of farmers on one side, and teachers on the other. Hard work and serving your community were instilled into me from the beginning, as was the huge importance of education. I was fortunate enough to study Chinese at the University of Edinburgh before deciding that I wanted a career in public services, joining the Civil Service initially working on transport policy.\nBut when I was accepted into the Army as an Intelligence Officer, I knew that that was my true calling. After a year undergoing officer training, my first post gave me the privilege of leading teams right from the beginning, supporting an armoured formation whilst based in Germany. It was a big responsibility leading experienced soldiers, many of whom had deployed on operations multiple times, but that's where I learnt what it really means to be a leader. To know the importance of always listening to their advice, but also when to step up and take responsibility for a tough decision myself. To know that my priority was their welfare and their needs, but to not shy away from holding them to high standards. \"Serve to lead\" is the Army's motto, and it's mine too.\nI left in 2020 and now work as part of the senior management team for a tech company which uses data gathered by satellites to analyse the impact of natural disasters. After public service, it's a learning curve to be in business but I'm really proud of what we have grown.\nPromoted by R Griffin on behalf of L Jones at 34 New Rd, Holymoorside, S42 7EN",
  "https_louisejones4ned_co_uk_/https_louisejones4ned_co_uk_privacy-policy/content_2.html": "Privacy Policy\nLast Updated: 05/09/2023\n1. Introduction\nWelcome to the official website of Louise Jones (\"we,\" \"us,\" or \"our\"). We respect your privacy and are committed to protecting your personal data. This Privacy Policy explains how we collect, use, disclose, and protect your personal information when you visit our website.\n2. Information We Collect\nWe may collect various types of personal data when you visit our website, including but not limited to:\nPersonal Information: Name, email address, postal address, and phone number.\nUsage Data: Information about how you use our website, including IP address, browser type, and pages visited.\nCookies: We may use cookies to collect information about your browsing habits on our website. You can manage your cookie preferences through your browser settings.\nOnce Louise Jones' campaign concludes, all data will be deleted.\n3. How We Use Your Information\nWe may use your personal information for the following purposes:\nTo respond to your inquiries and requests.\nTo send you updates, newsletters, and campaign information (only if you have provided consent).\nTo improve our website and user experience.\nTo comply with legal obligations.\n4. Disclosure of Your Information\nWe may share your personal data with third parties under the following circumstances:\nWith your consent.\nTo comply with legal obligations.\nTo trusted service providers assisting us in website operations.\nIn connection with a campaign or political activities (if you have given consent).\n5. Data Security\nWe take the security of your personal information seriously. We implement appropriate technical and organizational measures to protect your data from unauthorized access, disclosure, alteration, and destruction.\n6. Your Rights\nYou have the following rights regarding your personal data:\nRight to access: You can request access to the personal data we hold about you.\nRight to rectify: You can request the correction of inaccurate or incomplete data.\nRight to erasure: You can request the deletion of your data under certain circumstances.\nRight to restrict processing: You can request restrictions on the processing of your data.\nRight to data portability: You can request to receive your data in a structured, commonly used format.\nRight to object: You can object to the processing of your data.\n7. Contact Us\nIf you have any questions or concerns about our Privacy Policy or the way we handle your personal data, please contact us at louise@louisejones.win.\n8. Changes to this Privacy Policy\nWe may update this Privacy Policy from time to time to reflect changes in our practices or for other operational, legal, or regulatory reasons. The most recent version of the Privacy Policy will be posted on our website with the effective date.\nHow to complain\nIf you have any concerns about our use of your personal information, you can make a complaint to us at louise@louisejones.win\nYou can also complain to the ICO if you are unhappy with how we have used your data.\nThe ICO’s address:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nICO website: https://www.ico.org.uk\nPromoted by R Griffin on behalf of L Jones at 34 New Rd, Holymoorside, S42 7EN"
}