{
    "http_www_thecommongood_info/http_www_thecommongood_info/content_1.html": "- I’m campaigning for people to join HM Armed Forces because of the need to bump up the numbers of good people (male and female) defending our country and community and what we stand for in the world. I’ve made a start here in Birmingham’s New Street with this banner and the attached leaflet. Please have a read! Thank you!\n- Britain needs a unifying national purpose – to work to make the world a better place and, at home, to model the kind of healthy, kindly, more equal society that is in keeping with such a purpose.\n- Britain needs a unifying national purpose – namely, to work to make the world a better place and, at home, to model the kind of healthy, kindly, more equal society that is in keeping with such a purpose.\n- see YouTube channel @dickrodgers7502\nI’ve been out in the street asking people to join the army.\nLeaflet Northfield\nMy election leaflet for 4th July 2024 Birmingham Northfield genelec2024 genelecA2024\nThis website has been dormant for some years during a slough of despond during the Scottish Referendum, Brexit, Boris John’s Premiership, Nigel Farage’s input and Donald Trump. I’m coming out from under the “duvet” because the ideas rumbling around in my head need action. I have deeper political answers than any big party but I intend to get out and about to get this stuff to happen.\nLots of people are struggling. I have some answers which are probably easy to dismiss but I hope to put energy into pressing and persuading for these to happen.\n- The Common Good party facebook https://www.facebook.com/comgood\n- My YouTube is http://www.youtube.com/@dickrodgers7502\n- My X formerly Twitter https://x.com/dick_rodgers\n- I kept a vigil in Birmingham’s New Street for six weeks before Easter 2024 to honour brave Russians imprisoned for opposing Russia’s attack on Ukraine. https://www.youtube.com/shorts/qYBMDVStExk\nMy past entries here give the flavour of my political message and style! I have tried my hand at about 12 elections since 2004 – often beaten by the Monster Raving Loony party. I last tried to stand in Amersham and Chesham in 2021 but it was all about HS2 opposition and I couldn’t have made progress there.\n- Please click here to see my April 2021 leaflet that I distributed in the Chesham and Amersham constituency to ‘test the waters’ there.\nI stood in the Peterborough By-Election of June 2019 saying we should stay in the EU and met Nigel Farage albeit briefly. I still think the European Union is a tremendous peace project which has turned Europe from postwar devastation in 1945 to today’s democratic and increasingly fair society. I would have liked us to stay in the EU and still hope we will rejoin soon.\nPlease see my 2019 leaflet for Peterborough here.\nDick Rodgers 63 Meadow Brook Birmingham B31 1ND. Thank you so much!\nSee my 2019 leaflet given out in New Street Birmingham\nSee my recent banner used in Birmingham\nhttps://www.facebook.com/comgood\nhttps://twitter.com/dick_rodgers?lang=en-gb\nI stood (see the picture below) also in 2017 in Edgbaston Birmingham in the General Election for staying in the EU in the constituency that had been represented by Gisela Stewart the prominent “Leave” campaigner.\nDick Rodgers dick@rodgers.org.uk\nI describe my worldview more fully in About us"
}